{"id": 112647, "date": "2017-04-28 07:39:55", "user": "cociu", "post": "Hello people ,\r\n\r\ni will start with send thanks to all who give us much work in the last week (almost infernal week) . Due of huge demand of storage servers we decided to put 1500 vps more in stoc with   cupon code :    \" @NEKKI LOVE \" wich is give you 30% OFF recurring priced for life in all plans except in montly payments.\r\n\r\nI want personnaly to thanks all affiliates who work to promote our products and apologise for delay in payments this days due of huge quantity of work (i am the only autorizated to make this payments..... so yes need time)  , we have start from today to make all payments in order what we have recived the request.\r\n\r\nAbout network ? Yes we have got  the stability but in 2-3 days we have the guarantee from our isp`s will  be implemented finnaly 5x10gbps connections. \r\n\r\nin all this orders the principal network (in order)  will be :\r\n\r\n&lt;br /&gt;1) UPC (liberty Global)\r\n&lt;br /&gt;2) Magyar Telekom\r\n&lt;br /&gt;3) RDS-RCS\r\n&lt;br /&gt;4) Telekom Romania\r\n&lt;br /&gt;5) Euroweb\r\n\r\nTo avoid tiketing and pm messages i will put there some TOS and i hope eaven the Affiliates will copy/paste this because we note huge missunderstand about this in the last offer :\r\n\r\n1) YES we allow seedbox BUT if you make traffic 24 hours/day you need to know the port is  shared and you need to  limit your upload to 100 mbps to not disturb the other users.\r\n\r\n2) YES WE ARE FREE DMCA but this not meen we permit spam/flood\r\n\r\n3) A pre-order is a pre-order , your server will be provided in order recived/payed so please do not open tikets with \"when my server will be online\" .  You can have the guarantee if you have payed to rezerve this offer you server will be delivered the most rappid we can.\r\n\r\n4) we face problem with Asian guys, instead of opening tikets its opened directly paypal disputes wich is not good for us. So please use our tiketing sistem because yes is working eaven we are not responding in the first minute.Nothing racist here but seems have problem with this so is better to talk.\r\n\r\n5) No debian 8 , centos 7 , ubuntu +15 template aviable so do not open tikets ask for this , also do not buy if is a need this template.\r\n\r\nNow , my offers :\r\n\r\n[Here you can find 1 tb Vps offer ](https://www.hostsolutions.ro/eng/hosting/cheap-storage-vps)\r\n\r\n\r\n\r\nAlso still have this limited offer in Stoc :\r\n\r\n&lt;br /&gt;4 core (intel xeon 2.20) \r\n&lt;br /&gt;4 gb ram (10600 ecc ) \r\n&lt;br /&gt;400 gb hdd (sata 3 in raid 10 so a good speed) \r\n&lt;br /&gt;1 ipv4 \r\n&lt;br /&gt;1gbps port speed \r\n&lt;br /&gt;10tb/mo traffic included \r\nprice will be 6.50 eur/mo or if you pay/year will be 38 eur/year\r\n\r\n\r\n&lt;br /&gt;unless we dont detect abuse this vps is not limited in nothing ex io, network speed, processor , ram .. \r\n&lt;br /&gt;you can buy here : https://secure.hostsolutions.ro/cart.php?a=add&amp;pid=282\r\n\r\n\r\nALL THIS ORDERS WILL BE DELIVERED IN 4-7 DAYS !!! The cupon code is only for 1500 vps  , when the stoc is gone please do not ask for more .\r\n\r\n\r\n"}