{"id": 11421, "date": "2013-06-26 14:37:40", "user": "serverian", "post": "&lt;strong&gt;Order your new Netherlands Backupsy TODAY!&lt;/strong&gt;\r\n\r\nVisit our website and read our FAQ: &lt;a href=\"https://backupsy.com\"&gt;https://backupsy.com&lt;/a&gt;\r\n\r\n&lt;strong&gt;Disclaimer: Our Netherlands products are not limited to be used as backup. You can use these as regular VPS except torrents, TOR, game servers. Note that these VPSes are not backed up. For redundancy we recommend you to get 2 x Backupsy in different locations and mirror them.&lt;/strong&gt;\r\n\r\n250GB VPS for $7/month:\r\n\r\n&lt;pre&gt;\r\nKVM Virtualization\r\n1 vCPU (Intel Xeon X5650, Fair share)\r\n512 MB Memory\r\n250GB RAID 50 Storage Space (HP P410 Controller with cache memory and BBU with enterprise hard drives)\r\n1000GB Traffic Limit\r\n1Gbps Uplink\r\n1 IPv4\r\n&lt;a href=\"https://backupsy.com/cart.php?a=add&amp;pid=19&amp;promocode=DUTCHCRISIS\"&gt;[ORDER NOW]&lt;/a&gt;\r\n&lt;/pre&gt;\r\n\r\n&lt;strong&gt;For bigger storage please contact us for good deals.&lt;/strong&gt;\r\n\r\nIf you want to try it before you buy, feel free to PM me. We are also offering a 7 day no questions asked money back guarantee.\r\n\r\nWe utilize our custom control panel that has ability to install popular Linux distributions (Debian, Ubuntu, CentOS) automatically by scripting (Kickstart, Preseed). (You can however, install them manually by using our out of band Java based console)\r\n\r\nWe are also offering ISO mounts for popular storage management operating systems such as FreeNAS, Openfiler, Openmediavault and Turnkey Linux Fileserver. For additional ISO files, please contact us by simply opening a ticket and we will add them for free.\r\n\r\nYou can view our control panel screenshot here:\r\n\r\n&lt;img src=\"https://backupsy.com/imgs/backupsy-panel-th.png\" alt=\"Backupsy Control Panel\"&gt;\r\n\r\nLocation: Naaldwijk, Netherlands&lt;br&gt;\r\nTest IP: 192.71.151.4&lt;br&gt;\r\nTest File: http://192.71.151.4/100MB.test&lt;br&gt;\r\n\r\nOur TOS is linked here: https://backupsy.com/tos.html"}