{"id": 1177, "date": "2012-01-19 20:31:07", "user": "prometeus", "post": "Prometeus, is a hosting provider since 1997 (mainly with\r\nthe brand IperWeb, even if now all operation are run by\r\nPrometeus.com).\r\nWe are located in Milan, Italy  and have 5 racks colocated in the\r\nlargest campus/intenet exchange of Italy. We have our Provider\r\nIndipendent Ip (from RIPE) and do BGP with our Autonomus System Number\r\n(AS34971).\r\n\r\nUntil now we offered only high end/HA vmware virtual machine. But since some months we decided to introduce some low end VPS (with a 50% off promotion running right now at http://www.prometeus.net/sito/VPS).\r\n\r\nOne of them, we think, fit well within LEB requirement (after a specific\r\npromotion code for a 60% discount for your visitors: LEB60REC).\r\n\r\n\r\nThe link to order (with the code included) is:\r\nhttps://www.prometeus.net/billing/cart.php?a=add&amp;pid=14&amp;currency=3&amp;promocode=LEB60REC\r\n\r\nVirtualization: vmware\r\nCPU: 1\r\nRAM: 256MB\r\nHard disk: 10GB\r\nBandwidth: 10Mb/sec unmetered\r\nOS: Linux (debian, ubuntu or centos)\r\nRegular price: $15/month, $6 with the above promo code **LEB60REC**\r\n\r\n\r\nThe only payment method is Paypal, the provisioning is manual, usually in a few hours (24H max).\r\n\r\nOur clusters all use SAN to store the vm (we use one Coraid SRX3200 AOE and two fiber channel Sun 6130 arrays - a bit old but they do the job!). When we need to distribute load VM are moved live from a host to another and in case of a host failure the virtual machine is restarted on another host in automatic.\r\n \r\nI know you like the dd sequencial test... I'm sorry but you don't find spectacular sequencial numbers here, our storage is optimized to handle high concurrency I/O with the right latency, just run some real life random i/o test and then you will see what I mean.\r\n\r\nIf you have questions or comments please post here or write us to support@iperweb.com\r\n\r\nThank you\r\n\r\nSalvatore\r\n\r\nwww.prometeus.com\r\n"}