{"id": 121769, "date": "2017-08-09 12:27:01", "user": "OnApp_Terry", "post": "Hi All,\r\n\r\nWeather is terrible in London today, and we haven't run a special for a little while. Need something to brighten the day up! So, I've brought back the worldwide specials, with a few changes.\r\n\r\nThe worldwide plan comes with 15 locations, with the addition of Chicago, Delhi, Lviv, Sydney &amp; Tel Aviv. Best news, the new locations come with just a $2 premium. For the USA &amp; Europe plans, if we have multiple PoPs in the same city, the added PoPs are included for free.\r\n\r\n&lt;strong&gt; The Details&lt;/strong&gt;\r\n&lt;UL&gt;\r\n&lt;li&gt;Each plan comes with 1 TB of bandwidth.\r\n&lt;li&gt;Manage through HostBill or direct with OnApp.\r\n&lt;li&gt;Static resources only - no live streaming available.\r\n&lt;li&gt;Unlimited CDN zones can be created.\r\n&lt;li&gt;SSL supported - shared or you can provide your own\r\n&lt;/UL&gt;\r\n\r\n&lt;strong&gt;Worldwide CDN&lt;/strong&gt;   \r\n19 Total PoPs, across 15 locations!  \r\nAmsterdam, Ashburn, Chicago, Dallas, Delhi, London, Lviv, Milan, Salt Lake City, Santa Clara, Sao Paulo, Singapore, Stockholm, Sydney, Tel Aviv  \r\nPrice: $7 a month  \r\nReady to order? &lt;a href=\"http://hb.cdn.net/?cmd=cart&amp;action=add&amp;id=62\"&gt;Worldwide CDN&lt;/A&gt;\r\n&lt;hr /&gt;\r\n\r\n&lt;strong&gt;European CDN&lt;/strong&gt;   \r\n12 Total PoPs, 8 cities  \r\nAmsterdam x2, Budapest, Frankfurt, Lviv x2, London x3, Milan, Paris, Sheffield  \r\nPrice: $5 a month   \r\nReady to order? &lt;a href=\"http://hb.cdn.net/?cmd=cart&amp;action=add&amp;id=56\"&gt;European CDN&lt;/A&gt;\r\n\r\n&lt;hr /&gt;\r\n&lt;strong&gt;USA CDN&lt;/strong&gt;   \r\n14 total PoPs, 8 cities   \r\nAshburn x3, Atlanta, Chicago, Dallas x2, Newark x2, Salt Lake City x2, Santa Clara x2, Seattle   \r\nPrice: $5 a month  \r\nReady to order? &lt;a href=\"http://hb.cdn.net/?cmd=cart&amp;action=add&amp;id=55\"&gt;USA CDN&lt;/A&gt;\r\n\r\n&lt;strong&gt;Why use a CDN?&lt;/strong&gt;   \r\nA few reasons: better worldwide performance. Reduce resource consumption on your server. Reduce bandwidth usage on your server.\r\n\r\n&lt;strong&gt;Do you have PoPs in China?&lt;/strong&gt;   \r\nYes, we do! You'll need to provide an ICP license, at which point we can create a custom plan including PoPs in China.  \r\n\r\n&lt;strong&gt;Where else do you have PoPs?&lt;/strong&gt;  \r\nWe use the OnApp federation for our infrastructure and have a little over 160 PoPs worldwide. Every continent but Antartica!  \r\n\r\n&lt;strong&gt;Do you do PAYG CDN?&lt;/strong&gt;   \r\nUnfortunately no. We need to sell at a certain price to ensure the cost of support is covered. Likewise, a CDN is most effective when a site has steady traffic. If your site only has a small amount of traffic, I actually suggest focusing on optimizing the code, and images before implementing a CDN.  \r\n\r\nAny questions? Looking for a specific PoP? I'm flexible - Ping me: t@cdn.net or on livechat at CDN.net.  \r\n "}