{"id": 12913, "date": "2013-08-23 06:32:55", "user": "terafire", "post": "![](http://terafire.net/clients/templates/slick-host-v3-4/images/logo.png)\r\n\r\nTeraFire, LLC is a registered limited liability corporation in the state of Delaware.  \r\n\r\nWe offer quality KVM and OpenVZ plans at competitive prices.\r\nWhat sets apart from other hosting companies? For starters, we don't use SolusVM, or CPanel. We have a solid belief in open source, and believe in the stability and capability of using opensource applications. For virtualization we use ProxMox 3.0 VE which is a bare-metal virtualization platform based on the tried and true Debian linux system. With billing integration, you can manage your VPS directly inside the client system. For our shared web hosting plan we use an actively-developed opensource control panel, Kloxo-MR, which is easy to use and offers a plethora of features.\r\n\r\n**We offer a 15-day money-back guarantee.** \r\n\r\nRight now we're looking to fill up **20** slots of our KVM special.\r\n\r\n**KVM LET Special**  \r\n1 CPU Core  \r\n512MB RAM  \r\n15 GB Space  \r\n600GB Transfer  \r\n1 IPv4  \r\n10 IPv6 (self-service and on ticket)  \r\n1Gbit Port  \r\n$4.50/mo with coupon code **LETSPECIAL50**   \r\nMany ISOs included, including Windows 7 (bring your own license)   \r\n[Order Link](https://terafire.net/clients/cart.php?a=add&amp;pid=30)  \r\n\r\n**OVZ Special**  \r\n1 CPU Core  \r\n128 MB RAM  \r\n128 MB Swap  \r\n20 GB Space  \r\n300GB Transfer  \r\n1 IPv4  (No IPv6)  \r\n$1.25/mo  \r\n[Order Link](https://terafire.net/clients/cart.php?a=add&amp;pid=14)  \r\n  \r\n**Managed services available (open ticket for custom quotes)**\r\n\r\nVPS control panel located in the client system.  \r\n  \r\nIn 2 weeks all clients of this plan will be given the option to move over to our pending Pure SSD (yes, pure, not cached) space free of charge (at 1/3 of the space).   \r\n  \r\nSpecify ISO in control panel area.  \r\n  \r\nWe are hosted in Los Angeles at the Quadranet datacenter (not through CC).  \r\n\r\nLocation: Los Angeles, CA  \r\n  \r\nTest IP 162.216.226.134   \r\n\r\nIPv6 Test IP: 2607:fcd0:ff01:4::3  \r\n\r\n(Test IPv6 is also our main website)\r\n\r\nTest File: http://terafire.net/100MB.zip\r\n\r\nAUP Quick and Dirty: IRC OK, Private Proxies and VPN okay. No public proxies. No TOR exit nodes. No spamming/unsolicited mailing. \r\n\r\nRDNS Available by request, IPv6 Available (up to 10 per plan) Bandwidth overages won't get you suspended, but you will be throttled until the next billing cycle. "}