{"id": 129188, "date": "2017-11-10 22:48:06", "user": "WSCallum", "post": "We're very pleased to announce that our brand new range of KVMSD Virtual Dedicated Servers are now available, in a brand new location in the Netherlands, Amsterdam. This is a fantastic new location offering great connectivity across Europe and offers a diverse change from our current range of VPS services.\r\n\r\nOur new KVMSD services are performance oriented machines, featuring Intel E3 Processors of 3.4GHz+ per core and SSD drives as standard! Plus, FREE DDoS Protection up to 40Gbps is included, this is alongside our normal great features such as custom ISOs, and the ability to backup your VPS at any point through the control panel, and restore from any backup taken by yourself or us at any point too and the ability to easily manage your VPS from within a Virtualizor, an accessibe, easy to use graphical interface to ease the management process.\r\n\r\nThe KVMSD range is different because it offers dedicated resources, CPU, RAM and Disk Space are all guaranteed - Meaning you can use them out to the max, with no conditions preventing you from doing so! These new virtual machines truly bridge the gap between affordability and full dedicated server.\r\n\r\nTo celebrate, we're offering you an exclusive 30% off to the LET community whilst stocks last. Just enter promotional code **KVMSD-LET** on checkout!\r\n\r\n**KVMSD1024**\r\n&lt;br /&gt;1GB RAM\r\n&lt;br /&gt;25% of 1 E3 CPU Core @ 3.4GHz+\r\n&lt;br /&gt;12GB SSD Disk Space\r\n&lt;br /&gt;1TB Monthly Bandwidth @ 1Gbps\r\n&lt;br /&gt;1IPv4 Address, /64 IPv6 Available\r\n&lt;br /&gt;£3.85 ($5.06) per month with promotional code KVMSD-LET\r\n&lt;br /&gt;[ORDER HERE](https://websound.co.uk/cart.php?a=add&amp;pid=165&amp;promocode=KVMSD-LET)\r\n\r\n**Testing &amp; LookingGlass:**\r\n&lt;br /&gt;Netherlands, Amsterdam:\r\n&lt;br /&gt;LookingGlass: [http://lg.nl.websound.co.uk](http://lg.nl.websound.co.uk)\r\n&lt;br /&gt;Test IPv4: 185.212.201.10\r\n&lt;br /&gt;Test IPv6: 2604:6600:2001:11::1\r\n\r\n**Hardware**\r\n&lt;br /&gt;Consists of E3-1230v5 or equivalent/better, all CPUs are at least 3.4GHz clock speed and Intel E3s are used as standard. Nodes have 32GB EEC RAM, with 2 - 4 SSD Drives in either RAID 1 or RAID 10 configurations. Backups are taken weekly as standard with the ability to backup/restore at any time within Virtualizor, with the option for daily backups of your VDS coming soon for a fixed monthly fee.\r\n\r\n\r\n[View all packages by clicking here!](https://websound.co.uk/vps-kvmsd)\r\n"}