{"id": 13077, "date": "2013-08-31 00:01:01", "user": "Oxide", "post": "WeLoveServers is proud to announce that we have further expanded our global presence, with the addition of &lt;font color=\"red\"&gt;Orlando, FL&lt;/font&gt; and &lt;font color=\"red\"&gt;London, UK&lt;/font&gt;.\r\n\r\nWe understand the need to have diversity and location variety as a global web hosting provider serving thousands of customers worldwide, and have been working behind the scenes for the past couple months to be able to bring forth these new location offerings.\r\n\r\nWeLoveServers is partnering with the DimeNOC datacenter in Orlando, Florida, just _~5ms_ to Miami! Our friends in South America and the east coast can enjoy premium connectivity on the tier 1 network.\r\n\r\nOur Maidstone, Kent UK location is all part of the greater London area, located in the CustodianDC with a 10G network composing of Level3 and London exchange peers.\r\n\r\nAt this time, WeLoveServers offers VPS hosting in 6 markets:\r\n\r\n&lt;ul&gt;\r\n&lt;li&gt;Los Angeles, California&lt;/li&gt;&lt;br&gt;\r\n&lt;li&gt;Dallas, Texas&lt;/li&gt;&lt;br&gt;\r\n&lt;li&gt;Buffalo, New York&lt;/li&gt;&lt;br&gt;\r\n&lt;li&gt;Orlando, Florida&lt;/li&gt;&lt;br&gt;\r\n&lt;li&gt;Frankfurt, Germany&lt;/li&gt;&lt;br&gt;\r\n&lt;li&gt;London, United Kingdom&lt;/li&gt;&lt;br&gt;\r\n&lt;/ul&gt;\r\n\r\n**Orlando, FL:**\r\n\r\nTest IP Address: 72.29.70.131&lt;br /&gt;\r\nTest File 128MB http://72.29.70.131/128mbfile.tgz\r\n\r\n**Kent (London) UK:**\r\n\r\nTest IP Address: 109.73.162.6&lt;br /&gt;\r\nTest File 128MB http://109.73.162.6/128mbfile.tgz\r\n\r\nView our current &lt;a href=\"http://www.weloveservers.net/expansion-specials/\"&gt;expansion specials&lt;/a&gt; which are now available in Orlando and London. You will find the option to select what hosting location site you would like your VPS to be set up in during the order process. \r\n\r\nWe are extremely grateful to our customers for making such expansions possible. Your support is appreciated!"}