{"id": 131159, "date": "2017-11-27 13:42:43", "user": "deployvm", "post": "&lt;center&gt;![](https://www.xhostfire.com/images/logow.png)&lt;/center&gt;\r\n&lt;center&gt;**XHOSTFIRE LLC**&lt;/center&gt;\r\n\r\nPlease take a look at our special Cyber Monday offers below for virtual servers in Norway and Finland.\r\n\r\n&lt;u&gt;**Server-specific features:**&lt;/u&gt;\r\n\r\nKVM Virtualisation - RAM and VM storage will exclusively be guaranteed to you. Custom kernel and ISOs are supported, but you can freely use our templates for a quick deployment.\r\n\r\nEnterprise grade hardware - Our hypervisor is powered by Dual E5s or E3 v5, DDR4 memory and RAID 10 protection (hardware controller).\r\n\r\nQuality Nordic network (Norway) – Connectivity is supplied by TDC (Danish ISP). The ISP is present in the entire Nordic region (i.e. Sweden, Norway etc). No matter where your audience is, you can always expect the shortest paths and fastest access. Leading transits are used such as TeliaSonera, PCCW, Level 3 and NTT.\r\n\r\nRedundant connectivity (Norway) - We have NIC bonding (LACP) and HSRP configured to provide network resiliency. We also have network mitigation (Anti-DDoS). SLA 99.5%\r\n\r\nSetup - usually instant if payment was confirmed successfully. \r\nWe can also provide a free trial for 24 hours if required.\r\n\r\n**KVM Virtual Server in Central Oslo, Norway*:**\r\n\r\nvCPU - 1 core (1x E3 v6 on host)&lt;br&gt;\r\nRAM - 1GB RAM DDR4&lt;br&gt;\r\nStorage - 10GB RAID 10&lt;br&gt;\r\nBandwidth - 1TB on 100Mbit &lt;br&gt;\r\n1 dedicated IP included + native IPv6 on request&lt;br&gt;\r\n\r\n&lt;font color=\"red\"&gt;\r\nPrice: $7/month (first 3 months) and then $10 recurring.&lt;br&gt;\r\nOrder link: https://xhostfire.com/clientarea/cart.php?a=add&amp;pid=25&lt;br&gt;\r\nUSE PROMO CODE: CYBERNO&lt;/font&gt;\r\n\r\n*Promo available with max 1 additional IP only.\r\n\r\n**KVM Virtual Servers in Espoo, Finland (near Helsinki):**\r\n\r\nvCPU: 1x E3-1230v5&lt;br&gt;\r\nRAM: 1GB DDR4 (contact us after order to redeem) &lt;br&gt;\r\nHDD Space: 20GB RAID 10 Protected &lt;br&gt;\r\nBandwidth: 1.25TB on 1Gbps (contact us after order to redeem extra traffic)&lt;br&gt;\r\nDedicated IPs: 1 + /80 IPv6 subnet &lt;br&gt;\r\n\r\n&lt;font color=\"red\"&gt;$5/month (first 6 months) and then $7 recurring.&lt;br&gt;\r\nPromo code: CYBERFI&lt;br&gt;\r\n\r\nOR $18/quarterly using promo CYBERFI3 (that's 40% OFF original price lifetime)\r\n\r\nORDER NOW - https://www.xhostfire.com/clientarea/cart.php?a=add&amp;pid=114&lt;/font&gt;\r\n\r\n&lt;font color=\"purple\"&gt;In addition, we are offering 50% OFF (FIRST MONTH ONLY) on KHB-KVM2 and KHB-KVM3 PLANS (Virtual Machines in Khabarovsk, Russia)  USE PROMO CODE: &lt;b&gt;CYBERRU&lt;/b&gt;&lt;br&gt;\r\nPlans for Khabarovsk VPS can be found at https://xhostfire.com/clientarea/cart.php?gid=14&lt;/font&gt;\r\n\r\nPlease send us a support ticket if you need custom packages or the listed plans are sold out. We may have alternatives. We do not allow any sort of abusive activity, please refer to our ToS at https://www.xhostfire.com/terms\r\n\r\nWe accept a variety of payment methods such as PayPal, Credit/debit cards and Bitcoin.\r\nPlease enter correct billing details or your order may be flagged and require manual verification.\r\n\r\n**Test IP addresses (example only to check routing):** Please check https://www.xhostfire.com/network\r\n\r\nThanks!\r\n"}