{"id": 132982, "date": "2017-12-16 19:57:47", "user": "ramnet", "post": "[TinyKVM](http://tinykvm.com/) is a specially discounted service provided by [RAM Host](http://www.ramhost.us). For over 8 years, we have been providing quality virtual dedicated servers for people on a budget. With our proven record, you can rest assured you will receive a quality stable professional product from a proven company that takes pride in offering affordable high quality web hosting solutions.\r\n\r\nOS - your choice of:\r\n\r\nArchLinux, Debian, Gentoo, OpenBSD, FreeBSD, NetBSD, Slackware, Ubuntu, and many more. Custom ISO images can be added too!\r\n\r\n**TinyKVM Plan Details**\r\n\r\n* 256 MB Dedicated RAM\r\n* 7 GB Hard Disk Drive\r\n* 200 GB Data Transfer Bandwidth\r\n* Gigabit Network\r\n* IPv4 and IPv6 dual-stack, Each VPS includes 1 IPv4 and 1 /112 IPv6, additional available!\r\n* Free DNS Hosting\r\n* Raid 10 Protected Storage with SSD caching - Higher Performance and Reliability\r\n* Expert Technical Support - Fast, Knowledgable Response Times When It Matters Most!\r\n\r\n**Extras:**\r\n\r\n* More Memory/Disk/Bandwidth/IPs - Contact Us\r\n\r\nAll prices are good for the life of your account with us!\r\n\r\nWe also offer custom plans to meet any budget and requirements. Contact us for a free quote!\r\n\r\n[We Have Lots of Excellent 3rd Party Customer Reviews Too](http://www.ramhost.us/?page=customer-reviews) and we have been voted #1 best provider on LowEndBox multiple times over the years.\r\n\r\n---&gt;&gt;&gt; [Signup Now](http://tinykvm.com) &lt;&lt;&lt;---\r\n\r\n------------------------------------------------------\r\n\r\nFAQ:\r\n\r\nQ: Do you allow IRC?\r\nA: IRC Servers/Clients/Bots/Bouncers are allowed for personal use.\r\n\r\nQ: Do you support OpenVPN/FUSE/PPTP/etc?\r\nA: Yes. As these plans are powered by KVM, almost anything that will work on a dedicated server will work inside your KVM VPS.\r\n\r\nQ: Can I run my own kernel?\r\nA: Yes, you can run custom Linux, BSD or other kernels on our KVM service.\r\n\r\nQ: What about adult content?\r\nA: We allow adult content as long as it is legal under US law.\r\n\r\nQ: Do you allow BitTorrent / P2P?\r\nA: Yes, provided you don't transfer anything illegal.\r\n\r\nQ: How long have you been in business?\r\nA: We have been operating servers since January 19 2009 - Over 8 Years!\r\n\r\n\r\nHave Questions? Post Them Below, Send me a PM, or [Contact Directly](http://www.ramhost.us/?page=contact)\r\n\r\n."}