{"id": 133600, "date": "2017-12-24 17:54:22", "user": "KuJoe", "post": "So for Black Friday we decided to think outside the box and offer something different and that worked out well so we wanted to mix it up a bit for Christmas and here we are. We're offering 2 different NAT OpenVZ VPS plans to test the waters since this is our first adventure into NAT country. Yes, we understand some people's feelings on NAT and OpenVZ but here they are anyways for the other people that need some off-site storage or a cheap VPS.\r\n\r\nOur first plan is a normal NAT VPS, depending on the popularity of this plan it may be moved to SSD storage (along with having more Wyvern features enabled) in the future.  \r\n\r\n**NAT5**  \r\n128MB RAM  \r\n128MB vSwap  \r\n5GB Disk Space  \r\n1000GB Bandwidth  \r\n1 vCPU Core (Fair Share)  \r\n1Gbps Port (Fair Share)  \r\n1 Shared IPv4 Address  \r\n/64 IPv6 Block  \r\n30 Port Forwarding Rules  \r\nTampa, FL.  \r\nWyvern Control Panel  \r\nOpenVZ Virtualization  \r\n$6.99 PER YEAR!  \r\n\r\nOur second plan is a storage NAT VPS, this one remain on HDD storage but other plans might be added in the future based on popularity.  \r\n\r\n**NAT100**  \r\n256MB RAM  \r\n256MB vSwap  \r\n100GB Disk Space  \r\n1000GB Bandwidth  \r\n1 vCPU Core (Fair Share)  \r\n1Gbps Port (Fair Share)  \r\n1 Shared IPv4 Address  \r\n/64 IPv6 Block  \r\n30 Port Forwarding Rules  \r\nTampa, FL.  \r\nWyvern Control Panel  \r\nOpenVZ Virtualization  \r\n$15 PER YEAR!  \r\n\r\n[You can order these plans here.](https://securedragon.net/clients/cart.php?gid=50)\r\n\r\nBoth plans include the following:  \r\n+ Wyvern Control Panel  \r\n+ SSAE-16 Certified Data Center in Tampa, FL.  \r\n+ Full root access  \r\n+ Basic DDoS Protection  \r\n+ 30 Day Money Back Guarantee  \r\n\r\n[You can find our server stats, test IPs, and looking glass here.](http://drgn.biz)\r\n\r\nThis is a zero warning service, any abuse will result in immediate termination without a refund. No warnings will be given.\r\n\r\nThe number of plans are limited as well as the duration of these plans so grab them now before they're gone! Your feedback is appreciated so feel free to leave it below.\r\n\r\nHappy Holidays! :)"}