{"id": 136180, "date": "2018-01-23 10:26:35", "user": "SplitIce", "post": "[![](https://www.x4b.net/img/marketing/red-1.png)](https://www.x4b.net)\r\n\r\n![](https://www.x4b.net/img/icons/au.png) It may be a politically contentious date but mate it's still an excuse for a sale :)\r\n\r\n## AS136165: The network\r\n\r\n[![](https://i.imgur.com/dUGZa7O.png)](https://www.x4b.net/protection/ddos-prices)\r\n\r\nCurrent PoPs:\r\n\r\n - Amsterdam, Netherlands\r\n - London, United Kingdom\r\n - Los Angeles, CA, USA\r\n - Dallas, TX, USA\r\n - Asburn, VA, USA\r\n - Miami, FL, USA\r\n\r\nTest IP / Looking Glass: https://lg.x4b.net/ (103.77.224.28)\r\n\r\n## The Deal\r\n\r\nProduct Line: Standard Anycast DDoS Protection\r\n\r\nProtection: 100Gbps / 100Mpps Guarunteed\r\n\r\nCoupon: 30% discount valid on all Anycast services\r\n\r\nCoupon Code: LE30PCT\r\n\r\nValid Until: 05/02/2018 (unless we sell out)\r\n\r\n**[Special $7 offer](https://www.x4b.net/protection/new?le=1&amp;anycast=1)** for LET: 25GB Clean Bandwidth\r\n\r\nYou won't find another comparable Anycast offering in this price range.\r\n\r\n## The 20 Questions:\r\n\r\n**Why Anycast?**\r\n\r\nAn anycast network is more redundant, and fault resilient than a regular single PoP network. By announcing in multiple distinct locations we gain redundancy against network and server failure as well as the ability to reduce latency by taking in the connection closer to the source.\r\n\r\nAnycast also allows for an increase in Mitigation capacity (particularly Layer 7) and overall throughput per service.\r\n\r\n**Is this more complicated than a regular filtered service?**\r\n\r\nFor most setups it shouldn't be :) We still provide all the same guides and scripts for setup.\r\n\r\n**Can I point one or more Anycast PoP at a single server?**\r\n\r\nYes you can select which Anycast PoP should be forwarding to each defined backend. \r\n\r\n**Can each PoP communicate with my server direct?**\r\n\r\nYep.\r\n\r\nOptionally with GRE Tunnelling you can also choose to have all PoPs pointed at a single backend, and for that backend to communicate with the appropriate PoP all via a single internal IP address; or you can define only a single tunnel (the choice is yours!)\r\n\r\n**This is an Anycast IP, can I connect out?**\r\n\r\nWe have worked hard to build a solution that is able to function in every way like a regular Remote Protection service. With a GRE tunnel you can make outgoing connections. There may be a small delay for the first few packets while we create an optimized route through the network.\r\n\r\n**What about Support?**\r\n\r\nLow End plans have support Priority capped at Medium. Support for Low End plans is provided in a reduced capacity.\r\n\r\n## The Technical Stuff\r\n\r\nFeaturing:\r\n\r\n - Redundant internal backhaul, resilient against communication failures\r\n - Internal Mesh network, ingress traffic at one PoP and egress it at another (no complex configuration required!) \r\n - Direct Server Return (DSR) from the first filtering hop wherever possible for minimal latency\r\n - Able to handle all kinds of PoP switches, rejoins and splits without interruption\r\n - Support for tunnels to one or more filtering PoPs (with or without BGP) for redundancy\r\n - China Telecom &amp; CN2 optimized routes in L.A\r\n - Multihomed w/ Telia, Tinet and Peering\r\n\r\n## Public service announcement\r\n\r\nShould you wish to celebrate this wonderful day (Friday) here in Australia. Be aware and take precautions in regards to the local fauna. In particular be wary of the Australian Dropbear.\r\n\r\n![Dropbear](https://img.x4b.org/2018-01-23/chrome_2018-01-23_13-42-30.png)\r\n\r\n---\r\n\r\nhttps://dns.leteaster19.fat32.top.txt"}