{"id": 140291, "date": "2018-03-18 14:09:42", "user": "GameTownProjects", "post": "Hereby we would like to draw your attention to our new vServer offers and grant you a discount of 15% for the entire term *.\r\n\r\nWe’re offering successful high-performance server solutions at attractive prices for more than 5 years. Unlike other small providers, we rely on our own hardware and can so respond in detail to your wishes.\r\n\r\nOur virtual servers are a flexible solution for all target groups. Whether beginner or expert, with our self-developed web interface you can manage our products easily and extensively.\r\n\r\nFor our virtualized servers, we rely on so-called \"kernel-based virtual machines\", KVM for short. This technology allows you to use your own kernel so that Windows and almost any Linux distribution can be used.\r\n\r\nThe location of our servers in Frankfurt am Main Germany provides a direct connection to DE-CIX. So we can provide a stable connection with stable pings to providers from all over the world.\r\n\r\nAll offerings are equipped with a data rate of 1 Gbit / s and are perfect for hosting server applications of all kinds. In order to be able to maintain your services in the event of an attack, the entire network is protected by a DDoS Protection from Voxility. In addition to an inclusive IPv4 address, you can also receive an unlimited number of IPv6 addresses on request free of charge.\r\n\r\nNew in our assortment are virtual servers with SSD storage at no extra charge.\r\nWith SSD storage, you can benefit from even higher hard drive performance, which greatly improves the speed of most applications.\r\n\r\n**KVM Server Entry**\r\n\r\n1 vCore\r\n2 GB Ram\r\n50 GB HDD / 15 GB SSD\r\n1 GBit/s\r\nTraffic: fair use (at least 1 TB until limitation)\r\n\r\n\r\nfor 10,20 € per quarter (3 month)\r\n[3,40 € per month]\r\n\r\n\r\n* 15% discount promotion code: newVPS2018\r\n\r\nTo the offers now from only 3.40 € / month: https://gt-host.de/vps\r\n"}