{"id": 14450, "date": "2013-10-05 21:06:40", "user": "MountVPS", "post": "We have added couple of nodes to our existing nodes. On that occasion we are planning to offer a huge offer.\r\n\r\nWe have added couple of nodes to our existing nodes. On that occasion we are planning to offer a huge offer. All our server provisioning are automatic and instant. Our servers are equipped with 72GB DDR3 ECC, 2 X 2,000GB SATA in RAID 1,  2 * 1Gbits Port Connection and Instant Setup.\r\n\r\n    EVR-4096 \r\n    100GB Storage Space \r\n    1750GB Bandwidth \r\n    4096MB RAM \r\n    4096MB SWAP \r\n    4 CPU Core 3.4GHz (Equal Share) \r\n    1 IPv4 Address (Additional on Request - 1.25/month) \r\n    100 IPv6 (More Free on Request) \r\n    100 mbits Port \r\n    No Hidden Fees \r\n    Free/Instant Setup \r\n    OPENVZ Virtualization \r\n    Price - 6.49/month\r\n    \r\nTest IP and Test File Download\r\n    \r\n    IP: 198.50.26.27\r\n    File: http://198.50.26.27/100MB.test\r\n\r\nWe can provide unmetered bandwidth for additional charge or we can provide unmetered 10mbits bandwidth for this price. \r\n\r\n##Our datacenter is in Chicago. \r\n\r\nNo Need for Coupon - [Click here to order](http://www.mountvps.com/billing/cart.php?gid=4)\r\n\r\nNo Game Clients or your account will be banned\r\n\r\nIf someone wants to host a wordpress website with robust caching system and varnish cache on the backend to better manage trafic then Please let us know. Our technicians will setup your wordpress website with following things for $9.99 (one time)\r\n\r\n1. NGINX with virtual host so that we can host as many subdomain as you want. (This comes with PHP installation, MYSQL and PHPadmin setup as well as webserver setup)\r\n2. Varnish Cache on the Backend.\r\n3. APC Caching system and Linking it with the W3 Total Cache\r\n4. Wordpress installation with W3 Total Cache\r\n5. Pointing your domain to the VPS IP with cloudflare\r\n\r\nJust buy a VPS and open a ticket and we will assist you setting up asap. \r\n\r\n\r\nWe can provide customer package as well. Contact us at http://www.mountvps.com/billing/contact.php with your custom package information"}