{"id": 145553, "date": "2018-05-30 19:03:22", "user": "BharatB", "post": "[Qovic Online Solutions LLP](https://qovic.com/) - Web hosting, Dedicated Servers, WHMCS Modules, Server Management.\r\n\r\nQovic caters to all your needs when it comes to I.T, Dedicated Servers, Colocation, Web Hosting, Virtual Servers and also Managed Cloud services on platforms like AWS and GCS since 2016. With a seasoned team, we always thrive to drive your business in the right direction with the best available resources the market has to offer. \r\n\r\nDowntime is a strict NO for us to ensure that we operate out of data centers that are disaster proof and have the best service record in the industry thus maintaining a 99.99% uptime.\r\n\r\nOur fantastic support team is available round the clock for businesses that are uptime critical via Phone, Email or Live Chat making sure you’re attended to at all times, rest easy and concentrate on business while we take care of your infrastructure.\r\n\r\nAs experts in the industry, we take up the task of migration to ensure a smooth transition without affecting your current status ensuring minimal downtime onto our secure &amp; high performing infrastructure. Any customer is thus entitled to a hassle-free migration service free of cost.\r\n\r\n**Dual Intel Xeon E5-2620v2 ( 12 Cores, 24 VCPUs)**&lt;br /&gt;\r\n32GB ECC RAM&lt;br /&gt;\r\n4x256GB Intel 545 SSD&lt;br /&gt;\r\n/29 IPv4 + /28 IPv4, &lt;br /&gt;\r\n/64 IPv6&lt;br /&gt;\r\n10TB @ 1GigE&lt;br /&gt;\r\n100% Uptime Guarantee&lt;br /&gt;\r\n15Gbit/s DDoS Mitigation Included&lt;br /&gt;\r\nPsychz, Los Angeles &lt;br /&gt;\r\n&lt; 24h Provisioning \r\n&lt;br /&gt;Includes IPMI ( Different Subnet saving you the cost of an IP)&lt;br /&gt;\r\n**$84/mo only!**&lt;br /&gt;\r\n**[Order Now!](https://qovic.com/clients/cart.php?a=add&amp;pid=30)**\r\n\r\nUse coupon **LETSALE**&lt;br /&gt;\r\n\r\n**Test IP / Looking Glass** &lt;br /&gt;\r\nhttp://lg.lax.psychz.net\r\n\r\n**Add-ons / Customization**&lt;br /&gt;\r\nUpgrade to Unmetered 1GigE @ $99/mo additionally&lt;br /&gt;\r\nUpgrade to 48GB RAM -&gt; $100 one time fee.&lt;br /&gt;\r\nUpgrade to 64GB RAM -&gt; $200 one time fee.&lt;br /&gt;\r\nAdditional IP(s) are subject to availability and can be provided with proper justification ( up to /24 SWIP IP(s) ).&lt;br /&gt;\r\nHigher size disks can be requested via Ticket as we need to confirm stock.&lt;br /&gt;\r\n\r\n**Note: Any modification of above configuration may result in delaying the provisioning ETA for the same will be given.**&lt;br /&gt;"}