{"id": 14608, "date": "2013-10-09 08:11:09", "user": "rds100", "post": "Do you want to learn how to manage your own dedicated server and play with\r\nvirtualization?  \r\nWe've got an offer for you. Probably the cheapest offer for a small server\r\nsupporting hardware virtualzation.\r\n\r\nSo the specs of this dedi are: &lt;b&gt;AMD E240 CPU&lt;/b&gt; (single core 1.5GHz), &lt;b&gt;2GB RAM&lt;/b&gt;\r\n(actually 1.75GB, because the builtin video takes the rest) and a single\r\n&lt;b&gt;500GB&lt;/b&gt; 3.5\" SATA 7200RPM not enterprise and not new HDD. This bundled with a\r\n&lt;b&gt;/29&lt;/b&gt; (5 usable IPs) netblock assigned (SWIPed) to your name,\r\n&lt;b&gt;100Mbps&lt;/b&gt; ehternet port, &lt;b&gt;3000GB&lt;/b&gt; bandwidth per month and a system for\r\nautomatic reinstallations and remote reboot. And all this for &lt;b&gt;$15 / month&lt;/b&gt;.\r\n\r\nThis CPU supports hardware virtualzation, so this server can run OpenVZ, Xen\r\nor KVM. Although quite slow for real production use, it's good for learning\r\nand experimenting.\r\n\r\nThe catch is, we only have one of these E240 systems left and we aren't\r\ngetting more. So if you want it, PM me.  \r\nThe other catch is, that the offer is valid only for LET members which have\r\nbeen on LET for at least 6 months. So if you are registered on LET after 9th\r\nof April 2013 - you can't get this.  \r\nAlso you need to be knowledgeable enough to be able to manage the server\r\nyourself.  \r\n\r\n&lt;b&gt;&lt;font size=+2&gt;[edit: The one listed above was SOLD already]&lt;/font&gt;&lt;b&gt;\r\n\r\nOur other (regular) dedi offers can be found here:  \r\nhttps://www.fitvps.com/members/cart.php?gid=2  \r\n\r\nOr at these LET threads:  \r\nhttp://lowendtalk.com/discussion/13614/ivy-bridge-dual-core-dedicated-from-30-month-and-more  \r\nhttp://lowendtalk.com/discussion/10468/atom-n2800-dedicated-servers-from-25-month  \r\nhttp://lowendtalk.com/discussion/8926/dual-core-4-threads-1-86ghz-atom-n2800-with-4gb-ram-from-25-month  \r\nhttp://lowendtalk.com/discussion/8326/atom-n2800-from-25-month  \r\n"}