{"id": 146426, "date": "2018-06-12 14:16:50", "user": "MikePT", "post": "Hello,\r\n\r\nWe are expanding. 2 years and a half after we started WNDP - WebNegócio Lda, 7 months after we launched MXroute.io, we're now moving to a much better, much larger office to accommodate our growth.\r\n\r\nAs so, we'd like you guys to enjoy our super exclusive yearly offers, and thank you, once again, for helping us growing!\r\n\r\nPromotional _let's think about it_ text:\r\n\r\nWe'd like you to look at this list and ask yourself which of these items have recently frustrated you and taken up time that could have been better spent elsewhere:\r\n\r\n* IP blacklisting due to compromised hosting account/app.\r\n* Waking up to deal with said compromised account/app before every other customer starts complaining.\r\n* Unnecessary rejection from AT&amp;T, Verizon, Yahoo, Hotmail, someone important who just doesn't like you and doesn't care if you or your customers like it.\r\n* Rate limited by Google. You know that one customer with a catchall forwarder that causes everyone else to not be able to email their blog subscribers? Yeah, we all know that guy.\r\n* \"My email lands in spam folders and I think it's your fault\" said at least one customer every day, like you can control what Google wants to receive?\r\n\r\nHow about this for an answer:\r\n\r\n* All outbound email heavily filtered.\r\n* Compromised accounts sending spam no longer impact neighbors.\r\n* IP reputation is never a phrase you speak again\r\n* If an email is rejected due to blacklisted IP, it is sent again from another IP, never bouncing to the sender\r\n* Alerts sent to email and/or webhooks (slack notifications, anyone?) for email trends (spam, rejected content, rate limited senders, etc)\r\n* cPanel/Plesk plugin to immediately configure your servers to use this\r\n* This beautiful panel to see your stats: https://files.mxcloud.io/marketing/mxio_panel.png\r\n* This extremely useful UI for searching mail logs: https://files.mxcloud.io/marketing/mxio_logsearch.png\r\n* Easily grant individual senders access to their own logs: https://files.mxcloud.io/marketing/mxio_insights.png\r\n \r\n**Plans available:**\r\n \r\n**STARTER**\r\n10.000 Emails per month\r\n\r\nOverage: 0,70€ per 1000 emails\r\n \r\nSMTP Relay Access\r\n\r\nMailChannels Cloud Access\r\n\r\n[5€ /month](https://mxroute.io)\r\n\r\n**Special annual offers at https://mxroute.io/LET.html**\r\n\r\nIn stock: \r\n \r\n**LET10K - 20**\r\n\r\n**LET5K - 20**\r\n \r\n**LET2K - 20**\r\n\r\n\r\nRule is: First come, first served!\r\n\r\nMore plans available at https://mxroute.io\r\n"}