{"id": 156828, "date": "2019-04-11 21:09:51", "user": "Abdullah", "post": "Hi guys!\r\n\r\n&lt;br /&gt;\r\n\r\nAs promised, some good deals are here. HostHatch was founded on 11th April, 2011 and today marks the 8th year in existence. These are special deals that will be available for one week.\r\n\r\n&lt;br /&gt;\r\n\r\nWe won't be extending these and the orders will close on 18th April.\r\n\r\n&lt;br /&gt;\r\n\r\nWe're also introducing Chicago in these deals. The looking glass is available at http://lg.chi.psychz.net/ - very premium network. Provisioning ETA for Chicago servers is 29th April, 2019. (Expected ~20th April, but the promised date is 29th April) -- all the equipment is already there. \r\n&lt;br /&gt;\r\n\r\nChicago storage:\r\n&lt;pre&gt;\r\nBase plan:\r\n1x 3.0 GHz\r\n3 GB RAM\r\n3 TB usable storage\r\n15 TB bandwidth\r\n$84 per year\r\nAdd more: 1 GB RAM, 1 TB storage and 5 TB bandwidth chunks for $2.5 per month each. Up to 30 TB storage per VM. This pricing is only for servers created until 18th April.\r\n&lt;/pre&gt;\r\n\r\n\r\n&lt;pre&gt;\r\nNote: We can do this plan on monthly billing if at least 5 TB storage is bought.\r\nNote2: Servers can be upgraded with chunks after the promotion period at the same pricing, as long as the server was ordered within the promotional period.\r\nNote3: Sorry for making it a bit confusing, could not figure out a way to make the structure easier.\r\n&lt;/pre&gt;\r\n\r\n&lt;br /&gt;\r\n&lt;br /&gt;\r\n\r\nNVMes:\r\n\r\n&lt;pre&gt;\r\n1 CPU core (15% dedicated)\r\n512 MB RAM\r\n8 GB NVMe disk (RAID-10)\r\n1 TB premium bandwidth\r\n$15 per year\r\nAvailable in: Oslo, Vienna, NY, LA, Chicago, Stockholm and Amsterdam\r\nFree upgrade with double RAM in any location\r\nFree upgrade with double RAM, double disk, and 10x bandwidth in Chicago\r\nFree 40 Gbps DDoS protection will be activated for Chicago NVMe customers at a later date (will be available at a cost for orders after 18th April)\r\n&lt;/pre&gt;\r\n\r\n&lt;pre&gt;\r\n1 CPU core (30% dedicated)\r\n1 GB RAM\r\n10 GB NVMe disk (RAID-10)\r\n1 TB premium bandwidth\r\n$30 per year\r\nAvailable in: Oslo, Vienna, NY, LA, Chicago, Stockholm and Amsterdam\r\nFree upgrade with double RAM in any location\r\nFree upgrade with double RAM, double disk, and 10x bandwidth in Chicago\r\nFree 40 Gbps DDoS protection will be activated for Chicago NVMe customers at a later date (will be available at a cost for orders after 18th April)\r\n&lt;/pre&gt;\r\n\r\n&lt;pre&gt;\r\nAny of our larger NVMe plans (if paid semi-annual or higher):\r\n\r\nFree upgrade with double RAM in any location\r\nFree upgrade with double RAM, double storage, and 10x bandwidth in Chicago + free DDoS protection\r\n&lt;/pre&gt;\r\n\r\n&lt;br /&gt;\r\n&lt;br /&gt;\r\n\r\nStorage plans (available in Amsterdam, Stockholm, Chicago - not LA)\r\n\r\n&lt;pre&gt;\r\n1 CPU core\r\n512 MB RAM\r\n250 GB storage\r\n1 TB bandwidth\r\n$15 per year\r\n(small amount available in each location, thread will be updated once sold out) \r\n&lt;/pre&gt;\r\n\r\n&lt;pre&gt;\r\n1 CPU core\r\n1 GB RAM\r\n1 TB storage\r\n4 TB bandwidth\r\n$12 per quarter\r\n&lt;/pre&gt;\r\n\r\n&lt;br /&gt;\r\n\r\nWe cannot replace existing servers, or apply these promotions to existing servers. These only apply to new servers ordered before 18th April.\r\n\r\n&lt;br /&gt;\r\n\r\n**To order:**\r\n\r\nTo order, please sign up/login at manage.hosthatch.com and deposit the appropriate amount of funds. Then open a ticket with sales mentioning the promotion/location you want. All servers will be created by us manually with the following provisioning times and renewal dates will be updated accordingly:\r\n\r\n\r\nChicago: 29th April\r\nAmsterdam/Stockholm: 19th April\r\nNY/LA/Oslo/Vienna: 24 hours\r\n\r\n&lt;br /&gt;\r\n\r\nAll of these are approximate, we will try to deliver much earlier where possible. We do not expect any delays in provisioning times more than these dates. Please read this thread carefully before depositing funds.\r\n\r\n&lt;br /&gt;\r\n\r\nThank you for the love guys. To the next 8 years and more. Cheers!"}