{"id": 158741, "date": "2019-07-04 15:39:20", "user": "vapornode", "post": "**[OVERVIEW]**\r\n\r\n\r\n\r\nProxCP is a full-featured extension to Proxmox VE for VPS hosting providers. Proxmox is well-known and very reliable but it is missing many features and convenience factors that would make it ideal for commercial use. ProxCP aims to solve this by providing a customer web interface that is easy to use with full billing integration. LXC, KVM, and KVM Cloud accounts are all supported.\r\n\r\n\r\nProxCP is relatively new but we care about the direction of the software and keeping it in line with what hosting providers want. Have a feature idea that ProxCP doesn't have? Let us know and it will very likely be added. The majority of updates made so far have come from user feedback.\r\n\r\n\r\n\r\n**[FEATURES]**\r\n\r\n\r\n\r\nProxCP v1.2 was recently released with a focus on quality of life improvements to the admin interface and adding support for Blesta integration.\r\n\r\n\r\nOutside of that, ProxCP features include:\r\n\r\n\r\n- Create, suspend, unsuspend, and terminate LXC and KVM services with ease\r\n\r\n- Built-in support for custom KVM templates that actually work with Proxmox\r\n\r\n- Prefer cold hard ISOs? Your users can upload ISO images themselves\r\n\r\n- Monitor VPS bandwidth usage and automatically suspend on overages\r\n\r\n- Manage forward and reverse DNS records\r\n\r\n- Integrate with DHCP servers for full provisioning automation\r\n\r\n- Firewalls, backups, rebuilds, and more!\r\n\r\n\r\n**[CHEAP LICENSES]**\r\n\r\n\r\n\r\nProxCP has a licensing structure that fits any business no matter what stage it's in. We do need to cover development costs but we don't want to take 56% of your revenue just because.\r\n\r\n\r\n\r\n\r\nUse coupon code **JULYFOUR** and receive a 30% recurring discount on _any_ new ProxCP license! What does that look like for you?\r\n\r\n\r\n[https://proxcp.com/licenses](https://proxcp.com/licenses)\r\n\r\n\r\n- Basic license: $4/month\r\n\r\n- Starter license: $24/month\r\n\r\n- SMB license: $45/month\r\n\r\n\r\n...this discount even includes owned licenses and branding removal. Want to try it out first? There is a free trial option you can pick up at any time.\r\n\r\n\r\n[https://proxcp.com](https://proxcp.com)"}