{"id": 160025, "date": "2019-08-29 14:21:49", "user": "seriesn", "post": "Good day fellow LETians. Some of you might know us and most of you most likely don't. But we want you to know us.\r\n\r\n&lt;center&gt;Who are we? :&lt;/center&gt;\r\n\r\n&gt;&lt;b&gt;&lt;a href=\"https://nexusbytes.com\"&gt;We are Nexus Bytes LLC&lt;/a&gt;&lt;/b&gt;\r\n&gt;Your web hosting partner. Nexus Bytes LLC is a privately owned hosting company established in 2016. We are based out of Middletown, Connecticut, USA. We are legally incorporated as a business in the State of Connecticut. Nexus Bytes LLC is owned and managed by a very small group of IT enthusiasts who are passionate about web hosting and server management and pride themselves in providing reliable and affordable web hosting service to the masses at a price they can afford.\r\n\r\n&lt;center&gt;Our motto :&lt;/center&gt;\r\n\r\n&gt;We only believe in providing quality service for an affordable price. Customer satisfaction is, has been and will always be our top priority! Here at Nexus Bytes LLC, you, our customers are our #1 priority and we strive to make you happy. Your satisfaction is what we care about and we will do everything and anything we can, that is within our policy and capability to ensure your are 100% satisfied.\r\n\r\n&lt;b&gt;What are we offering here at today?&lt;/b&gt;\r\n\r\nWell to keep it short and simple, we are offering  60% off on any of our VPS hosting plans for a limited time\r\n\r\nOkay lets get down to details,\r\n\r\nPlan :\r\n&gt;&lt;b&gt;Basic SSD&lt;/b&gt;\r\n\r\n&gt;1 GB RAM\r\n&gt;10 GB PURE SSD STORAGE\r\n&gt;1 TB Transfer @ 1Gbit shared. (Free Double Bandwidth to first 10 signups)\r\n&gt;1 CPU Cores @3.4GHz+**\r\n&gt;1 IPv4\r\n&gt;KVM Virtualization\r\n&gt;Custom ISO Supported\r\n&gt;Locations : Falkenstein, Germany\r\n&gt;$2.80/mo with discount code \" LET-Basic\"\r\n&gt;&lt;a href=\"https://nexusbytes.com/knowledgebase/6/Nexus-Bytes-LLC--48-Hour-Refund-Policy.html\"&gt;48 Hour Money Back guarantee&lt;/a&gt;\r\n\r\nTest IP : 178.63.68.107\r\n\r\n&lt;a href=\"https://nexusbytes.com/cart.php?a=add&amp;pid=8\"&gt;Order and configure here&lt;/a&gt;\r\n\r\n&lt;a hef=\"https://nexusbytes.com/knowledgebase/2/Policies\"&gt;Link to our Terms of Service, Acceptable use policy, Privacy Policy and Service level agreement. &lt;/a&gt;\r\n\r\n&lt;a href=\"https://nexusbytes.com/\"&gt;Our Other Products&lt;/a&gt;\r\n\r\nThank you for taking the time and checking out this offer. We look forward towards earning your business."}