{"id": 160721, "date": "2019-10-11 15:47:23", "user": "ArubaCloud", "post": "Hi guys, how are you doing? ;)\r\n\r\n&lt;h2&gt;Still looking back at the good times when we had our 1 EUR VPS?&lt;/h2&gt;\r\n\r\nYou told us several time that having missed the opportunity to renew our 1EUR box offer has been one of the worst mistake ever, as you haven't found such a deal from any provider ever since.\r\n\r\n_«Times like this I wish Aruba still did their 1 euro boxes»_ \r\ncit. @mikewazar \r\n\r\n_«Even Tom Cruise can't find a deal like Aruba's 1 EUR VPS»_ \r\ncit. @subjugating\r\n\r\nWe cared about you nostalgic people! And here is the “Mission impossible” deal we got for you:\r\n\r\n&lt;h1&gt;1 Year of our Linux Cloud VPS Small at the old price of 1 EUR / month&lt;/h1&gt;\r\n(equivalent to 1.1 US dollar (+VAT) / month)\r\n\r\n[Cloud VPS Small](https://www.arubacloud.com/vps/virtual-private-server-range.aspx):\r\n* 1 vCPU\r\n* 1 GB RAM\r\n* 20 GB SSD Storage\r\n* 2 TB/month data transfer\r\n* Operating system: Linux - Virtualization powered by VMware technology.\r\n* You can choose to activate it in one of our 8 Data Centers available in different European countries (Italy, Czech Republic, France, Germany, United Kingdom, Poland).\r\n\r\n**The promo is limited to the first 10 users** who will reply to this thread asking for a voucher, so hurry up and **don't miss the chance to be like Tom Cruise**... or even better! :)\r\n\r\nThis is just the first preview of many limited offes we are going to reserve for LET users in the near future, so… stay tuned!\r\n\r\n[![Image](https://i.ibb.co/QYK9cZg/arubacloud.png \"Aruba Cloud\")](http://www.arubacloud.com)\r\n\r\n&lt;hr /&gt;\r\n**Offer rules:**\r\n\r\nThe promo is valid both for current and new customers and it’s limited to the first 10 LET users who will answer to this thread. You have to specify before you request it if you want to use it for a new or existing account.\r\n\r\nWe will send via PM to the first 10 users who answer to this thread a voucher of 21.48 EUR which will allow to purchase 12 months of “Cloud VPS - Server Smart\" size Small at 12.00 EUR (+VAT) instead of 33.48 EUR (+VAT). After the first year the product can be renewed at the list price.\r\n\r\n\r\n"}