{"id": 161726, "date": "2019-11-29 09:32:44", "user": "AlexBarakov", "post": "Hello!  \r\n\r\nIt's this time of the year again - Black Friday. The day where we offer premium services at questionably low pricing!  \r\n\r\nHere's how we'll be doing it this year - every hour, we will be posting a new very special offer on 3 categories - OpenVZ VPS, KVM VPS and Dedicated servers on our very special BlackFriday website, located over at https://blackfriday.alphavps.bg  \r\n\r\nThat's not all - at random intervals, we'll be releasing FLASH SALE items, super limited in quantity, listed again over at https://blackfriday.alphavps.bg  \r\n\r\n\r\nAll subscribers on our mailing list will be receiving flash sale deals, throughout all December!  \r\n\r\nAll of our twitter subscribers will also be the first to know about all special deals!  \r\n\r\n\r\n===============HEAD OVER TO:=============  \r\n[https://blackfriday.alphavps.bg](https://blackfriday.alphavps.bg)\r\n\r\n\r\n\r\n**Some quick FAQ:**  \r\n\r\n- All pricing is in EUR  \r\n- All pricing is VAT Excl, unless otherwise stated  \r\n- VAT will be charged to EU residents, living outside of Bulgaria, with no valid VAT number. VAT will not be charged to customers from outside the EU.  \r\n- All black friday sales are non-refundable and come with limited support  \r\n- All orders need to contain valid contact information, otherwise will be rejected.  \r\n\r\n**About us:**  \r\n[AlphaVPS](https://alphavps.bg) is an IaaS provider, offering Virtual servers, Dedicated Servers, Connectivity and custom solutions out of 5 world-wide locations. Operating since 2013 and based out of Bulgaria. Our offices are located in Troyan and Sofia. We are staffed around the clock and our team is fully in-house with zero outsourcing. We run our network under AS203380, own our hardware and our Sofia office is located inside the Telepoint DataCenter in our flagship Sofia location, just above our equipment. Our company name is DA International Group Ltd. and we are an EU VAT-registered company.  \r\n\r\n&gt;Some network information:  \r\n- Sofia, Bulgaria @ Telepoint DC - http://lgbg.alphavps.bg - Native IPv6 available.\r\n- London, United Kingdom @ London Enfield 1 facility and Telehouse 2 - DDOS Protected - http://lguk.alphavps.bg - Native IPv6 available\r\n- New Jersey, USA @ Choopa's facility in NYC Metro. - DDOS Protected - http://lgny.alphavps.bg - Native IPv6 available\r\n- Nuremberg, DE - DDOS Protected - http://lgde.alphavps.bg - Native IPv6 available\r\n"}