{"id": 165721, "date": "2020-07-12 09:41:33", "user": "jar", "post": "## MXroute Summer 2020 Offer\r\n\r\nMXroute is a \"bring your own domain\" e-mail service. You provide the domain, we provide service for inbound and outbound e-mail. We provide a strong focus on outbound e-mail delivery, with an adequate (if not above average) focus on inbound e-mail delivery. Our philosophy is that anyone can run an inbound mail server, but getting your e-mail delivered to Gmail, Hotmail, Verizon, AT&amp;T, and Yahoo from one IP address is almost a fantasy. If we don't get your email where it needs to go, there's no way to get it there. We started with MailChannels as our relay and we grew up to our own internal system that consistently outperforms it. You can read more about our delivery system under \"E-mail Flow\" in our docs: https://docs.mxroute.com/en/technologies\r\n\r\nWe provide SMTP, POP3, IMAP, Webmail (Roundcube, Rainloop, Crossbox), Control Panel (DirectAdmin-based), and NextCloud (primarily for Cal/CardDAV).\r\n\r\nWe're also proud to announce that we're adding mobile apps for iOS and Android! Our iOS app is already available, and the Android app will be available any day now. You can pre-register for the Android app here: https://play.google.com/store/apps/details?id=com.mxroute.crossbox\r\n\r\nThe iOS app is available here: https://apps.apple.com/us/app/mxroute/id1522254361\r\n\r\nWe're big believers in open source as well. We've started our rspamd custom rules where it will grow, and users can contribute (https://github.com/mxroute/rspamd_rules). We also contribute to ZoneMTA, a huge piece of our infrastructure (https://github.com/zone-eu/zone-mta).\r\n\r\nWith all of that said, I'd like to introduce a limited offer for this summer:\r\n\r\nName: Large Promo\r\nFeatures: 50GB Storage, unlimited domains/emails\r\nLimits: 300 outbound per hour (per email address)\r\nPrice: $25/year (recurring)\r\nOrder: https://portal.mxroute.com/cart.php?a=add&amp;pid=103\r\n\r\nThis is a big discount, and we haven't been offering a lot of those lately. We hope to see you join us!\r\n\r\nMXroute is a partnership LLC based in Texas: https://opencorporates.com/companies/us_tx/0803383575"}