{"id": 165936, "date": "2020-07-21 20:56:22", "user": "qps", "post": "**QuickPacket™** is pleased to offer premium dedicated servers with high-quality, major brand hardware backed by a 100% uptime guarantee.\r\n\r\n**Why Choose QuickPacket™?**\r\n- Founded in 2003; registered NC Limited Liability Company.\r\n- We are not resellers - we own all of our server hardware.\r\n- We operate our own fully-redundant network [AS46261](https://bgp.he.net/AS46261) and have IP addresses directly from ARIN.\r\n- Data center staffed 24x7 by on-site technicians.\r\n- We keep spare parts on-site for hardware replacement.\r\n- We have flexible month-to-month terms that do not require a long-term commitment.\r\n- We provide a private VLAN on every server.\r\n- We stock a large selection of IP addresses and can offer up to an additional /24 per server (optionally 8x /27, 4x /26, or 2x /25, if you prefer).\r\n- We will announce and route your IP addresses for free with a proper LOA or a valid RPKI ROA.\r\n- We offer free BGP sessions upon request.\r\n\r\n**SuperMicro - Intel Dual Xeon E5-2650v2**\r\n- Dual Octa Core 2.6 GHz / 2x 20 MB Cache / HyperThreading (32 Threads!)\r\n- 32GB RAM standard (upgrade to 64GB +$20, 96GB +$30, 128GB +$40, 256GB +$80)\r\n- 1TB Hard Drive or 500GB SSD\r\n- /29 IPv4 Addresses (5 usable IP Addresses) on Private VLAN with Reverse DNS\r\n- /64 IPv6 Addresses upon request (More available with justification)\r\n- Dedicated KVM over IP / IPMI\r\n- 50TB Bandwidth / 1 Gbps Port (upgrade to 100TB for +$20)\r\n- Unmanaged\r\n- Located in Los Angeles, CA\r\n\r\n**WOW - SAVE $80! - $69.99 per month - USE PROMO CODE W58G49PEZA**\r\n**[CLICK HERE TO ORDER NOW!](https://quickpacket.com/billing/cart.php?a=add&amp;pid=284&amp;promocode=W58G49PEZA)**\r\n\r\nNote: All add-ons (network upgrades, hardware and software pricing) are listed on the order form. If something is not listed on the order form, please contact us for pricing.\r\n\r\n**Charlotte Facility Information:**\r\n- Located in 530 W 6th St, Los Angeles, CA.\r\n- UPS and Generator backup power.\r\n- Network providers include PCCW, GTT, and Cogent.\r\n- Looking Glass / Test Files: http://lg.lax01.quickpacket.com\r\n\r\n**Technical Support:**\r\n- Push button reboots are provided for no charge.\r\n- Faulty hardware replacement is included on dedicated servers.\r\n- Dedicated servers are unmanaged. However, our technicians are available 24x7 to assist with simple, non-recurring requests (generally 15 minutes or less per request). Recurring or more involved requests may qualify as advanced technical support, which is available for $100 per hour.\r\n\r\n**Acceptable Use Information:**\r\n- Warez-related, Bulk Mail, and Spam-related activities are strictly forbidden.\r\n- CAN-SPAM, Copyright, DMCA, and other related US laws must be strictly followed.\r\n- Legal adult content is allowed.\r\n- Please review our [Terms of Service](https://quickpacket.com/termsofservice.php), which includes Acceptable Use Policy and Service Level Agreement, for more information.\r\n\r\n**Ordering Information:**\r\n- We accept VISA, MasterCard, Discover, American Express, Alipay, Bitcoin and PayPal for payment.\r\n- Please [contact our sales department](https://quickpacket.com/billing/submitticket.php?step=2&amp;deptid=2) with questions prior to ordering.\r\n- Orders will typically be processed within one business day after verification.\r\n- Promotional pricing is available for new customers or existing customers adding additional servers.\r\n- Promotional code is mentioned above and is embedded in the order links provided. The discounted price will be reflected on the second page of the order form.\r\n\r\nThanks for your interest! We look forward to serving you!"}