{"id": 166175, "date": "2020-08-05 19:30:29", "user": "combahton_it", "post": "fastpipe.io is a brand of combahton GmbH, offering Cloud and Dedicated Servers in Frankfurt am Main, Germany.\r\n\r\nOur services are based on latest HPE and Supermicro servers, offering outstanding realiability and performance. We also operate our own fully redundant, multi-datacenter Juniper based network, consiting of Juniper EX, QFX and MX equipment.\r\n\r\n**Some key features of our SSD Cloud Servers**\r\n\r\n* **High Availability:** All SSD Cloud Servers are provisioned on a redundant, highly available KVM Cluster consisting of multiple Cloud and Storage Nodes. HA is provided by Corosync and GlusterFS. Storage Nodes are based on SSD and HDD (SAS) Raid-10, using NVMe Drives (Caching) to provide exceptionel I/O performance. The whole setup is fully redundant, both on network and server level.\r\n\r\n* **Excellent connectivity:** By default, every cloud node is connected with 2x 10Gbit to our network. This provides network-level fault resilience, fast data transfers, and best performance even at peak times. Network-intensive applications are excellently hosted with us, as our AS30823 is based on a premium Tier-2 blend. Packetloss during peak hours? Not when your server is hosted with us.\r\n\r\n* **DDoS-Protection:**  Our cloud servers include our exclusive, self developed DDoS protection, which is unique beside other proprietary solutions and used by large gameserver clients. Even DDoS attacks on web applications are filtered out by our DDoS protection.\r\n\r\n* **Additional IP-Addresses:** You can add additional IP addresses (from 1.49€) and subnets (from 6.95€) to your instance. The setup takes place immediately, the reserved address ranges are routed to an instance of your choice.\r\n\r\n* **Daily Backup:** Data loss is annoying. Accordingly, our cloud server nodes are equipped with several hard drives (hardware raid) as standard. You can avoid the risk of self-generated data loss with minimal effort through our automated snapshot backups. For this purpose we make a complete backup of your server every day.\r\n\r\n* **Scale at any time:** Do you need more CPU power, memory or disk space instantly? Scale your server automatically to the next higher level, fully automated and without changing the existing configuration or data. We only charge you the difference in connection with the current remaining term.\r\n\r\n* **Virtual Private Lan:** Create your own, isolated networks with our Virtual Private Lan (VPL). VPLs behave like V-Lans and provide an internal network between different instances where you can freely use your own IP addresses. Choose between 1Gbit, 2Gbit or 5Gbit interfaces.\r\n\r\n* **Free BGP (AS30823):** Already own an AS and IP-Space? Just open a ticket after your server has been provisioned and tell us your ASN and Prefixes with valid route objects. We will configure the session within two business days.  \r\n\r\n* **Real hardware required?:** Check out our website, beside Cloud Servers, we're also offering [Dedicated Servers](https://www.fastpipe.io/dedicated \"Dedicated Servers\") based on premium hardware.\r\n\r\n**Small entry offerings**\r\n\r\nWith a small budget, you get a lot of power and possibilities with our Cloud Servers. Starting at 2,95€  ($3,56) per 30 days, we offer:\r\n\r\n* **Cloud HE-2**\r\n* One CPU Core (Intel Xeon E5v2/v3/v4 @ +2,5GHz) incl. AES-NI\r\n* 2048MB ECC Memory\r\n* 80GB HDD Storage\r\n* Debian, Ubuntu, CentOS and FreeBSD available as one-click installation\r\n* Additional details and [order link available on our website](https://www.fastpipe.io/cloudserver)\r\n\r\nMore power needed? [Choose a higher package](https://www.fastpipe.io/cloudserver) or upgrade with just a few clicks, without moving configuration or data.\r\n\r\nWant to learn more about our current progress? Checkout our [blog](https://www.fastpipe.io/blog/)."}