{"id": 1663, "date": "2012-02-29 03:24:29", "user": "laaev", "post": "**Breaking news:** URPad.net expands to Los Angeles, CA in partnership with QuadraNET.com!\r\n\r\nThe below hot special is now available in our newest and latest expansion: Los Angeles, CA\r\n\r\nAre you from Asia? Clients from Asia? Are you or your target audience in or near the northwest? This is the perfect location for you regardless of where you are, QuadraNET is directly connected to One Wilshire in Los Angeles (premium network) with excellent Asian routing.\r\n\r\nStock is available while supplies last, we do not anticipate it will last long at this rate!\r\n\r\nTest IP: 173.254.233.2\r\nTest File: http://173.254.233.2/100mb.test\r\n\r\n    1024MB Ram\r\n    1536MB Burst Ram\r\n    40GB HDD\r\n    500GB Bandwidth\r\n    100Mbps Port\r\n    1 IPv4 Address\r\n    SolusVM/OpenVZ\r\n   \r\nAll at an unbeatable price of **$5.99/Month**, Instant Setup!\r\n\r\nOrder now! https://billing.urpad.net/cart.php?a=add&amp;pid=117\r\n\r\n**Guaranteed Lifetime Price Lock** -- Price NEVER increases after your order is secured!\r\n\r\nMonthly payment is available (you can pay on a month basis with absolutely no contract). However, additional discounts are available if paid quarterly, annually, biannually or triennially which is an option in the order form.\r\n\r\nURPad is the first and only reputable provider offering Los Angeles VPS at affordable rates without compromising quality, we’re very much looking forward to this expansion and we will never forget this wouldn’t be possible without you – our valued clients.\r\n\r\n**Contact URPad.net**\r\n\r\nURPad.net understands that you might have questions about the service we offer. This is why we make it easy for you to communicate with us.\r\n\r\nEmail sales at: sales@urpad.net\r\nCall us toll free at: 1-888-743-8814\r\nTweet us: http://twitter.com/urpad\r\n\r\nWe view each and every client as an asset and we always remember that we are providing a service, and not a product. Thank you for your trust &amp; business, we genuinely appreciate it.\r\n\r\nBest,\r\nKevin"}