{"id": 166827, "date": "2020-09-09 15:28:34", "user": "Webdock_io", "post": "[![N|Webdock](https://webdock.io/application/themes/webdock/img/webdock-logo-full-whitebg.png)](https://webdock.io/en)\r\n\r\n# Introducing Webdock to LowEndTalk\r\n\r\nHello everybody! \r\n\r\nWe are happy to finally be a part of the LowEndTalk community and would like to try and post an offer here and see how well you guys receive us. **Webdock is not like the typical hosting provider** you might see on LowEndTalk, for a variety of reasons. Let's try and explain a few of the highlights:\r\n\r\n  - We operate **our own hardware in Co-Location** (read more below)\r\n  - We have built a complete end-to-end hosting platform based on Canonical LXD with **our own Control Panel** (3rd party control panels available, see below)\r\n  - Which means we can **provide a lot of unique benefits and features** (and some drawbacks vis-a-vis KVM for example)\r\n\r\n\r\n***\r\n\r\n\r\n# The LowEndTalk September Special\r\nIf you want to try out Webdock, we have put together a coupon code for you guys. After [signing up](https://webdock.io/en/signup) with us and adding a credit card, add the coupon code:\r\n\r\n**LOWENDTALKSEPT007**\r\n\r\nAnd you will **receive a €10.00 Euro Credit** added to your account which you can use on any one of our server profiles. There is no requirement for purchase and you can simply spin up and delete a server again and get fully refunded any unused compute/credit. \r\n\r\n**Offer terms:**\r\n  - This coupon code is only valid for new accounts\r\n  - The coupon can be activated up to and including September 30th 2020\r\n\r\n\r\n# [Click here to get started](https://webdock.io/en#createserver)\r\n\r\n\r\n***\r\n\r\n\r\n# Try Our Smallest Server Profile for Free\r\n\r\nWe invite you to try our smallest server profile which has a sticker price of €4.00 so with the above coupon you can take it for a spin for a whole 2 months and not pay a dime (and even have a bit of credit left over). With the coupon you'd on average get **the first year for just €3.16/month**\r\n\r\n\r\n#### Webdock Micro:\r\n - **6 Cores / 12 Threads Intel Xeon CPU**\r\n - 2GB ECC RAM\r\n - 5GB (fast) SSD storage backed by ZFS\r\n - 1Gbit port with \"unlimited\" traffic. No overage charges. Fair use applies: [read more here](https://webdock.io/en/docs/webdock/billing-pricing)\r\n - 1 Dedicated IPv4 address and a /112 IPv6 range (65,563 addresses) included \r\n - Server will be placed in **Helsinki Finland (no, we are not reselling Hetzner)**\r\n - Choose between \"Perfect Server\" LAMP/LEMP stacks or clean Ubuntu images\r\n - Lots of backups included, awesome control panel, DDOS protection, Free Email forwarding, Free transactional email with Postmark etc. etc. - [check out our website for full details](https://webdock.io/en).\r\n\r\nOur next tier up has more RAM and more Disk and in our larger profiles you can get up to a whopping 15 Cores / 30 Threads. With the coupon above you could try our next-tier-up profile, Micro+, for the first month essentially for free. [Check out all our Profiles and pricing here](https://webdock.io/en#pricing)\r\n\r\n# [Click here to get started](https://webdock.io/en#createserver)\r\n\r\n\r\n***\r\n\r\nYABS benchmark for this (our smallest) profile (thanks larmarat)\r\n\r\n    Basic System Information:\r\n    ---------------------------------\r\n    Processor  : Intel(R) Xeon(R) CPU E5-2670 v2 @ 2.50GHz\r\n    CPU cores  : 12 @ 1200.053 MHz\r\n    AES-NI     : ✔ Enabled\r\n    VM-x/AMD-V : ✔ Enabled\r\n    RAM        : 1.9Gi\r\n    Swap       : 119Gi\r\n    df: no file systems processed\r\n    Disk       :\r\n    \r\n    fio Disk Speed Tests (Mixed R/W 50/50):\r\n    ---------------------------------\r\n    Block Size | 4k            (IOPS) | 64k           (IOPS)\r\n      ------   | ---            ----  | ----           ----\r\n    Read       | 47.36 MB/s   (11.8k) | 210.49 MB/s   (3.2k)\r\n    Write      | 47.41 MB/s   (11.8k) | 211.59 MB/s   (3.3k)\r\n    Total      | 94.78 MB/s   (23.6k) | 422.08 MB/s   (6.5k)\r\n               |                      |\r\n    Block Size | 512k          (IOPS) | 1m            (IOPS)\r\n      ------   | ---            ----  | ----           ----\r\n    Read       | 226.86 MB/s    (443) | 229.38 MB/s    (224)\r\n    Write      | 238.91 MB/s    (466) | 244.65 MB/s    (238)\r\n    Total      | 465.77 MB/s    (909) | 474.03 MB/s    (462)\r\n    \r\n    iperf3 Network Speed Tests (IPv4):\r\n    ---------------------------------\r\n    Provider                  | Location (Link)           | Send Speed      | Recv Speed\r\n                              |                           |                 |\r\n    Bouygues Telecom          | Paris, FR (10G)           | 555 Mbits/sec   | 1.57 Gbits/sec\r\n    Online.net                | Paris, FR (10G)           | 477 Mbits/sec   | 1.62 Gbits/sec\r\n    WorldStream               | The Netherlands (10G)     | 568 Mbits/sec   | 911 Mbits/sec\r\n    wilhelm.tel               | Hamburg, DE (10G)         | 617 Mbits/sec   | 1.68 Gbits/sec\r\n    Biznet                    | Bogor, Indonesia (1G)     | 21.2 Mbits/sec  | 163 Mbits/sec\r\n    Hostkey                   | Moscow, RU (1G)           | 686 Mbits/sec   | 937 Mbits/sec\r\n    Velocity Online           | Tallahassee, FL, US (10G) | 231 Mbits/sec   | 650 Mbits/sec\r\n    Airstream Comms           | Eau Claire, WI, US (10G)  | 202 Mbits/sec   | 575 Mbits/sec\r\n    Hurricane Electric        | Fremont, CA, US (10G)     | 174 Mbits/sec   | 473 Mbits/sec\r\n    \r\n    iperf3 Network Speed Tests (IPv6):\r\n    ---------------------------------\r\n    Provider                  | Location (Link)           | Send Speed      | Recv Speed\r\n                              |                           |                 |\r\n    Bouygues Telecom          | Paris, FR (10G)           | 417 Mbits/sec   | 1.61 Gbits/sec\r\n    Online.net                | Paris, FR (10G)           | 515 Mbits/sec   | 894 Mbits/sec\r\n    WorldStream               | The Netherlands (10G)     | busy            | 1.79 Gbits/sec\r\n    wilhelm.tel               | Hamburg, DE (10G)         | 488 Mbits/sec   | 1.67 Gbits/sec\r\n    Airstream Comms           | Eau Claire, WI, US (10G)  | 84.0 Mbits/sec  | 122 Mbits/sec\r\n    Hurricane Electric        | Fremont, CA, US (10G)     | 151 Mbits/sec   | 528 Mbits/sec\r\n    \r\n    Geekbench 5 Benchmark Test:\r\n    ---------------------------------\r\n    Test            | Value\r\n                    |\r\n    Single Core     | 513\r\n    Multi Core      | 3362\r\n    Full Test       | https://browser.geekbench.com/v5/cpu/3671662\r\n\r\n\r\n***\r\n\r\n\r\n# How can you provide so much CPU-juice for so little?\r\nWe get this question asked a lot and it is a bit strange for us having to explain our hardware profiles as much as we do. The industry is so used to optimizing tenant density and is so marked by a reseller culture (It's resellers all the way down!) that people don't realize that us \"near-first-tier operators\" who are in co-location and can take advantage of economies at scale and low overheads, are looking at perfectly adequate profit margins even with an outstanding hardware mix. What we do specifically is:\r\n\r\n- We operate high-quality refurb hardware (typically Dell Poweredge units) in order to cut costs on outlay while providing excellent performance\r\n- Take advantage of Linux Containers as our hypervisor is LXD. Many providers would see this is a good way to increase tenant density. At Webdock we do the opposite: We pass on more hardware resources to you, the end-user.\r\n- We actively balance and adjust capacity according to load. No host is ever allowed to go above 30% utilization sustained\r\n- Compute density is increasing rapidly these years. Within a few years we are looking at deploying kilothread Epyc systems in a 1U package. **That's a lot of flippin' compute.**\r\n- And frankly, maybe we are just not as greedy as so many other providers ?  ¯\\\\_(ツ)_/¯\r\n\r\n### TL;DR: With Webdock, you do actually get what it says on the sticker.!\r\n\r\n\r\n***\r\n\r\n\r\n# Helsinki Finland. So, this is just Hetzner, right?\r\n\r\nYes and no. As stated we **operate our own hardware** in co-location and in the EU we have chosen Hetzner as our co-location partner. This means that **we own our own racks** in the Hetzner Datacenter, **we operate our own IPv4 blocks** ( [RIPE](https://apps.db.ripe.net/db-web-ui/lookup?source=ripe&amp;key=ORG-WA586-RIPE&amp;type=organisation) ) and Hetzner merely supplies the redundant power and network connections. Add to that the fantastic level of technical expertise in their datacenters and fantastic DDOS protection, you get the best of both worlds with Webdock.\r\n\r\n\r\n***\r\n\r\n\r\n# That's not a lot of SSD Storage - what about hardware upgrades?\r\nA primary reason we do not offer as much storage included in our base packages as the competition is because we use **on-board storage** and not network-attached storage. In our largest profiles this is RAIDed Nvme drives and in our smaller profiles this is RAIDed enterprise SSD drives (SATA+ZFS). We opted for this route in order to provide excellent performance, first and foremost.\r\n\r\nWe offer a range of expansion options to our base profiles. All our profiles can be upgraded or downgraded without any downtime and in addition you can get a range of hardware upgrades, including:\r\n\r\n- On-Board HDD backed Storage mounted in a directory of your choosing\r\n**€0.075 /Month /GB**\r\n\r\n- Expanding your SSD root storage volume\r\n**€ 0.125 /Month /GB**\r\n\r\nIn addition you can order additional IPv4 addresses, more RAM etc. Please take a look at our [Additional Products page](https://webdock.io/en/docs/webdock/billing-pricing/additional-products) for full pricing and details.\r\n\r\n\r\n***\r\n\r\n\r\n# Webdock is probably not suited for most resellers\r\n\r\nAs our hypervisor is LXD on Ubuntu we are not suited for something like installing KVM. We do support nested containers (LXD and Docker), but you are loosing control of certain aspects which you may want to tweak if you want to further slice up our VPS's. We also do not support CentOS so cpanel is a no go. **However** we do have quite a few shared-host resellers on our platform that use 3rd party control panels such as Runcloud and Serverpilot. We would just like to leave you with this quote from one of our customers:\r\n\r\n&gt; i'm really in love with Webdock, it was such a breeze moving my sites from an old dedicated server which was far more costly. It's so nice having everything I need already installed (MySQL, PHP, composer, git, etc). Control panel is really nice. All the extras like shell users, certificates, crons, etc, spot on! **So happy to be done with Cpanel forever now**. -Nate, USA\r\n\r\nSo for single site -&gt; Single (awesome) server type reselling, Webdock has a pretty sweet control panel you might want to give a chance.\r\n\r\nIn addition Webdock is **fully GDPR compliant** and you can easily generate a DPA between you and your clients you may be reselling to within the European Union. Also, Webdock has really been built from the ground up with agencies and \"premium reselling\" in mind - not shared hosting / lowest common denominator hosting. We certainly will not stop you from doing so, but if you care about more than reaching the lowest possible cost we urge you to consider a 1 server = 1 app/website approach as the benefits are many.\r\n\r\nWith all that said, we are releasing our API within 1-2 weeks where we will have SDKs for Python, NodeJS and PHP right out the gate and shortly following that we will release a (free) WHMCS integration plugin, so that could be an option for you if you are looking to resell Webdock in more of a shared-setup with automated billing etc.\r\n\r\n\r\n***\r\n\r\n\r\n# FAQ\r\n\r\n### What are your terms and conditions?\r\n\r\nOur terms and conditions are pretty awesome, actually. You should check them out. Here are some links to all the legal nitty-gritty:\r\n\r\n- [Terms and Conditions. No bullshit guarantees.](https://webdock.io/en/docs/legal-stuff/terms-and-conditions)\r\n- [Billing &amp; Pricing, Trial Periods and more ](https://webdock.io/en/docs/webdock/billing-pricing)\r\n- [Privacy and GDPR.](https://webdock.io/en/docs/legal/privacy-policy)\r\n\r\n### Where are your Datacenters located?\r\nWe are in co-location with Hetzner in Helsinki Finland (details above). In the USA, Dallas TX, we lease hardware from Servermania - thus the lower specs on those servers. At the moment we are all sold out of servers in Dallas however but we are in the process of deploying more servers there which should become available within the next few weeks.\r\n\r\nIf you want to try out Webdock, it is a breeze to move servers between regions - so there is nothing stopping you from provisioning a server in Finland and then later migrating it to the US (you will obviously receive a new IP address when doing so)\r\n\r\n### What is your Refund Policy?\r\nWe refund all unused compute time down to the day instantly and directly to your payment method as soon as you delete a server. As simple as that.\r\n\r\n### Supported payment types?\r\nWe only support Credit Cards with Stripe as our payment processor at the moment. Later this year we will roll out Paypal and AliPay support.\r\n\r\n### Do you price match?\r\nNot really something we have had to deal with, ever. But if you find something that's a VPS with better specs shoot us a message and we will take a look. We don't promise anything as there's lots more included than just hardware in our platform (such as our expansive feature set and 3rd party services, stellar support and more).\r\n\r\n### Test IP?\r\nSince all servers are essentially free for the first 24 hours with Webdock, regardless of coupons or not, we urge you to simply create a server with us and run some tests. This makes more sense than us reserving some \"golden ip\" for you to test against.\r\n\r\n### What Operating Systems are available?\r\n\r\nWe only support Ubuntu in a few version flavors at the moment and do not plan on expanding to other OS's at this time.\r\n\r\n\r\n***\r\n\r\n\r\n# Select Customer Reviews\r\n\r\n&gt; “Quality, Security &amp; performance, 1 push of a button.. Webdock gives it all! Even their customer support has a high performance - Yoram, Netherlands\r\n\r\n \r\n&gt; “ Free transactional email from Postmark? Absolutely love your rock bottom prices! You guys are killing it! You've built something really really cool here. - Pratheek, India\r\n\r\n \r\n&gt; “You all seem to be really on top of your game - Alexander, Spain\r\n\r\n \r\n&gt; “Honestly i've tried like 5 different hosting companies today and yours was the best, you have the most intuitive GUI and start up was the fastest. - Hayden, Canada\r\n\r\n \r\n&gt; “How have I never heard of you? This is awesome! - Tobias, USA\r\n"}