{"id": 167904, "date": "2020-11-12 09:38:29", "user": "marvel", "post": "Hello all,\r\n\r\nLooking for a VPS in the beautiful city of Antwerp? Then look no further. We are one of the most affordable VPS providers in Belgium and that says a lot because there are not many players here compared to other European countries.\r\n\r\nWe're hosting from the beautiful new, green and high-tech datacenter [DCStar Burcht](https://www.dcstar.be/dcburcht \"DCStar Burcht\")\r\n\r\nStability and uptime is our key requirement which is why all of our components are double or even triple redundant. We don't use local storage but instead we have a NVMe storage cluster based on CEPH with triple data replication! This allows us to provide high availability as well.\r\n\r\nTo maintain performance the storage cluster is connected by a redundant 80 GBps infiniband network to the hypervisors. You will hardly feel any difference compared to local storage.\r\n\r\nWe can offer you the following:\r\n\r\n* 1x AMD EPYC 7451 vCPU (fair share usage).\r\n* 512 MB ECC memory\r\n* 10 GB NVMe disk space (cluster)\r\n* /64 IPv6 (coming soon, ETA 4-5 days but don't order yet if you absolutely need it now).\r\n* 1 x IPv4 address\r\n* 256 GB bandwidth (capped to 10 mbit when used).\r\n* 1 GBps shared uplink.\r\n* Automatic volumetric DDoS protection (Arbor).\r\n* Virtualizor control panel.\r\n\r\nJust **€ 2 / month** or **€ 20 a year** with annual billing! (Excl. VAT).\r\n\r\n[Direct order link](https://billing.novos.be/cart.php?a=add&amp;pid=11 \"Direct order link\")\r\n\r\nAll specs can be upgraded individually. No lame sliders where you are forced to upgrade everything if you only want to upgrade one component. Pay only for what you really need!\r\n\r\nSupport through tickets or Telegram.\r\n\r\nFor our company information see here: https://novos.be/company-information/\r\nNetwork IP test and YABS benchmark: https://novos.be/network/\r\nYour most asked questions will be here: https://novos.be/faq/\r\nAnd please read the TOS before ordering: https://novos.be/terms-of-service/\r\nWe're using [AS42160](https://bgp.he.net/AS42160 \"AS42160\")\r\n\r\nAny questions or comments or criticism please ask and I will provide you with an answer :smile: "}