{"id": 168135, "date": "2020-11-23 17:45:52", "user": "JustVPS", "post": "Founded by software engineers and cloud professionals in 2018, **[JustVPS](http://justvps.com/?utm_source=forums&amp;utm_medium=cpc&amp;utm_campaign=LET&amp;utm_content=%7Bcreative%7D&amp;utm_term=%7Bkeyword%7D \"JustVPS\")** understands hosting pains like no one else. Our mission is simple: help you achieve more by securing your online presence with hassle-free hosting. We want to be your all times best web host. We love what we do and it’s the idea that drives us.\r\n\r\nWe bring value to your business: it's not just about hosting for us. It's about making your life easier for you to concentrate on what matters most!\r\n\r\nWe take all the hassle out of your hands to help you accomplish great things. We invest our knowledge into creating a better, safer place for your business to reach its full potential. We value people more than anything. We are devoted to helping you accomplish great things. We act according to our high standards and honest business practices.\r\n\r\nWe use servers based on Quanta QuantaGrid D52B-1U platforms equipped with modern 12-core Intel Xeon Gold 5118 processors, 768GB DDR4 ECC Registered RAM and 12 Datacenter class SSD disks to achieve great performance. Each server is equipped with 4 10Gb network ports.\r\n\r\nWe host our equipment at one of the market leaders in DPC (Data Processing Centers), LeaseWeb. Singapore is our main location. We rent racks in a Tier III SIN-10 class data center certified ISO 27001, PCI DSS, SOC 1 Type II, SOC 2 Type II and SS 564. The data center has two independent inputs power supplies as well as 8 x 1,375 kVA uninterruptible power supplies (UPS) and 3 x 2,000 kVA diesel generators.\r\n\r\n**Choosing [JustVPS](http://justvps.com/?utm_source=forums&amp;utm_medium=cpc&amp;utm_campaign=LET&amp;utm_content=%7Bcreative%7D&amp;utm_term=%7Bkeyword%7D \"JustVPS\") as your host, you get:**\r\n\r\n- Great speed\r\n- Best price\r\n- Security\r\n- Free SSL certificate\r\n- Xeon Core\r\n- SSD only hosting\r\n- 24/7 expert support\r\n- Painless transfer \r\n- Easy setup for beginners\r\n- Advances settings for IT pros\r\n- Your local host (available in 15 locations)\r\n- And a variety of payment options: Visa, MasterCard, PayPal, Bitcoin.\r\n\r\nCheck our website to choose the plan that suits your needs best. Make sure to enter the PROMO CODE \"**JustSG**\" to receive up to 6 months hosting for FREE in Singapore!\r\n\r\n**3 months plan + 1 month free\r\n6 months plan + 3 months free\r\n12 months plan + 6 months as a gift**\r\n\r\n[**Singapore Special Offer**](http://justvps.com/?utm_source=forums&amp;utm_medium=cpc&amp;utm_campaign=LET&amp;utm_content=%7Bcreative%7D&amp;utm_term=%7Bkeyword%7D \"Singapore Special Offer\")\r\n\r\nJust VPS Micro $6.99/mo\r\nCPU Cores - 1\r\nMemory Size - 1GB\r\nSSD Disk Size - 20GB\r\nFull Root Access - Yes\r\nBandwidth - Unmetered\r\nIPs Included - 1 ipv4 &amp; 1 ipv6\r\nOS CentOS, Debian, Ubuntu\r\nOptional control panel - Plesk or cPanel (additional cost)\r\n\r\nYou'll find more information on services available in other locations on our website. Powerful dedicated servers, cloud hosting, Windows VPS. We'll gladly offer you an additional % OFF for bulk buy!\r\n\r\nAnother benefit of JustVPS is strong technical support. We offer 24 hours live assistance through Live Chat and Facebook Messenger. Alternatively, you can always create a support ticket or just write us at info@justvps.com. \r\n\r\nWe want you to succeed! We care about you and we know that having a website that flies at perfect speed with no downtimes matters much to you. We want your business to have a dream-like head start and will spare no effort to keep your website and visitors safe from cyber attacks.\r\n\r\nGet used to your website being always up;)\r\n\r\nNo more overpriced add-ons, questionable attitude, poor judgment, or restrictive server settings. Try not to fall in love!\r\n\r\nGo to [JustVPS.com](http://justvps.com/?utm_source=forums&amp;utm_medium=cpc&amp;utm_campaign=LET&amp;utm_content=%7Bcreative%7D&amp;utm_term=%7Bkeyword%7D \"JustVPS.com\")"}