{"id": 168154, "date": "2020-11-24 16:16:58", "user": "HBAndrei", "post": "# &gt;&gt;&gt; Promos &amp; Giveaway entries will start at 12AM 27th Nov (UTC) &lt;&lt;&lt;\r\n# &gt;&gt;&gt; Promos &amp; Giveaway entries will start at 12AM 27th Nov (UTC) &lt;&lt;&lt;\r\n# &gt;&gt;&gt; Promos &amp; Giveaway entries will start at 12AM 27th Nov (UTC) &lt;&lt;&lt;\r\n\r\nHello everyone,\r\n\r\nThis Black Friday we're having **recurring discounts** and **giveaways** for both our services: [**Blacklist Monitoring**](https://hetrixtools.com/pricing/blacklist-monitor/) and [**Uptime Monitoring**](https://hetrixtools.com/pricing/uptime-monitor/), so you can start monitoring all of your BF and CM servers right away.\r\n\r\nPlease find all of the features included in each plan at the links above. The promo codes can be applied when ordering a plan from our pricing pages.\r\n\r\n## Promo Codes:\r\n- 30x **BF2020-80OFF** - 80% OFF - ~~$99.95/yr~~ $19.99/yr for the yearly Professional Uptime Monitoring plan.\r\n- 20x **BF2020-70OFF** - 70% OFF - ~~$99.95/yr or $9.95/mo~~ $29.98/yr or $2.98/mo for the Professional Uptime Monitoring plan.\r\n- 10x **BF2020-40OFF** - 40% OFF - ~~$199.95/yr or $19.95/mo~~ $119.97/yr or $11.97/mo for the Business Uptime Monitoring plan.\r\n- 10x **BF2020-30OFF** - 30% OFF - for the Personal and Professional Blacklist Monitoring plans.\r\n- 10x **BF2020-20OFF** - 20% OFF - for the Enterprise Uptime Monitoring plan and for the Business Blacklist Monitoring plan.\r\n\r\n### Promo Code Notes:\r\n- All discounts are recurring.\r\n- Promo codes and packages cannot be stacked.\r\n- None of the promo codes can be used before 12AM 27 Nov. (UTC), as our promo starts exactly at midnight (UTC) on Black Friday.\r\n- All promo codes, excluding **BF2020-80OFF** will have all of their stock available at 12AM 27 Nov. (UTC).\r\n- The promo code **BF2020-80OFF** will only have 7 stock available at 12AM 27 Nov. (UTC), after which, starting with 1AM (UTC), each hour at a random minute another 1 stock will be made available, summing up a total of 30 available usages for this coupon code, spread out throughout the day. This has been done so everyone can have equal chances at grabbing this promo, regardless of which timezone they are on.\r\n- All promo codes are available to be used until either their stock runs out or until the end of 30 Nov.\r\n\r\n---\r\n\r\n## Giveaway (draw):\r\n- 100x **+5 Uptime Monitors / + 5 Server Monitors / + 16 Blacklist Monitors**\r\n- 20x **250 SMS Credits** \r\n- 3x **1 Year Professional Uptime Monitoring** or **1 Year Personal Blacklist Monitoring** (winner's choice)\r\n- 2x **1 Year Business Uptime Monitoring** or **1 Year Professional (512-8h) Blacklist Monitoring** (winner's choice)\r\n- 1x **1 Year Enterprise Uptime Monitoring** or **1 Year Business (2k-12h) Blacklist Monitoring** (winner's choice)\r\n\r\n### Giveaway - how to participate in 2 easy steps:\r\n1. Register for a free HetrixTools account (if you don’t already have one).\r\n2. Reply in this thread with your account’s Public Key, found here [https://hetrix.tools/public-key](https://hetrix.tools/public-key).\r\n\r\n### Giveaway Notes:\r\n- Only entries that will be considered valid will be those posted between: **12:00AM 27 Nov. - 11:59PM 30 Nov.** (UTC).\r\n- The giveaway/draw is shared between 3 forums: LowEndTalk, LowEndSpirit, and HostedTalk. Posting your key once on any of these forums will be enough. Posting your key multiple times or on multiple forums will not increase your winning odds.\r\n- The first two listed prizes will be awarded automatically, while for the last three listed prizes I will have to contact the winners via PM in order to see which would their choice be (between the two available options).\r\n- The first two listed prizes cannot be exchanged or traded to other users, but they can stack to your previous promos or giveaways.\r\n- The last three listed prizes cannot be exchanged, but they can be traded to other users (if the winners wish to do so), however this would need to be done before the prize is selected and applied to an account.\r\n- The draw and prizes distribution will be done in the days following Cyber Monday.\r\n\r\nThanks for taking the time to read this long thread.\r\n\r\nGood luck to everyone and have a very productive and rewarding BlackFriday &amp; CyberMonday!"}