{"id": 168222, "date": "2020-11-26 17:41:23", "user": "BunnySpeed", "post": "Hello :)\r\n\r\nI've been quiet for almost a year, but things have been super busy for BunnyCDN. As usual for Black Friday, we're currently giving a 25% recharge bonus for one payment on Black Friday, but we also prepared a special LET promo code for $6 account credits with no payment required as a thank you for the love. This works either for new or old accounts. You can find the code at the bottom of the post.\r\n\r\nSince I haven't posted much for a while, I also wanted to share some of the cool new stuff we've added recently.\r\n\r\n**Edge Storage - Geo-Replicated Cloud Storage**\r\n We recently released our new Geo-Replicated system that allows you to store and automatically replicate files on the edge over 5 locations. This offers unparalleled storage performance for global content delivery, and we're super excited about it.\r\n\r\n**Perma-Cache**\r\nWith the Edge Storage, we also released a new Perma-Cache system, that permanently stores cached files in the edge storage. This results in great performance even for cache MISS requests and I think it's an amazing solution for smaller sites.\r\n\r\n**High Volume Updates**\r\nWe also included Singapore into our High Volume tier to further boost the High Volume tier performance.\r\n\r\nWe have much more coming soon, so it's a very exciting time for us.\r\n\r\n&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;\r\n![](https://bunnycdn.com/assets/v2/images/bunnycdn-logo-dark.svg \"\")\r\n\r\nAt BunnyCDN, we are trying to constantly push the boundaries of performance while offering really cost-effective pricing and innovative features. We offer two pricing tiers aimed at different requirements. Both are 100% Pay As You Go with a $10/year minimum payment.\r\n\r\n**Standard Tier** (43 POPs, any region can also be toggled on/off)\r\n- $0.010/GB for Europe &amp; North America\r\n- $0.030/GB for Asia &amp; Oceania\r\n- $0.045/GB for South America\r\n- $0.060/GB for South Africa\r\n\r\n**High Volume Tier** (8 POPs)\r\n$5/TB global rate and as low as $2.5/TB after 2PB/month\r\n\r\nEnabled pops: Amsterdam, Frankfurt, Paris, Dallas, Los Angeles, Miami, Chicago, Singapore\r\n\r\n_There is a $1 per month minimum usage, but the credit is valid for the life of the account._\r\n\r\n**Some of our features:**\r\n\r\n- 30Tbps+ network backbone\r\n- 100% SSD/NVMe hardware\r\n- 43 PoPs\r\n- Perma-Cache\r\n- Edge Storage\r\n- Image Processing\r\n- Free SSL for custom hostnames with Let's Encrypt integration\r\n- HTTP/2\r\n- Brotli\r\n- Edge Rules\r\n- Origin Shield\r\n- Toggle any region ON/OFF\r\n- Secure URL tokens\r\n- HTTP Video delivery\r\n- 95% Average Cache HIT rate\r\n- Instant setup with a super simple control panel\r\n- Friendly team and a cute name :)\r\n- CDN accelerated cloud storage ($0.01/GB of storage)\r\n- Block IPs, countries\r\n- Hotlinking protection\r\n- 99.99%+ Uptime guarantee\r\n[- And lots more :)](https://bunnycdn.com/features \"- And lots more :)\")\r\n\r\n**Our Network**\r\nWe now have 43 PoPs over 6 continents + quite a few more that will be announced soon ;)\r\n\r\n![](https://publicshare.b-cdn.net/let/network-list-2.png \"\")\r\n\r\n\r\n# Promo code: LETFRIDAY-2020\r\n\r\n**You can enter the code in the billing section of your account after setting up your account details (name and address) and it's valid for the next 3 days.** \r\n\r\nFor more info, you can have a look at https://bunnycdn.com\r\n&lt;br /&gt;\r\nWe've grown a lot over the past few years and have just recently hit 10.000 customers. The early growth was largely thanks to LET, so I wanted to take this opportunity to say thank you for helping us get where we are today!\r\n\r\nHappy Black Friday / Thanksgiving! :)&lt;br /&gt;\r\n![](https://publicshare.b-cdn.net/let/bunny.jpg \"\")"}