{"id": 168301, "date": "2020-11-27 23:01:00", "user": "Abdullah", "post": "Hi guys\r\n\r\nSorry for the delay in getting these deals out to you. Hope you will like them.\r\n&lt;br /&gt;\r\n\r\nThe promotions applies to all of our locations, and we are also introducing multiple new locations for our KVM NVMe servers. Warsaw and Sydney is live starting today. Hong Kong, Milan and Madrid will also be launched in the next couple of weeks. We can take pre-orders for these locations if you are keen, but guaranteed delivery will be December 31st.\r\n\r\n&lt;br /&gt;\r\nPlease carefully read the specifications and delivery ETAs before ordering. All payments are final.\r\n&lt;br /&gt;\r\nLet’s start with the storage VMs. They are based on RAID-50/60 with SSD caching. As many of you already know, these are reliable, high performing storage plans. You won't find any days where you can't pull/push at least a whole gigabit to or from the internet. You can expect consistent, high performance, all year round, but keep in mind that these are for mass storage and not heavy compute. Abuse will be dealt with very efficiently.\r\n&lt;br /&gt;\r\n\r\n**Storage deals:**\r\n_Available in: Chicago, London, Amsterdam, Stockholm, Los Angeles_\r\n\r\n&lt;pre&gt;\r\n1x 2.4+ GHz\r\n3 GB RAM\r\n3 TB usable storage\r\n9 TB bandwidth\r\n$84 per year\r\nAdd more resources for $30 per year per chunk. Each chunk is 1 GB RAM, 1 TB storage and 3 TB bandwidth. Up to 30 TB storage per VM. This pricing is only for servers created during the promotion. We can do quarterly billing cycle for servers larger than 5 TB.\r\n\r\nExisting customers from the past two years' Black Friday deals can upgrade to these plans. Just send in a ticket. We love you.\r\n\r\nAn additional 10% discount applies if you order them in at least two (or more) locations. And before you ask, no, it is not possible to do it in the same location/server.\r\n\r\nYou can add or remove chunks and calculate pricing yourself linearly. It will be too complex if I start writing out all the possible configurations :)\r\nThis is the most reliable, high performing storage you can find on the market (compared to any Kimsufi deals and such), AND we beat them on price.\r\n\r\n\r\nIf you find a better quality/cost ratio, please let us know. We have hundreds of TBs available to deploy with a minute's notice.\r\n\r\nYou can likely get two of these in different locations, still come cheaper than most backup services, and have far more reliability/control over your data by replicating it.\r\n&lt;/pre&gt;\r\n\r\n&lt;br /&gt;\r\n\r\n&lt;pre&gt;\r\n1x 2.4+ GHz\r\n1 GB RAM\r\n1 TB usable storage\r\n3 TB bandwidth\r\n$40 per year\r\nAdditional 10% discount if you order them in at least two (or more) locations.\r\n&lt;/pre&gt;\r\n\r\n&lt;br /&gt;\r\n&lt;br /&gt;\r\n\r\n**NVMe deals:**\r\n_Available in: Amsterdam, Stockholm, Los Angeles, Zurich, Oslo, Vienna, Warsaw, London, Chicago, Los Angeles, New York and Sydney (Hong Kong, Madrid and Milan can be pre-ordered, but delivery will be by December 31st)._\r\n\r\n&lt;pre&gt;\r\n1 CPU core (12.5% dedicated, burstable up to 100%)\r\n2 GB RAM\r\n20 GB RAID-10 NVMe\r\n2 TB bandwidth (500 GB in Hong Kong and Sydney)\r\n$15 per year\r\n&lt;/pre&gt;\r\n\r\n&lt;br /&gt;\r\n\r\n&lt;pre&gt;\r\n2 CPU core (50% dedicated, burstable up to 200%)\r\n8 GB RAM \r\n40 GB RAID-10 NVMe\r\n5 TB bandwidth (1 TB in Hong Kong and Sydney)\r\n$30 per year\r\n&lt;/pre&gt;\r\n\r\n&lt;br /&gt;\r\n\r\n&lt;pre&gt;\r\n3 CPU core (100% dedicated, burstable up to 300%)\r\n16 GB RAM\r\n80 GB RAID-10 NVMe\r\n10 TB bandwidth (1.5 TB in Hong Kong and Sydney)\r\n$60 per year\r\n&lt;/pre&gt;\r\n\r\n&lt;br /&gt;\r\n\r\nI know you guys are going to complain about the low bandwidth allotment in Sydney and Hong Kong. If you see someone providing cheaper for the same price, please let me know and we will see what we can do.\r\n\r\n&lt;br /&gt;\r\n\r\n\r\nAll of our nodes have 10 GbE public + 10 GbE private with jumbo frames. So for example - you can use a NVMe + storage server in combination by mounting the disk over the private network. It will be higher performance than most 'block storage' products out there, likely cheaper, and you get more control over your setup.\r\n\r\n&lt;br /&gt;\r\n\r\n_If you decide to get at least one NVMe VM in each of our locations, you will get 30% off your order._\r\n\r\n&lt;br /&gt;\r\n\r\n**How to order**\r\n\r\nTo order, please sign up or login at manage.hosthatch.com and deposit the appropriate amount of funds. Then open a ticket with sales mentioning the promotion/location you want. All special orders are manually provisioned on working days only. We require up to 7 working days to provision these so please be patient.\r\n\r\n&lt;br /&gt;\r\n\r\nPlease note that we will likely have some flash sales, which might be better/worse than these deals, and you might feel bad about missing out on them. We cannot switch you once you have opened a ticket to order something. An open ticket (whether you close it or not later) is considered an active order, and will not be changeable without our discretion. Please understand that flash deals or not - all of these are high-performing servers with incredible value for the price.\r\n\r\n&lt;br /&gt;\r\n\r\nPlease keep an eye on this thread. We will update as stock in some locations go out. Any orders made after the timestamp of my post saying we are out of stock here will not be provisioned, and your only option will be to change to something else.\r\n\r\n"}