{"id": 168480, "date": "2020-12-01 07:12:07", "user": "VirMach", "post": "![](https://virmach.com/images/logo.png \"\")\r\n\r\nThey say good things come to those who wait, so if you were not tempted by the other offers posted over the weekend (or maybe even if you were) you can now purchase &amp; idle multiple services and save them for the perfect occasion. Last year we were a day late and the offers were great, so now that we're late by 4, it's only logical the deals are 4 times as good (probably not.) Luckily, we've been sitting on tons of available stock for nearly a year, just to sell it to you at a fraction of the price.\r\n\r\n\r\n&lt;h1&gt;⇨ Special Flash Sale&lt;/h1&gt;\r\n_______________________________\r\n\r\n[VIEW ~~BLACK FRIDAY~~ &amp; CYBER WEEK FLASH DEALS.](https://virmach.com/black-friday-cyber-monday)\r\n\r\nFor **the best** chance of getting a flash deal:\r\n\r\n* Only have one window open to view the sales. If it does not load, refresh only once per minute.\r\n* Ensure you click the button from the offer page; do not add to the cart directly by skipping a step.\r\n* Ensure you are already [logged in ](https://billing.virmach.com/clientarea.php \"logged in \") and (optional) have [store credit](https://billing.virmach.com/clientarea.php?action=addfunds \"store credit\") ready to skip the payment step.\r\n* Do not refresh any pages. Do not go back/forward. Complete the checkout step by step.\r\n* If there is a database error, do not complete your purchase. There is a high chance it is glitched.\r\n* Tip: reply to a \"Resolving issue &amp; completing your order\" ticket and we may still activate your order.\r\n\r\n&lt;h1&gt;⇨ More VPS Offers&lt;/h1&gt;\r\n_______________________________\r\n[VIEW MORE DEALS.](https://virmach.com/special-offers \"VIEW MORE DEALS.\") We'll try to update the page with new deals.\r\n\r\n\r\n&lt;strong&gt;KVM-SPECIAL-512&lt;/strong&gt;\r\n**1** vCORE (Shared)\r\n**512**MB RAM\r\n**15**GB Pure SSD\r\n**500**GB Bandwidth\r\nUp to **1**Gbps Port\r\n**1**x IPv4\r\n**KVM**/SolusVM Panel\r\n\r\n**$7.00** _PER YEAR_*\r\n**ORDER:** https://virmach.com/special-offers/\r\n\r\n~~★ ~~★ ~~★ ~~★ ~~★ \r\n\r\n&lt;strong&gt;KVM-SPECIAL-768&lt;/strong&gt;\r\n**1** vCORE (Shared)\r\n**768**MB RAM\r\n**20**GB Pure SSD\r\n**750**GB Bandwidth\r\nUp to **1**Gbps Port\r\n**1**x IPv4\r\n**KVM**/SolusVM Panel\r\n\r\n**$10.00** _PER YEAR_*\r\n**ORDER:** https://virmach.com/special-offers/\r\n\r\n~~★ ~~★ ~~★ ~~★ ~~★ \r\n\r\n&lt;strong&gt;KVM-SPECIAL-1&lt;/strong&gt;\r\n**1** vCORE (Shared)\r\n**1**GB RAM\r\n**30**GB Pure SSD\r\n**1000**GB Bandwidth\r\nUp to **1**Gbps Port\r\n**1**x IPv4\r\n**KVM**/SolusVM Panel\r\n\r\n**$14.00** _PER YEAR_*\r\n**ORDER:** https://virmach.com/special-offers/\r\n\r\n~~★ ~~★ ~~★ ~~★ ~~★ \r\n\r\n&lt;strong&gt;KVM-SPECIAL-2&lt;/strong&gt;\r\n**2** vCORE (Shared)\r\n**2**GB RAM\r\n**50**GB Pure SSD\r\n**2000**GB Bandwidth\r\nUp to **1**Gbps Port\r\n**1**x IPv4 \r\n**KVM**/SolusVM Panel\r\n\r\n**$21.00** _PER YEAR_*\r\n**ORDER:** https://virmach.com/special-offers/\r\n\r\n~~★ ~~★ ~~★ ~~★ ~~★ \r\n\r\n&lt;strong&gt;KVM-SPECIAL-3&lt;/strong&gt;\r\n**2** vCORE (Shared)\r\n**3**GB RAM\r\n**75**GB Pure SSD\r\n**3000**GB Bandwidth\r\nUp to **1**Gbps Port\r\n**1**x IPv4\r\n**KVM**/SolusVM Panel\r\n\r\n**$28.00** _PER YEAR_*\r\n**ORDER:** https://virmach.com/special-offers/\r\n\r\n~~★ ~~★ ~~★ ~~★ ~~★ \r\n\r\n&lt;strong&gt;KVM-SPECIAL-4&lt;/strong&gt;\r\n**2** vCORE (Shared)\r\n**4**GB RAM\r\n**100**GB Pure SSD\r\n**4000**GB Bandwidth\r\nUp to **1**Gbps Port\r\n**1**x IPv4\r\n**KVM**/SolusVM Panel\r\n\r\n**$35.00** _PER YEAR_*\r\n**ORDER:** https://virmach.com/special-offers/\r\n\r\n~~★ ~~★ ~~★ ~~★ ~~★\r\n\r\n*Pricing subject to change, prices are as published on Cyber Monday (November 30th.)\r\n\r\n\r\n&lt;h1&gt;⇨ Dedicated Server Offers&lt;/h1&gt;\r\n_______________________________\r\n\r\n[CHECK PREVIOUS OFFER.](https://www.lowendtalk.com/discussion/167964/virmach-ssd-384mb-kvm-7-50-yr-16gb-dedicated-25-mo-2gb-kvm-3-mo-ddos-protected#latest \"CHECK PREVIOUS OFFER.\") Dedicated servers @ $25/MO.\r\n\r\n\r\n&lt;h1&gt;⇨ Remember, more deals here!&lt;/h1&gt;\r\n_______________________________\r\n[CLICK HERE TO VIEW MORE DEALS.](https://virmach.com/special-offers \"VIEW MORE DEALS.\")\r\n\r\n&lt;h1&gt;⇨ Offer Details&lt;/h1&gt;\r\n______________________________\r\nWe have a lot of offers so these will vary, but our VPS plans are generally:\r\n\r\n&lt;strong&gt;Storage:&lt;/strong&gt;  Solid State Drive RAID 10 (For VPS)\r\n&lt;strong&gt;DDoS Protection:&lt;/strong&gt;  Available Free (In Buffalo, NY)\r\n&lt;strong&gt;Locations:&lt;/strong&gt;  Varied, as available.\r\n&lt;strong&gt;Virtualization:&lt;/strong&gt;  KVM (For VPS.)\r\n&lt;strong&gt;Operating System:&lt;/strong&gt;  Various Linux Only.\r\n&lt;strong&gt;Support:&lt;/strong&gt;  Limited level of support, standard on some.\r\n&lt;strong&gt;Refunds:&lt;/strong&gt;  No Refunds (For Most.)\r\n&lt;strong&gt;Terms:&lt;/strong&gt;  https://virmach.com/terms-conditions\r\n&lt;strong&gt;Looking Glass:&lt;/strong&gt;  http://lg.virmach.com/\r\n\r\n&lt;h1&gt;⇨ What's New &amp; Improved?&lt;/h1&gt;\r\n______________________________\r\n\r\n* Our AUP is more lenient than ever, with our automated system now having virtually no false positives. Nodes are now automatically locked off much earlier, allowing more room to burst.\r\n* New protection systems that reduce the number of attacks against your service, also smoothing out the network and I/O usage on your service and the node.\r\n* Smarter anti-spam system that catches most high mail volumes before the datacenter, preventing long nullroutes. Also allows for higher bursts, such as larger attachments.\r\n* Auto-detection and mitigation for some network abuse, reducing bursts of packet loss and ensuring much quicker handling at all times, with ultimately smoother networking.\r\n* More operating system and ISO options, so you don't have to mount a custom ISO. Now includes Ubuntu 16 w/ Desktop template, Ubuntu 20 ISO, ISO tools, and more.\r\n* Semi-automated processing, allowing you to pay for some requests and upgrades without having to wait for manual confirmation from staff members (soon to be automated.)\r\n* Optimizations, and virtualization fixes that result in significantly lower CPU &amp; RAM being utilized per node. We've also resolved most provisioning errors, for faster deployment.\r\n* Fixes to certain operating systems, ensuring more functions work. Adding more functions to the billing panel, and fixes to packages that improve most of these functions.\r\n\r\n&lt;h1&gt;⇨ More Information&lt;/h1&gt;\r\n______________________________\r\n \r\n* **Flash Deals:** This will consist of manually scheduled &amp; automatically generated deals by our system. The default timers are around 10 minutes for each offer and 5 minute grace period for anyone who clicked the button to complete their order, although this may change without notice. Please try to stay calm &amp; orderly when completing your order or you may be rate-limited.\r\n* **Special Offers:** These are similar to our usual \"special offers\" page with higher quantity specials in specific locations &amp; standard resource levels. Throughout the sale we will try to manually post additional specials on the special offers page for LET users, although this will depend on how busy we get during the week.\r\n* **LET Exclusives:** Sometimes our offers get posted elsewhere so deals sell out quickly. On this thread, some deals may be posted exclusively for LET members. We encourage requests, but be watchful -- we might have a few easter eggs. Please keep in mind that this year it will be less frequent since it is difficult for us to do this while we're busier than usual.\r\n\r\n&lt;h1&gt;⇨ Disclaimer&lt;/h1&gt;\r\n______________________________\r\n\r\nPlease do not contact our live chat or sales department with questions in regards to this sale. We may rate limit or block special-related requests. Please anticipate your service to potentially not be functional for a few days before you can contact us for a resolution. If you have any questions, please post them on this thread. We apologize for any errors/typos within this offer. If your service is not properly generated and is broken, we will attempt to regenerate this offer for you as soon as possible, but it may be canceled &amp; refunded. We hope you understand. If you do not check out within 5 minutes our system may charge you for the next special in the queue and provide you with completely different server specifications and pricing. This is rare, and we've improved everything to avoid this further, but we may not cancel the service if this happens and it's purchased.\r\n\r\n**Please also avoid doing the following:**\r\n\r\n* Making more than one account (may cause major problems.)\r\n* Making more than one ticket (will slow down the process for everyone.)\r\n* Selling your outside of our transfer process (may cause major problems.)\r\n* Requesting e-mail changes (we cannot process these for specials at this time.)\r\n* Locking yourself out (2FA, we can't deal with this high quantity of requests.)\r\n\r\nJust remember, while we want to bring the best value &amp; support to you, at these price points and quantities it is difficult to process certain requests. We appreciate you being reasonable."}