{"id": 168594, "date": "2020-12-04 22:01:29", "user": "turnkeyintenet", "post": "# **Our Black Friday / Cyber Monday Cloud Hosting and Data Center Deals have been EXTENDED! Hurry now, before these discount offers are gone forever! View all deals at [turnkeyinternet.net/blackfriday](https://turnkeyinternet.net/blackfriday \"turnkeyinternet.net/blackfriday\")**\r\n\r\nsee our [Holiday Promotional Page](https://turnkeyinternet.net/blackfriday \"Holiday Promotional Page\") for all our offer details, exclusions and limitations\r\n\r\n**TurnKey Internet** provides Dedicated Servers, Colocation, Web Hosting, Cloud, and Virtual Servers from its company-owned and operated green data center. Since 1999, TurnKey Internet has built a reputation of outstanding personalized service, reliability, and value.\r\n\r\n\r\n&gt; ## **[10G Dual Hexa-Core Dedicated Server Deal](https://turnkeyinternet.net/go.php?c=bf19_hexacore \"10G Dual Hexa-Core Dedicated Server Deal\")**\r\n&gt; \r\n&gt; * Enterprise Grade Dell PowerEdge Bare Metal Servers\r\n&gt; * 2 x Intel Xeon X5650 Hexa-Core CPUs @ 2.66 GHz\r\n&gt; * Hyper-Threading (HT) Enabled\r\n&gt; * 24 Visible Cores (12 Physical Cores + 12 Via HT)\r\n&gt; * Intel Virtualization Technology (VT) Enabled\r\n&gt; * 8 GB RAM \r\n&gt; * 240 GB SSD\r\n&gt; * **10Gbps Network Port**\r\n&gt; * **100 TB Bandwidth**  \r\n&gt; * IPv4: 1 Usable IP  \r\n&gt; * IPv6: /64 Subnet included \r\n&gt; * EasyDCIM Remote Management\r\n&gt; * 100% Network &amp; Power Uptime Guarantee\r\n&gt; * 24x7 Toll-Free Phone, Live Chat, and Help Desk Support \r\n&gt; * 30 Day Money-Back Guarantee  \r\n&gt; * NO SETUP FEES\r\n&gt; * No Term Contracts!\r\n\r\n\r\n&gt; **$59/month - [ORDER NOW](https://turnkeyinternet.net/go.php?c=bf19_hexacore \"ORDER NOW\")**\r\n\r\nAll discounts are for LIFE, as long as you keep the product active, paid, and the account in good standing your discount will apply for the life of the product you order! Coupons and special offers are limited to 1 per client, new orders only, and may not be combined with other coupons or special offers. Cannot be used to transfer from existing TurnKey Internet service plan. Discount offers and coupons apply to main purchase price of product. Any additional items such as certain control panels, features, management, or operating systems may be an additional cost.\r\n\r\n\r\n**About TurnKey Internet:**\r\n\r\nAll servers are hosted in our company-owned and operated, SSAE-18 SOC 2 certified, HIPAA compliant, green data center in New York’s Tech Valley Region. Alternative technologies such as on-site solar power generation, cold containment pods, hydroelectricity, and SmartAisle cooling have eliminated our carbon footprint entirely, and made our data center the best of the best for energy efficiency nation-wide.\r\n\r\nSince 1999, TurnKey Internet has built a reputation of outstanding personalized service, reliability, and value. We are experts in the Cloud Hosting and Data Center space with a true dedication to your online success every step of the way.  TurnKey maintains an A+ rating from the Better Business Bureau and was the winner of the Excellence in Small Business Award from the U.S. Small Business Administration. \r\n\r\nDon't just take our word for it - view these [Verified Client Reviews &amp; Testimonials](https://turnkeyinternet.net/reviews \"Verified Client Reviews &amp; Testimonials\").\r\n\r\n\r\n**CONTACT US:**\r\nLive Chat: [Live Sales Chat](https://turnkeyinternet.net/help/ \"Live Sales Chat\")\r\nEmail: sales@turnkeyinternet.net\r\nWeb: [www.turnkeyinternet.net](https://www.turnkeyinternet.net \"www.turnkeyinternet.net\")\r\nFacebook: [TurnKey Internet](https://www.facebook.com/turnkeyinternetNY/ \"TurnKey Internet\")\r\nTwitter: [@TurnKeyInternet](https://twitter.com/TurnKeyInternet \"@TurnKeyInternet\")"}