{"id": 168864, "date": "2020-12-21 07:53:36", "user": "cociu", "post": "Hello LET, \r\n\r\nwe decided to restock (will be the last time when we offer such discount ) our legendary coupon code **BUCHAREST-STORAGE**  in a quantity of 300 cupons .\r\nAfter this promo we will focus in another kind of offers so the storage plans will go to the second place .\r\n\r\nWhat we offer today ? easy , we have reduce 60% from the normal price to any packages bigger than 750gb with a quarently payment minimum (need to avoid as much possible merchants fee) \r\n\r\nPlease note ! And is very important to the affiliates too , this orders will be delivered between today and tomorrow so if you resell our service IS A MUST TO SPECIF THIS to not have consequences \r\n\r\nso where to buy ? here is the link : https://secure.hostsolutions.ro/cart.php?gid=69\r\n\r\nAll orders will be delivered in Bucharest and will have 5 days money back guarantee start from the day when the service is active no question asked .\r\n\r\n\r\nAlso we have restock our limited offer (will be only 50 in stock and no need cupon code , the price is already verry good) with this config : \r\n\r\n**Storage kvm 3.6tb\r\n**\r\n**1 core**\r\n**1 gb ram**\r\n**3.6 tb Hdd**\r\n**10tb traffic/mo**\r\n**1 ipv4**\r\nPrice 76 eur/year : https://secure.hostsolutions.ro/cart.php?a=add&amp;pid=447\r\n\r\n\r\n------------------------------------------------------------------------------\r\n\r\nNow i want to send a big thanks to all and wish happy Holiday to all people who was contribute in our permanent growing during this years. Is true we had good periods and bad ones,  but hey ! we are here and we are growing.\r\n\r\nWhat is the plan for the next year ? : \r\n\r\n\r\n1) focusing in quality (we have modify our entirely structure in Oradea for this was some interruptions this year but now the job is done) \r\n2) open some new locations as we had huge success with the first ones so i espect to have at least 10 locations more next year.\r\n3) Because we have grow uncontrollable we have some  peak days with huge quantity of tikets (some was related to some scripts/modules what we have use in the past , some because of network downtime etc ) so is a must to add at least one person more to our tiketing support , right now 70% of the tikets is handle by @MikePT  (love you puta do not forget this never) so this is a must !\r\n4) Many of you was ask for better cpu so i have great news  , start from 2021 we will have E5-2680v4 cpu in all our storage plans but clear will not be same price , also i have buy some ryzen  servers for our nvme products line so yes we will have some sexy offers there.\r\n5) As many of you know i am a very busy person so i decided to employ a new girl (Alina)  in our company to handle all payments/refunds to win some time for me personally.\r\n\r\nHappy Cristmas and happy holliday with the family !\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"}