{"id": 169375, "date": "2021-01-17 03:56:13", "user": "WiredBlade", "post": "~With over 15 years of experience, US-West-Phoenix based [WiredBlade](https://www.wiredblade.com) is offering the most reliable, high-quality servers at affordable prices.\r\n\r\n~All our servers are fully customizable such as RAM space, hard drive space, the operating system (CentOS, Ubuntu, ESXi, Windows and many more) and bandwidth.\r\n\r\n~Our dedicated servers are ideal for all types of businesses.\r\n\r\n~We believe that a good strong support team available 24/7 to provide our users with solutions is a necessity.\r\n\r\n**Here are our special deals to LET:**&lt;br&gt;\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~&lt;br&gt;\r\n\r\n~**CPU: Dual Intel Xeon X5660** (2.8 GHz, 12 Cores, 24 Threads)\r\n\r\n~RAM: 32GB\r\n\r\n~Storage: 1 TB SATA or 240GB SSD\r\n\r\n~IPv4 Address: 5 IPs\r\n\r\n~IPv6 Address: /64 Subnet\r\n\r\n~Monthly Bandwidth: 20 TB@1 Gbps dedicated connection\r\n\r\n~**Price: $39.99/month** after coupon WELCOMEABOARD| **[Order Now](https://www.wiredblade.com/en-US/ControlPanel/AddDedicatedServer?UwBlAHIAdgBlAHIAVAB5AHAAZQA9AEQAdQBhAGwAWABlAG8AbgBYADUANgA2ADAAJgBDAG8AdQBwAG8AbgBDAG8AZABlAD0AVwBFAEwAQwBPAE0ARQBBAEIATwBBAFIARAA%7c)**&lt;br&gt;\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~&lt;br&gt;\r\n\r\n~**CPU: Dual Intel Xeon E5-2650** (2 GHz, 16 Cores, 32 Threads)\r\n\r\n~RAM: 32GB\r\n\r\n~Storage: 1 TB SATA or 240GB SSD\r\n\r\n~IPv4 Address: 5 IPs\r\n\r\n~IPv6 Address: /64 Subnet\r\n\r\n~Monthly Bandwidth: 20 TB@1 Gbps dedicated connection\r\n\r\n~**Price: $49.99/month** after coupon LOWENDTALK | **[Order Now](https://www.wiredblade.com/en-US/ControlPanel/AddDedicatedServer?UwBlAHIAdgBlAHIAVAB5AHAAZQA9AEQAdQBhAGwAWABlAG8AbgBFADUAXwAyADYANQAwACYAQwBvAHUAcABvAG4AQwBvAGQAZQA9AEwATwBXAEUATgBEAFQAQQBMAEsA)**&lt;br&gt;\r\n\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~&lt;br&gt;\r\n\r\n-To place an order simply follow the link on the selected server type and configure the server's specs or select another configuration of your choice.\r\n\r\n~Upgrade options available for Dual Intel Xeon Processors, Disk Space SSD or HDD, RAM, IP Addresses, Bandwidth, Etc.\r\n\r\n~Do you have a special need, a custom configuration for educational and/or research purposes?  Shoot us an email. We will be more than happy to help you wherever possible.\r\n\r\n**All servers come with the below standard configuration**:\r\n\r\n-Upgrades available for RAM, Disk Space, IP Addresses, Bandwidth \r\n\r\n-[Looking Glass](https://www.wiredblade.com/Support/LookingGlass)\r\n\r\n-Monthly Bandwidth: 20 TB@1 Gbps dedicated connection. 10Gbps connection is available for just $30 more.\r\n\r\n-Operating System: Linux, Windows 2008/2012/2016, VMWare, XenServer, etc as well as self-installed\r\n\r\n-Remote Management: Dedicated KVM over IP / IPMI\r\n\r\n-Premium Network Blend: Level3, Zayo, Comcast, Cogent and PCCW\r\n\r\n-Datacenter Location: Phoenix, Arizona, USA\r\n\r\n-Reverse DNS for IPv4 and IPv6\r\n\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~&lt;br&gt;\r\n\r\n**FAQ**\r\n\r\nQ. How long does it take to provision my server?\r\n\r\nA. New server orders are provisioned within 24 hours of payment.\r\n\r\nQ. Are the servers managed?\r\n\r\nA. All of our services are normally self-managed. We provide the server, bandwidth, and hardware support.\r\n\r\nQ. Is your bandwidth shared?\r\n\r\nA. No! All of our servers are fully dedicated. You have access to the full amount of bandwidth 100% of the time, and you will not share a connection with any other customer or server.\r\n\r\nQ. Do you offer KVM over IP?\r\n\r\nA. Absolutely! All servers come with IPMI capability built-in.\r\n\r\n**Why choose us?**\r\n\r\n-Over 15 Years of Experience\r\n\r\nSince 1997, we have been committed to providing innovative services along with rich features.\r\n\r\n-24x7 On-Site Tech Support\r\n\r\nZero outsourcing with in-house staff, around the clock support, is available 24X7. We are always ready to resolve your issues.\r\n\r\n-99.9% Network Uptime\r\n\r\nOur network is designed to be fully redundant. Downtime is not something that we will tolerate.\r\n\r\n-Fast Server Deployment\r\n\r\nAll servers are delivered and ready for your use within 24 hours of payment.\r\n\r\n-Security\r\n\r\nYour dedicated server will be hosted in our highly secured data center featuring 24x7x365 on-site security, mantraps with anti-tailgating technology, biometric and keycard access denial systems, CCTV throughout the facility interior and exterior, and data center access logs.\r\n\r\n**Payment Methods** PayPal, Bitcoin, Wechat &amp; All Major Credit/Debit Cards.\r\n\r\nAll servers are located in our Tier 3+ Phoenix AZ USA Data Center.\r\n\r\nPlease visit our website at www.wiredblade.com to open a ticket with our sales department for any custom quote or any questions you may have.\r\n\r\nYou can contact us by phone, email or through the ticketing system. If you are in the Phoenix area, we can give you a tour of the data center.\r\n\r\nFeel free to also reach out to me directly if you have any questions.\r\n\r\nTimothy@Wired Blade"}