{"id": 169373, "date": "2021-01-17 01:15:15", "user": "VirMach", "post": "![](https://virmach.com/images/logo.png \"\")\r\n\r\nVirMach is excited to announce the launch of our Ryzen servers (in the near future.) Be one of the early adopters, beta test the service for free, and help us ensure everything goes smoothly for the official launch. You have the option to pre-purchase this service for after the beta should you be interested. We also have more storage space available, now in Los Angeles, ready for pre-orders, and our regular KVM specials with a large discount for the first year of purchase (while supplies last.) Some extra promotion codes are sprinkled around, and more locations coming soon.\r\n\r\n\r\n&lt;h1&gt;RYZEN PREORDERS QUICKSTART&lt;/h1&gt;\r\n________________\r\n\r\n**HOW TO PREORDER THE FREE BETA TEST**\r\n\r\nDisable automatic payments on your account and ensure you do not have any store credit on file. Pre-order any Premier Ryzen packages below, and comment the following information below, replacing [Anything] in the brackets with the relevant information.\r\n&lt;pre&gt;FREE BETA ORDER\r\n**Order ID:** [Enter Order ID]&lt;/pre&gt;\r\nAlternatively, you can pay for the order. You will still receive the free beta before your paid term starts.\r\n\r\n**BONUS SERVICE/DURATION**\r\n\r\nIf you purchase a Ryzen package in Los Angeles, you will also immediately (barring any complications) receive a complimentary placeholder server on existing hardware, while supplies last. No placeholder service for Amsterdam at this time.\r\n\r\n&lt;h1&gt;PREMIER RYZEN PLANS&lt;/h1&gt;\r\n___________\r\n\r\n[.-\"-.     .-\"-.     .-\"-.     \r\n{ ORDER NOW }\r\n     \"-.-\"     \"-.-\"     \"-.-\"      ](https://virmach.com/special-offers/ \".-\"-.     .-\"-.     .-\"-.     \r\n{ ORDER NOW }\r\n     \"-.-\"     \"-.-\"     \"-.-\"      \")                                   \r\n\r\n**NVMe1G**\r\n1GB DDR4 RAM – 2400MHz-2666MHz (Dedicated)\r\n25GB NVMe  – RAID1/RAID10, 6GB-14GB/s (Dedicated, Shared IO*)\r\n1 vCore CPU – Ryzen 3.5GHz (Fair Use**)\r\n2500GB Bandwidth – 1Gbps Port (Shared)\r\n1x IPv4 Address – IPv6 Available\r\n$27 annually | $38 biennially (Every 2 Years) – Additional 10% off first term, use code NVMe1G\r\n\r\n**NVMe2G**\r\n2GB DDR4 RAM – 2400MHz-2666MHz (Dedicated)\r\n50GB NVMe  – RAID1/RAID10, 6GB-14GB/s (Dedicated, Shared IO*)\r\n2 vCore CPU – Ryzen 3.5GHz (Fair Use**)\r\n5000GB Bandwidth – 1Gbps Port (Shared)\r\n1x IPv4 Address – IPv6 Available\r\n$48 annually | $72 biennially (Every 2 Years) – Additional 20% off first term, use code NVMe2G\r\n\r\n**NVMe4G**\r\n4GB DDR4 RAM – 2400MHz-2666MHz (Dedicated)\r\n100GB NVMe  – RAID1/RAID10, 6GB-14GB/s (Dedicated, Shared IO*)\r\n3 vCore CPU – Ryzen 3.5GHz (Fair Use**)\r\n7500GB Bandwidth – 1Gbps Port (Shared)\r\n1x IPv4 Address – IPv6 Available\r\n$84 annually | $142 biennially (Every 2 Years) – Additional 25% off first term, use code NVMe4G\r\n\r\nPlease note, for the additional discount, limit one per client and you must make a payment or it will be void (so free beta testers, even if they decide to renew, will be ineligible.) Additional earlybird promotion is set to expire on January 23rd, 2021. \r\n\r\n&lt;h1&gt;WINDOWS&lt;/h1&gt;\r\n____________\r\n\r\n[.-\"-.     .-\"-.     .-\"-.     \r\n{ ORDER NOW }\r\n     \"-.-\"     \"-.-\"     \"-.-\"   ](https://virmach.com/special-offers/ \".-\"-.     .-\"-.     .-\"-.     \r\n{ ORDER NOW }\r\n     \"-.-\"     \"-.-\"     \"-.-\"   \") \r\n\r\nOrder Windows on the NVMe2G package for $39 per year.\r\n\r\n&lt;h1&gt;STORAGE PREORDER&lt;/h1&gt;\r\n___________________\r\n\r\n[.-\"-.     .-\"-.     .-\"-.     \r\n{ ORDER NOW }\r\n     \"-.-\"     \"-.-\"     \"-.-\"   ](https://virmach.com/special-offers/ \".-\"-.     .-\"-.     .-\"-.     \r\n{ ORDER NOW }\r\n     \"-.-\"     \"-.-\"     \"-.-\"   \") \r\n\r\nWe will be expanding our storage offerings to Los Angeles. Here is a great chance to reserve your spot for our storage packages that are in extremely high demand (and usually sold out.) There is no beta testing for this service, it's only available for purchase.\r\n\r\n**STORAGE-1T**\r\n1GB RAM (Dedicated)\r\n1TB Storage – RAID10 (Dedicated, 930GB~ Usable)\r\n1 vCore CPU (Shared)\r\n10TB Bandwidth – 10Gbps Port (Shared)\r\n1x IPv4 Address \r\n$59.50 annually | $79.80 biennially (Every 2 Years)\r\n\r\n\r\n&lt;h1&gt;KVM Specials&lt;/h1&gt;\r\n____________\r\n\r\n[.-\"-.     .-\"-.     .-\"-.     \r\n{ ORDER NOW }\r\n     \"-.-\"     \"-.-\"     \"-.-\" ](https://virmach.com/special-offers/ \".-\"-.     .-\"-.     .-\"-.     \r\n{ ORDER NOW }\r\n     \"-.-\"     \"-.-\"     \"-.-\" \")   \r\n\r\nThese are our current KVM specials, not pre-order on Ryzen (but on current hardware.)\r\n\r\n**1GB RAM** (Comment Order ID for +512MB***)\r\n1  vCore (Shared)\r\n25GB SSD – RAID10\r\n3TB Transfer – 1Gbps (Shared)\r\n$18.40/YR – Additional 50% off first term, use code KVMSPEC2021\r\n\r\n**2GB RAM** (Comment Order ID for +512MB***)\r\n2  vCore (Shared)\r\n35GB SSD – RAID10\r\n4500GB Transfer – 1Gbps (Shared)\r\n$22.30/YR – Additional 50% off first term, use code KVMSPEC2021\r\n\r\n**3GB RAM** (Comment Order ID for +512MB***)\r\n2 vCore (Shared)\r\n50GB SSD – RAID10\r\n6TB Transfer – 1Gbps (Shared)\r\n$28.60/YR – Additional 50% off first term, use code KVMSPEC2021\r\n\r\n***To receive 512MB additional RAM, reply the following:\r\n&lt;pre&gt; ADDITIONAL RAM\r\n**Order ID:** [Enter Order ID]&lt;/pre&gt;\r\nWe will try to add this as soon as possible. We will stop processing additional RAM after January 23rd, 2021 so please order this within the allowed timeframe for the extra RAM.\r\n\r\n\r\n&lt;h1&gt;RYZEN PRE-ORDER DETAILS&lt;/h1&gt;\r\n_____________________\r\n\r\nBelow, we will cover all the details regarding this promotion. If you have any additional questions, please check our replies on this thread and if the question has not been answered, feel free to ask.\r\n\r\n**HOW IT WORKS.** _General Explanation_\r\n\r\nPlace an order. You may pay for it to reserve/prioritize your spot. If you do not want to pay for it yet, you can comment here with your order ID per the instructions above, and it will also be added to a list of beta testers. We will process non-paid beta test services in the order they are received, while supplies last. There will be a total of 3,000 positions at this time, so these will be cut off for the first phase of expansion after approximately that quantity of comments. More positions may be added.\r\n\r\n**ETA/TIMELINE.** _Guaranteed And Estimated Timeframes_\r\n\r\nAll paid Los Angeles orders will be activated by February 28, 2021 or sooner. All paid Amsterdam orders will be activated by March 31st, 2021 or sooner. Any other location (if offered due to high demand, paid only) will be guaranteed by April 30th, 2021. All paid Ryzen orders in Los Angeles will receive a PLACEHOLDER service free of charge, meaning you will have a service on current hardware for the time being as a courtesy. No guarantees are provided on this placeholder. For non-paid orders, there is no timeline or guarantee although it will fall in line with/after the paid orders. We will provide at least [1] week notice before terminating placeholder &amp; beta test services. There's no set period of time for the duration of beta test. It will most likely last at least several weeks.\r\n\r\nBy the estimated timeframes, we will at least have an automated system set up to request a refund if we miss the target. You can request a refund via this button, or chose to wait longer. Please do not contact us for order status; we will not be able to update you and the ticket will most likely be closed without a response. We will only provide updates on this thread.\r\n\r\n**LOCATIONS AVAILABLE.** _Initial Locations Offered_\r\n\r\nWe will allow you to place an order, selecting either Los Angeles or Amsterdam. Please note, Amsterdam may have further delays related to the added time for shipping &amp; customs. You may comment here with your paid order ID and a preferred primary location. This will count as a vote toward that location and if that location has enough support we may provide your service on that location, with a modified guaranteed due date of April 30th, 2021. Otherwise, it will be on the location selected/available. Only paid orders can vote. \r\n\r\nUse this form to request another location (not guaranteed.)\r\n&lt;pre&gt; LOCATION REQUEST\r\n**Order ID:** [Enter Order ID]\r\n**Preferred Location:** [City, Country]&lt;/pre&gt;\r\n\r\nSome potential future locations include the following, but feel free to state any location.\r\n* Ashburn, US. Toronto, CA.  Moscow, RU. London, UK. Dallas, US. Miami, US. Tokyo, JP. Sydney, AU. Singapore, SG. Chicago, US. Sao Paulo, BR. Johannesburg, ZA. Mumbai, IN. Taipei, TW. Atlanta, US. \r\n\r\nIf you vote for other locations, we recommend checking other votes and use similar formatting.\r\n\r\n**AFTER BETA TEST.** _What Will Happen?_\r\n\r\nThe end of the beta test will be announced, and you will be provided at least one week notice. An invoice will be generated, and it can be paid to continue service at the published price and term or you may \"cancel\" the service instead to ensure a termination. Published price will be without any additional promotion/coupon for any orders not paid initially, even if coupon was initially utilized. Please note, our billing will proceed as normal which means if you do not have auto payments disabled with a credit/debit card or PayPal account on file then it will auto-renew 72 hours before the invoice due date. If you already paid for the service, then your service duration will begin only after the beta test concludes (so if you paid, you still get the free beta test period.)\r\n\r\n\r\n&lt;h1&gt;SUPPORT LEVEL&lt;/h1&gt;\r\n_______________\r\n\r\nThe Storage &amp; paid Ryzen packages will have a regular level of support. KVM specials will have limited support. All beta test portion of Ryzen services will have extremely limited support (essential no support) and will have no guarantees whatsoever. For beta tests, use this thread for support. Complimentary placeholder services will have limited support. There are absolutely no guarantees whatsoever on beta test and placeholder services.\r\n\r\n**Please remember, the beta test is a beta test. A lot can go wrong, including extended outages. Do not use for important applications. Do not store important data. Do not use in production.**\r\n\r\n&lt;h1&gt;REFUNDS&lt;/h1&gt;\r\n_________________\r\n\r\nThere are no refunds for any services on this promotion, unless we miss any specified delivery outline. Even if the package comes with support, it will not qualify for a refund (by default.) Please be absolutely sure you have automatic payments disabled and no credits on file before you place any order, as you will not qualify for a refund even if there was an unintended purchase. Do not refresh checkout pages or press the back button, including at the payment processor’s website; if a page fails at loading, close out.\r\n\r\n&lt;h1&gt;AFFILIATES&lt;/h1&gt;\r\n_________________\r\n\r\nIf you are an affiliate, please note that the pre-order packages are NOT eligible for any affiliate payout, but the regular KVM specials are eligible. We cannot pay out affiliate earnings on the pre-orders due to the nature of how they will be created and the timeline. \r\n\r\n&lt;h1&gt;OFFER TERMS/DISCLAIMER&lt;/h1&gt;\r\n_________________\r\n\r\nWe reserve the right to cancel and refund any service and opt not to render it instead (this will usually be reserved in case of major issues with the package or estimated delivery times, typos, or our ability to deliver the product should it be sold out.) All promotion/coupon codes for this offer are one-time use only per household, and non-recurring. See \"REFUNDS\" section above for the refund terms. \r\n\r\nPlease do not contact our live chat or sales department with questions in regards to this sale. We may rate limit or block special-related requests. Please anticipate your service to potentially not be functional for a few days before you can contact us for a resolution. If you have any questions, please post them on this thread. We apologize for any errors/typos within this offer.\r\n\r\n**Please also avoid doing the following:**\r\n\r\n* Making more than one account (may cause major problems.)\r\n* Making more than one ticket (will slow down the process for everyone.)\r\n* Selling your outside of our transfer process (may cause major problems.)\r\n* Requesting e-mail changes (we cannot process these for specials at this time.)\r\n* Locking yourself out (2FA, we can't deal with this high quantity of requests.)\r\n\r\nThe promotion codes for the additional one-time discounts are set to expire by January 23rd, 2021.\r\n\r\n&lt;h1&gt;BETA TEST FEEDBACK&lt;/h1&gt;\r\n_________________\r\n\r\nWe will expect some level of feedback from beta testers. We may send you communication/polls, message you on LET, or gather feedback here in some way. For Alpha testers (in a previous thread) you will receive your services first and we will expect a greater level of feedback. If you have issues, please post on this thread only and please do not create a ticket, unless you are asked to create a ticket. \r\n\r\n\r\n&lt;h1&gt;OFFER DETAILS&lt;/h1&gt;\r\n_________________\r\n\r\nWe have a lot of offers so these will vary, but our VPS plans are generally:\r\n\r\n**Storage:** Solid State Drive RAID 10 or NVMe RAID 1 or RAID 10.\r\n**DDoS Protection:** Available Free (In Buffalo, NY) Not advertised/guaranteed, but also in LA &amp; NL too (Ryzen.)\r\n**Locations:** Varied, as available. New in LA &amp; NL.\r\n**Virtualization:** KVM (For VPS.) SolusVM Control Panel.\r\n**Operating System:** Various Linux. Windows at additional cost on NVMe2G package.\r\n**Support:** Limited level of support, standard on some. No/limited support on free services.\r\n**Refunds:** No Refunds.\r\n**Terms:** https://virmach.com/terms-conditions\r\n**Looking Glass:** http://lg.virmach.com/ (Does not have new LA &amp; NL.)\r\n\r\n\r\n"}