{"id": 169729, "date": "2021-02-05 02:37:29", "user": "NicholasOXI", "post": "Hello there,\r\n\r\n**Oxide Hosting** is a high quality, affordable Virtual Servers (VPS) and Website Hosting provider, with a dedicated customer service team. Our services are hosted upon enterprise-grade hardware with flexible solutions to fulfil various needs. We offer a wide range of plans to be accommodating as possible, for any further queries or concerns; please do not hesitate to reach out to us - https://support.oxide.host/ or via email - support@oxide.host. As this is our first discussion on this platform, if you have any feedback on missing details which will be useful for other community members please do let us know and we'll clarify this for you.\r\n\r\n# Virtual Servers (VPS) Offerings\r\n\r\n**VPS Classic XS**:\r\n1x vCore (3.00ghz) - Intel Xeon E5-1660 v3 processor,\r\n2048MB DDR4 ECC Ram,\r\n32GB Storage (NVMe),\r\n200mbp/s Port Speed,\r\nUnmetered Bandwidth,\r\nAnti-DDoS Protection,\r\n1x IPv4, 1x IPv6 (/80),\r\nOne-Click Installers,\r\nAutomated Backups - maximum of three backups taken daily,\r\nService Monitoring,\r\nMultiple Locations - available in Gravelines, France and Montreal, Canada (OVH),\r\nVirtualized by KVM, managed by Virtualizor.\r\n\r\n~~£3.59/month~~ **£3.23/month (GBP)**, $4.42/month (USD). [[**ORDER**](https://billing.oxide.host/cart.php?a=add&amp;pid=8&amp;promocode=LOWENDTALK \"**ORDER**\")]\r\n\r\n**VPS Storage S**:\r\n2x vCore (2.40ghz) - Intel Xeon D-1521 processor,\r\n512MB DDR4 ECC Ram,\r\n256GB Storage (HDD),\r\n200mbp/s Port Speed,\r\nUnmetered Bandwidth,\r\nAnti-DDoS Protection,\r\n1x IPv4, 1x IPv6 (/80),\r\nOne-Click Installers,\r\nService Monitoring,\r\nVirtualized by KVM, managed by Virtualizor; available in Gravelines, France (OVH) only.\r\n\r\n~~£2.99/month~~ **£2.69/month (GBP)**, $3.68/month (USD). [[**ORDER**](https://billing.oxide.host/cart.php?a=add&amp;pid=16&amp;promocode=LOWENDTALK \"**ORDER**\")]\r\n\r\nWe currently support the following payment gateways: PayPal, Stripe (Credit/Debit Cards) and Bank Transfer (unofficially limited to the United Kingdom). Our servers listed above support the following templates: Ubuntu 20.04/18.04/16.04, Debian 10/9, CentOS 8/7, Fedora 32 and OpenSUSE 15. At the moment, all our plans are only billed monthly to enable flexibility for customers. All orders are usually deployed instantly once all automated fraud checks have been conducted.\r\n\r\nThank you for your interest in our services, we hopefully look forward to serving you. Pricing in USD is accurate as of writing this discussion (£1.00 = $1.37); this may change depending upon the date/time you are reading this on our billing area as product pricing in different currencies is updated daily. We're also considering creating specials limited to LowEndTalk; if you think this is something you might be interested in, please do let us know. Stay safe, have a great day!\r\n"}