{"id": 16988, "date": "2013-11-21 21:42:32", "user": "professionalxen", "post": "Hello, dear community, users of LET.\r\nI am here today beacuse i would like to introduce you and tell you a bit more about our company.\r\n\r\n[OUR WEBSITE](http://professionalxen.com/)\r\n\r\n**About us:**\r\n&lt;br&gt;We registred the domain two months ago, when it all started. We have been patiently preparing our nodes, testing them, stressing them to test their limits and much more.\r\nI'm pleased to announce, that we are finally ready to accept orders now.&lt;/br&gt;\r\n\r\n**Why us?**\r\n&lt;br&gt;We believe in a no-nonsense business. To that end our pricing is simple, and so is our professional support. Open a ticket, have the issue fixed; simple! All of our dedicated servers are powerful to provide our customers with the most pleasurable experience a VPS hosting can offer.&lt;/br&gt;\r\n\r\n**Uptime?**\r\n&lt;br&gt;Our goal is your satisfaction, reliable availability is important for both you and us. Never worry about experiencing any downtime. We are very well aware that breakdowns can easily lead to financial losses.&lt;/br&gt;\r\n\r\n**Network ?**\r\n&lt;br&gt;Virtual Machines are connected to 1 Gbps shared port guaranteeing you will have great speeds no matter the time of day. Our goal is customer satisfaction, we are improving each day to provide the best service for fairly cheap.&lt;/br&gt;\r\n\r\n_More informations:_\r\n&lt;br&gt;Our nodes VPS allocation is very important to us.\r\nBeacuse of that, we have specific amount and well planned ratio between plans.&lt;/br&gt;\r\n\r\n&lt;br&gt;Node 1 is located in Italy, Milano.&lt;/br&gt;\r\n&lt;br&gt;Specs: 32 GB RAM, Intel(R) Core(TM) i7-4770S CPU @ 3.10GHz&lt;/br&gt;\r\n\r\n___________________________\r\n\r\n&lt;br&gt;Plan 1:&lt;/br&gt;\r\n&lt;br&gt;1 Xeon CPU&lt;/br&gt;\r\n&lt;br&gt;1 GB Guaranteed RAM&lt;/br&gt;\r\n&lt;br&gt;35 GB HDD Space&lt;/br&gt;\r\n&lt;br&gt;500 GB Premium Bandwidth&lt;/br&gt;\r\n&lt;br&gt;SolusVM Control Panel&lt;/br&gt;\r\n&lt;br&gt;1 IPv4&lt;/br&gt;\r\n&lt;br&gt;100 Mbps DDoS Protection&lt;/br&gt;\r\n&lt;br&gt;1 Gbps port&lt;/br&gt;\r\n&lt;br&gt;Location: Italy, Milano&lt;/br&gt;\r\n_&lt;br&gt;Price: $7/month&lt;/br&gt;_\r\n&lt;br&gt;[Order Here](http://professionalxen.com/eunode1.html)&lt;/br&gt;\r\n\r\n___________________________\r\n\r\n&lt;br&gt;Stock organization per dedicated server:\r\n&lt;br&gt;4 GB RAM = 5x&lt;/br&gt;\r\n&lt;br&gt;2 GB RAM = 3x&lt;/br&gt;\r\n&lt;br&gt;1 GB RAM = 4x&lt;/br&gt;\r\n\r\nWhen we fully get out of stock on specific dedicated server we will open another node.\r\nBalance between bigger and lower plans is very important to us. Everything has to be sold evenly.\r\n\r\nOS that we use:\r\nWe are using windows server 2008 R2 Standard as our OS for VPS servers. It is pre-activated with 100 days. That is from our side, after that it is up to you how you are planning/will activate the OS.\r\n\r\nAnyway, you will find most of the things that you need to know about us on our wiki page.\r\n\r\nA little extra (got permission of following images from seflow datacenter, where we rent our hardware)\r\n&lt;br&gt;[Image 1](https://fbcdn-sphotos-g-a.akamaihd.net/hphotos-ak-ash3/644075_669579786398952_958200830_n.jpg)&lt;/br&gt;\r\n&lt;br&gt;[Image 2](https://fbcdn-sphotos-e-a.akamaihd.net/hphotos-ak-ash3/1186161_668663296490601_1913206596_n.jpg)&lt;/br&gt;\r\n\r\nCheck us out, you will defenitly not regret it :)"}