{"id": 169865, "date": "2021-02-11 14:22:10", "user": "HostMedia", "post": "We thought we would do something a little different for our domain offer today, we are offering a first-come, first-served limited offer for .COM, .UK and .US domains. You will find below coupon codes for each batch - if the batch is sold out try the next coupon code to get the best offer available. Once the batches are gone they won't be available again! So order quickly :smile:\r\n\r\nPrices start from just **£1**, yes that includes the .COM extension!\r\n\r\nThis is NOT a recurring price offer, if you wish to keep the domain name with us you will need to renew at the normal full price. Don't worry you can transfer the domain away at any time, we won't hold you to staying with us, but it would be nice if you do :blush:\r\n\r\nAll prices are in GBP and exclude VAT, so you will be charged VAT on top of any offer price if applicable to you. This offer is for 1-year registration only.\r\n\r\n# Offers\r\n\r\n============================\r\n\r\n## .COM\r\n\r\n**.COM Batch 1 (Only 5 available) - £1**\r\nCoupon: `COM022020-BATCH1`\r\n\r\n**.COM Batch 2 (Only 5 available) - £3.50**\r\nCoupon: `COM022020-BATCH2`\r\n\r\n**.COM Batch 3 (Only 10 available) - £7**\r\nCoupon: `COM022020-BATCH3`\r\n\r\n**ORDER:** https://www.hostmedia.co.uk/client/cart.php?a=add&amp;domain=register\r\n\r\n============================\r\n\r\n## .UK (Includes .co.uk / .org.uk / .me.uk)\r\n\r\n**.UK Batch 1 (Only 5 available) - £1**\r\nCoupon: `UK022020-BATCH1`\r\n\r\n**.UK Batch 2 (Only 5 available) - £2**\r\nCoupon: `UK022020-BATCH2`\r\n\r\n**.UK Batch 3 (Only 10 available) - £3**\r\nCoupon: `UK022020-BATCH3`\r\n\r\n**ORDER:** https://www.hostmedia.co.uk/client/cart.php?a=add&amp;domain=register\r\n\r\n============================\r\n\r\n## .US\r\n\r\n**.US Batch 1 (Only 5 available) - £1**\r\nCoupon: `US022020-BATCH1`\r\n\r\n**.US Batch 2 (Only 5 available) - £2**\r\nCoupon: `US022020-BATCH2`\r\n\r\n**.US Batch 3 (Only 10 available) - £3**\r\nCoupon: `US022020-BATCH3`\r\n\r\n**ORDER:** https://www.hostmedia.co.uk/client/cart.php?a=add&amp;domain=register\r\n\r\n============================\r\n\r\n# FAQ\r\n\r\n**Will I be able to transfer the domain name away before renewal?**\r\nYes, you will be able to transfer the domain name away at any time, we won't hold you to keeping the domain with us and paying a renewal fee. We are nice like that :smile: \r\n\r\n**On renewal will I be charged the normal domain pricing?**\r\nYes, if you wish to keep the domain name with us you will be charged on renewal the normal domain price. Pricing can be found here: https://www.hostmedia.co.uk/domain-names/\r\n\r\n**Can I place an order to transfer a domain to Host Media with the coupon**\r\nYes you can, just following the transfer order process: https://www.hostmedia.co.uk/client/cart.php?a=add&amp;domain=transfer\r\n\r\n**Do you provide domain forwarding or DNS Record management?**\r\nThese features are paid add-ons but you can use services such as CloudFlare or hosting service to enable such features.\r\n\r\n**Can I point the domain name to external nameservers**\r\nYes, you do not need to use our hosting for the domain name. You will be able to set your own nameservers on the domain.\r\n\r\n**Can I buy more than 1 domain in a batch?**\r\nEach batch is limited to 1 domain per client, you can purchase a domain from each batch. For example:  UK022020-BATCH1 &amp; UK022020-BATCH2 for 2 domains and pay a total of £3 for the 2 .UK domain names. You will not be able to use 2x UK022020-BATCH1.\r\nYou will need to place separate orders for each coupon code you wish to use.\r\n\r\n# A little bit about Host Media\r\n\r\nWhilst our expertise in hosting solutions dates back to 2002 we actually launched Host Media in 2008. With our range of powerful server resources, we wanted to provide heavy media and application-based hosting that will not fail under the stress that is created by media-based websites and applications. We continue to use our rule on overselling. We do not do it and will sell what we have, so you know that when you order your hosting plan that the hosting space is dedicated to you, not anyone else.\r\n\r\nHost Media Ltd | Company Registration No. 10990171\r\nVAT No. GB283897147 | UK EORI No. GB283897147000\r\n\r\n**Questions?**\r\nWe are always here to help with any questions you may have, feel free to open a sales ticket via our helpdesk."}