{"id": 169938, "date": "2021-02-15 20:31:22", "user": "WebHorizon", "post": "Heya everyone, \r\n\r\n\r\nVery excited to  announce our very first service offering in India - NAT VPSes. :)\r\n\r\nThe server is located in **Mumbai**  B) \r\n\r\n\r\n* Each VPS comes with 256MB of RAM. \r\n* One CPU core subject to fair use policy.\r\n* 4GB of SSD disk space in RAID.\r\n* 125GB of high speed bandwidth (1Gbps shared), then reduced speeds. (no suspension)\r\n* A dedicated /112 IPv6 subnet (that's 65,536 IPs! ) along with 50 IPv4 ports which can be forwarded to your VPS.\r\n\r\n\r\nIt comes with a nice control panel which supports enabling **tun/tap, NFS, Fuse, and PPP.**\r\n**Full Netfilter support** is enabled.  Most VPN solutions (OpenVPN, wireguard-go etc. tested working).\r\nVirtualization type is OVZ7.\r\nYou can reinstall the OS, options include Debian 9 &amp; 10, Ubuntu 18 &amp; 20, CentOS 7 &amp; 8 now.\r\nYou can also upload your SSH key, so your VMs are set to use keys by default upon reinstall.\r\n\r\n\r\n* **Support for Domain Forwarding** - means you can have your domain served on port 80 &amp; 443. SSL support letsencrypt certificates. :)\r\n\r\n&lt;br&gt;\r\n\r\n**Pricing**- The normal pricing is $12 for 1 year of service.\r\n\r\ncuz. of the much higher costs involved in India location, promotions are realistically not possible. \r\nWe are offering a discount for first 20 orders only - use coupon code NATINDIA for a discounted price.\r\nOrders need be paid within 24 hours and will be activated within 24 hours.\r\n \r\n[ORDER LINK](https://my.webhorizon.in/order/config/index/nat/?group_id=33&amp;pricing_id=365 \"ORDER LINK\")\r\n\r\n**Payment Methods:**\r\nPayPal payments, Cards via Stripe Payments, BTC payments.\r\nBilling currencies: USD, EUR, GBP or INR.\r\n\r\n&lt;br&gt;\r\n\r\n**For people living in India/having a card issued in India/billing address in India - Order using INR currency only** - [ORDER LINK](https://my.webhorizon.in/order/config/index/nat/?group_id=33&amp;pricing_id=365&amp;currency=INR \"ORDER LINK\")\r\nINR payment methods: \r\nRazorpay(Cards, UPI, Netbanking, GooglePay etc), Stripe payments.\r\n\r\n&lt;br&gt;\r\n\r\nPlease note - there is no refund policy for NAT VPS, new PayPal refund terms are very costly and we won't pay for refunds on NAT VPS. If you really need a refund - that can be done after deducting a small fee covering the Payment Gateway and usage charges. creating a support ticket on our portal is the way, no direct disputes please. :)\r\n\r\n\r\n\r\n\r\n&lt;br&gt;\r\nThanks you for reading &amp; Kind Regards."}