{"id": 170051, "date": "2021-02-21 16:06:31", "user": "seriesn", "post": "As some of you might have noticed, uncle Bob recently went missing. Turned out, he went on a trip to the land of tulips, windmill, stroopwafels and tall people; if you aren't aware, that's Netherlands. So when he came back he had some exciting news for the Nexus Bytes Family members and an amazing finding! Did you know, that carrots weren't always orange? Nope! You can blame the Dutch folks for that. So while researching, we found an interesting video, that you might enjoy as well :)\r\n\r\n\r\nhttps://www.youtube.com/watch?v=08cKczLnDkc\r\n\r\nWith that said, as you guessed it by now, we have added another awesome location to our portfolio. Not only awesome, but rather fantastic and as I write this, we are officially live! As crazy as it may sound, we actually got delayed by almost 2 weeks due to Netherlands getting first snow in almost a decade! \r\n\r\nAny who, not going to bore ya'll with wall of texts. Let's dive straight into the details:\r\n\r\n-------------------\r\n\r\nPromo: \r\n\r\n- **CarrotsAreOrange:**\r\n    - 15% recurring discount with the purchase of **ANY** new services, excepts the followings:\r\n\t- VPS 0.5G\r\n\t- Storage VPS\r\n\t\r\n\r\n- **CarrotsAreDelicious:** \r\n    - 20% Recurring discount when you upgrade your plans to the next tier! Storage plans aren't eligible for the discount.\r\n\r\n\r\n- **NL Launch special:** \r\n&lt;center&gt;![](https://i.imgur.com/FrB2CJ0.jpg\"\")&lt;/center&gt;\r\n        \r\n         - We are going dutch (almost) by picking up some part of the tab:\t\r\n\t- **25% cash back** (via service credit) when you signup with either semi-annual or annual commitment and post your order number in this thread.\r\n\t- Only applicable to orders placed for NL location.\r\n\t- NL Looking glass: https://lgnl.nexusbytes.com\r\n\t\r\n---------------------\r\n\r\n**Order links**\r\n- [Web Hosting in NYC Metro | Germany or Singapore]( https://nexusbytes.com/web-hosting \"Web Hosting in NYC Metro | Germany or Singapore\")\r\n- [Reseller Hosting in NYC Metro | Germany or Singapore](https://nexusbytes.com/web-hosting-reseller \"Reseller Hosting in NYC Metro | Germany or Singapore\")\r\n- [Premium E-mail Hosting](https://nexusbytes.com/email-hosting \"Premium E-mail Hosting\")\r\n- [AMD Ryzen VPS](https://nexusbytes.com/ryzen-vps-hosting \"AMD Ryzen VPS\")\r\n- [Budget VPS (Not to be mistaken as \"Cheap\" VPS)](https://nexusbytes.com/budget-vps-hosting \"Budget VPS (Not to be mistaken as \"Cheap\" VPS)\")"}