{"id": 170762, "date": "2021-04-01 17:25:53", "user": "seriesn", "post": "[Nexus Bytes](https://nexusbytes.com \"Nexus Bytes\"): Announcing [EntryBytes](https://entrybytes.com \"EntryBytes\") (Not an April fool prank)\r\n\r\n\r\n![](https://stayhipp.com/wp-content/uploads/2019/06/Untitled-5.jpg \"\")\r\n&lt;details&gt;\r\n  &lt;summary&gt;Wall of text that no one likes to read&lt;/summary&gt;\r\nHope all is well with you and your loved ones. Thank you for your continued business and thank you for being a member of the Nexus Bytes Family :).\r\n\r\nOver the months and years, we have asked you for your valuable feedback, that continues to pave the way for our services and offerings. We appreciate you for not only taking the time to communicate with us, but also for continuing to help us, becoming the better version of ourselves. Thank you!\r\n\r\nOne of the most commonly shared feedback was, can we bake something bigger and lesser, with the similar Nexus Bytes delicious spice. Not only did we listen to your suggestions and ideas, but we actually cooked up a whole new division, to accommodate your requests!\r\n&lt;/details&gt;\r\n\r\n\r\n&lt;center&gt;\r\n\r\n&lt;a href=\"https://entrybytes.com\"&gt;Today, we are excited to announce our affordable sub-brand, EntryBytes: Purveyor of quality affordable VPS\r\n\r\n![](https://entrybytes.com/assets/img/logo.png \"\")&lt;/a&gt;\r\n&lt;/center&gt;\r\n\r\nPowered by the same loving and caring team, that you have known since day 1. \r\n\r\n&lt;details&gt;\r\n  &lt;summary&gt;Wall of text that no one likes to read&lt;/summary&gt;\r\nBy separating our brands, we will able to develop additional services and offerings, which also paves the way for future affordable offerings under the Entry Bytes lineup, while continuing to bake more awesomeness within Nexus Bytes current offerings.\r\n\r\n&lt;/details&gt;\r\n\r\nThis is not an April Fool joke and what we said above, we were serious about it!\r\n\r\nThere is no better way to announce this awesome update, but to share the following amazing promotions:\r\n\r\n\r\n---------------\r\n**Limited promo codes:**\r\n\r\n* **Am-I-A-Joke-To-You-?(30)** – 30% recurring discount\r\n* **Am-I-A-Joke-To-You-?(25)** – 25% recurring discount\r\n* **Am-I-A-Joke-To-You-?(20)** – 20% recurring discount\r\n\r\n**Eligible plans:**\r\nEntryBytes VPS Plans (Entry and Inter)\r\n\r\n**[Order by clicking here.](https://entrybytes.com \"Order by clicking here.\")**\r\n\r\n**Payment Terms:**\r\nQuarterly, Semi-Annual, Annual.\r\n\r\n-------------------\r\n\r\n\r\n[Select Family perks available. Please confirm eligibility here.](https://my.nexusbytes.com/knowledgebase/38/Family-Perks---Because-family-matters.html \"Select Family perks available. Please confirm eligibility here.\")\r\n\r\nYes Free Directadmin standard and Free blesta is included :)\r\n\r\nOnce again, we would like to thank you, for your valuable partnership and being a member of the Nexus Bytes Family 🙂\r\n\r\nNo @DA_Mark you aren't welcome to offer mini promo while half the world is sleeping -_-\r\n"}