{"id": 170810, "date": "2021-04-04 11:28:45", "user": "BunnySpeed", "post": "Hello :)\r\n\r\nAt [bunny.net](https://bunny.net \"bunny.net\"), Easter is (obviously) the most important day of the year for us, so we are celebrating it along with our users. As always, we prepared something extra for the LET community as this is where it all started! \r\n\r\n# Easter Giveaway Event\r\n\r\n![](https://publicshare.b-cdn.net/let/happy-easter-2021.jpg \"\")\r\n\r\nWe are currently running a fun little event for all of our existing users, giving you a chance to win some account credits, T-shirts, or a couple of secret surprise items that I'm sure you will enjoy. **If you already have an account, simply log in, spin the wheel, and hopefully you get lucky and win something cool.**\r\n\r\nMy favorite item we're giving away is this mug, but there's other cool stuff we're sending out as well!\r\n&lt;br /&gt;\r\n![](https://publicshare.b-cdn.net/let/bunnynet-mug.jpg \"\")\r\n\r\n&lt;br&gt;&lt;br&gt;\r\n\r\nSince we have LET close at heart and largely appreciate the love we've received over the years, we also prepared a special promo code as always, giving you $6 of account credits completely free of charge with no payment required. \r\n\r\n# LET Special Promo Code: **LETSTER-2021**\r\n\r\nThis is available both for existing and new users and can be entered on the billing page of your account after confirming your email. The code will expire tomorrow.\r\n\r\n&lt;br&gt;&lt;br&gt;\r\n\r\n![](https://publicshare.b-cdn.net/let/bunnynet-logo-dark-small.png \"\")\r\n\r\nSince I last posted, there's also been a whole lot going on, so I also wanted to share some updates about what we've been working on.\r\n\r\n# 🐇 **BunnyCDN rebranded as bunny.net**\r\nFor those that didn't know yet, we rebranded from BunnyCDN to bunny.net. We've grown a crazy amount over the past few years, and so has our vision. To go along with that and our new goal of building a much bigger, better, and faster service with more products, we felt it was also time to update our brand to reflect that. BunnyCDN however remains as one of our products called Bunny CDN.\r\n\r\n# 🖥️ **Bunny Stream**\r\nOne of the first big releases in this direction is Bunny Stream, a better new way to deliver online video where we take care of the whole video process from storage, transcoding, security to actual delivery, while still giving you full control. The only charges are the storage and CDN fees and we take care of all the rest behind the scenes.\r\n\r\n# 🌎 **Massive network expansion and SmartEdge™ routing engine**\r\nWe are trying to constantly push the boundaries of performance and have been hard at work to achieve this. We recently expanded to our 53rd PoP with more coming soon to deliver performance like never before.\r\n\r\nTo go along with that, we also released our new SmartEdge routing engine that dynamically optimizes and monitors routing based on your content and network metrics in realtime. This allows us to deliver the best possible performance for any request, even for smaller websites.\r\n\r\n# ⚙️ **New Edge Rules, features and more cache control**\r\nWe added multiple new edge rules and cache control options to give you more power than ever in controlling how your content is stored and delivered. We also released multiple new features such as real-time log forwarding, permanent log storage, and Follow Redirects, and more.\r\n\r\n# 🥰 **bunny.net partnered with jsDelivr**\r\nFinally, not really an update by itself, but something I'm personally very excited about and I wanted to share. bunny.net partnered with jsDelivr as one of the main CDN partners, to help speed up the internet.\r\n\r\n&lt;br /&gt;\r\nThat's it for now, but we have huge plans for the future and extremely excited going forward.\r\n\r\nHappy Easter! :)&lt;br /&gt;\r\n\r\n\r\n"}