{"id": 171397, "date": "2021-05-05 13:25:35", "user": "Aswin", "post": "**About CloudStick:**\r\n\r\nhttps://cloudstick.io/\r\n\r\nCloudStick is a SaaS application designed to manage your Digital Ocean, Linode, AWS, Vultr, GCP, Any KVM servers or Dedicated servers for PHP, and Node-based Web Applications. CloudStick is fully packed with Nginx, Apache, PHP, MariaDB, FTP, Cron, Supervisord, Redis, Memcached, Node, Composer, etc. CloudStick’s one Click installer is capable of deploying WordPress, Joomla, NextCloud, and PHPMyAdmin.\r\n\r\nWe are giving away a coupon LowEndTalk for a month so people can make use of our Control Panel the best possible way with the lowest pricing. This offer is applicable for Basic and Pro packages (Not trial). Just pay 90 USD for pro and 48 USD for the basic plan - Avail this offer for a Year!\r\n\r\nYour feedback and suggestions are highly appreciated in order to serve you better.\r\n\r\nSo what are you waiting for? Get started today!\r\n\r\n**How to install CloudStick?**\r\n\r\n**Requirements:**\r\n\r\nYou need an account with CloudStick: https://cloudstick.io to get started.\r\nYou should have a server with the operating system of Ubuntu 16.04 LTS, 18.04 LTS, or 20.04 LTS.\r\n\r\nProcedure:\r\n1.       Once the account is created, you need to click on Connect server\r\n2.       Enter your server name and select the provider, and server IP address \r\n3.       Enter the root password to install CloudStick on your server. The installation will take 5 - 8 minutes and your server will be ready to host websites and applications.\r\n\r\n\r\n**What are the features available in CloudStick?**\r\n\r\n* Quota for accounts/ Web applications/ System Users.\r\n* Centralized management and the global search for databases, web application, and servers.\r\n* The one-click web application installer.\r\n* Manual SSL\r\n* Free SSL\r\n* Additional FTP accounts for web applications and subdirectories.\r\n* SFTP for web applications.\r\n* Service management.\r\n* Server Time zone management.\r\n* Hostname setup\r\n* Database management with advanced options, such as assigning custom privileges for the user, easy remote access, and many more.\r\n* Git Deployment and WebHooks.\r\n* Multiple PHP versions - 5.5, 5.6, 7.0, 7.1, 7.2, 7.3, 7.4, 8.0\r\n* EasyPHP - which allows customers to install the required PHP module without a command-line interface, such as pgsql, mcrypt, redis, geoip, imagick, ioncubeloader, and igbinary, ZMQ, etc.\r\n* Easy SSH access management.\r\n* Advanced server firewall with automated triggering.\r\n* Server Health Statistics.\r\n* Advanced web application file manager.\r\n* Isolated cache management system.\r\n* Advanced Web application management utilities, such as manage redirection, fix permissions, cores management, authentication management, etc.\r\n \r\n**What are the Upcoming Modules?**\r\n\r\n* Free Team management - which is free for Basic and Pro package owners. Will be released in 15 - 20 days.\r\n* DNS - Which is also a free module for all customers even for free too.\r\n* Backup - Incremental backup with addon pricing.\r\n \r\n**What are the benefits of using CloudStick?**\r\n\r\n* 24/7 Free ticket support with 20 minutes response time.\r\n* Free migration.\r\n* No additional cost for support\r\n* API availability\r\n\r\nTutorials - https://www.youtube.com/channel/UCNd7wFn6EMRgCK8eXXsxyBw"}