{"id": 171682, "date": "2021-05-21 19:19:02", "user": "randvegeta", "post": "Hello everyone!\r\n\r\nI'm happy to announce the launch of our NEW hosting company [www.millenial.host](http://millenial.host \"www.millenial.host\").\r\n\r\nYes, that's right, my partner @jayjay and I have decided to go with the cheesiest name we could possibly think of! \r\n\r\nWhat makes Millenial Host different? Why should you choose us?\r\n\r\nMillenial Host is a UK registered company, owned and operated by 2 guys... who happen to be Millenials with a poor sense of humor and couldn't think of a better name. But I digress! Let's cut to the chase.\r\n\r\nGone are the days of Fax, phones and even E-mail. We live in an age of social media! Millenial Host is dumping the old ways of communications, and opening up support to mediums people actually want to use. That's Facebook, Twitter, Instagram, and soon Whatsapp, Telegram, WeChat, once we get our numbers verified. It's the Millenial way!\r\n\r\n*More Cheesy Stuff* -  We're on a journey. And this is just the beginning. We plan to document and share our journey over platforms such as Twitter and YouTube. Because who doesn't like watching builds of new servers and setups of networking equipment.\r\n\r\nAnd in keeping the whole 'Millenial' way of doing things, of course we not only accept, but encourage Cryptos of all kinds \r\n\r\nOK.. Enough of the intro, and onto the offers.\r\n\r\nAs a UK based operation, it only makes sense that our very first offer will be of HONG KONG based servers! Because logic! No but seriously, UK will be coming soon. But HK first! \r\n\r\nWe've got 3 great promotional offers:\r\n\r\n**HK-KVM-512M**\r\n512MB RAM\r\n10GB SSD\r\n1TB Traffic\r\n_US$3/month_\r\n[Order Now](https://www.millenial.host/portal/cart.php?a=add&amp;pid=15 \"Order Now\")\r\n\r\n**HK-KVM-1G**\r\n1GB RAM\r\n25GB SSD\r\n1TB Traffic\r\n_US$5/month_\r\n[Order Now](https://www.millenial.host/portal/cart.php?a=add&amp;pid=11 \"Order Now\")\r\n\r\n**HK-KVM-1.5G**\r\n1.5GB RAM\r\n35GB SSD\r\n1TB Traffic\r\n_$7/month_\r\n[Order Now](https://www.millenial.host/portal/cart.php?a=add&amp;pid=14 \"Order Now\")\r\n\r\n**HK-KVM-1G-DDoS-Protected**\r\n1GB RAM\r\n25GB SSD\r\n250GB Traffic\r\n_US$7/month_\r\n[Order Now](https://www.millenial.host/portal/cart.php?a=add&amp;pid=16 \"Order Now\")\r\n\r\nPing Test:\r\n**DDoS Bandwidth** - _45.123.188.1_\r\n**Standard Bandwidth** - _45.123.191.1_\r\n\r\nSetup Time - Immediately after Payment\r\n\r\nGeneral stuff applies. No abuse of any kind! So no SPAM, no hacking sites, no warez sites etc. None of that allowed. Rule of thumb is, if it's legal and doesnt attract DDoS, then it's okay! If it's legal but DOES attract DDoS, then you must go for our DDoS Protected plan. If you have to ask, it's probably NOT okay. Abusers will be terminated without notice or refund (especially spammers!).\r\n\r\nAny questions, please feel free to ask.\r\n\r\nPort Speed: 100MBit"}