{"id": 172467, "date": "2021-07-04 07:51:20", "user": "VirMach", "post": "![](https://virmach.com/images/logo.png \"\")\r\n\r\nVirMach is back to let you know that the Ryzen servers we announced six months ago are finally going to be deployed very soon, so we no longer feel guilty about posting another offer! Our servers with ColoCrossing have been going empty, so I am once again asking for your support in filling the lonely and deeply saddened Buffalo servers. \r\n\r\nBut wait, there's a catch. _Unfortunately, we can't keep you there forever._ These servers used for this special are set to expire over the next few months, as they've earned their retirement after [working long and hard for over half a decade](https://ark.intel.com/content/www/us/en/ark/products/series/78582/intel-xeon-processor-e5-v2-family.html \"working long and hard for nearly a decade\"). So while we're not guaranteeing this will happen, you'd be slated to go on our new Ryzen servers before your annual contract ends. The initial batch of servers we are filling at the beginning of this sale, for example, are currently destined to be moved off by 11/11/2021. Others may be sooner or later.\r\n\r\nOn top of these packages, we will also be trying something new: _temporary services_, in the spirit of all summer hosts. Instead of ordering a recurring package, pre-paying, and having it randomly disappear one day, we will let you know exactly how long it will last before it disappears. These can be 30 day, 60 day, 90 day, 120 day, or even 180 day services. After this specific period of time advertised, your package will be terminated, _forever_. \r\n\r\n\r\n&lt;h1&gt;MIGRATION SPECIALS&lt;/h1&gt;\r\n________________________________\r\n\r\n[.-\"-. .-\"-. .-\"-.\r\n{ ORDER NOW }\r\n\"-.-\" \"-.-\" \"-.-\"](https://virmach.com/special-offers/ \".-\"-. .-\"-. .-\"-.\r\n{ ORDER NOW }\r\n\"-.-\" \"-.-\" \"-.-\"\")\r\n\r\n**512MB MIGRATION SPECIAL**\r\n$9.00 /yr\r\nRAM 512MB MEMORY\r\nCPU 1 CPU vCORE\r\nSSD 10GB SSD\r\nNetwork 1TB @ 1GBPS\r\nIP 1 DEDICATED IPv4\r\nSTANDARD SUPPORT\r\n\r\n**768MB MIGRATION SPECIAL**\r\n$12.00 /yr\r\nRAM 768MB MEMORY\r\nCPU 1 CPU vCORE\r\nSSD 15GB SSD\r\nNetwork 2TB @ 1GBPS\r\nIP 1 DEDICATED IPv4\r\nSTANDARD SUPPORT\r\n\r\n**1GB MIGRATION SPECIAL**\r\n$15.00 /yr\r\nRAM 1GB MEMORY\r\nCPU 1 CPU vCORE\r\nSSD 20GB SSD\r\nNetwork 3TB @ 1GBPS\r\nIP 1 DEDICATED IPv4\r\nSTANDARD SUPPORT\r\n\r\n**2GB MIGRATION SPECIAL**\r\n$25.00 /yr\r\nRAM 2GB MEMORY\r\nCPU 2 CPU vCORE\r\nSSD 40GB SSD\r\nNetwork 4TB @ 1GBPS\r\nIP 1 DEDICATED IPv4\r\nSTANDARD SUPPORT\r\n\r\n**3GB MIGRATION SPECIAL**\r\n$35.00 /yr\r\nRAM 3GB MEMORY\r\nCPU 3 CPU vCORE \r\nSSD 60GB SSD\r\nNetwork 5TB @ 1GBPS \r\nIP 1 DEDICATED IPv4\r\nSTANDARD SUPPORT\r\n\r\n\r\nPlease note, these are not Ryzen pre-orders. You are purchasing a regular package and it will at a later time be moved over to Ryzen. Please only purchase these specials if you're looking for a service and interested at these price-points for our current server offerings (not Ryzen.)\r\n\r\n\r\n&lt;h1&gt;LIMITED TERM/DURATION SERVICES&lt;/h1&gt;\r\n________________________________\r\n\r\n[.-\"-. .-\"-. .-\"-.\r\n{ ORDER NOW }\r\n\"-.-\" \"-.-\" \"-.-\"](https://virmach.com/special-offers/ \".-\"-. .-\"-. .-\"-.\r\n{ ORDER NOW }\r\n\"-.-\" \"-.-\" \"-.-\"\")\r\n\r\nRemember, these expire. The duration is in the title of each package.\r\n\r\n\r\n&lt;h1&gt;SUPPORT LEVEL&lt;/h1&gt;\r\n__________________________________\r\n\r\nWe have decided to provide these migration specials with a standard level of support (excluding one-time limited term offers.) This means that the migration plans are not limited support specials, but please understand that due to the pricing of the package, we do still expect customers to take some time to review knowledgebase articles to ensure they only contact us when necessary. This also does not mean we will provide full management, so please do not create a ticket asking us to set up your website/software for you. \r\n\r\n&lt;h1&gt;REFUNDS&lt;/h1&gt;\r\n__________________________________\r\n\r\nWe are also allowing refunds per our regular refund policy for migration services, although they are still considered \"specials.\" Unfortunately, for one-time/temporary length specials, we have decided to not allow refunds due to high potential for abuse. We reserve the right to change migration specials to no refunds if there is excess abuse, but we will of course still honor refunds if you purchased the package and it didn't state \"no refunds\" in a checkbox. If the refund button does not function, please create a ticket titled exactly \"Request - Refund [Special]\" and in the message, mention: [1] your service name and IP address, [2] that you placed a cancellation request first, and [3] that you are OK with all the data on the service being deleted permanently.\r\n\r\nPlease read our refund policy first before ordering: https://virmach.com/terms-conditions/\r\n\r\n&lt;h1&gt;OTHER TERMS/DISCLAIMER&lt;/h1&gt;\r\n________________\r\n\r\nWe reserve the right to cancel and refund any service and opt not to render it instead (this will usually be reserved in case of major issues with the package or estimated delivery times, typos, or our ability to deliver the product should it be sold out.) All promotion/coupon codes for this offer are one-time use only per household, and non-recurring. See \"REFUNDS\" section above for the refund terms.\r\n\r\nPlease also avoid doing the following:\r\n\r\n* Making more than one account (may cause major problems.)\r\n* Making more than one ticket (will slow down the process for everyone.)\r\n* Selling your service outside of our transfer process (may cause major problems.)\r\n* Locking yourself out (2FA, we can't deal with this high quantity of requests.)\r\n\r\n\r\n&lt;h1&gt;OFFER DETAILS&lt;/h1&gt;\r\n\r\n**Locations:** Varied, as available.\r\n**Virtualization:** KVM (For VPS.) SolusVM Control Panel.\r\n**Refunds:** See above.\r\n**Terms:** https://virmach.com/terms-conditions\r\n**Looking Glass:** http://lg.virmach.com/ (Does not have new LA &amp; NL.)\r\n\r\n&lt;h1&gt;WHY MIGRATION SPECIALS?&lt;/h1&gt;\r\n\r\nWe are doing this to minimize inconvenience/confusion for our website visitors, so this way everyone purchasing a special can get a great deal while also knowing and expecting a migration to occur in the near future. Please note, along the way, you might hit a few bumps and be transferred to other ColoCrossing nodes as we consolidate (but you'll receive ample notice.) We wouldn't recommend this special if you don't like your VPS to travel, as you may be moved to the next closest location, but there's a good chance we'll let you decide once our automatic migration tool goes live.\r\n\r\n&lt;h1&gt;WHY LIMITED TERM SPECIALS?&lt;/h1&gt;\r\n\r\nThese are the ones that we need to fill so we don't lose money, but we also don't want to fill permanently because there's not enough room to move to Ryzen, or because the migration will happen too soon and not be worth the effort and/or cause confusion. In addition, we are going to sprinkle a few of these *hidden* ones on this thread, so keep an eye out. This gives us a higher ability to put some interesting temporary services out for everyone to give you a chance to do a cool project over the summer, and again, allows us to give back to the community while reducing wasted empty server space. Please note, we recommend migrating away a few days before your plan expires, just in case. Remember that all easter eggs are just temporary happiness, and pay attention to the title.\r\n\r\n&lt;h1&gt;WHAT IF I ORDERED YOUR LAST SPECIAL?&lt;/h1&gt;\r\n\r\nDon't worry, we haven't forgotten about Ryzen pre-orders and beta testers. We almost have servers in both Los Angeles this week, and NYC Metro in the coming week(s) -- Amsterdam will unfortunately still be further delayed but not much longer. You will absolutely receive Ryzen before anyone else who purchases this offer, we respect your position in line.\r\n\r\nIf you have questions or concerns about the previous offer, [please post it here instead](https://www.lowendtalk.com/discussion/169373/virmach-nvme-free-ryzen-beta-la-nl-ryzen-38-2yr-1tb-hdd-80-2yr-1-5gb-from-9-20-yr/p1 \"please post it here instead\").\r\n\r\n\r\n&lt;h1&gt;DOUBLE BANDWIDTH&lt;/h1&gt;\r\n\r\nAfter months of research, we have perfected bandwidth doubling technology to where you will receive double bandwidth compared to what's advertised, without having to bump our thread. Just place an order, and you will receive double the bandwidth automatically as we have just multiplied the bandwidth limit on SolusVM by 2, since you're never going to use it anyway."}