{"id": 172559, "date": "2021-07-09 11:26:12", "user": "GameTownProjects", "post": "The new generation of our popular SSD KVM servers has been available for a few days.\r\nContrary to what we expected, we have managed to keep the price per GB Ram identical to the old generation and thus increase the CPU performance and the available memory at no extra charge!\r\n\r\nCustomers who want to upgrade from the old SSD generation to the new one can contact our support team who will be happy to help. Please note that this does not apply to special deals!\r\n\r\nAll offerings are protected against outages by Voxility DDoS Protection and are located in our colocation in the Netherlands.\r\nWe provide Looking Glass to test the connection: https://lg.nl.haendler.it/\r\n\r\nAll systems are powered by two independent circuits and are redundantly connected to our network to ensure the best possible stability of your systems.\r\n\r\n\r\nFor more information about the data center, please visit: https://kts24.com/about/datacenter\r\n\r\n\r\n\r\n**SSD G2 - 0.5 GB**\r\n\r\n1 shared Intel E5 Core\r\n0.5 GB RAM\r\n7 GB SSD storage\r\nIPv4 / IPv6 inclusive\r\n\r\n1,49 € per month\r\n[Order now](https://kts24.com/order/checkout/82 \"https://kts24.com/order/checkout/82\")\r\n\r\n\r\n\r\n**SSD G2 - 1 GB**\r\n\r\n1 shared Intel E5v2 Core\r\n1 GB RAM\r\n15 GB SSD storage\r\nIPv4 / IPv6 inclusive\r\n\r\n1,99 € / Monat\r\n[Order now](https://kts24.com/order/checkout/83 \"https://kts24.com/order/checkout/83\")\r\n\r\n\r\n\r\n**SSD G2 - 2 GB**\r\n\r\n1 shared Intel E5v2 Core\r\n2 GB RAM\r\n30 GB SSD storage\r\nIPv4 / IPv6 inclusive\r\n\r\n2,99 € per month\r\n[Order now](https://kts24.com/order/checkout/84 \"https://kts24.com/order/checkout/84\")\r\n\r\n\r\n**SSD G2 - 4 GB**\r\n\r\n2 shared Intel E5v2 Cores\r\n4 GB RAM\r\n60 GB SSD storage\r\nIPv4 / IPv6 inclusive\r\n\r\n4,99 € per month\r\n[Order now](https://kts24.com/order/checkout/9 \"https://kts24.com/order/checkout/9\")\r\n\r\n\r\nAll servers have a GBit/s connection to our network. However, to ensure that the connection is actually available, our host systems are connected with 2 - 20 GBit/s.\r\nWe do limit the traffic with a \"fair use\" policy, without a fixed value, as this is actually not necessary for customers who use their server within the framework of our terms and conditions.\r\n\r\nMore information on when we start contacting customers and how we proceed can be found here: https://kts24.com/about/traffic\r\nAs a guideline, you could say 2 TB per month is fine with us.\r\n\r\n\r\nOn our website you will find offers for up to 16 GB RAM, but more powerful SSD vServers can also be offered on request: https://kts24.com/vps\r\nWith all offers it is possible to rent additional hard disks, IP addresses or backup slots.\r\n"}