{"id": 172675, "date": "2021-07-17 06:58:23", "user": "randvegeta", "post": "**Millenial.Host is now MLNL.Host!**\r\n\r\nIt's been over a month since @jayjay and I officially launched Millenial.Host, and to a success that surpassed even our own expectations (we've since turned over TENs of dollars!).\r\n\r\nBut with the recent launch of Boomer.Host, it dawned on us that we need a sleeker, more modern branding. We have too many letters in our name. Milenails don't spell out words in full! Everything is shortened and lazy. And thus, MLNL.Host! Gotta keep with the times, and stay modern.\r\n\r\nWe have some great NAT offers today. Now these aren't your typical NAT VMs running OpenVZ with tiny resources and heavily oversold. These are proper KVM based VMs, just without that oh so unnecessary dedicated IP. These VMs are designed with performance in mind.\r\n\r\n\r\n\r\n**NAT-512MB**    \r\n- RAM : 512MB  \r\n- Disk: 5GB SSD  \r\n- Data Transfer: 1TB  \r\n- Port Speed: 1Gbit/s  \r\n_$3/Month_ | _$30/yr_\r\n[Order Now](https://www.millenial.host/portal/cart.php?a=add&amp;pid=18 \"Order Now\") (_Use Coupon Code **MLNLONE** and get the 1st month for just $1._)\r\n\r\n**NAT-1GB**  \r\n- RAM : 1GB  \r\n- Disk: 10GB SSD  \r\n- Data Transfer: 3TB  \r\n- Port Speed: 1Gbit/s  \r\n_$5/Month_ | _$50/yr_\r\n[Order Now](https://www.millenial.host/portal/cart.php?a=add&amp;pid=19 \"Order Now\")\r\n\r\n**NAT-1GB-Plus**    \r\n- RAM : 1GB  \r\n- Disk: 20GB SSD  \r\n- Data Transfer: Unlimited  \r\n- Port Speed:  1Gbit/s  \r\n_$7/Month_ | _$70/yr_  \r\n[Order Now](https://www.millenial.host/portal/cart.php?a=add&amp;pid=20 \"Order Now\")\r\n\r\nTEST IP: 210.3.160.110\r\n\r\n**F.A.Q.**\r\n\r\nQ: Can I pay with cheque?  \r\nA: No. We only accept Paypal and Crypto Currencies such as BTC and ETH. Cheques are for boomers.\r\n\r\nQ: What's your fax number for client registration?  \r\nA: Sorry. We only have online registration. Just use the order link above.  \r\n\r\nQ: Does my server get a dedicated phone line for the dial up connection?  \r\nA: Sorry, but we do not provide dedicated phone lines with our VPS. Our NAT VPS share a Gbit connection over a single IP. Each VPS includes 20 forwarded ports + SSH port. \r\n\r\nQ: Can I run my MOS 6502 code on your VPS?  \r\nA: Yes but not natively. Our virtualization nodes are running modern 64bit Xeon CPUs. Usually a Xeon E3 series but occasionally you may find your VM on a Xeon E5. You can run a 6502 emulator if you want to run your boomer code.  \r\n\r\nQ: Do you issue refunds by cheque?  \r\nA: YES! All refunds are processed ONLY by posted cheque. There is a handling fee of $25 for any and all refunds. Cancellation without refunds are of course free.  \r\n\r\n**Other Information**\r\n\r\nOur NAT VPS plans come with meaningful and usable resources. The above offer includes SSD to enhance the performance. However, HDD based NAT VPS with 10x (or more) storage will be made available shortly if we see there is any demand for more storage. We use HGC as our upstream. Our IPs can be used for accessing HK based streaming services, inlcluding Netflix and TVB. The service is ideal for personal VPN use, with the added benefit of having a usable server as well.\r\n\r\nAs with all our plans. Our services can only be used for legal (as defined under HK and UK law) purposes only. Any abuse, which includes spam, will not be tolerated.\r\n\r\nI'm sorry but we do not offer free trials. If you want to try our services first, we have an offer of $1 for the first month. \r\n\r\n**Other Offers**\r\n\r\nAny if you don't want NAT, we do have some other offers as well.\r\n\r\n**KVM-1G-v2**  \r\n- RAM : 1GB  \r\n- Disk: 5GB SSD  \r\n- Data Transfer: 500GB  \r\n- Port Speed: 1Gbit/s  \r\n- 1IPv4 (Dedicated) Address  \r\n_$5/Month_\r\n[Order Now](https://www.millenial.host/portal/cart.php?a=add&amp;pid=17 \"Order Now\")\r\n\r\n\r\n**HK-DDoS-0.5G**  \r\n- RAM : 512MB  \r\n- Disk: 10GB SSD  \r\n- Data Transfer: 1TB  \r\n- Port Speed: 1Gbit/s (DDoS Protected)  \r\n- 1IPv4 (Dedicated) Address    \r\n_$36/Year_  \r\n[Order Now](https://www.millenial.host/portal/cart.php?a=add&amp;pid=21 \"Order Now\")\r\n\r\n\r\n**HK-DDoS-1G**  \r\n- RAM : 1GB  \r\n- Disk: 25GB SSD  \r\n- Data Transfer: 1TB  \r\n- Port Speed: 1Gbit/s (DDoS Protected)    \r\n- 1IPv4 (Dedicated) Address \r\n_$7/Month_  \r\n[Order Now](https://www.millenial.host/portal/cart.php?a=add&amp;pid=16 \"Order Now\")\r\n"}