{"id": 172637, "date": "2021-07-15 04:42:38", "user": "VirMach", "post": "![](https://virmach.com/images/logo.png \"\")\r\n\r\nIt's been 10 days and we can post another thread, so VirMach is back again after being back again last week, to provide some dedicated server migration deals. \r\n\r\nJust like the last set of offerings, these servers are set to be migrated, but it may be a little bit less exciting as they're going to be migrated into other E3 nodes and not Ryzens. You will still get a few perks though, as all newer set of nodes you're migrated into will at the very least have an upgrade to the disk configuration. To keep it simple: expect to have to migrate (which may be inconveniencing) and you'll essentially have a service that's similar or better in most cases. But if you'd like to dig in to the details, scroll down further.\r\n\r\n\r\n&lt;h1&gt;DEDICATED MIGRATION SPECIALS&lt;/h1&gt;\r\n____________\r\n\r\n**ORDER LINK:** https://virmach.com/vds-dedicated-servers/\r\n\r\n**E3-HDL** Multiple Locations\r\n**Processor//** Intel E3-1240v1/Equivalent\r\n**Memory//** 16GB DDR3 RAM\r\n**Storage//** 1x 1TB HDD\r\n**Bandwidth//** 10TB @ 1Gbps\r\n**IPv4//** 4 Usable IPs + IPMI\r\n\r\n~~$39/MO~~  $27.30/MO\r\n**COUPON CODE:** E3HDLMIGRATE (30% OFF, RECURRING)\r\n\r\n**E3-HD** New York\r\n**Processor//** Intel E3-1240v2/E3-1270v1\r\n**Memory//** 32GB DDR3 RAM\r\n**Storage//** 2x 1TB HDD\r\n**Bandwidth//** 10TB @ 1Gbps\r\n**IPv4//** 4 Usable IPs + IPMI\r\n\r\n~~$49/MO~~  $31.85/MO\r\n**COUPON CODE:** E3HDMIGRATE (35% OFF, RECURRING)\r\n\r\n**E3-HD+** New York\r\n**Processor//** Intel E3-1240v2/E3-1270v1\r\n**Memory//** 32GB DDR3 RAM\r\n**Storage//** 1x 2TB HDD\r\n**Bandwidth//** 10TB @ 1Gbps\r\n**IPv4//** 4 Usable IPs + IPMI\r\n\r\n~~$49/MO~~  $34.30/MO\r\n**COUPON CODE:** E3HDPLUSMIGRATE (30% OFF, RECURRING)\r\n\r\n**E3-SD+** New York\r\n**Processor//** Intel E3-1240v2/E3-1270v1\r\n**Memory//** 32GB DDR3 RAM\r\n**Storage//** 1x 240GB SSD\r\n**Bandwidth//** 10TB @ 1Gbps\r\n**IPv4//** 4 Usable IPs + IPMI\r\n\r\n~~$49/MO~~  $36.75/MO\r\n**COUPON CODE:** E3SDPLUSMIGRATE (25% OFF, RECURRING)\r\n\r\n**E3-SD** New York\r\n**Processor//** Intel E3-1240v2/E3-1270v1\r\n**Memory//** 32GB DDR3 RAM\r\n**Storage//** 2x 120GB SSD\r\n**Bandwidth//** 10TB @ 1Gbps\r\n**IPv4//** 4 Usable IPs + IPMI\r\n\r\n~~$49/MO~~  $36.75/MO\r\n**COUPON CODE:** E3SDMIGRATE (25% OFF, RECURRING)\r\n\r\n\r\n&lt;h1&gt;POST-MIGRATION SPECIFICATIONS&lt;/h1&gt;\r\n____________\r\n\r\n**E3** Multiple Locations\r\n**Processor//** Intel E3-1270v2 (Some E3-1245v2*)\r\n**Memory//** 16-32GB** DDR3 RAM\r\n**Storage//** 2x 1TB*** SSD\r\n**Bandwidth//** 10TB @ 1Gbps\r\n**IPv4//** 4 Usable IPs + IPMI\r\n**IPv6//** Available\r\n\r\n*With integrated graphics. This will be offered as available if requested.\r\n**If your existing server has 32GB, you can request that if needed. Otherwise, further discount will be applied to your package for the downgrade (you decide.)\r\n***This may end up being 960GB or similar instead.\r\n\r\n\r\n&lt;h1&gt;FURTHER INFO&lt;/h1&gt;\r\n\r\nThat's right, whether you pick up a 1TB HDD server, 2TB HDD, 2x 1TB HDD, 2x 120GB SSD, or 1x 240GB SSD right now, your new server will have 2 x 1TB SSD.\r\n\r\nWe will also allow you to select your new location, regardless of where you select it now, as available (we will most likely just ask everyone to pick first and then allocate servers accordingly, so we do not anticipate anyone getting a location they do not desire.) Please note though, worst case scenario, you may end up being moved to the same location.\r\n\r\nSome people will technically be downgraded if they receive, for example, an E3-1270v3, but the majority of what's left over is E3-1240v1 and E3-1240v2 so for most people it will be an upgrade. As for memory, we are currently short on that, but if your package comes with 32GB RAM and you actually require 32GB RAM, you can let us know. Otherwise, you will be able to opt in for a small amount of additional saving instead (TBD.)\r\n\r\nThis migration is expected to happen sometime between 09/30/2021 and 04/30/2022, but is not guaranteed. You can of course decide to discontinue renewal if you wish, before the migration happens (at end of term, as usual.)\r\n\r\n\r\n**LOCATIONS:**\r\nThe following locations are planned to be offered, but may change.\r\n\r\n* NYC Metro\r\n* Los Angeles\r\n* Amsterdam\r\n* Chicago\r\n* Dallas\r\n* Atlanta\r\n* Seattle\r\n* Phoenix\r\n* San Jose\r\n* Other*\r\n\r\n*If at least 10 customers elect to move to a new location, we will expand there, provided that colocation cost in the region is similar to others. Unfortunately, this means a location such as Japan would not be available since it would cost several times more.\r\n\r\n&lt;h1&gt;OPTIONAL RYZEN UPGRADE&lt;/h1&gt;\r\n____________\r\n\r\nThere's no reason for us to set up older hardware if you would prefer to pay an additional amount to upgrade to a Ryzen server instead. We will allow anyone to upgrade their service if desired, when migrating. This must be selected/arranged before migration occurs and cannot be altered at a later time. We will have a set deadline, at a future time per our communication.\r\n\r\n**Switch to Ryzen 3700X/5600X or Equivalent + NVMe**\r\n\r\n* We will decide on a suitable Ryzen processor. This may range from 6 to 8 cores and generally be in the $200 to $300 price range, with 65W TDP. \r\n* Your 2x1TB SSD option will change from SATA to 2x 1TB NVMe SSD.\r\n* RAM amount will most likely be 32GB DDR4 but we may provide 64GB DDR4 at an additional cost to be determined based on RAM pricing at time of deployment (+$10-15/MO.)\r\n\r\n**Additional Cost:**\r\n +$350 ONE-TIME | _OR_ | +$200/YR | _OR_ | +$40/MO \r\n\r\nThese are not meant to be an \"upsell\" so please do not feel obligated. In fact, this ends up costing us more money so we discourage it ;)\r\n\r\nExample:\r\nE3-HDL purchased for $27.30/MO or $273/YR becomes $67.30/MO or $473/YR with no setup fees. Or, optionally remain at $27.30/MO or $273/YR with $350 one-time fee.\r\n\r\n\r\n&lt;h1&gt;LOOKING FOR A VPS?&lt;/h1&gt;\r\n____________\r\n\r\nCheck out our other thread: https://www.lowendtalk.com/discussion/172467/virmach-s-u-m-m-e-r-h-o-s-t-s-a-l-e-from-9-yr-1gb-15-yr-transfers-to-ryzen-easter-eggs\r\n\r\n\r\n&lt;h1&gt;SUPPORT LEVEL&lt;/h1&gt;\r\n____________\r\n\r\nWe have decided to provide these migration specials with a standard level of support (excluding one-time limited term offers.) This means that the migration plans are not limited support specials, but please understand that due to the pricing of the package, we do still expect customers to take some time to review knowledgebase articles to ensure they only contact us when necessary. This also does not mean we will provide full management, so please do not create a ticket asking us to set up your website/software for you.\r\n\r\nIn addition, for dedicated servers, this means being reasonable: currently, password resets and OS re-installs are still manual, if you make excessive requests we reserve the right to refuse them.\r\n\r\n&lt;h1&gt;REFUND&lt;/h1&gt;\r\n____________\r\n\r\nThere are no refunds on dedicated servers, as usual.\r\n\r\nPlease read our refund policy first before ordering: https://virmach.com/terms-conditions/\r\n\r\n&lt;h1&gt;OTHER TERMS/DISCLAIMER&lt;/h1&gt;\r\n____________\r\n\r\nWe reserve the right to cancel and refund any service and opt not to render it instead (this will usually be reserved in case of major issues with the package or estimated delivery times, typos, or our ability to deliver the product should it be sold out.) All promotion/coupon codes for this offer are one-time use only per household, and non-recurring. See \"REFUNDS\" section above for the refund terms.\r\n\r\n&lt;h1&gt;DOUBLE BANDWIDTH&lt;/h1&gt;\r\n____________\r\n\r\nNo\r\n\r\n\r\n"}