{"id": 172829, "date": "2021-07-24 15:52:51", "user": "MannDude", "post": "![](https://cdn.incognet.io/imgs/cryptomonth.jpg \"Buy a VPS with Crypto!\")\r\n\r\nThis is the last week of our Crypto Month promotion. After this, all KVM VPS plans will be sold at the normal crypto-discount of a fluctuating 10-30% depending on availability of services and other factors. Secure your IncogNET service today for 50% off the normal advertised pricing. All discounts are recurring and for the life of your product.\r\n \r\n**Links:**\r\n- WWW Site: https://incognet.io\r\n- Tor Site: http://incogwebxwgsnbkrquxku3qwh5qkywvlet77st5i5tcvqmq4xdmspuad.onion/\r\n- I2P Site: ( [.i2p](http://webhosting.i2p \".i2p\") | [.b32](http://hxqjbkpn5fxnmurlab6oluyqf3dd2xnxszeawn4ak2s4rpjnfheq.b32.i2p/ \".b32\") | [Helper](http://webhosting.i2p/?i2paddresshelper=-SEqVR40tBx5Cf3BVJzQL9JFL21DfOwCx7rLlljBNgACvptT5mEEbVzdKvPcaC1J8zc68r66yHZihkpPi4FiYWOuAKvR~kxcI00r57uNUBAYiG8DTcXZ1WO2oVbREyRB8zY5-fqZx~rFNfqqu5Aty8AVS6bCsbmYAuAmZ4tFv76rMJJGvbpDMXvJ5Xk5WR8XJGBlM6ZYFJoDKBYmw5UKeRZmH7b4T4B616Hn~n2rgY7yg3-y967WYQSzxocz2mcg9RwBNFD5lYUYA2S7r8scQazFfZrBWsyLOrpI-aIilLQUMNrSvYYRGR4PxWzUWJiIseh89y0IwJ~233AopdFUhzncyA7zZIYEXn0nT6OHpeIdvQuwU0G2f6gWZMAqPntg9qAhkV4RyMes1aDPK~ZHNfSlLu8brO3I4uCvOJOysWbb4-rVQJQcJwERRjAe6UYzedBvIOlTPkFFqgpxUp0iSJDXjID6fs1kQ9En05Iq4tbsn7uD7SiprLIf2TL8ILQ-BQAEAAcAAA== \"Helper\") )\r\n- Yggdrasil Site: ( [IPv6](http://[201:4018:2546:daa5:aaed:dddf:c034:6142]/ \"IPv6\") | [.YGG](http://webhosting.ygg \".YGG\") )\r\n- Privacy Policy: https://incognet.io/privacy\r\n- TOS &amp; AUP: https://incognet.io/legalstuff\r\n- About IncogNET: https://incognet.io/about\r\n\r\n ---\r\n\r\nThe entire month of July is, \"Crypto Month\" at IncogNET and we're offering huge savings over our regularly priced plans. The coupon code, \"CRYPTOMONTH\" works on all Shared Hosting, Ad-Block VPN and KVM VPS plans. Deal is recurring and for the life of your product/service. Promotion ends July 31st, 2021.\r\n\r\nWe accept: BTC, BCH, DASH, DOGE, ETC, ETH, LTC, OXEN, THETA/TFUEL, &amp; XMR.\r\n\r\nWe also accept PayPal/Card, and you can use coupon code: LETJULY to save 30% off any order of any plan!\r\n \r\n---\r\n\r\nThe following plans are located in Helsinki, Finland with Hetzner. We will be expanding into a new location in the Netherlands likely within the following month, with brand new hardware and our own v4/v6 IP space. Our goal is to make NL, and an undecided US location, to be our two main flagship locations for shared hosting and our VPS services. We'll continue to stock Finland as interest is gauged and/or needed, though likely smaller deployments similar to the nodes we already have there.\r\n\r\nAll servers in are powered by AMD Ryzen CPU's and now have NVMe storage.\r\n\r\n**Finland Looking Glass:** https://lg-fin.incognet.io/\r\n\r\n**KVM-512**\r\n \r\n          Location: Helsinki, Finland\r\n          vCPU: 1 cores @ 3Ghz+\r\n          RAM: 512MB\r\n          Disk: 20GB\r\n          IPv4: 1\r\n          IPv6: Unavailable, sorry.\r\n          BW: 1TB @ 1Gbps\r\n          DDoS Protection\r\n           -----------\r\n          Was: $5.00 / mo\r\n          Now: $2.50 / mo\r\n  \r\n **[Order Here](https://portal.incognet.io/cart.php?a=add&amp;pid=17 \"Order Here\") with coupon: CRYPTOMONTH**\r\n  \r\n  **KVM-1024**\r\n  \r\n          Location: Helsinki, Finland\r\n          vCPU: 1 cores @ 3Ghz+\r\n          RAM: 1024MB\r\n          Disk: 25GB\r\n          IPv4: 1\r\n          IPv6: Unavailable, sorry.\r\n          BW: 3TB @ 1Gbps\r\n          DDoS Protection\r\n           -----------\r\n          Was: $9.00 / mo\r\n          Now: $4.50 / mo\r\n  \r\n  **[Order Here](https://portal.incognet.io/cart.php?a=add&amp;pid=18 \"Order Here\") with coupon: CRYPTOMONTH**\r\n  \r\n  **KVM-2048**\r\n  \r\n          Location: Helsinki, Finland\r\n          vCPU: 1 cores @ 3Ghz+\r\n          RAM: 2048MB\r\n          Disk: 30GB\r\n          IPv4: 1\r\n          IPv6: Unavailable, sorry.\r\n          BW: 5TB @ 1Gbps\r\n          DDoS Protection\r\n           -----------\r\n          Was: $13.00 / mo\r\n          Now: $6.50 / mo\r\n  \r\n **[Order Here](https://portal.incognet.io/cart.php?a=add&amp;pid=18 \"Order Here\") with coupon: CRYPTOMONTH**\r\n  \r\n  ---\r\n  \r\n**Need more resources? Want to pay via traditional methods?** Promotion applies to all plans. See all of our plans and pricing here: https://incognet.io/vps\r\n  \r\n  ---\r\n  \r\nOur **[Ad and Bullshit Blocking VPN Service](https://incognet.io/vpn \"Ad and Bullshit Blocking VPN Service\")** is also available at 50% off. We operate our own anycast \"DNS Over Tor\" network, which is where we filter out all the \"BS\" like ads, trackers, telemetry gatherers and other known malicious domains from resolving over our VPN network.\r\n  \r\nThis is a barebones service. You get an OpenVPN configuration file for each location you select. We suggest that you use the _official_ OpenVPN apps for your desktop, server, or mobile devices.\r\n  \r\nThere is no tracking, no logging, no data caps. If you order the \"Pick 3\" plan, you can use one configuration file on your phone, another on your desktop, and give one to a friend and all be connected at the same time.\r\n\r\n  \r\n          VPN LOCATIONS AVAILABLE\r\n          Helsinki, Finland (Hetzner)\r\n          Roost, Luxembourg (BuyVM)\r\n          Kiev, Ukraine (Ukrainian Data Network)\r\n          Las Vegas, USA (BuyVM)\r\n          New York, USA  (BuyVM)\r\n\r\n  \r\n          VPN PLANS INCLUDE\r\n          No Data Caps\r\n          No Logging\r\n          DNS over Tor\r\n          Blocks Advertisements\r\n          Blocks Web Trackers\r\n          Blocks Malware\r\n          Multiple VPN Locations\r\n          Crypto Accepted\r\n          No Personal Details Required\r\n          OpenVPN protocol (WireGuard soon!)\r\n          -----------\r\n          Pricing:\r\n          -----------\r\n          Choose 1 location: Was $2/mo, now $1/mo.\r\n          Choose 3 locations: Was $4/mo, now $2/mo.\r\n          Choose 5 locations: Was $6/mo, now $3/mo.\r\n  \r\n**Order Now:** **[Choose 1 Location](https://portal.incognet.io/cart.php?a=add&amp;pid=24 \"Choose 1 Location\")** or **[Choose 3 Locations](https://portal.incognet.io/cart.php?a=add&amp;pid=13 \"Choose 3 Locations\")** or **[Choose 5 Locations](https://portal.incognet.io/cart.php?a=add&amp;pid=12 \"Choose 5 Locations\")**.\r\n  \r\nNOTE: That VPN orders are manually setup. After payment clears, it could be 0 - 12 hours before I get you setup. Once setup, you'll be notified via email/ticket and will have a configuration file available from your client portal for each of the locations that you choose.\r\n \r\nIf you select the same location more than once when ordering, you will receive however many configurations for that location that you choose. IE: Order the \"Pick 3\" plan and choose 2 New York and 1 Luxembourg = You'll receive 2 separate New York configuration files and 1 Luxembourg configuration file.\r\n \r\n---\r\n\r\nWhy choose IncogNET?\r\n\r\nWe wish to normalize privacy in an industry that has relatively invasive common practices and are huge supporters of existing pro-privacy projects, a few of which are listed below. Although our small business has only been operating since April, it's powered by competent people who have been in the industry for many years. Our goal is to have privacy meet performance, by offering no-nonense services that allow our customers to browse and publish content in a manner that respects their privacy.\r\n\r\nSome of the pro-privacy projects we run or sponsor:\r\n\r\n* https://tube.incognet.io/ - A YouTube proxy allowing you to browse YouTube without ads, javascript, or trackers. Download videos direct from the browser with no 3rd party browser extension required or command line tools, and watch videos and listen to music on mobile devices without needing the official YT app. This allows playback to be achieved while your phone's screen is off, or when using other apps. These are things you can not do with the official YouTube app. Powered by Invidious, an open source YT proxy, we offer this site as a privacy respecting alternative to YouTube that will work on all platforms.\r\n\r\n* We are huge supporters of the I2P anonymity network, and namely the [I2P+ router console software.](https://i2pplus.github.io/ \"I2P+ router console software.\") We sponsor the default I2P+ outproxy ( purokishi.i2p ) and will provide bandwidth and resources in each location of ours as needed by the project. You can also find that webhosting.i2p, our I2P eepsite, is available directly from the [I2P+ router console software](https://i2pplus.github.io/ \"I2P+ router console software\") current developmental releases and will be available for all in the next major release. Learn how to run a high performance I2P+ router on our VPS plans by following our guide here: https://incognet.io/blog/how-to-install-i2p-on-a-linux-vps.html\r\n\r\n* On the ever-growing to-do list includes us updating our [Yggdrasil Network](https://yggdrasil-network.github.io/ \"Yggdrasil Network\") peer nodes to support the latest update to the protocol, as well as launched our public ZeroNet tracker to help support yet another great anonymity network project.\r\n\r\n---\r\n \r\nLet us know if you have any questions or concerns. \r\n\r\n"}