{"id": 172937, "date": "2021-07-29 06:02:45", "user": "OVH_APAC", "post": "#Exclusive offer on Powerful and budget friendly professional Dedicated servers \"RISE-1\"\r\n\r\n* Starting from US$39.55/month \r\n* Offer valid for as long as you keep your server\r\n* The most competitive price-performance ratio for professional Dedicated servers\r\n* Limited to the first 400 servers ordered.\r\n* Hosting locations in Europe &amp; North America \r\n* Valid for APAC &amp; DE residents only via websites listed below. \r\n\r\n**3 offers based on commitment:**\r\n\r\n* 18% OFF LIFETIME on a month to month plan (Setup fee applies) --&gt; US$ 51.65/month (+Setup fee)\r\n* 27% OFF LIFETIME with a 12-month commitment + No setup fee --&gt; US$ 45.33/month\r\n* **37% OFF LIFETIME** with a 24-month commitment + No setup fee --&gt; **US$ 39.55/month**\r\n\r\nDiscount is only applied on the base price of a RISE-1 Dedicated Server (=excluding paid options)\r\n  \r\n**Rise-1 Dedicated Server:**\r\n\r\n* Intel Xeon E3-1230v6 - 4c/8t - 3.5 GHz/3.9 GHz\r\n* 32 GB DDR4 ECC 2133MHz (or 64GB RAM paid option)\r\n* 2 x 2TB HDD SATA (or  SSD NVMe disks and hybrid paid options)\r\n* 500Mbps bandwidth\r\n* Unmetered data traffic\r\n* Anti-DDoS Protection included\r\n* 500GB free backup storage space (up to 10TB paid options)\r\n* Each server has a public IPv4 address and an IPv6 address range (Up to 256 IPv4 with one-off fee/IPv4 – no monthly recurring fee)\r\n\r\n\r\n#Offer exclusively available to Asia-Pacific residents &amp; Germany AND only via the following websites:\r\n\r\n* Asia US$: https://www.ovhcloud.com/asia/bare-metal/rise/rise-1/ \r\n* Singapore S$: https://www.ovhcloud.com/en-sg/bare-metal/rise/rise-1/ \r\n* Australia A$:https://www.ovhcloud.com/en-au/bare-metal/rise/rise-1/\r\n* Germany €: https://www.ovhcloud.com/de/bare-metal/rise/rise-1/\r\n\r\n\r\nAbout OVH\r\nOVHcloud is a global player and the leading European cloud provider operating 400,000 servers within its own 32 data centers across 4 continents. For more than 20 years, the Group has been leveraging an integrated model that provides full control of our value chain, from designing our servers to managing our data centers through to orchestrating our fibre-optic network. This unique approach enables OVHcloud to cover, independently, the full spectrum of use cases for our 1.6 million customers across 140 countries. OVHcloud now offers customers the latest-generation solutions that combine high performance, predictable pricing and full data sovereignty to support their unfettered growth."}