{"id": 173029, "date": "2021-08-03 14:37:20", "user": "rustelekom", "post": "Hello everyone!\r\n\r\nFrom our last post we taken some measurements to make our site more friendly for English spoken visitors. What we did:\r\n\r\n1) Most of important content translated to English language.\r\n2) Steps of order process also is translated to English language.\r\n3) Prices in Russian rubles shown on site now have equivalent in Euro.\r\n\r\nAlso some changes happen in prices - price for additional IPv4 was increased to 140₽ (~1,54€)\r\nLicense types and prices changed for popular control panel  ISPmanager.\r\n\r\nAlso we switched our phone verification system from sending verification code by SMS to voice call. You will receive your code on same language which you use when visit our site.\r\n\r\nAlso we improve our  VPS management panel and now you can upload your own .ISO image (image size should be less than 2GB) without touching support.\r\n\r\nExcept above prices remain is same. For virtual servers in Germany and Netherlands:\r\n\r\n**Pluto** 1 vCPU 512 MB RAM 10 GB SSD storage upto 100 Mbit/sec 129₽/mo  (~ 1,43€)\r\n**Mercury** 1 vCPU 1 GB RAM 20 GB SSD storage upto 100 Mbit/sec 199₽/mo  (~ 2,21€)\r\n**Mars** 2 vCPU 2 GB RAM 30 GB SSD storage upto 200 Mbit/sec 299₽/mo  (~ 3,32€)\r\n**Venus** 3 vCPU 3 GB RAM 50 GB SSD storage upto 200 Mbit/sec 479₽/mo  (~ 5,32€)\r\n**Earth** 4 vCPU 4 GB RAM 60 GB SSD storage upto 200 Mbit/sec 599₽/mo  (~ 6,65€)\r\n**Neptune** 5 vCPU 6 GB RAM 100 GB SSD storage upto 200 Mbit/sec 999₽/mo  (~ 11,1€)\r\n**Uranus** 6 vCPU 8 GB RAM 130 GB SSD storage upto 250 Mbit/sec 1399₽/mo  (~ 15,5€)\r\n**Saturn** 8 vCPU 16 GB RAM 240 GB SSD storage upto 250 Mbit/sec 2599₽/mo  (~ 28,88€)\r\n**Jupiter** 10 vCPU 24 GB RAM 20 GB SSD storage upto 250 Mbit/sec 3999₽/mo  (~ 44,43€)\r\n\r\nTraffic is unmetered.\r\n\r\nFor FTP backup storage in Germany:\r\n\r\n**SELASTIC** (Network storage with disk space from 1 GB upto 5000 GB. Disk space size can be changed anytime \"on the fly\". ) - 1₽ per GB (~ 0,01€)\r\n**500GB** - 349₽/mo (~ 3,87€)\r\n**1TB** -  649₽/mo (~ 6,8€)\r\n**2TB** - 949₽/mo (~ 10,5€)\r\n**5TB** - 2199₽/mo (~ 24,43€)\r\n\r\nStorage based on RAID10 h/w controller with battery, port is 1 Gbit/sec.\r\n\r\nTraffic is unmetered.\r\n\r\nDedicated servers on site offered in Germany location but we could offer also Netherlands:\r\n\r\n**Dell R210 II 1 x Quad Core Xeon E3-1230v2 SATA 16 GB 2 x 1 Tb SATA - 30 €/mo**\r\n\r\n**Looking glass** for Germany and Netherlands location can be found at https://www.robovps.biz/en/help/55-our_data_center.html\r\n\r\nFeel free touch us for presales question by webchat on site or by contact email: support@rustelekom.net\r\nWe accept Cards, PayPal, PaySera, QIWI, Webmoney, Crypto (BTC, ETH etc.) payments. "}