{"id": 173128, "date": "2021-08-06 18:43:32", "user": "jar", "post": "I needed a break from data entry, which has been a constant task since migrating from WHMCS to HostBill. Loving HB so far, but it's a lot of work :smile: \r\n\r\nMy friends, a comrade in our industry is falling and you hate to see it: https://www.tuffmail.com/\r\n\r\nOut of respect for what they've done and their success, we're looking to give a home to customers that may be looking for a new one. With promo code \"TUFFMAIL\" you can get 25% off of all MXroute services, even the lifetime promo. If you're not coming from Tuffmail, feel free to cash in one it as well. It's a recurring promo for as long as you keep the package.\r\n\r\nIf you're not familiar with MXroute, let's get to the introduction:\r\n\r\nMXroute is an email provider where customers bring their own domains. Our customers range from well funded startups to that guy in the corner over there trying to hack all of your cell phones while you read this, just to see if he can do it. We provide all of the universal standards you should expect: IMAP, SMTP, POP3. We have a DirectAdmin-based control panel and while it isn't everything you've dreamed of for managing email it does a pretty damn good job, and it's not really our selling point. We offer the finest webmail you've ever laid eyes upon called Crossbox, both for your browser and with our native branded apps for both iOS and Android. We're still rocking Roundcube and Rainloop because you've gotta have those time tested standbys (and personally I use Roundcube more than anything, just habit). We use rspamd for our inbound filtering system, and frequently update custom rules based on identified trends. Yeah we know it's not Google's anti-spam system, but we're trying to challenge the market not mirror it ;)\r\n\r\nWe've also just added a new webmail option recently: Afterlogic Pro. That's right, not the free version you might be used to. We took your money and put it right back into your service. Afterlogic Pro includes CalDAV and CardDAV, which have been significant feature requests for a long time.\r\n\r\nBut what really sets us apart? We believe we have the secret sauce for outbound delivery. The reason the answer is no to your question of \"Do you offer dedicated IP addresses\" is because what we offer could take 1500 dumps on your dedicated IP address by the time you finished writing your email. If we can't get your email to your recipient, either your recipient doesn't want it or you typed the wrong email address. If an email is rejected for IP reputation we shuffle the deck and send it from another IP. We do this repeatedly, and from different ranges, until it's either delivered or we're absolutely certain they're not going to accept it. We do this all while rejecting FAR less of your outbound emails than the outbound service we used a few years ago did (back before we completed our in-house relays). We keep you safe from bad neighbors, and you can see for yourself what they think of us: https://www.trustpilot.com/users/5d9dc082d5e7683c5227754c\r\n\r\nWe're focusing on our normal packages this time instead of adding new promo packages. Here's what we've got:\r\n\r\n- Small\r\n- 10GB Storage\r\n- Unlimited Emails/Domains\r\n- 300 outbound per hour (per email address, don't create emails solely to circumvent)\r\n- $33.75/year with promo code TUFFMAIL\r\n- https://accounts.mxroute.com/?cmd=cart&amp;action=add&amp;id=90\r\n\r\nAnd...\r\n\r\n- Medium\r\n- 25GB Storage\r\n- Unlimited Emails/Domains\r\n- 300 outbound per hour (per email address, don't create emails solely to circumvent)\r\n- $41.25/year with promo code TUFFMAIL\r\n- https://accounts.mxroute.com/?cmd=cart&amp;action=add&amp;id=91\r\n\r\nWhile the code applies for others, we're sticking to the shared hosting pricing rules as that seems most comparable to our service model.\r\n\r\nPeace, love, and fuck the police."}