{"id": 173244, "date": "2021-08-13 03:25:48", "user": "MannDude", "post": "Happy Friday the 13th!\r\n\r\n[IncogNET](https://incognet.io \"IncogNET Amsterdam KVM VPS\") is proud to announce our expansion to the Netherlands. From our new home we are able to offer our full line of services, including our [CloudLinuxOS Shared Hosting](https://incognet.io/webhosting \"CloudLinuxOS Hosting in the Netherlands\") (Reseller Soon), [KVM VPS](https://incognet.io/vps \"KVM VPS\") as well as the sixth location for our [\"BS\" Blocking VPN](https://incognet.io/vpn \"Ad Blocking VPN\") service. Our new presence in the Netherlands allows us to utilize our own IP space (ASN Soon) and operate on a network that is better suited for connectivity to the rest of Europe, the US and the world.\r\n\r\n**Quick Details and Answers to Common Questions:**\r\n- **Website**: https://incognet.io\r\n- **I2P Site**: http://webhosting.i2p ([B32 Address](http://hxqjbkpn5fxnmurlab6oluyqf3dd2xnxszeawn4ak2s4rpjnfheq.b32.i2p/ \"B32 Address\") | [Address Helper](http://webhosting.i2p/?i2paddresshelper=-SEqVR40tBx5Cf3BVJzQL9JFL21DfOwCx7rLlljBNgACvptT5mEEbVzdKvPcaC1J8zc68r66yHZihkpPi4FiYWOuAKvR~kxcI00r57uNUBAYiG8DTcXZ1WO2oVbREyRB8zY5-fqZx~rFNfqqu5Aty8AVS6bCsbmYAuAmZ4tFv76rMJJGvbpDMXvJ5Xk5WR8XJGBlM6ZYFJoDKBYmw5UKeRZmH7b4T4B616Hn~n2rgY7yg3-y967WYQSzxocz2mcg9RwBNFD5lYUYA2S7r8scQazFfZrBWsyLOrpI-aIilLQUMNrSvYYRGR4PxWzUWJiIseh89y0IwJ~233AopdFUhzncyA7zZIYEXn0nT6OHpeIdvQuwU0G2f6gWZMAqPntg9qAhkV4RyMes1aDPK~ZHNfSlLu8brO3I4uCvOJOysWbb4-rVQJQcJwERRjAe6UYzedBvIOlTPkFFqgpxUp0iSJDXjID6fs1kQ9En05Iq4tbsn7uD7SiprLIf2TL8ILQ-BQAEAAcAAA== \"Address Helper\"))\r\n- **Tor Site**: http://incogwebxwgsnbkrquxku3qwh5qkywvlet77st5i5tcvqmq4xdmspuad.onion/\r\n- **Yggdrasil Site**: http://[202:7f4c:a4fe:e85b:4410:21f4:7b8c:99c]/\r\n- **Payments Accepted**: BTC, BCH, DASH, DOGE, ETC, ETH, LTC, OXEN, THETA/TFUEL, XMR, &amp; PayPal + Cards (Processed by PayPal).\r\n- **TOS and AUP**: https://incognet.io/legalstuff\r\n- **Business Docs**: [Here](https://wyobiz.wyo.gov/Business/FilingDetails.aspx?eFNum=229163159131103035162114075077079168168187129050 \"Here\")\r\n- **Tor Exits?**: Yes, but utilize a strict exit policy. Abuse complaints will be forwarded to you. If any single exit becomes too much of a headache or causes concerns from the owner of the ASN we announce under then we will ask you to move. Sorry. We love and support Tor but until we operate our own ASN we have to be a bit strict on exits to keep people above us happy.\r\n- **How much bandwidth can I use?**: 100% of what is allocated to your VPS. It's there for you to use.\r\n- **Adult Content?**: Legal adult content is fine.\r\n- **Refunds**: Within the first 48 hours. No refund if suspended for abuse. No crypto refunds.\r\n \r\n\r\n\r\n**So, what is IncogNET and why should you consider us as your hosting provider?**\r\n&gt;! IncogNET LLC aims to provide production quality services while normalizing privacy in the digital age. We do things a bit different than you may have seen elsewhere. For starters, our website, ordering system and control panels (where able) are available over the regular internet, as well as the I2P, Tor, and/or Yggdrasil networks for additional end-user privacy. We require no personal identifying information and operate under the unofficial motto of, “We can not share what we do not know.”\r\n&gt;! \r\n&gt;! Our CloudLinuxOS based shared hosting features a beta, manually activated but free opt-in option to have your website made natively available to the Tor and I2P network. This is an attempt on our part to make normal, regular, everyday type of content available on these networks in the hopes that it encourages normal, regular use of them.\r\n&gt;! \r\n&gt;! We are big supporters of anonymity network projects such as I2P, where we sponsor the default I2P+ outproxy (purokishi.i2p) to make clearnet web traffic available through the network. We also donate resources to the Yggdrasil project, an early-stage implementation of a fully end-to-end encrypted IPv6 network. We use Yggdrasil everyday in combination with the I2P network in way to secure HTTP tunnels made from the I2P network to non-I2P end-servers (such as those hosting our website). In fact, you may have noticed our website under the, “Sites Of Interest” in I2P+’s router console software as seen here. Our in-house, anycast DNS network also bridges the Tor network to serve DNS requests for our VPN service and from all provisioned VM’s by default.\r\n&gt;! \r\n&gt;! But really, at the end of the day, we’re just a small team of nerds who have been in the industry in various roles for a very long time. We believe that freedom of expression is a fundamental human right that should be offered to all and that seeking privacy is totally normal, and not just something reserved for activists, journalists, criminals or whistleblowers. Everyone, even you (yes you!) benefit from privacy respecting services.\r\n&gt;! \r\n&gt;! With that said, we have a very reasonable TOS and AUP that we do enforce. Just because we encourage privacy and support free speech does not mean we allow our network to be abused or used in ways that’d negatively impact the quality or experience for others.”\r\n\r\n\r\n**The Deals**\r\n\r\nThat's what you're here for, right? We have two great deals for you today.\r\n\r\nDeal #1: What if we took 25% off the package cost? _Not good enough?_ Fine, how about we **DOUBLE THE RAM** too. Now _that_ is a great deal.\r\n\r\n**25% off and DOUBLE RAM** on our first three plans. Just contact support after ordering and we'll double that ram for you as quickly as possible. Use coupon: _FRITHE13TH_\r\n\r\nDeal #2: Check out [LowEndBox](https://lowendbox.com \"LowEndBox\") and look for our Friday the 13th special for a deal on 13 months of KVM VPS service.\r\n\r\n\r\n**KVM-512**\r\n- vCPU: 1 cores @ 3.8Ghz\r\n- RAM: ~~512MB~~ _1024MB with deal_\r\n- Disk: 20GB\r\n- IPv4: 1 IP\r\n- IPv6: /64 included\r\n- BW: 1TB @ 1Gbps\r\n- DDoS Protection up to 50Gbps\r\n\r\n**Now just $3.75/mo**\r\n\r\nUse Coupon: FRITHE13TH\r\n\r\n[[Order Now w/ PayPal or Card](https://portal.incognet.io/cart.php?a=add&amp;pid=31 \"Order Now w/ PayPal or Card\")]\r\n[[Order Now w/ Crypto](https://portal.incognet.io/cart.php?a=add&amp;pid=25 \"Order Now w/ Crypto\")]\r\n\r\n\r\n**KVM-1024**\r\n- vCPU: 1 cores @ 3.8Ghz\r\n- RAM: ~~1024MB~~ _2048MB with deal_\r\n- Disk: 25GB\r\n- IPv4: 1 IP\r\n- IPv6: /64 included\r\n- BW: 3TB @ 1Gbps\r\n- DDoS Protection up to 50Gbps\r\n\r\n**Now just $6.75/mo**\r\n\r\nUse Coupon: FRITHE13TH\r\n\r\n[[Order Now w/ PayPal or Card](https://portal.incognet.io/cart.php?a=add&amp;pid=32 \"Order Now w/ PayPal or Card\")]\r\n[[Order Now w/ Crypto](https://portal.incognet.io/cart.php?a=add&amp;pid=26 \"Order Now w/ Crypto\")]\r\n\r\nCoupon also works on our 2048 plan (Making it 4096MB of RAM), but the price is above the $7/mo limit so not listing the order links here. \r\n\r\n\r\n**NETWORK INFO:**\r\n\r\n    Worldstream – Naaldwijk, Netherlands\r\n        Test IPv4: 23.184.48.5\r\n        Test IPv6: 2602:fd92:509:93da:1:2:3:4\r\n        https://lg-nl.incognet.io/100MB.test\r\n        Looking glass: https://lg-nl.incognet.io/\r\n\r\n\r\n"}