{"id": 173241, "date": "2021-08-12 21:41:38", "user": "ezeth", "post": "Let's do it. Here comes the final offer for 2021. Over the past month that we have been active here on LET we've sold over 50% of our stock (mainly to bulk orders). In fact, out of the 150 customers we've got over the past month, we've provisioned over 500 VMs.\r\n\r\nA big thanks to all our customers, and I wish you a very boomery year.\r\n\r\nWe'll be back around January 2022 with some storage deals. So be sure to set a reminder on your calendar.\r\n\r\nNevertheless, here's our final offer for the year. VALID until stock sells out.\r\n\r\n**_you're only allowed to buy one VPS. NO BULK ORDERS. Orders are manually activated and inspected to be sure you only buy one of this promotion VPS._**\r\n\r\n**_Please DO NOT order more than one. If you order more than one it's not possible to get a refund_**\r\n\r\nIf you want to buy more than one VM from boomer.host, I recommend that you take a look at our previous offers.\r\n\r\n1 CPU\r\n15 GB SSD Storage\r\n1 GB RAM\r\n1000 GB Monthly Transfer\r\n250Mbps Network Port\r\n1 Dedicated IPv4 &amp; IPv6 Address\r\nOVZ7 / Virtualizor Control Panel\r\nFREE snapshot - WOW\r\nAbility to set reverse DNS\r\nONLY $0.5 first year. Recurring $19.95 per year!\r\n[ORDER NOW. Promotion VPS, MAX 1 per customer](https://my.boomer.host/order.php?step=1&amp;productGroup=4&amp;product=19 \"ORDER NOW. MAX 1 per customer\")\r\n_____________________\r\n**Network info**\r\n64.112.124.124\r\n2001:550:3402:32:0000:0000:0039:3d94\r\n\r\nData Ideas datacenter in Texas\r\n_____________________\r\n**Other important information**\r\nSMTP and all mailing ports are also blocked permanently\r\n\r\nPort Speed: 250MBit\r\n\r\nYou can choose Ubuntu 20.04 or Centos 7. We utilize OpenVZ 7\r\n\r\nNo abuse of resources or any kind of abuse. Fair usage on CPU. Rule of thumb is, if it's ilegal, attract DDoS, then it's NOT okay! Abusers will be terminated without notice or refund.\r\n_____________________\r\nEMAIL US: boom@boomer.host\r\nCALL US: 856-676-4328\r\nWe're here 8AM-10AM (Central Standard Time)\r\nAny questions, please feel free to ask.\r\n\r\nThanks to @SirFoxy for https://www.lowendtalk.com/discussion/173200/marketing-101-a-msg-to-providers/p1"}