{"id": 174148, "date": "2021-09-28 11:56:52", "user": "GameTownProjects", "post": "Hello, we are KTS24, an international cloud provider from the heart of Germany in the beautiful Eifel region. We rent KVM server series for different application areas from Teamspeakserver, over Minecraftserver up to Dedicated Server solutions. \r\n \r\n![](https://kts24.com/kts24/img/kts24_logo.png \"\")\r\n\r\nAn outstanding characteristic of KTS24 is hidden in our origin. \r\nFrom a common hobby the interest and the fun in the work grew. The binding enthusiasm ensures that we do not just work, but burn for the work and were forged into a team on the anvil of daily challenges as well as ups and downs. \r\n\r\nAll our offerings are protected against downtime by our DDoS Protection and are located in our colocation in the Netherlands.\r\nYou would like to test our connection? Use our Looking Glass to convince yourself of our network quality: https://lg.nl.haendler.it/\r\n\r\n\r\n\r\n## Starting with the cheapest deals ever from us we have prepared some great offers for 09/28 and 09/29/2021. It should be noted that the number is very limited and no further capacity will be made available. So you have to act fast!\r\n\r\n&gt; **SSDG1 1EUR Special**\r\n&gt; 1 vCore\r\n&gt; 512 MB Ram\r\n&gt; 5 GB SSD storage\r\n&gt; No public IPv4 includet!\r\n&gt; \r\n&gt; _**First year for only 1 €! After this year we will charge 6 € / year for an extend.**_\r\n\r\n\r\n## Or with public IPv4 after all? We have the perfect offer!\r\n\r\n&gt; **SSDG1 5EUR Special**\r\n&gt; 1 vCore\r\n&gt; 1024 MB Ram\r\n&gt; 10 GB SSD storage\r\n&gt; Public IPv4 inclusive!\r\n&gt; \r\n&gt; _**First year only 5 € / year! After this year we will charge 15 € / year for an extend.**_\r\n\r\n\r\n\r\n\r\n## You need more power? Get a permanent 50% discount on our Dedi VPS offers!\r\n\r\n\r\n\r\n&gt; **Dedi VPS – 6 GB**\r\n&gt; 1 Intel E5 2680v2 Thread\r\n&gt; 6 GB Ram\r\n&gt; 25 GB SSD storage\r\n&gt; Public IPv4 inclusive!\r\n&gt;     \r\n&gt; _**Now for only 3,99 € / month. For ever!**_\r\n\r\n\r\n\r\nWe reserve the right to publish additional offers should the SSDG1 servers sell out as fast as we hope :) So it is worth to visit us regularly: https://kts24.com/special_offers\r\n\r\n\r\nPlease read our terms and conditions before ordering. We do not offer a money back guarantee or anything like other sellers do and will block any customer account that opens a Paypal case."}