{"id": 174167, "date": "2021-09-29 03:59:48", "user": "BharatB", "post": "Hey Folks,\r\n\r\n**ReadyDedis** has been a stable and growing company and has been in business for the past 4 years, we specialize in managed services on cloud platforms like AWS, DO, GCP &amp; Azure. We also have our own lineup of powerful KVM instances at 10 different locations in the world with more to come.\r\n\r\n**ReadyDedis** is now headed over to hourly billed cloud instances powered by AMD Ryzen 3950X and HP NVMe drives. We will kick off with 2 locations Atlanta &amp; Los Angeles and slowly start covering most of the locations in the U.S, an announcement for the beta will be done in the General Section in the following week. Looking forward to the community's support to make it a success!\r\n\r\n\r\n**The following plans are available as per rules and more can be browsed on our website**\r\n\r\n|Processor|Plan|Resources|Price|\r\n| --- | --- | --- | --- |\r\n|Intel|Cloud 1GB|1 core / 1GB / 25GB SSD / Unmetered BW|$4/mo|\r\n|Intel|Cloud 2GB|2 cores / 2GB / 40GB SSD / Unmetered BW|$7/mo|\r\n|AMD|Cloud 1GB|1 core / 1GB / 25GB NVMe / Unmetered BW|$6/mo|\r\n\r\n# Order link for Metered Intel Gold KVM ~~SSD~~ NVMe plans - India\r\n\r\nhttps://readydedis.com/clients/store/cloud-kvm-ssd-vps-mumbai-in\r\n\r\n# Order link for AMD Ryzen Unmetered NVMe KVM\r\n\r\nhttps://readydedis.com/clients/store/ryzen-kvm-nvme-cloud\r\n\r\n# Order link for Intel Unmetered SSD KVM\r\n\r\nhttps://readydedis.com/clients/store/intel-kvm-ssd-cloud\r\n\r\n# Locations\r\n\r\n&lt;strong&gt;New York - Intel\r\nAtlanta - Intel\r\nSeattle - Intel\r\nLas Vegas - Intel\r\nLos Angeles - Intel\r\nJacksonville - Intel\r\nMumbai - Intel - Metered\r\nDallas - AMD\r\nAmsterdam - AMD\r\nFalkenstein - AMD&lt;/strong&gt;\r\n\r\nWe own all our hardware except at select locations such as Germany.\r\n\r\nAll our Intel offerings are on Dell R620 / Supermicro powered - Dual E5 processors and 256GB RAM each powered by Samsung EVO SSD(s) on RAID-10 with the capacity to scale in terms of storage and network on demand.\r\n\r\nAll our AMD offerings are powered by - AMD Ryzen 3950x or 3900x processors with 128GB RAM each powered by 2x4TB NVMe HP drives on RAID-1.\r\n\r\n**Add windows for an additional $3/mo only at any of our locations!**\r\n\r\n**We don't offer DirectAdmin at our Indian location due to cost factors!**\r\n\r\n**Control Panel**\r\nWe use the Hypervisor control panel completely owned and developed by us. It offers you full control over your server and also the ability to use a GUI-based firewall, installation scripts, and ssh keys as well.\r\n\r\n**About Us**\r\nCurrently, we’re a team of experienced system administrators who’ve been exposed to servers, networking, and security. We’re based out of India but our company is registered and incorporated in Delaware, US in the year 2018.\r\n\r\n**24x7 Support**\r\nNormally we have proactive monitoring in place for all our servers, even so, if you should face any problem we’re always available on-call vide our phone number +1 302-597-7085 or our support platform via tickets.\r\n\r\n**Payment Methods**\r\nPayPal | Credit / Debit Card | Bitcoin | Alipay\r\n\r\n**All orders are delivered instantly!**\r\n\r\n**All the servers above 4GB plan come with 1 hour of managed support per month.**\r\n\r\n**We also provide Hybrid servers with dedicated resources custom-tailored to your needs on request**"}