{"id": 175465, "date": "2021-11-26 08:07:51", "user": "jar", "post": "NOTE: I am aware that Sucuri IDS is preventing some users from opening tickets. Email ticketsupport@mxroute.com from the email address that you used to sign up at accounts.mxroute.com if needed. This is temporary and in weighing the pros and cons of a unique situation, this is the lesser evil.\r\n\r\nHey friends,\r\n\r\nThis year I'm keeping it short. If you've been watching, you've noticed that I don't really do many promotions for MXroute throughout the year anymore. This is a trend that will continue into the next year. With that in mind, if you've been waiting for a promotion to jump on board (as so many reach out to me and tell me they are), you shouldn't hold out to see if there's more. With the damage to the hardware market over the last almost two years, the continual drop in overhead over time due to slowly decreasing costs for compute and storage is on pause for the foreseeable future. With such a big question mark hanging out there, my focus is on sustainability.\r\n\r\nMXroute is an email provider where customers bring their own domains. Our customers range from well funded startups to that guy in the corner over there trying to hack all of your cell phones while you read this, just to see if he can do it. We provide all of the universal standards you should expect: IMAP, SMTP, POP3. We have a DirectAdmin-based control panel and while it isn't everything you've dreamed of for managing email it does a pretty damn good job, and it's not really our selling point. We offer the finest webmail you've ever laid eyes upon called Crossbox, both for your browser and with our native branded apps for both iOS and Android. We're still rocking Roundcube and Rainloop because you've gotta have those time tested standbys (and personally I use Roundcube more than anything, just habit). We use rspamd for our inbound filtering system and we have a custom, open source rule set. Yeah we know it's not Google's anti-spam system, but we're trying to challenge the market not mirror it ;)\r\n\r\nThis year we've added Afterlogic Pro which includes CalDAV and CardDAV, two highly requested features. Please note that they are part of a licensed webmail app and not features developed or managed by MXroute, it's unlikely anything there will be adjustable by request.\r\n\r\nOur Black Friday page is live: https://mxroute.blackfriday/\r\n\r\nFirst Promo:\r\n\r\n- BF2021\r\n- 10GB Storage\r\n- Unlimited Domains\r\n- Unlimited Emails\r\n- 300 outbound per hour (per email)\r\n- $10/year\r\n- https://accounts.mxroute.com/?cmd=cart&amp;action=add&amp;id=173\r\n\r\nSecond Promo:\r\n\r\n- BF2021 Medium\r\n- 25GB Storage\r\n- Unlimited Domains\r\n- Unlimited Emails\r\n- 300 outbound per hour (per email)\r\n- $25/year\r\n- https://accounts.mxroute.com/?cmd=cart&amp;action=add&amp;id=174\r\n\r\nA brief FAQ:\r\n\r\nQ: Can I switch my plan to this promo?  \r\nA: You can purchase a new promo and migrate your own data to it freely, but no action will be taken on our part to assist with the billing or migration when moving to a promo. It's nothing personal, it's just how we sustain promotions by relying on our automated systems, and promos are often entirely based on newly provisioned servers.\r\n\r\nQ: Can I really add UNLIMITED domains?  \r\nA: Ok real talk. If you add so many domains that it breaks a server, we have no choice but to consider that \"Server Abuse\" by our Terms of Service. I don't know what that number is, but if you have to randomly generate the domain names and push them over the API to add them all by end of year then yeah that's probably the number. Since 2013 we've had 2 customers find out what that number was for them, and I don't think you're statistically likely to find yourself in their company. We're not going to be dicks about it btw, we fully refunded those 2 customers.\r\n\r\nQ: What kind of services don't you allow?  \r\nA: Good question. Leak forums (forum where people shared leaked password databases), adult forums (you know, porn), anyone who has to send hundreds of emails at a time to qq.com (I don't even know), deceptive use of third party services through us (ex. randomly generating email accounts to sign up for 5,000 Steam accounts), forward-only service for a massive number of domains (11.8k domains under one account was the number that broke it and added that to policy).\r\n\r\nQ: What is your refund policy?  \r\nA: Pitchforks. Please don't sign up if you think you might want a refund. I'd rather lose the potential sale. I really don't care if it's unfriendly, it's the only way to stop people from forcing me to offer \"Free trials\" and eating the overhead that they generate. That overhead bleeds into our actual client's services if I let it, and I will violently refuse to raise prices on my customers.\r\n\r\nQ: Where are your servers located?  \r\nA: You'll most likely be provisioned in ReliableSite's NY location, with a secondary possibility of OVH Canada.\r\n\r\nQ: Can we choose custom locations?  \r\nA: Afraid not."}