{"id": 17606, "date": "2013-12-02 08:23:36", "user": "FrankZ", "post": "&lt;center&gt;Happy Cyber Monday from the WeLoveServers team!&lt;/center&gt;\r\n\r\n  &lt;p&gt;  We are extending a Cyber Monday promotion that will be running for the next 24 hours.  We are offering free account credit which can be used towards any WeLoveServers invoice or bill &lt;/p&gt;\r\n&lt;p&gt;\r\nThere are 6 tiers that you may choose from on this promotion. You may only utilize this promotion once, so please choose your desired tier accordingly.&lt;/p&gt;\r\n&lt;p&gt;\r\nTier 1: Add $25 to your account credit, and $10 is on us - total of $35&lt;br&gt;\r\nTier 2: Add $50 to your account credit, and $25 is on us - total of $75&lt;br&gt;\r\nTier 3: Add $75 to your account credit, and $40 is on us - total of $115&lt;br&gt;\r\nTier 4: Add $100 to your account credit, and $50 is on us - total of $150&lt;br&gt;\r\nTier 5: Add $200 to your account credit, and $100 is on us - total of $300&lt;br&gt;\r\n&lt;/p&gt;\r\n\r\n&lt;p&gt;Now we are saving the best for the last folks... because in tier 6 we'll match the amount you add and DOUBLE your account credit!&lt;/p&gt;\r\n&lt;p&gt;\r\nTier 6: (Best Deal!): Add $400 to your account credit, we'll double it - total of $800&lt;/p&gt;&lt;p&gt;\r\nTo get started, log into the Core Client Area and add the funds to your account. After adding the funds, send an email to sales@weloveservers.net specifying the tier you have chosen so we can apply the free credits accordingly.&lt;/p&gt;\r\n&lt;p&gt;\r\nWe are honoring this promotion for ALL clients (both current AND new clients) so tell your friends! Tweet about this  http://core.weloveservers.net/announcements.php?id=12 on Twitter and be sure to mention @WeLoveServers in your tweet because we will randomly select a winner after this promotion has ended. The winner will receive $50 in free account credit which can be used towards any bill with WeLoveServers. While you're at it, why not stay in the loop and follow us on Twitter? &lt;/p&gt;\r\n&lt;p&gt;\r\nThis promotion will end after Cyber Monday (12/3/13 12:00 AM US Central). Thanks for reading!&lt;/p&gt;\r\nRegards,&lt;br&gt;\r\nWe Love Servers&lt;br&gt;\r\nWhere quality meets affordability\r\n\r\n&lt;BR&gt;&lt;BR&gt;Note: My backups are all up to date.\r\n"}