{"id": 18847, "date": "2013-12-23 23:07:21", "user": "professionalxen", "post": "Hello, dear community, users of LET. I am here today beacuse i would like to introduce you and tell you about our newest offer.\r\n\r\n[OUR WEBSITE](http://professionalxen.com/)\r\n\r\n**Why us?** \r\n&lt;br&gt;We believe in a no-nonsense business. To that end our pricing is simple, and so is our professional support. Open a ticket, have the issue fixed; simple! All of our dedicated servers are powerful to provide our customers with the most pleasurable experience a VPS hosting can offer.&lt;/br&gt;\r\n\r\n**Uptime?**\r\n&lt;br&gt;Our goal is your satisfaction, reliable availability is important for both you and us. Never worry about experiencing any downtime. We are very well aware that breakdowns can easily lead to financial losses.&lt;/br&gt;\r\n\r\n**Network ?**\r\n&lt;br&gt;Virtual Machines are connected to 1 Gbps shared port guaranteeing you will have great speeds no matter the time of day. Our goal is customer satisfaction, we are improving each day to provide the best service for fairly cheap.&lt;/br&gt;\r\n\r\n**More informations:**\r\n&lt;br&gt;Our nodes VPS allocation is very important to us. Beacuse of that, we have specific amount and well planned ratio between plans.&lt;/br&gt;\r\n\r\n\r\nDedicated server is located in New York, USA (Intel® Xeon® Processor E3-1240)\r\n\r\n**Plan 1:**\r\n&lt;br&gt;Location: USA, New York&lt;/br&gt;\r\n&lt;br&gt;1024 MB RAM&lt;/br&gt;\r\n&lt;br&gt;Intel® Xeon® Processor E3-1240&lt;/br&gt;\r\n&lt;br&gt;2 CPU Cores (3.30 GHz) &lt;/br&gt;\r\n&lt;br&gt;25 GB HDD Storage&lt;/br&gt;\r\n&lt;br&gt;500 GB Premium Traffic&lt;/br&gt;\r\n&lt;br&gt;1 Gbps shared port&lt;/br&gt;\r\n&lt;br&gt;Price: $7/month &lt;/br&gt;\r\n&lt;br&gt;[Order Here](http://professionalxen.com/billing/cart.php?a=add&amp;pid=24)&lt;/br&gt;\r\n\r\n&lt;br&gt;Test IP: 198.12.127.131&lt;/br&gt;\r\n&lt;br&gt;100 MB File: http://198.12.127.131/100MB.test&lt;/br&gt;\r\n\r\nStock will be updated daily.\r\n&lt;br&gt;When we fully get out of stock on specific dedicated server we will open another node. &lt;/br&gt;\r\n&lt;br&gt;&lt;/br&gt;\r\n&lt;br&gt;OS that we use: We are using windows server 2008 R2 Standard x64  as our OS for VPS servers.&lt;/br&gt;\r\n&lt;br&gt;&lt;/br&gt;\r\n&lt;br&gt;Anyway, you will find most of the things that you need to know about us on our wiki page.&lt;/br&gt;\r\n\r\nCheck us out, you will defenitly not regret it :)"}