{"id": 21066, "date": "2014-02-02 13:26:53", "user": "Virtovo", "post": "Help us celebrate our launch with 40% off of our regular pricing!  \r\n\r\n[Virtovo](http://www.virtovo.com) was formed in December 2013 and this is the first time we are offering KVM VPS services to LET users.  Virtovo is a registered business in England and Wales.  Virtovo is a very young company and doesn't have a long story to tell.  We are committed to writing a successful story going forward through good quality hardware and a commitment to customer service.  \r\n\r\nWe currently only offer services out of Coresite, Miami.  IPv6 is available in this location but IPv6 is not currently offered with these plans.  We are investigating the best way to allocate /64s to customers instead of fragmented addresses which SolusVM allocates by default.  We hope to have a solution to this before the end of February.\r\n\r\nWe use Blesta for our billing/support and SolusVM for our VPS control.    \r\n\r\n**Node specifications**  \r\n* Dual E5-2620v2 (2.1Ghz)  \r\n* 128GB RAM  \r\n* Minimum 8 Disk LSI Raid 10 Array  \r\n* Redundant 1Gbps uplinks at the node level  \r\n\r\n**Important info**  \r\n[Terms of service ](http://www.virtovo.com/tos.html)  \r\n[Acceptable use policy](http://www.virtovo.com/aup.html)  \r\n[Privacy policy](http://www.virtovo.com/privacy.html)  \r\n[Public Status](http://status.virtovo.com/)  \r\n\r\n**Test IP/Files**  \r\nmia.virtovo.com  \r\n[http://mia.virtovo.com/100MB.zip  ](http://mia.virtovo.com/100MB.zip)  \r\n[http://mia.virtovo.com/1GB.zip  ](http://mia.virtovo.com/1GB.zip) \r\n\r\nWe currently have two packages which fit within LET pricing although the discount code below applies to all of our services.  \r\n\r\n**Use code: LAUNCH40OFF during checkout to receive advertised prices**  \r\n\r\n**KVMH1**  \r\n512MB RAM  \r\n2 Cores   \r\n25GB HDD  \r\n1TB Transfer  \r\n1 IPv4 Address  \r\nSolusVM  \r\n**$3/mo** | [Order](http://virtovo.com/services)  \r\n\r\n**KVMH2**  \r\n1024MB RAM  \r\n4 Cores  \r\n50GB HDD  \r\n2TB Transfer  \r\n1 IPv4 Address  \r\nSolusVM  \r\n**$6/mo** | [Order](http://virtovo.com/services)    \r\n\r\n**As an extremely limited offer we can double the disk space on either plan for an additional $1/mo, simply open a ticket after ordering to have this added**\r\n\r\n\r\n"}