{"id": 2116, "date": "2012-04-03 05:41:56", "user": "NickM", "post": "I think we can all agree that it's important to monitor your servers.  Many people rely on self-hosted monitoring services like Nagios, Munin, or my very own monitoring system, OpenStatus.  The problem with these is that they can be a pain to set up, and they require you to have yet another server or VPS. And if that server goes down, you're out of luck for monitoring until you fix it.  An additional server requires time to set up and maintain.\r\n\r\nArmed with the knowledge I gained developing OpenStatus, I've created [CheckMyServers.com](http://www.checkmyservers.com), a hosted server monitoring solution.  Unlike other monitoring solutions that only check if your server is up, CheckMyServers monitors the vital signs of your servers - RAM usage, CPU usage, disk usage, and more.  By taking a proactive approach, CheckMyServers helps you to prevent your servers from going down in the first place by notifying you immediately if there's a problem.\r\n\r\nHow does it work?\r\n\r\nEach of your servers runs a small application that gathers vital statistics (RAM usage, load average, disk usage, network usage) and sends it to our servers every minute. Our servers compare that information to thresholds you set for each statistic, and if too much of a resource is being used, we send you an alert by email, SMS, or however else you'd like.  And if our servers don't hear from your server within 2 minutes, our servers start trying to figure out why.  We ping your server from multiple locations to see if there's a routing problem and to make sure that your server is actually down before sending you an alert.\r\n\r\nSo, as I mentioned in the thread title, I'm currently looking for beta testers for this service - 10 to be exact. For the first 10 people who'd like to try this service and provide feedback, I'm offering monitoring of up to 10 servers, absolutely FREE, for life!  Simply visit [CheckMyServers.com](http://www.checkmyservers.com) and sign up for the Business package, using promo code **LEBBETA**.  Please note that as of right now, not all features of the service are completely implemented, but the basic features (monitoring, and email alerts) are functional, and I'm working hard on implementing everything else.  \r\n\r\nAlso, please note that the pricing listed on the website is not yet finalized, and will almost definitely change based on feedback from the LEB/LET community.  In fact, I'd love to hear your suggestions about pricing."}