{"id": 22516, "date": "2014-02-26 06:23:23", "user": "ryguy222", "post": "EVL Gaming, LLC is proud to unveil its new LEB friendly VPS services!\r\n  \r\n**About EVL Gaming, LLC** We've been providing gaming and VPS services since 2011, and have always owned 100% of our hardware and networking equipment. Our clients also believe that we offer some of the best support in the industry as we never turn anyone away, and always point them in the right direction if they get lost or stuck in their VPS!\r\n  \r\nEVL Gaming, LLC is registered and is in good standing with the Arizona Corporation Commission.\r\n  \r\n**Hardware Specifications** These VPS operate on Dual Opteron 4226 Six-Core 2.7Ghz (3.1ghz turbo) CPU's, with a RAID 10 disk array (providing faster I/O speeds, and more IOPS perfect for databases, minecraft and many other applications).\r\n  \r\n  All of our servers utilize Supermicro enterprise grade motherboards, chassis, and power supplies. Here's some proof that we own our infrastructure --&gt; http://evlgaming.com/infrastructure\r\n  \r\n**Ping/Trace/Speed Test**\r\n  Phoenix Speed Test --&gt; http://209.250.6.57/speed/  (Or trace/ping 209.250.6.57)\r\n  Kansas Speed Test --&gt; http://142.54.161.25/speed/  (Or trace/ping 142.54.161.25)\r\n \r\n**About our locations**\r\n  We own all of our gear (aside from offsite dns/backups). That said we do not sell VPS off of rented Secured Servers in Phoenix, or Datashack in Kansas but rather colocate directly with these datacenters. This usually gives us better routing than those two services offer. \r\n  \r\n**LEB Plans**\r\n  \r\n  \r\nEnterprise LEB Series #1 (We have very low stock left on this package act fast!) \r\n  \r\n  *   CPU Cores: 1 \r\n  *   Memory: 1024mb / 2048mb swap\r\n  *   Disk: 25GB RAID 10\r\n  *   Bandwidth: 100mbps / 750GB Transfer\r\n  *   OS: Linux/Windows (contact us for custom ISO or OS)\r\n  *   IP's: 1 (Max 3 IP's $1.75 per IP) \r\n  *   Price: $5.00/mo  $48/yr\r\n  *   Kansas City, MO Oak Tower\r\n  *   [Direct Order Link](https://myevl.net/cart.php?a=add&amp;pid=134)     [View all Plans](http://evlgaming.com/vps) \r\n  \r\n**Enterprise LEB Series #2**\r\n  \r\n *   CPU Cores: 1 \r\n *   Memory: 2048mb / 3072mb swap\r\n *   Disk: 25GB RAID 1\r\n *   Bandwidth: 100mbps / 100TB Transfer\r\n *   OS: Linux/ Windows (contact us for custom ISO or OS)\r\n *   IP's: 1 (Max 3 IP's $1.75 per IP) \r\n *   Price: $7.00/mo \r\n *   Kansas City, MO Oak Tower\r\n *   [Direct Order Link](https://myevl.net/cart.php?a=add&amp;pid=133)     [View all Plans](http://evlgaming.com/vps) \r\n  \r\n\r\n**Legal Stuff**\r\n   *   [View our Terms of Service](http://evlgaming.com/terms)\r\n   *   [View our Acceptable Usage Policy](http://evlgaming.com/aup)\r\n   *   Please note that some orders may require telephone verification and only orders above $100 require photo ID verification. \r\n   * ** Our LEB plans posted have a 24 hour refund policy!**\r\n \r\n **Windows Licenses**\r\n  * You may use your own windows license if it is a volume license key, and works on our Server 2008 iso file. Choose Windows Server 2008 (own license key) at checkout.\r\n  * We do not allow customers to upload their own Windows ISO's, that does mean you can only use Server 2008 R2 on our network. We are prohibited from allowing this by our contract with Microsoft. EVL Gaming, LLC is an official Microsoft SPLA partner. \r\n  * License are $10/mo for web edition. \r\n  \r\n   **Contact Us**\r\n  Please feel free to contact our sales team and they'll be glad to assist you with any questions or concerns you may have about us!\r\n  \r\n   **And finally...**\r\n  Thanks for reading the ad! We realize there is lots of competition! Do remember that this discount code is a lifetime discount! Meaning you keep it if you upgrade/downgrade the service so long as the service remains active. \r\n "}