{"id": 23327, "date": "2014-03-12 13:35:34", "user": "ElitePixels", "post": "Update : (13/03/2014)\r\nThis template has been sold. Thank you for your cooperation.\r\n\r\n\r\nFew months ago, i was contacted by a webhosting company. They requested for a new website design. It was all fine until i completed the work as per their requirements, at this point they decided to sell their company. They did not want the new design, as their company was sold.\r\nAll my hardwork and time was completely wasted. \r\n\r\nHence, i am trying to sell the custom template here, Hoping that i get paid for my loss. \r\n\r\nThe template has 5 pages, coded in HTML5. Index, Minecraft, Shared, Dedicated Server and a Text page for content. It's not responsive. (Can be made on request, for extra charges (of course).\r\n\r\n**Screenshots:**\r\n\r\n[Index Page](https://dl.dropboxusercontent.com/u/95318193/yourhost/YourHost.jpg)\r\n\r\n[Shared Hosting](https://dl.dropboxusercontent.com/u/95318193/yourhost/YourHost%20(2).jpg)\r\n\r\n[Minecraft Hosting](https://dl.dropboxusercontent.com/u/95318193/yourhost/YourHost%20(3).jpg)\r\n\r\n[Dedicated Servers](https://dl.dropboxusercontent.com/u/95318193/yourhost/YourHost%20(4).jpg)\r\n\r\n[Textual Content](https://dl.dropboxusercontent.com/u/95318193/yourhost/YourHost%20(1).jpg)\r\n\r\nEach page was designed as per the requirements of the original client. Of-course, it might or might not suit your requirements. Minor changes can be made. If you are looking for major changes, lets discuss and make it happen! \r\n\r\nThe minecraft page is the highlight of this template, as it has a unique plan slider. Never before used technique in hosting industry. You can use it for selling any product of your choice.\r\n\r\nPSD Files are also included in this sale.\r\nProof: http://i.imgur.com/YnLtoZb.png\r\n\r\n&gt;**Buy it now @ 300$**\r\n\r\nThis is a one time sale. Meaning, you will be the sole owner of this theme and all rights will belong to you, once sold.\r\n\r\n&gt; If you are interested in purchasing the template, i'll show you a live preview of the same. \r\n&gt; \r\n&gt; I accept PayPal (Verified) and Skrill.\r\n\r\n**Contact:**\r\nSkype: Froomple\r\nE-mail: contact ( at ) elitepixels ( d o t ) net\r\nOr PM me.\r\n\r\nLooking forward for your offers and queries.\r\n"}