{"id": 29839, "date": "2014-06-24 08:23:09", "user": "devnull", "post": "I just found out they have a new plan called \"Warm-Up\". It costs 60RUB which, [according to XE](http://www.xe.com/currencyconverter/convert/?Amount=60&amp;From=RUB&amp;To=USD), is about $1.76.\r\n\r\nFull specs:\r\n\r\n* `CPU: 1 Core` \r\n* `RAM: 256 MB` \r\n* `HDD: 10 GB`\r\n* `BW:  Unlimited @ 100Mbps`\r\n\r\nThis is a limited stock offer. They're planning to sell 1000 VPSes only.\r\n\r\nTerms and conditions apply (_for this plan_):\r\n\r\n* No ISPmanager[1];\r\n* No promotions and discounts apply for this plan;\r\n* You can't order any add-ons for this plan;\r\n* Their free DNS is not available for this plan;\r\n* No moneyback;\r\n\r\nUPD: (translation by @rm_)\r\n\r\n* VM type is OpenVZ;\r\n* Game servers are forbidden on this plan;\r\n* Abusers will be kicked out (with the provider determining in their sole discretion what amounts to \"abuse\");\r\n* No SLA or guarantee of any kind whatsoever.\r\n\r\nFull list and more invo available here: http://firstvds.ru/products/vds_vps_cheap\r\n\r\n[1]. ISPmanager is honestly the best server control panel I've ever used. It's developed by ISPserver, the company behind FirstVDS. Though I guess lack of the control panel should not be a turndown for most of the LET users.\r\n\r\nFirstVDS has been in business [since late 2002](http://web.archive.org/web/20030201102245/http://firstvds.ru/ru/home/index.html). I've been using their services for 6 years already. Except for the links, I am not affiliated with this company. I was lucky enough to get on a node where I've experienced little to no network/availability issues. Because of that positive experience I was recommending the company to most of my friends and people I was working with, but some of them actually did experience unavailability issues. Not for long though, so I think it's kind of acceptable for a low-end budget service.\r\n\r\n_They also offer some other plans, starting from ~$4.37 for 512MB/30GB/Unlim VPS. You can get a 25% one-time discount on those plans if you use [my affiliate link](http://bit.ly/FirstVDSplans)._\r\n"}