{"id": 32069, "date": "2014-08-01 11:23:09", "user": "Rhys_quadex", "post": "![enter image description here][1]\r\n\r\n\r\n  *Hourly Billing, High Availability, Real cloud Hosting!*\r\n  \r\n\r\n\r\n----------\r\n\r\n\r\n  QuadexHosting aims to provide convenient cloud hosting to its customers, most importantly customers only pay for the time that they use their server, if they decide to go offline for a day, week or month they can immediately put their server back online without having been charged for the duration of which they where offline.\r\n  \r\n  Servers are hosted in **Toronto, Canada**\r\n  \r\n\r\n\r\n----------\r\n\r\nOperating Systems: **Debian 7, Ubuntu 12.04, Centos 6, FreeBSD, rhel 6, Windows 2k8 R2(BYO license)**'\r\nStandard With all Plans: \r\n\r\n - Ability to Resize at any time.\r\n - Unlimited data transfer via 10Mbps, 100Mbps(Standard)\r\n - Access to Ticket, Skype and Email Support\r\n - HA Elastic CPU\r\n - 1 IPv4\r\n - Detachable volumes For Extra space (Max 1.3TB)\r\n - KVM\r\n\r\n\r\n\r\n----------\r\n\r\n**A Few Plans we currently Offer:**\r\n\r\n (KVM) 1vCPU | 512MB |20GB SSD | 10Mbps &lt;- $0.00528/hr\r\n \r\n (KVM) 1vCPU | 512MB |20GB SSD | 100Mbps &lt;- $0.0086/hr\r\n \r\n *12 plans ranging upto 8GB available*\r\n \r\n\r\n\r\n----------\r\n\r\nWe provide a custom control panel featuring in browser console access to your server as well as SSH keys as standard with all VM's and user customizable Security policy settings.\r\n\r\nIt's free to sign up so you can have a good look around before depositing a single dime!\r\n\r\n&lt;&lt;**Test IP: 198.144.155.27** &gt;&gt;\r\n\r\n**Payments:** Minimum deposit of $5 USD via paypal.\r\n\r\n[Visit Us Here!][2]\r\n\r\n. \r\n\r\n\r\n  [1]: http://www.quadexhosting.com/img/logo.png\r\n  [2]: http://quadexhosting.com\r\n  \r\n  \r\n\r\n\r\n----------\r\n\r\n\r\n  Refunds: In certain circumstances we will deliver refunds upon request, these circumstances include when the user has either not used any of his initial balance since their last deposit or VM's have been failing to deploy when needed, issues to do with poor performance are up to Quadexhosting to decide if a refund is necessary.\r\n  \r\n  **Rules: Users are not to use their servers for activities illegal in the country of Canada, other than that you are free to use your provided resources to the fullest extent.**\r\n  \r\n  *Note: if you wish for us to provide Disk / Network tests we are happy to oblige, simply comment below with the specific test you'd like us to run and which plan you'd like it ran on.*"}