{"id": 33176, "date": "2014-08-23 20:18:48", "user": "Kihi", "post": "[![](http://i.imgur.com/xRd4aGN.png)](http://kihihosting.com)\r\n\r\nHey! We are Kihi, after many hours of programming and  deliberation we have decided to finally advertise our offers on LowEndTalk. \r\n\r\n**About us**: We are a growing company located in the heart of the Waterloo area. We house and own all of our equipment in a fast, reliable data center located in Kitchener, Ontario.\r\n\r\n**Our network**: To learn more about our network. Check out out blog posts [here](http://kihihosting.com/blog), as well as our looking glass [here](http://lg.kihihosting.com).\r\n\r\n**Our control panel / API**: We built our control panel and provisioning software from scratch. Powered by _Ruby_ and _Go_, each VPS is deployed in less than 10 seconds on each node. We utilize _Sinatra_ for our API, allowing us to scale to our customer base. This allows us to easily implement our control panel  for devices such as Android and Android Wear. having built all our back-end architecture ourselves, we are less susceptible to security exploits compared to other third-party software.\r\n\r\n**What we program in**: We program in both _Ruby_ and _Go_ for our provisioning software as well as control panel. Ruby for it's track-record and Go for it's lovely concurrency.\r\n\r\n**Features**:\r\n\r\n * No over allocation. Dedicated resources. (the benefit of KVM).\r\n * Less-than-10-seconds deployment\r\n * Launch configured hosted solutions (such as Wordpress, GitLab, OpenVPN) easily through a simple form.\r\n * Custom control panel with statistics.\r\n * Android &amp; Android Wear application. Download from the play store [here](https://play.google.com/store/apps/details?id=vps.kihi.panel).\r\n\r\n**Technical (per VPS)**:\r\n\r\n * Storage: RAID-1 or RAID-5 storage (depending on the node)\r\n * CPU: 2.0Ghz to 2.5Ghz\r\n * Network: 100Mbps link \r\n\r\n**Terms of Service (in a nutshell)**: Go crazy as long as it's nothing illegal. High CPU abuse is frowned upon. More details [here](http://kihihosting.com/tos)\r\n\r\n**Mini-FAQ**\r\n\r\n * IPv6? Not at this moment. Our data center is currently preparing itself to be 100% IPv6 compliant.\r\n * How do I get an API key for the (beta) Android application? After ordering, feel free to open a ticket with us and we shall manually add an API key for you. \r\n * Transparency? We try and remain as transparent as possible with our service. Feel free to check out our [blog](http://kihihosting.com/blog) as well as our [public whois](http://easywhois.com) information. \r\n\r\n**LowEndTalk discussion**\r\nWe have actually been briefly [mentioned](http://lowendtalk.com/discussion/29655/anyone-know-this-provider) before on LowEndTalk. However, as we were still implementing our Android application as well as numerous other features, we decided to sustain until later. \r\n\r\n\r\n###KVM Hosting Details\r\n\r\n**KVM 512MB - $2 / Month - [Order here](http://kihihosting.com/pricing)**:\r\n\r\n* RAM: 512 MB\r\n* CPU Cores: 1\r\n* HDD - 120GB\r\n* Bandwidth - 500GB \r\n* 100 Mbps\r\n* 1 IPv4\r\n\r\n**KVM 1GB - $4 / Month - [Order here](http://kihihosting.com/pricing)**:\r\n\r\n* RAM: 1 GB\r\n* CPU Cores: 1\r\n* HDD - 120GB\r\n* Bandwidth - 1TB\r\n* 100 Mbps\r\n* 1 IPv4\r\n\r\n###Other\r\n\r\n**Guarantee**: If you're not satisfied with the server for ANY reason within three days after ordering, feel free to contact us and we will provide 100% of your money back.\r\n\r\n**Questions?** Feel free to ask! Don't be shy. We try to remain as transparent as possible with our service. Questions about our network back-end or monitoring system? Don't be afraid to ask!\r\n\r\n\r\n\r\n\r\n"}