{"id": 33315, "date": "2014-08-26 03:06:11", "user": "jar", "post": "Hey everyone! While I have a lot of friends here any at least a few of you have seen my previous offers, many of you may not know who I am and I would like to introduce myself to you, as well as my product. I'll try to make it easy to skip for those of you more interested in the offers.\r\n\r\n&gt; The Story\r\n\r\nI am a recovering LowEndTalk addict with a passion for Linux server management and an obsession with all things that can be described with \"it just works.\" I think that the quality of a product is found not in it's cost or marketing budget, but in consistency. Consistency in what exactly? Performing the task that it was created to perform, without error, without interruption.\r\n\r\nI am also a firm believer that quality can be had at low cost. Quality is not necessarily expensive, but one must effectively calculate the cost of scaling the operation while understanding that said scale is anything but linear in this industry. I consider myself to be very skilled in just that and this is why I believe that I should be the provider of e-mail for your domain.\r\n\r\nMXroute went through many phases as a concept before it became an active business, for at least a year. Long before it's name was written, it's existence was inevitable and I knew it. E-mail hosting is a market that has many choices, but almost none of the choices fall in line with what we know to be possible here at LowEndTalk due to the proven VPS market. They all seem to follow an out of date pricing and structure. I knew I wanted someone to shake up the market, and ultimately I know that it would be me.\r\n\r\nThe MXroute team consists of myself, @ryanarp, and Christine.\r\n\r\n&gt; The Offers\r\n\r\n(A &lt;b&gt;very&lt;/b&gt; special offer at the bottom)\r\n\r\nI am introducing three new MXroute packages exclusively at LowEndTalk. You guys get the first go at our new line of plans that were designed to benefit people who simply have greater needs than our current plans can fit.\r\n\r\n&lt;b&gt;MX350&lt;/b&gt;&lt;br&gt;\r\n20GB Storage&lt;br&gt;\r\nUnlimited Domains&lt;br&gt;\r\nUnlimited Accounts&lt;br&gt;\r\n$3.50/m&lt;br&gt;\r\nhttps://billing.mxroute.com/cart.php?a=add&amp;pid=10\r\n\r\n&lt;b&gt;MX500&lt;/b&gt;&lt;br&gt;\r\n40GB Storage&lt;br&gt;\r\nUnlimited Domains&lt;br&gt;\r\nUnlimited Accounts&lt;br&gt;\r\n$5.00/m&lt;br&gt;\r\nhttps://billing.mxroute.com/cart.php?a=add&amp;pid=11\r\n\r\n&lt;b&gt;MX700&lt;/b&gt;&lt;br&gt;\r\n75GB Storage&lt;br&gt;\r\nUnlimited Domains&lt;br&gt;\r\nUnlimited Accounts&lt;br&gt;\r\n$7.00/m&lt;br&gt;\r\nhttps://billing.mxroute.com/cart.php?a=add&amp;pid=12\r\n\r\nThe promo codes from our previous offer apply to these plans as well.\r\n\r\n&gt; Promo Code: MX10&lt;br&gt;\r\n10% off recurring for the life of the service.\r\n\r\n&gt; Promo Code: TRYMX&lt;br&gt;\r\n20% off first billing cycle.\r\n\r\n...\r\n\r\nOh and there's just....&lt;br&gt;\r\n&lt;img src=\"http://i58.tinypic.com/30jjipv.jpg\"&gt;\r\n\r\nI want your help. I want you to write tutorials for MXroute's support page, in the style of these articles:&lt;br&gt;\r\nhttps://mxroute.com/guide-ios.html&lt;br&gt;\r\nhttps://mxroute.com/guide-dkim.html\r\n\r\nI want step by step guides with screenshots. Comment in this thread stating which tutorial you want to make and within 24 hours I will contact you to finalize the deal. Your reward? You will receive a discount of 50% on any MXroute service recurring for the life of your service.\r\n\r\nHere are the topics:&lt;br&gt;\r\n- How to set up your account on Outlook 2007.&lt;br&gt;\r\n- How to set up your account on Outlook 2008 Mac.&lt;br&gt;\r\n- How to set up your account on Outlook 2010.&lt;br&gt;\r\n- How to set up your account on Outlook 2011 Mac.&lt;br&gt;\r\n- How to set up your account on Outlook 2013.&lt;br&gt;\r\n- How to set up your account on Windows Live Mail.&lt;br&gt;\r\n- How to set up your account on Android (any version).&lt;br&gt;\r\n- How to set up your account on Blackberry.&lt;br&gt;\r\n- How to set up your account with Gmail's Mail Fetcher.&lt;br&gt;\r\n- How to set up your account on Mac Mail (OS 10.8 or above).&lt;br&gt;\r\n- How to set up your account on Thunderbird (latest version, Windows preferred).&lt;br&gt;\r\n- How to add mail domain in MXroute panel.&lt;br&gt;\r\n- How to create e-mail account in MXroute panel.\r\n\r\nThe limit is 3 articles per individual. You can receive up to 3 promo codes for 50% off (recurring) on any of our products. You can use them, sell them, give them away, whatever you want. Sure I could write all of these myself, but why miss out on an awesome opportunity to delegate the work while simultaneously giving out the single greatest offer that MXroute has ever given.\r\n\r\nI thank you guys for your time, and I look forward to providng you with quality mail service!"}