{"id": 33931, "date": "2014-09-05 23:23:49", "user": "frixelsolutions", "post": "Hello, Frixel Solutions LLC. is a registered company in the state of Oregon, though we primarily operate in California. We use private WHOIS, however you can confirm our information [here](http://egov.sos.state.or.us/br/pkg_web_name_srch_inq.show_detl?p_be_rsn=1704921&amp;p_srce=BR_INQ&amp;p_print=FALSE) and we also have contact information on our website [here](https://www.frixelsolutions.com/support.php).\r\n\r\nWe have an exclusive offer for LowEndTalk readers, for a 40% (two orders) or a 20% discount (four orders) setup on any of our \"Bargain Bin Dedicated Server\" lineup. You can see what we have in stock right now, order soon as we do not have many in stock, though we will periodically add more.\r\n\r\nOUT OF STOCK: Pentium 4 CPU, 4GB RAM, 160GB HDD, 10Mbps Unmetered (~3TB) - $15/month\r\n\r\nIN STOCK: Core 2 Duo CPU, 4GB RAM, 250GB HDD, 3TB 100Mbps - $30/month\r\n\r\nIN STOCK: Core 2 Duo CPU, 4GB RAM, 500GB HDD, 3TB 100Mbps - $35/month\r\n\r\nOrder Link: https://www.frixelsolutions.com/secure/cart.php?gid=5\r\n\r\nPromo code for 40% off recurring: LET-BBDS-40PC (only 2 uses allowed)\r\nPromo code for 20% off recurring: LET-BBDS-20PC (only 4 uses allowed)\r\n\r\nCPUs, RAM speed, hard drive model, speed, and age may vary between servers. We do not allow configuration/customization of these servers as far as changing the hardware specifications. If you want a different operating system than listed please contact our sales department by email before ordering. By default we use Minimal installs. Please put the OS you want in the order notes if it's not listed. If you need many reinstalls we will begin to charge $5 each for the time and effort - this is a low margin service. If you need constant reinstalls get a virtual server where you can do it from your web browser, or buy from another provider.\r\n\r\nAll servers include a /29 of IPv4 and a /64 of IPv6. Our network upstream consists of HE right now, and more will be added soon by our upstream provider. As far as I know Level3 is next.\r\n\r\nOur servers are located in Rohnert Park, California. We own and operate our servers in this unique location; we are not a reseller. Our upstream bandwidth provider has enterprise level fiber internet service. The building has grid power, solar power, a generator, and our core network has another layer of UPS backups, so we won't be having any power or network problems.\r\n\r\nRecently there was a medium sized earthquake near our facility, which resulted in damage of one hard drive in one of our servers, as well as several hours of loss of grid power to the facility. There were NO interruptions to any of our services.\r\n\r\nTest IP: 204.10.167.214*\r\n\r\nWe accept PayPal and Credit Cards. If you need any additional information, please let us know. Thank you and we look forward to serving you. Please be sure to read our terms of service, acceptable use policy, and privacy policy located at the bottom of every page of our website.\r\n\r\nhttps://www.frixelsolutions.com/\r\n\r\n*Test IP deactived due to DDoS, and I'm not letting you waste another. So if you want a working Test IP, email our sales department."}