{"id": 34835, "date": "2014-09-22 13:56:38", "user": "rsk", "post": "&lt;img src=\"https://myrskcloud.com/img/logocpcloud.png\"&gt;\r\n\r\nMyRSK webhosting solutions has entered the budget vps market since well over two years now (globally). However, we have been providing webhosting solutions since 2009 locally - in Dubai for young entrepreneurs and startup companies. We are currently holding strong with many, many happy clients :-)\r\n\r\nWe recently launched our MyRSKCloud for BETA testing, and after great reviews and modifications we are happy to release it publicly. Great quality, support, and an affordable price!\r\n\r\nOur Promise: **5 Days Money Back Guarantee, no BS!**\r\n\r\nCloud Bundle - KVM United States (Phoenix) PhoenixNAP &lt;br&gt;\r\n2 Concurrent VM instances &lt;br&gt;\r\n1024MB Guaranteed RAM &lt;br&gt;\r\n70GB HDD RAID10 &lt;br&gt;\r\n1000GB Bandwidth 1gigE Port &lt;br&gt;\r\n3 IPv4 &lt;br&gt;\r\n1 Internal IP &lt;br&gt;\r\nFREE Shared hosting account (cPanel with 10GB HDD and 1TB BW, unlimited features)&lt;br&gt;\r\n$5.99/month only! &lt;br&gt;\r\n[[ORDER](https://myrsk.com/whmcs/cart.php?a=add&amp;pid=138)] \r\n\r\nSome FAQ:\r\n\r\nQ: Do you have windows available?&lt;br&gt;\r\nA: Currently no, after more testing is done, we will be offering windows templates.\r\n\r\nQ: Can I request a windows ISO to be loaded? What about other ISOs?&lt;br&gt;\r\nA: You can not request a windows ISO to be loaded for the current time. Other ISOs will be loaded for you, just open a ticket :-)\r\n\r\nQ: Can I order more resources?&lt;br&gt;\r\nA: You can open a ticket and request a larger quantity of Cloud Bundles. For example, you can combine 2 or more Cloud Bundles to make a larger Cloud Bundle.\r\n\r\nQ: What about IPv6?&lt;br&gt;\r\nA: Native IPv6 is currently not available. It is easy to create your own tunnel on a KVM VPS, we can help!\r\n\r\nQ: What are the available POPs (points of presence) currently?&lt;br&gt;\r\nA: Currently, you will only be able to create a virtual machine at our Phoenix, US location. Coming within the next month is Frankfurt, DE and hopefully followed by Maidenhead, UK.\r\n\r\nQ: How do I get my free cPanel account?&lt;br&gt;\r\nA: There is a button/link in the Cloud Control Panel. Follow the instructions :-)\r\n\r\nScreenshots:\r\n\r\n1. Create VM\r\n![](http://i.imgur.com/191hhsu.png)\r\n&lt;br&gt;\r\n1. VM List\r\n![](http://i.imgur.com/X5IKH8v.png)\r\n&lt;br&gt;\r\n1. VM Management\r\n![](http://i.imgur.com/uqyZ3uf.png)\r\n&lt;br&gt;\r\n\r\n&lt;pre&gt;Quick Links \r\nFor TOS/Legal : http://myrsk.com/legal.php\r\nDatacenter Information and test files : http://myrsk.com/network.php \r\nFor queries or support please submit a ticket : http://myrsk.com/whmcs/submitticket.php\r\nLive Chat: http://myrsk.com on the website :-)&lt;/pre&gt;"}