{"id": 37707, "date": "2014-11-18 12:18:28", "user": "rsk", "post": "&lt;img src=\"https://myrskcloud.com/img/logocpcloud.png\"&gt;\r\n\r\nMyRSK webhosting solutions has entered the budget vps market since well over two years now (globally). However, we have been providing webhosting solutions since 2009 locally - in Dubai for young entrepreneurs and startup companies. We are currently holding strong with many, many happy clients :-)\r\n\r\nWe recently launched our MyRSKCloud product, and after great reviews we have decided that a EU location had to be introduced, and definitely not the Netherlands - a lot of providers there. Thus, Frankfurt was the new location that we decided on! Great quality, support, and an affordable price!\r\n\r\nOur Promise: **5 Days Money Back Guarantee, no BS!**\r\n\r\n&lt;pre&gt;\r\n&lt;b&gt;Cloud Bundle - KVM&lt;/b&gt;\r\n2 Concurrent VM instances\r\n1024MB Guaranteed RAM\r\n50GB HDD RAID10\r\n1000GB Bandwidth 1gigE Port\r\n2 IPv4\r\n1 Internal IP per VM\r\nDeploy at your own will/pace in either **Phoenix, AZ (USA) or Frankfurt, DE (EU)**\r\nFREE Shared hosting account (cPanel with 10GB HDD and 1TB BW, unlimited features)\r\n$5.99/month only!\r\nOne price, many locations!\r\n[[ORDER](https://myrsk.com/whmcs/cart.php?a=add&amp;pid=138)]\r\n&lt;/pre&gt;\r\n\r\nSome FAQ:\r\n\r\nQ: Do you have windows available?\r\nA: Currently no, after more testing is done, we will be offering windows templates.\r\n\r\nQ: Can I request a windows ISO to be loaded? What about other ISOs?\r\nA: You can not request a windows ISO to be loaded for the current time. Other ISOs will be loaded for you, just open a ticket :-)\r\n\r\nQ: Can I order more resources?\r\nA: You can open a ticket and request a larger quantity of Cloud Bundles. For example, you can combine 2 or more Cloud Bundles to make a larger Cloud Bundle.\r\n\r\nQ: What about IPv6?\r\nA: Native IPv6 is currently not available. It is easy to create your own tunnel on a KVM VPS, we can help!\r\n\r\nQ: What are the available POPs (points of presence) currently?\r\nA: Currently, you will be able to create a virtual machine at our Phoenix, US location and Frankfurt, DE. We hope to introduce new locations every 2-3 months.\r\n\r\nQ: How do I get my free cPanel account?\r\nA: There is a button/link in the Cloud Control Panel. Follow the instructions :-)\r\n\r\nScreenshots:\r\n\r\n1. Dashboard\r\n&lt;img src=\"http://i.imgur.com/ybP3nfn.png\"&gt;\r\n\r\n2. Manage VMs\r\n&lt;img src=\"http://i.imgur.com/03XxWHx.png\"&gt;\r\n\r\n3. Create VM\r\n&lt;img src=\"http://i.imgur.com/X6oxiZB.png\"&gt;\r\n\r\n4. Control VM\r\n&lt;img src=\"http://i.imgur.com/ugNBzoX.png\"&gt;\r\n\r\n&lt;pre&gt;Quick Links \r\nFor TOS/Legal : http://myrsk.com/legal.php\r\nDatacenter Information and test files : http://myrsk.com/network.php \r\nFor queries or support please submit a ticket : http://myrsk.com/whmcs/submitticket.php\r\nLive Chat: http://myrsk.com on the website :-)&lt;/pre&gt;"}