{"id": 37713, "date": "2014-11-18 14:08:08", "user": "AnthonySmith", "post": "Hi Folks,\r\n\r\nA few updates have taken place with [LowEndSpirit](http://lowendspirit.com/locations.html) so thought I would post a topic here as this is the majority of the user base.\r\n\r\nFor those that do not know about LES or what it is the service provides inexpensive resources with Native IPv6 and NAT IPv4 i.e. shared IPv4.\r\n\r\nYou get your own /112 so you can add your own IPv6 addresses and set your own IPv6 rDNS, and you get IPv4 access along with 21 ports.\r\n\r\nFor example you will be assigned an internal IP such as 10.0.0.123 and you will be notified of your external IP e.g. 199.23.41.123 (made up) the external IP will then forward ports 12301 to 12321 to your internal IP, one of them is pre forwarded for you to port 22 on your VPS.\r\n\r\nThere are now [9 locations](http://lowendspirit.com/locations.html) in total over 3 different providers, table below:\r\n\r\n&lt;img src=\"http://i.imgur.com/dMfnpUS.png\" /&gt;\r\n\r\nInception Hosting runs, NL,UK,Italy,Japan and Dallas, a few improvements have been introduced such as:\r\n\r\nKernel care on many of the nodes for rebootless kernel upgrades.\r\n\r\nThe haproxy (reverse proxy) has now been automated in all locations (except Australia).\r\n\r\nPre forwarded extra SSH port now in place so no more messing with the solusvm console to connect over IPv4.\r\n\r\nThe IPv6 has switched over to a subnet system rather than individual IP's each conatiner is assigned a /112\r\n\r\nI have opened a [new bundle](https://clients.inceptionhosting.com/cart.php?a=add&amp;bid=3) for the Inception Hosting locations reducing the price when ordering all 5 locations to just €13.00 p/year, when bought individually each location is €3.00 p/year.\r\n\r\nIt is not considered an enterprise grade service, it comes with no SLA on service or support, there is however an active [community forum](http://forum.lowendspirit.com/index.php).\r\n\r\nI stopped rolling locations and cancelled a few to work on the automation side instead, now that is almost finished (few tweaks left) St. Petersburg Russia will be next, perhaps in time for Christmas :)\r\n\r\nQuestions, comments, insults below :)"}