{"id": 3785, "date": "2012-07-18 19:36:28", "user": "vdnet", "post": "VirtuallyDedicated is now at our 5 1/2 year mark of selling premium virtual servers to the public!  Are you tired of your hosts ending up on the dead pool?  Try us today and you'll be worry-free for years to come!\r\n\r\n**Cloud features**\r\n=========================================\r\n\r\n\r\nOur cloud offers the following features:\r\n- High availability failover and data mirroring to keep your server online and data safe in the event of hardware failures\r\n- Load balancing to keep your server running at peak performance.\r\n- Instantly upgrade or downgrade between plans, prorated hourly\r\n- SSD caching for high performance I/O, up to 5000 IOPS\r\n\r\n\r\n**Go Green**\r\n=========================================\r\n\r\nOur cloud offers you many power saving features.  Our cloud runs at 100% efficiency as compared to the traditional cluster which only offered 50% efficiency.  Our servers run using both efficient hard drives and power supplies to reduce power usage.  When using our cloud servers over dedicated you can reduce your bill, your energy usage, and receive equivalent speeds.\r\n\r\n=========================================\r\n\r\n\r\n**Special #1** Coupon _1GBFOR7_ on the order form\r\n=========================================\r\n\r\n**1GBFOR7** : Get our Value Level 2 for only **$7.00** per month for the life of the account!\r\n\r\n1GB RAM\r\n40GB Disk\r\n1TB Bandwidth (2TB of Bandwidth in Las Vegas)\r\n\r\nCHICAGO METRO or LAS VEGAS\r\n\r\n=========================================\r\n\r\n**Special #2** Coupon __APPFOR5__ on the order form\r\n=========================================\r\n\r\n**APPFOR5** : Get our Application Level 1 for only **$5.00** per month for the life of the account\r\n\r\n384MB RAM\r\n192MB SWAP\r\n30GB Disk\r\n1TB Bandwidth\r\n\r\nCHICAGO METRO or LAS VEGAS\r\n\r\nOur application servers are great for game servers, java, or high traffic web sites.\r\n\r\n=========================================\r\n\r\n**Special #3** 5.5 Year Anniversary Specials\r\n=========================================\r\n\r\n**SAVE80** : Save 80% off the first month of any Level 2 or higher cloud server (or BW Level 1)\r\n**SAVE20** : 20% off any of our Level 2 or higher cloud servers for the life of the account.\r\n\r\n=========================================\r\n\r\n\r\nServer Platforms\r\n=========================================\r\n\r\nWe have cloud servers starting at $5.00 per month and expanding all the way up to 8GB of RAM.\r\n\r\nWe have four specific platforms that can assist you depending on your needs. \r\n\r\n**Value**: Our value platform is an affordable solution that offers all the features needed to run a successful web site or service.\r\n**Application**: Our application platform offers more guaranteed CPU and swap space to help handle heavy applications like database hosting, game servers, and java.\r\n**Bandwidth**: Our bandwidth servers are for users who need to transfer a lot of data.  This can be great for streaming, file hosting, and more.  Transfer up to 50TB per month.\r\n**Storage**: Our storage servers are great for VPS users who need to store backups or files.  These include less CPU and RAM but more hard drive space.\r\n\r\nView all of our packages today at http://www.virtuallydedicated.com\r\n\r\n========================================="}