{"id": 38079, "date": "2014-11-26 04:23:16", "user": "frixelsolutions", "post": "Hello, Frixel Solutions LLC. is a registered company in the state of Oregon, though we primarily operate in California. We use private WHOIS, however you can confirm our information here and we also have contact information on our website here.\r\n\r\nWe have an exclusive, NEVER HAPPENING AGAIN, (early) Black Friday offer for LowEndTalk readers, for an insanely low price on our two latest additions to our dedicated server lineup.\r\n\r\n**We only have 2 of each server in stock** for this promotion! If we are out of stock check again the next day because after any fraud or cancelled orders we will have to manually reset stock information!\r\n\r\n**i3/8GB/1TB**: Intel Core i3 2nd/3rd Gen 3.1+GHz 2C/4T CPU, 8GB RAM, 1TB HDD, 100Mbps Unlimited - **$40/month + $5 Setup** Promo Code for Discount: **LET-EBF2014-i3**\r\n\r\n**i5/16GB/2x1TB**: Intel Core i5 2nd/3rd Gen 2.8+GHz 4C/4T CPU, 16GB RAM, 2x 1TB HDD, 100Mbps Unlimited - **$44/month + $5 Setup** Promo Code for Discount: **LET-EBF2014-i5**\r\n\r\nOrder Link: https://www.frixelsolutions.com/secure/cart.php?gid=3\r\n\r\n**What's the catch? EXPECT 1-4 WEEKS DELAY IN PROVISIONING AFTER PAYMENT! Please do not order if this is not acceptable.**\r\n\r\nExact CPU specs, hard drive model, etc. may vary between servers. We do not allow configuration/customization of these servers as far as changing the hardware specifications. If you want a different operating system than listed please contact our sales department by email before ordering. By default we use Minimal installs. Please put the OS you want in the order notes if it's not listed. After initial setup, OS reinstalls cost $5 each for the time and effort - this is a low margin service!\r\n\r\nAll servers include a /29 of IPv4 and a /64 of IPv6. Our network upstream consists of HE right now, and more will be added soon by our upstream provider. As far as I know Level3 is next.\r\n\r\nOur servers are located in Rohnert Park, California. We own and operate our servers in this unique location; we are not a reseller. Our upstream bandwidth provider has enterprise level fiber internet service. The building has grid power, solar power, a generator, and our core network has another layer of UPS backups.\r\n\r\nTest IP: 204.10.167.243\r\n\r\nWe accept PayPal and Credit Cards. If you need any additional information, please let us know. Please be sure to read our terms of service, acceptable use policy, and privacy policy located at the bottom of every page of our website. Thank you and we look forward to serving you. \r\n\r\nhttps://www.frixelsolutions.com/"}