{"id": 38807, "date": "2014-12-09 02:32:11", "user": "SSDNodes", "post": "[SSD Nodes, Inc.](https://www.ssdnodes.com)\r\n\r\nRead our client reviews and discover why our clients rely on SSD Nodes!\r\n\r\n1) https://twitter.com/kmccarth11/status/210124894262923264 (client for 2 years)\r\n\r\n2) http://compdata.wordpress.com/2012/06/05/amazon-aws-vs-ssdnotes-ssd-nodes-rocks/ (client for 2 years)\r\n\r\n&gt; SSD Nodes allowed us to essentially run queries in 1/100th of the time of that which they were running on AWS.\r\n\r\n3) http://www.96mb.com/96mb-low-end-vps-review-part-xxxiii-ssd-nodes/\r\n\r\n&gt; with the impressive disk I/O of the SSD drives and fast customer support, SSD Nodes is definitely worth consideration if you need a VPS that partially requires high disk I/O without costing too much.\r\n\r\n4) http://www.webhostingtalk.com/showthread.php?t=1088161 (client for 2 years)\r\n\r\n&gt; Compiling was taking 20 mins on my reasonably fast machine at home and I cut that down to about 5 mins switching to his servers. I ran back to back compiles this weekend and it never missed a beat. Just a note, I didn't rent a beast of a machine, just the $20/mo one. Communication is key and Matt plus his staff are lightning quick with responses.\r\n\r\n5) http://www.webhostingtalk.com/showthread.php?t=1086271 (client for 2 years)\r\n\r\n6) http://www.webhostingtalk.com/showthread.php?t=1167685 (client for 2 years)\r\n\r\n&gt; Support Answers Super Fast (almost under 20 mins) never had downtime never had an issue with network nor hardware, staff is super friendly. I recomend SSD nodes if you are looking for a cuality host and 100% uptime host.\r\n\r\n7) http://www.webhostingtalk.com/showthread.php?t=1072168 (client for 1 year)\r\n\r\n--\r\n\r\nOur LEB servers are based on our extra capacity of newest bare metal, high performance computing (HPC) nodes in Canada. The difference is our HPC nodes get priority support, higher resource priorities, and higher SLA, whereas our LEB servers are more budget friendly. Pricing and availability for new LEB servers may change at any time based on our capacity, after ordering you'll be \"locked-in\" to the current price for the life of the server.\r\n\r\nOur LEB servers have 10GigE network interfaces, incredibly fast SSDs, and very powerful processors.\r\n\r\nWe’ve achieved over 1GB/s of write throughput and 200K IOPS, making these servers ideal for databases, financial modeling, big data analytics, rapid development, and high density mail and web servers.\r\n\r\n* LowEndBox Mu\r\n* 1x 2.60GHz E5-2650v2\r\n* 1GB ECC RAM\r\n* 10GB Enterprise SSD\r\n* OpenVZ + SolusVM Control Panel\r\n* 500GB Bandwidth @ 10Gbps (shared)\r\n* Only $5.95/mo! ($48/yr)\r\n* [Get started!](https://www.ssdnodes.com/manage/cart.php?a=add&amp;pid=83)\r\n\r\n\r\nIf you need a larger node (up to 240GB RAM), let us know and we can put together a custom package for you.\r\n\r\nNo-hassle refunds are provided within 7 days of ordering and are limited to monthly and annual billing cycles only. To qualify, it’s required that the Terms of Service hasn't been breached and no more than 10% of the bandwidth has been used. Refunds aren't available for hourly billing cycles.\r\n\r\n\r\nSpecial rules for LEB Servers:\r\n\r\n* Cannot exceed a load of 1.0 for more than 2 hours per 24 hours period or we may throttle it (HPC Nodes don't have this restriction)\r\n* Please be respectful and don't abuse the service\r\n* No torrents\r\n* No VPN (personal VPN is fine, although you're responsible for the traffic)"}