{"id": 39635, "date": "2014-12-25 04:48:00", "user": "frixelsolutions", "post": "Merry Christmas from Frixel Solutions!\r\n\r\nWe know you're busy so let's get right to the point - to celebrate this holiday season we are giving away a free smartphone to one lucky Frixel Solutions customer!\r\nHere's how it's going to work:\r\n\r\nOrder our \"Cloud Hosting\" web hosting plan using promo code \"**iwantmeawindowsphone**\" (don't use the quotes in the promo code). You'll pay $10 for a year of our most popular plan, which includes 10GB of storage and 100GB of monthly transfer. Usually valued at $59.88/year, you'll get the discounted price forever!\r\n\r\nDirect order link: https://www.frixelsolutions.com/secure/cart.php?a=add&amp;pid=1\r\n\r\nMore info/features: https://www.frixelsolutions.com/cloudhosting.php\r\n\r\nWe'll randomly pick one fortunate customer and send a brand new in box Nokia Lumia 520 smartphone running Windows Phone 8. While it's in AT&amp;T GoPhone retail packaging it'll work just fine with normal AT&amp;T service. Please note that this is NOT an unlocked phone and as such will probably not work with any other provider.\r\n\r\nNow, while it's all fun and games, there are some rules that you'll need to follow if you want to enter to win the phone. Even if you don't win a smartphone you're getting the lowest price we've ever advertised on premium West Coast hosting complete with cPanel and Softaculous:\r\n\r\n-Customers must be in the United States \"lower 48\" that means no Hawaii, Alaska, Canada, or international. \r\n\r\n-One entry is per hosting plan purchased. There's no limit to how many hosting plans you can purchase however all orders using the giveaway discount code are non-refundable.\r\n\r\n-Must be a valid United States address that USPS can ship to. No PO Boxes, please!\r\n\r\n-Fraud orders or orders cancelled for suspicious details are not eligible for winning the phone.\r\n\r\n-Promotion only applies to new orders, not existing websites hosted with us!\r\n\r\n-Orders must be placed between midnight (Pacific Time) on 12/24/14 and midnight (PST) 12/26/14 if you want to enter to win the phone. the coupon code will be valid until 12/31/14 however orders placed after midnight on the 26th won't get entered until the drawing.\r\n\r\n-The winner customer will be notified via ticket and phone (yes, we need a valid phone number) on Saturday the 27th. We won't ship your phone until you've confirmed your information via the support ticket we open in your account.\r\n\r\n-We won't provide any support for this phone - if you have problems please contact the manufacturer or you service provider. No returns, obviously!\r\n\r\nMore information about the phone:\r\n\r\nhttp://www.microsoft.com/en/mobile/phone/lumia520/\r\n\r\nhttp://www.gsmarena.com/nokia_lumia_520-5322.php\r\n\r\nhttp://www.techradar.com/reviews/phones/mobile-phones/nokia-lumia-520-1133192/review\r\n\r\nIf you've got any questions or concerns please feel free to contact us at sales@frixelsolutions.com and we'll respond shortly! Thank you for your business and here's to a new year filled with lots of visitors to your website hosted on Frixel Solutions!\r\n\r\n~Michael Staake\r\n\r\nPS: About our company: Frixel Solutions is your source for high quality, high performance hosting and infrastructure solutions from our own managed network and facility in California! We accept PayPal as well as credit cards directly through our website. \r\n\r\nhttps://www.frixelsolutions.com/"}