{"id": 39983, "date": "2014-12-31 11:44:37", "user": "VPNsh", "post": "Hey LET,\r\n\r\nSo I'm sure a few of you will be aware of the EU VAT changes that are happening. If not, you can follow the thread on it [here](http://www.lowendtalk.com/discussion/35101/the-elephant-in-the-room-vat-rules-jan-2015).\r\n\r\nDue to this, we're offering up yearly dedicated IP VPN packages at [FixedRoute](http://fixedroute.com) so that EU clients don't have to pay VAT each month. Clients outside the EU can get hold of this offer as well, however we'll still be closing it off before we tick over to 2015 (UK time).\r\n\r\nSo, FixedRoute provides dedicated IP VPN services in New York City and Seattle. This all runs over OpenVPN, and we even bundle a Viscosity license for you to use (usually $9 alone), as their software is significantly more user friendly than the standard OpenVPN client.\r\n\r\n&gt; **Our Offer - Valid until 00:00 GMT 1st Jan 2015**\r\n&gt;\r\n&gt;* New York City - 5TB/year bandwidth - [Order for $15/year](https://my.fixedroute.com/cart.php?a=add&amp;pid=7)\r\n&gt;* New York City - 10TB/year bandwidth - [Order for $20/year](https://my.fixedroute.com/cart.php?a=add&amp;pid=8)\r\n&gt;* Seattle - 5TB/year bandwidth - [Order for $15/year](https://my.fixedroute.com/cart.php?a=add&amp;pid=9)\r\n&gt;* Seattle - 10TB/year bandwidth - [Order for $20/year](https://my.fixedroute.com/cart.php?a=add&amp;pid=10)\r\n\r\nYou'll get your own IP address to use with this service, and can open up to 5 ports. Setup time on these packages is up to 48 hours, so please be patient.\r\n\r\nIf you've any questions, I'll be around here to answer them.\r\n\r\nThanks,\r\nLiam\r\n\r\n&gt;* Follow us on [Twitter](http://twitter.com/fixedroutevpn)\r\n&gt;* Like us on [Facebook](http://facebook.com/fixedroute)\r\n&gt;* Visit our [Website](http://fixedroute.com)\r\n\r\n_NOTE: Please leave any discussions regarding VPN.sh in the relevant topics. I'm more than happy to discuss anything regarding VPN.sh in the relevant topics. It should be noted that the VPN.sh service has been running to the standard expected for some time now._"}