{"id": 40548, "date": "2015-01-10 06:19:53", "user": "timnboys", "post": "VPS Offers - KeyedInHosting - We Hold the Key to your success!\r\n\r\nHere is some offers I have come up with right now since I am just starting this(these would be most likely promotional offers to help get me built up in the vps hosting world.)\r\nNote I am one person that deals with all of this, and don't worry I will respond to any of your help desk tickets asap if you ever need help....that is why I am just giving promotional offers right now due to trying to built myself up as a excellent and reliable provider. I understand some may be wary of even trying my services due to what silly posts I have made in the past and I apologize but I will try to prove to you my services aren't just a run of a mill service, and they aren't what they say they are(you know they're not good stay clear of them) and I will prove to you I am an excellent and reputable provider even if I have to give you a free vps for a week to show you for yourself how I will go above and beyond to prove that. And I am a honest business person so I will be honest about anything and not try to cover up anything.\r\n\r\nHere is what one person had to say:\r\n&gt; At least he's one of the most honest providers around.\r\n\r\nThat is right we are very honest we will not try to lie or cover up anything we base our business model around honesty we will never try to lie to you about anything we will tell you the absolute truth. and when there is honesty there is trust.\r\n\r\nHere is the offers now:\r\n\r\nXen-HVM 1024\r\n1024mb ram\r\nVirtualization: Xen HVM(like kvm..full virtualization)\r\n250gb of bandwidth(the reason the bandwidth isn't a terabyte is because I only get 5tb bandwidth from delimiter so I have to have bandwidth for everyone and myself :-)\r\nWindows(Bring your own license), Linux Centos 6, can insert your own iso if you don't like the default that I have with virtualizor.\r\n50gb of disk space.\r\n256 cpu units allocated\r\n1 Dedicated ipv4\r\n1 cpu core\r\n\r\n$15/year\r\nhttps://blesta.keyedinsoftware.us/index.php/order/config/index/order/?group_id=1&amp;pricing_id=3\r\n\r\nXen-PV 128\r\n128mb ram\r\nVirtualization: Xen-PV(like openvz)\r\n100gb of bandwidth\r\nLinux Centos 6, any other template please contact me via my blesta panel once you place your order and pay for it and I will pull the template down from virtualizator template browser and give it to you.\r\n5gb of disk space\r\n256 cpu units\r\n1 Dedicated Ipv4\r\n1 cpu core\r\n\r\n$1/month\r\n\r\nhttps://blesta.keyedinsoftware.us/index.php/order/config/index/order/?group_id=1&amp;pricing_id=4\r\n\r\nPlease note we will make custom plans tailored to you also.\r\nplease contact us via sales ticket at our blesta panel: https://blesta.keyedinsoftware.us for custom plans.\r\n\r\nAll orders must be manually verified by me to prevent fraud or abuse."}