{"id": 439, "date": "2011-10-19 14:59:07", "user": "gibibits", "post": "http://Gibibits.com - VPS and dedicated servers \n\n- 6 years in business\n- 24/7 livechat tech support by our experienced team\n- Gibibits Limited company incorporated in Hong Kong\nAll our VPS feature\n- Instant activation\n- SolusVM panel \n- Mirror RAID on all nodes\n- Guaranteed resources allocation - bandwidth, RAM and disk space are not oversold.\n- Our VPS are unmanaged, but qualified system administrators are at your service for additional modest fee.\n\nOur current VPS offers are here http://gibibits.com/vps.html , additionally we are willing to set up custom VPS in Germany, Netherlands, Switzerland or US. Contact me with your requirements if you need a quote. \n\nToday we are offering 2  VPS plans that were designed specially for LET :)\n\nYou wanted LEB with Directadmin license? Here you go! \n\nOpenVZ, 2 cores, 512 RAM + 512 swap, 25 GB hdd, 500 GB traffic/mo on 100 mbps uplink, Directadmin License!\n\nOrder link: http://billing.gibibits.com/cart.php?a=add&amp;pid=4  \n$7/mo or $60/year \n\nQuick Q&amp;A on this offer:\n\n- Ask our tech support for the license (by opening ticket, gtalk or livechat), this part is not automated. In your request please provide IP and OS of your box.\n- We can not set your license on any IP other than IP of your VPS with us, as it would violate our agreement with Directadmin. \n- We will provide you with license and detailed (and easy) installation instructions for your OS for free. Or we can install Directadmin on your box ourselves for $9 one time fee.\n- This is a limited time offer, but once you signed up - we guarantee price freeze, stable server performance and free directadmin license for as long as you are paying for the box.\n\nAnd our second offer - LEB with guaranteed, non oversold, 10 mbps pipe without monthly traffic limit! This plan might fit for streaming server, personal VPN or other purposes that require unmetered transfer.\n\nOpenVZ, 2 cores, 256 RAM + 256 swap, 10 GB hdd, 10 mbps dedicated unmetered.  \nOrder link http://billing.gibibits.com/cart.php?a=add&amp;pid=3  \n$7/mo or $60/year\n\nBoth plans are on nodes in Frankfurt, Germany. Test IP: 188.72.214.84\n\nIf you have any presales questions or need a custom quote - please contact me by email or gtalk gibibits@gmail.com. Please contact our 24/7 tech support by tickets at http://helpdesk.gibibits.com, email or gtalk support@gibibits.com, ICQ 222962071, skype gibibits.support or web based live chat on http://gibibits.com for any other issues.\n"}