{"id": 44472, "date": "2015-02-20 06:05:51", "user": "Melita", "post": "![](https://indovirtue.com/wp-content/uploads/cny.jpg)\r\n\r\n**Gong Xi Fa Cai! May the flow of blessings be upon you and your family continually. And welcome to IndoVirtue, where server hosting has never been this fast, easy and affordable.**\r\n\r\nWho are we?\r\n=====\r\n\r\nWe are privately held company and had been providing Webhosting solutions since late 2010 at local city in Indonesia for start-up projects, companies and young entrepreneurs. Then we continued entering unmanaged VPS market since around May 2013 globally under international commercial domain. We are currently holding strong with many happy customers. **Are you ready to tap your business into Asian market? We are.**\r\n\r\nThis thread is not meant for support. Instead, please feel free to contact us via [our support ticket system.](http://billing.indovirtue.com/contact.php) We will be happy answering any questions you may have! Below is our products portfolio:\r\n\r\n\r\n  \r\n  \r\n\r\n###[★ VPS Packages - US](https://indovirtue.com/us-openvz-ssd-vps)\r\n\r\n**LVOVZSSD-1** (Limited Stock)  \r\n512 MB RAM, 32MB vSwap  \r\n20 GB SSD Storage  \r\n1 vCPU Core  \r\n1000 GB Bandwidth  \r\n**$8/quarter. [Order Now!](https://billing.indovirtue.com/cart.php?a=add&amp;pid=4)**\r\n\r\n**LVOVZSSD-2** (Limited Stock)  \r\n1024 MB RAM, 32MB vSwap  \r\n40 GB SSD Storage  \r\n2 vCPU Core  \r\n2000 GB Bandwidth  \r\n**$5/month. [Order Now!](https://billing.indovirtue.com/cart.php?a=add&amp;pid=9)**\r\n\r\n* [Our network looking glass (for ping, traceroute and test ip / files).](http://lasvegas-lg.indovirtue.com/)\r\n\r\n* [Our mini speed test to see how it performs for you.](http://lasvegas-lg.indovirtue.com/speedtest)\r\n\r\n* Fiberhub LAS1 Datacenter, Las Vegas. Multi-homed BGP network from multiple Tier-1 upstreams. [Complete AS Info and Peering List.](http://bgp.he.net/AS53340#_peers)\r\n\r\n* 1 Gbit port burstable. Click for [our sequential write test and download test (in MByte).](https://indovirtue.com/wp-content/uploads/lvtest.jpg)\r\n  \r\n\r\n\r\n\r\n###[★ VPS Packages - Budget Singapore](https://indovirtue.com/budget-singapore-openvz-ssd-vps)\r\n\r\n**SGOVZPOPSSD-1** (Limited Stock)  \r\n512 MB RAM, 32MB vSwap  \r\n20 GB SSD Storage  \r\n1 vCPU Core  \r\n1000 GB Bandwidth  \r\n**$5/month. [Order Now!](https://billing.indovirtue.com/cart.php?a=add&amp;pid=22)**\r\n\r\n* [Our network looking glass (for ping, traceroute and test ip / files).](http://singaporepop-lg.indovirtue.com/)\r\n\r\n* [Our mini speed test to see how it performs for you.](http://singaporepop-lg.indovirtue.com/speedtest)\r\n\r\n* Softlayer Datacenter, Singapore. Multi-homed BGP network from multiple Tier-1 upstreams. [Complete AS Info and Peering List.](http://bgp.he.net/AS36351#_peers)\r\n\r\n* 100 Mbit port burstable. Click for [our sequential write test and download test (in MByte).](https://indovirtue.com/wp-content/uploads/sgpoptest.jpg)\r\n\r\n* **Our Budget Singapore VPS is only on 100Mbit port, does not have IPv6, and has higher ping to China, Philippines and some other country. If you're not satisfied with our Budget VPS network performance and reliability, please upgrade to our Premium Singapore VPS instead.**\r\n\r\n  \r\n  \r\n\r\n###[★ VPS Packages - Premium Singapore](https://indovirtue.com/premium-singapore-openvz-ssd-vps)\r\n\r\n**SGOVZSSD-1** (Limited Stock)  \r\n512 MB RAM, 32MB vSwap  \r\n10 GB SSD Storage  \r\n1 vCPU Core  \r\n400 GB Bandwidth  \r\n**$7/month. [Order Now!](https://billing.indovirtue.com/cart.php?a=add&amp;pid=17)**\r\n\r\n\r\n* [Our network looking glass (for ping, traceroute and test ip / files).](http://singapore-lg.indovirtue.com/)\r\n\r\n* [Our mini speed test to see how it performs for you.](http://singapore-lg.indovirtue.com/speedtest)\r\n\r\n* HostSG Global Switch Datacenter, Singapore. Multi-homed BGP network from multiple Tier-1 upstreams. [Complete AS Info and Peering List.](http://bgp.he.net/AS24482#_peers)\r\n\r\n* 1 Gbit port burstable, with excellent ping and throughput to every Asia country, including direct China routes. Click for [our sequential write test and download test (in MByte),](http://indovirtue.com/download-test.png) as well as [our speedtest result.](http://www.speedtest.net/result/3123186192.png)\r\n\r\n* Additional Bandwidth: $25/month for every 1000GB.\r\n\r\n* Additional IPv4: $3/month for every IP. More IPv6 for free, just make a support ticket.\r\n\r\n\r\n\r\n**★ VPS Details**\r\n\r\n* No setup fee with pro-rated billing to day one of each month, no minimum contract, 1 IPv4 and 1 IPv6 (Premium Singapore only) for each VPS plan.\r\n\r\n* VPS info usually emailed 45 seconds after payment received, unless our blacklist or anti-fraud system prevents it.\r\n\r\n* Full root access / SSH.\r\n\r\n* OpenVZ Virtualization, TUN/TAP/GRE/PPTP/DAHDI/FUSE/IPTABLES can be enabled.\r\n\r\n* SolusVM Control Panel, IPv4 and IPv6 RDNS can be set by client. IPv6 only available in Premium Singapore location.\r\n\r\n* Hosted on Enterprise Grade hardware: SuperMicro case, Intel Xeon E3, ECC RAM, Pure SSD Storage without spinning HDD.\r\n\r\n* OS Templates: 64 bit of Debian 7, **Elastix 2.5**, CentOS 6, CentOS 7 and Ubuntu 14.04. Cpanel VPS license available and custom templates request possible, just make a support ticket.\r\n\r\n\r\n\r\n**★ Summary of Legal aspects**\r\n\r\n* IndoVirtue servers is protected by RAID storage with offsite weekly backup. However, we are not offering any data integrities guarantee / liability. Please backup your own data regulary.\r\n\r\n* All services are provided on an \"as is\" basis. IndoVirtue will not be responsible for any damages your business may suffer.\r\n\r\n* 99.9% uptime guarantee applied, except on scheduled maintenance and DDOS attack. Service Level Agreement claims will be made in the form of account credit only.\r\n\r\n* Network null will be applied if your VPS is attacked by DDOS. Repeated attacks means service refund from us.\r\n\r\n* TOR, Adult/pornographic, Virus/worm/trojan and copyrighted content is prohibited. You will be allowed twenty four hours to respond to the complaint.\r\n\r\n* Legal by law activities only. Obvious spamming, phising, port scanning, OSCAM, and hacking activities means instant termination.\r\n\r\n* CPU abusive activities like coin mining, Minecraft and video encoding is prohibited. Please make a support ticket for specific permission and exception.\r\n\r\n* Detailed TOS, AUP, and privacy policy [is in here.](http://indovirtue.com/legal) By signing up to our service, you are agree with our terms. Please read in details before.\r\n\r\n\r\n\r\nTestimonial:\r\nhttp://www.webhostingtalk.com/showpost.php?p=8917695&amp;postcount=2\r\n\r\nThank you for spending your time in reading this thread in details, we really appreciate it and definitely looking forward to serving you soon. Have a good day :)\r\n"}