{"id": 44502, "date": "2015-02-20 13:28:07", "user": "rsk", "post": "Hello,\r\n\r\nI would like to share a module that we have developed in house, but has the ability to be used by many providers to help weed out fraudsters and verify your client base.\r\n\r\nWe needed a module to help verify phone numbers after maxmind decided to stop this service and the other service providers requiring a minimum of $100 per month just to verify phone numbers. This was just not possible for a small/budget hosting company.\r\n\r\nThere were a lot of solutions out there, that were literally stuck with tape. Any WHMCS update to the template files, would mean your whole solution would stop working or even to the point where everything is lost. **Hence, there are 'zero template changes' required in the module - not a single file is dependent on the templates you use**.\r\n\r\nThe module it self costs a mere $10 as a one time fee, and you get unlimited support and free upgrades and updates forever.\r\n\r\n[Read More | Order](http://myrsk.com/software.php)\r\n\r\n\r\n**Features**&lt;br&gt;\r\n\r\n**Admin Side**&lt;br&gt;\r\nView current unverified accounts&lt;br&gt;\r\nView current verified accounts&lt;br&gt;\r\nSearch for accounts in the system&lt;br&gt;\r\nVerify accounts manually from admin panel&lt;br&gt;\r\nUnverify accounts manually from admin panel&lt;br&gt;\r\nReset amount of verification attempts&lt;br&gt;\r\nCustomize the SMS greeting/beginning message&lt;br&gt;\r\nCustomize the SMS thankyou/ending message&lt;br&gt;\r\n&amp; more!&lt;br&gt;\r\n\r\n**Client Side**&lt;br&gt;\r\nSimple self service verification process&lt;br&gt;\r\nTwo verification attempts per customer&lt;br&gt;\r\nAbility to self place the verification code&lt;br&gt;\r\nProper error messages that guide and not mislead&lt;br&gt;\r\n\r\n\r\n&lt;pre&gt;\r\nFAQ\r\nQ: Will this module require old/current clients to verify their accounts?\r\nA: No! This is the beauty of the module. It will not trouble your old/current clients! Only clients' who are new and place new orders will be verified.\r\n\r\nQ: What if a potential customer signs up, but does not order a product or a service?\r\nA: The system is smart, and will try to save you some money. It will send out a verification SMS, and guides the customer through the verification process only if they add a product and checkout!\r\n\r\nQ: Is this module really purchasable for a one time fee? No recurring or hidden prices?\r\nA: This is absolutely correct! A one time payment grants you a license key, which you can use on your WHMCS when you install the module - the one time payment also includes unlimited free updates and support! No hidden or recurring fees.\r\n\r\nQ: Why Twilio as the SMS Gateway?\r\nA: There is cheap price, or guaranteed delivery - but never both. After a lot of study and research, we found that Twilio offers competitive SMS rates and a delivery guarantee system!\r\n\r\nQ: Will fraudsters be able to manipulate the system?\r\nA: There is a maximum of 2 verification attempts per phone number, if the customer goes through two SMS deliveries, and still not verified his/her account - the system will lock the automatic verification process and ask him/her to open a ticket on your system. Also, previous numbers (duplicates) are not allowed to verify their accounts.\r\n&lt;/pre&gt;\r\n\r\n\r\nClient Side Screenshots: &lt;br&gt;\r\n\r\n &lt;a href=\"http://myrsk.com/img/pvs/pvs-main.png\"&gt;Main Page&lt;/a&gt; &lt;br&gt;\r\n &lt;a href=\"http://myrsk.com/img/pvs/pvs-entervc.png\"&gt;Enter Verification Code&lt;/a&gt; &lt;br&gt;\r\n &lt;a href=\"http://myrsk.com/img/pvs/pvs-success.png\"&gt;Success Page&lt;/a&gt; &lt;br&gt;\r\n &lt;a href=\"http://myrsk.com/img/pvs/pvs-wrongvc.png\"&gt;Wrong Verification Code&lt;/a&gt; &lt;br&gt;\r\n &lt;a href=\"http://myrsk.com/img/pvs/pvs-usedattempts.png\"&gt;Used All Attempts&lt;/a&gt; &lt;br&gt;\r\n &lt;a href=\"http://myrsk.com/img/pvs/pvs-duplicate.png\"&gt;Duplicate Number&lt;/a&gt; &lt;br&gt;"}