{"id": 51261, "date": "2015-04-29 00:16:55", "user": "ATHK", "post": "Just recieved the below email,\r\n\r\n\r\n&gt; Spring has sprung, the leaves have started to grow on the trees.  With the long winter back behind us, Crissic Solutions continues to celebrate our second anniversary with the the expansion of VPS hosting services in Los Angeles, California.\r\n&gt; \r\n&gt;  \r\n&gt; \r\n&gt; Available immediately is our initial offering of OpenVZ SSD VPS services in the Quadranet data center in sunny Los Angeles, California.  This location continues to be a great value for customers in Asia with an optimized network to improve latency and routes.  Good routes plus Crissic's everyday low prices make our deal unmatched. \r\n&gt; \r\n&gt; \r\n&gt; ANNUAL CASH SAVER!\r\n&gt; \r\n&gt; $12 256MB Annual – SVZ256 LAX\r\n&gt; \r\n&gt; https://my.crissic.net/cart.php?a=add&amp;pid=102&amp;billingcycle=annually\r\n&gt; \r\n&gt;  \r\n&gt; \r\n&gt; $4 512MB Monthly – SVZ512 LAX\r\n&gt; \r\n&gt; https://my.crissic.net/cart.php?a=add&amp;pid=103\r\n&gt; \r\n&gt; \r\n&gt; \r\n&gt; $6 1GB Monthly – SVZ1024 LAX \r\n&gt; \r\n&gt; https://my.crissic.net/cart.php?a=add&amp;pid=104\r\n&gt; \r\n&gt;  \r\n&gt; \r\n&gt; SUPER SPECIAL PRICE! \r\n&gt; $7 2GB Monthly – SVZ2048 LAX\r\n&gt; \r\n&gt; https://my.crissic.net/cart.php?a=add&amp;pid=105\r\n&gt; \r\n&gt;  \r\n&gt; \r\n&gt; The servers for this new launch are 100% powered by pure SSD drive.  This isn't a cache-only SSD offering. All drives in these servers are SSDs and they are fast!  We are using Micron SSDs capable of over 500MB/s read and writes and over 1GB/s combined throughput.  Our server builds and the packages we are offering are identical to what we have been offering since last year in Jacksonville, Florida (Dell enterprise hardware, dual hexa Intel processors with 12 cores / 24 threads,  48GB of RAM, RAID-10 disk, IPv4 and IPv6 addresses).\r\n&gt; \r\n&gt;  \r\n&gt; \r\n&gt; Need something custom?  Crissic offers custom packages and bulk order discounts. Contact us and let's see how we can work together.  We have bulk IPv4 addresses available for customers that need them.\r\n\r\n\r\nI really wish they explained what size of the SSD you'll get with those plans in the email..\r\n\r\nThe order form doesn't tell you either..\r\n\r\n![](http://oi62.tinypic.com/2zp5rok.jpg)\r\n\r\nSeems it may be this - https://crissic.net/openvz_ssd_vps\r\n\r\n&gt; 20GB 100% PURE SSD Storage\r\n&gt; \r\n&gt;  750GB Bandwidth\r\n&gt; \r\n&gt;  256MB RAM\r\n&gt; \r\n&gt;  1 IPv4 Dedicated IP\r\n&gt; \r\n&gt;  /64 IPv6 Subnet\r\n&gt; \r\n&gt;  1Gbps Port\r\n&gt; \r\n&gt;  2 CPU Cores (Fair Share)\r\n\r\n\r\nAnd they're out of stock."}