{"id": 52683, "date": "2015-05-14 21:48:19", "user": "doverland", "post": "The 'Affordable VPS' from Availanet is a great solution at a great price!  \r\n\r\n* Unmetered 5mbps bandwidth\r\n* 512 mb ram \r\n* 2x vCPU\r\n* 5GB Boot Disk.  \r\n* Starting at $3.99 and you can customize at order time or at any time in the future!\r\n\r\nWhat are the upper configurable limits of an Availanet Affordable KVM VPS?\r\n\r\n* Max 6 vCPU\r\n* Max 2 GB Ram\r\n* Max 120GB hard drive space\r\n* Max 61 IP addresses\r\n* Max 10 mbps unmetered bandwidth\r\n\r\nOperating system images for Ubuntu, Centos, Debian, FreeBSD available today.  It is a minor matter to add additional ISO's for booting a distro or OS I don't currently have so if you don't see what you need, just ask.\r\n\r\nYou will get a Proxmox login and be able to console to your server, switch install OS, reboot, and check on your performance history graphs. \r\n\r\nIf you have some other requirement (more disk, more IP addresses, more RAM... something specific) please ask for a quote.  \r\n\r\nWaitasec – doesn't the subject say “as low as $2.99”?  Absolutely, and here are some great deals to get you there:\r\n\r\n1.  Before May 31,  sign up on the quarterly payment plan and use the Promotional Code **QUARTERLY** to get $0.50/mo off your price (your $3.99 VPS just became $3.49)\r\n\r\n2.  Before May 31, sign up on the semi-annual payment plan, use the Promotional Code **SEMIANNUAL** and get $0.75/mo off your price (your $3.99 VPS just became $3.24)\r\n\r\n3. Before May 31, sign up on the annual payment plan, use the Promotional Code **ANNUAL**, and get $1.00/mo off your price (your $3.99 VPS just became $2.99!)\r\n\r\nAll promo codes are for new signups and good for the duration of your subscription with Availanet.  \r\n\r\nYou're going to want to test out download performance and ping latency.  No problem, I've set up an IP address that you can use.  \r\n\r\nhttp://66.209.190.109/test.file\r\n\r\nServers are located in Kelowna, BC, Canada.\r\n\r\nUse the link below to build your ideal VPS and sign up today!\r\n\r\nhttps://billing.availanet.com/cart.php?a=add&amp;pid=13&amp;carttpl=cart"}