{"id": 53613, "date": "2015-05-25 07:36:00", "user": "XFS_Duke", "post": "★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ &lt;br /&gt;\r\nUse Coupon **MEMORIAL25** for 25% off your first month!&lt;br /&gt;\r\n★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ &lt;br /&gt;\r\n\r\n[**XFuse Solutions, LLC**](http://www.xfusesolutions.com) is proud to announce our partnership with SmarterTools, Inc!&lt;br /&gt;\r\n\r\nWe're providing all of the SmarterTools licenses such as SmarterMail, SmarterTrack and SmarterStats on a low cost monthly basis. &lt;br /&gt;\r\nWe're also providing free SmarterTools Bundles to customers who purchase select plans. &lt;br /&gt;\r\nThe SmarterTools Bundle includes $800 worth of software licenses including SmarterMail Pro 250!&lt;br /&gt;\r\n\r\n**Here's Why to Choose XFuse Solutions, LLC**&lt;br /&gt;\r\n\r\nThe XFuse Solutions, LLC team has almost 25 years of combined hosting industry experience.&lt;br /&gt;\r\n\r\nWe go the distance to make sure customers are satisfied. We have a team of support representatives who keep everything \r\nrunning smoothly and who will provide you with the best support possible. It's their job to assist customers and they enjoy helping.\r\n\r\nWe are a customer focused company. We are smart enough to realize that happy customers make for a happy business. \r\nWe value our customers and try to deliver reliable services backed by responsive support. We offer a 14 Day Money Back\r\nGuarantee for our VPS &amp; Shared Hosting Services. We accept PayPal, Credit/Debit Cards &amp; Bitcoin as payment methods.\r\n\r\n**TacVPS is fully owned and operated by XFuse Solutions, LLC.**&lt;br /&gt;\r\n\r\n**Freebies! Included with every server**&lt;br /&gt;\r\n\r\nFree Wildcard AlphaSSL&lt;br /&gt;\r\nFree IPMI Access&lt;br /&gt;\r\nFree SmarterTools Bundle! ($800 Value. Requires Windows License for Dedicated Server Purchase)&lt;br /&gt;\r\n\r\n**Our Plans**&lt;br /&gt;\r\n\r\nAll of these servers are located in Buffalo, NY in the ColoCrossing Datacenter. Other locations available. Contact us.&lt;br /&gt;\r\n\r\n★ ★ ★ **Intel Atom C2758 Octo Core** ★ ★ ★&lt;br /&gt;\r\n8GB RAM&lt;br /&gt;\r\n250GB HDD&lt;br /&gt;\r\n10TB Bandwidth&lt;br /&gt;\r\n5 IPv4&lt;br /&gt;\r\nChoice of OS&lt;br /&gt;\r\n$48.00/month&lt;br /&gt;\r\nGet 25% off your first month with coupon code MEMORIAL25&lt;br /&gt;\r\n★ ★ ★ [Order Here](https://www.tacvps.com/cart.php?a=add&amp;pid=460) ★ ★ ★&lt;br /&gt;\r\n\r\n★ ★ ★ **SM-VPS4** ★ ★ ★&lt;br /&gt;\r\n4 CPU Cores (Shared)\r\n4GB RAM&lt;br /&gt;\r\n200GB HDD&lt;br /&gt;\r\n3TB Bandwidth&lt;br /&gt;\r\n2 IPv4&lt;br /&gt;\r\nOpenVZ&lt;br /&gt;\r\n$7.00/month&lt;br /&gt;\r\nUse Coupon Code LETMEM7 for the pricing&lt;br /&gt;\r\n★ ★ ★ [Order Here](https://www.tacvps.com/cart.php?a=add&amp;pid=424) ★ ★ ★&lt;br /&gt;\r\n\r\n**About Us**\r\n\r\nFounded in Cankton, LA, XFuse Solutions is a privately owned Limited Liability Corporation. We were built on a promise of being great.\r\nSince 2012, we've provided low cost and reliable hosting services to customers all over the world. We value our relationship with our\r\nawesome clietele and have grown year after year. Since inception, XFuse has made great strides in bringing bigger and better things to\r\nour customers. We've picked up a few companies along the way as well. TacVPS (From Brian Oliver), GridHostingSolutions, myBlogster\r\nand OneBestHost. While we don't actively go after any \"awards\" from the industry, we believe that we have provided our customers \r\nwith a wide range of reliable and solid services that could ultimately bring us awards. However, the only award we want is to be\r\nawarded with your business. \r\n\r\nXFuse Solutions prides itself in providing the best to our customers. With this, we've partnered with a few of the best companies. For\r\nexample, SmarterTools, Inc, Attracta, Cloudflare, GlobalSign and a lot more. To read more about us and our team, please [&lt; click here &gt;](http://www.xfusesolutions.com)"}