{"id": 55101, "date": "2015-06-13 05:53:47", "user": "SoaringServers", "post": "Soaring Servers was built with the consumer in mind. We built a program that we believe will not only benefit our company but our current and future customers.\r\n\r\nWhat you get with us:\r\n\r\n24/7 Tech support\r\n\r\nPure SSD Storage with Raid 10\r\n\r\nUnique Storage and Bandwidth Programs\r\n\r\nAshburn, VA for Server location with 1 GBPS UPLINK PORT\r\n\r\n\r\nOverstock Sale:\r\n\r\nHow many are in stock: 30\r\n\r\n**Server specifications:**\r\n\r\n-1 GB RAM\r\n\r\n-100 GB Storage*\r\n\r\n-1 TB Bandwidth*\r\n\r\n-1 IPv4 Address\r\n\r\n-4 Cores Shared\r\n\r\nPrice before discounts: $57.60 per year (SAVE $47.60)\r\n\r\nPrice you pay today: $10 per year  (Use promo code: LET$10)\r\n\r\nOrder here: https://www.soaringservers.com/billing/cart.php?gid=1\r\n\r\n**_If you do not get the first offer please feel free to get our second offer_**\r\n\r\nHow many are in stock: 50\r\n\r\n**Server specifications:**\r\n\r\n\r\n-1 GB RAM\r\n\r\n-100 GB Storage*\r\n\r\n-1 TB Bandwidth*\r\n\r\n-1 IPv4 Address\r\n\r\n-4 Cores Shared\r\n\r\nPrice before discounts: $57.60 per year (Save $42.60)\r\n\r\nPrice you pay today: $15 per year (Use promo code: LET$15)\r\n\r\nOrder here: https://www.soaringservers.com/billing/cart.php?gid=1\r\n\r\nHow we run our storage and Bandwidth system:\r\n\r\nYou should never feel like you have to pay for extra storage or bandwidth that you actually need. We fully understand this and that is why we don’t ever limit you if you need the extra storage. If you need more resources just open a ticket with why you need more and we will review your account. (Please note that this is not unlimited or unmetered storage and bandwidth. Each account will have a starting limit. We just upgrade accounts if the account is in good standing. If you have any questions about how this works please email myself at matthew@soaringservers.com\r\n\r\nHow fast will my order be processed:\r\n\r\nOrders are typically processed within 10 hours of the order being made. Please note that it may take up to 24 hours to process your order. If you have ordered an account and your account is past the 24 hours please open a support ticket.\r\n\r\n\r\nQuick note:\r\n\r\nIf you are trying to use a promo code and it does not work. This means that we have sold out of that promotion. If you need any help at all please feel free to contact myself at matthew@soaringservers.com\r\n\r\n\r\nThanks LET Members.\r\nAgain feel free to contact us if you have any questions at all!\r\n\r\n\r\n\r\n\r\n\r\n"}