{"id": 5904, "date": "2012-11-11 22:43:17", "user": "jar", "post": "I'm not just making an offer, I'm reintroducing myself to you. One of the biggest fears around here seems to be whether or not people really know their provider. I'm going to put myself out there for you even more than I have in the past and tell you why I deserve your business. First, for those who don't care about the rest, the promo to kick off our new expansion into Dallas! The regular plans have also been extended to Dallas and are listed at the bottom of this post.\r\n\r\n*IPv6 Not currently offered.\r\n\r\nOFFER SOLD OUT. To continue to say thank you, here are three additional promotional offers for the remainder of the month!\r\nTall: Double RAM, BW, Storage.\r\nGrande: Double BW, Storage.\r\nVenti: Double Storage\r\nAutomatically applied upon VPS creation.\r\n\r\n&lt;pre&gt;PROMO:\r\nTrenta\r\nCPU: 4 CPU Cores\r\nRAM: 2GB\r\nSwap: 512MB (vSwap)\r\nStorage: 75GB (HW Raid10 with BBU)\r\nBandwidth: 1TB @ 1Gpbs\r\n$10/m OR $7/m with promo code \"nomorechicago\"\r\nONLY 10 AVAILABLE, ONLY IN DALLAS\r\nOrder: http://catalysthost.com/clientarea/cart.php?a=add&amp;pid=35\r\nTest IP: 192.211.54.101\r\nTest file: http://192.211.54.101/100mb.test&lt;/pre&gt;\r\n\r\n&lt;pre&gt;bench.sh:\r\nCPU model :  Intel(R) Xeon(R) CPU E5-2620 0 @ 2.00GHz\r\nNumber of cores : 4\r\nCPU frequency :  2000.118 MHz\r\nTotal amount of ram : 2048 MB\r\nTotal amount of swap : 512 MB\r\nDownload speed from CacheFly: 93.1MB/s \r\nDownload speed from Linode, Atlanta GA: 10.6MB/s \r\nDownload speed from Linode, Dallas, TX: 83.8MB/s \r\nDownload speed from Linode, Tokyo, JP: 6.26MB/s \r\nDownload speed from Leaseweb, Haarlem, NL: 11.2MB/s \r\nDownload speed from Softlayer, Singapore: 5.69MB/s \r\nDownload speed from Softlayer, Seattle, WA: 23.0MB/s \r\nDownload speed from Softlayer, San Jose, CA: 30.3MB/s \r\nDownload speed from Softlayer, Washington, DC: 26.1MB/s \r\nI/O speed :  294 MB/s&lt;/pre&gt;\r\n\r\nAs always, the most important thing that I want to do is thank our clients. I couldn't do this without you, obviously. Catalyst is all about you. Your success is my success. Your failure is my failure. We're in this together. It doesn't matter what plan you subscribe to, you are paying me to look out for you. I'm not doing you any favors, you're doing me the favor by giving me the chance to serve you and your clients.\r\n\r\nHas your VPS provider let you down? Are you ready to move to a provider that wants to treat you like a paying customer? Do you feel that \"unmanaged\" is too often cited as an excuse for providing inadequate service?\r\n\r\nWell I'm not here to sweet talk you. I'm not here to make myself out to be perfect. In fact, I'm going to tell you every mistake I've made as a VPS provider. I'm going to tell you what happened and how I resolved it. You want some insight into how I manage my nodes? Look no further.\r\n\r\nSummary of issues since launch:\r\n&lt;pre&gt;Denver, CO \"node2\" - Outgoing DDOS caused kernel panic, reboot followed.\r\nResolution: Manual approval on all orders of 100mbit unmetered package, increased level of fraud detection.&lt;/pre&gt;\r\n&lt;pre&gt;Denver, CO \"node2\" - Bandwidth dropped to average of 40mbit burst for the entire node.\r\nResolution: Waited for FDC Denver to address the issue. Persisted for roughly four days. I might have punched a few insignificant objects over my anger at my inability to solve the issue as it was completely in the hands of the datacenter. Provided $1 compensation to everyone on the node.&lt;/pre&gt;\r\n&lt;pre&gt;Denver, CO \"node2\" - WHMCS initiated termination of a container, wrong container was deleted.\r\nResolution: Termination or suspension now done manually, client given 3 months credit, apologized sincerely. I was quite upset over this for several days. There is no justification, no excuse, and the container was so new that it hadn't been backed up.&lt;/pre&gt;\r\n&lt;pre&gt;Lenoir, NC \"node4\" - Kernel panic. Was working on wife's car at the time, didn't hear my phone ding. Took almost an hour to get the issue resolved because of that.\r\nResolution: Added repetitive warnings, louder alerts on my phone, offered compensation to anyone who requested it.&lt;/pre&gt;\r\n&lt;pre&gt;Biggest problem with Catalyst: Denver. A lot of people love it and they're getting a lot more than their money's worth of use. The hardware is great. The bandwidth is trash. It's the best trash around, but it's trash.\r\nResolution: Denver is another product, I won't deny people what they want, but I'm not marketing it heavily. We need two locations for our VPS offering and Lenoir, NC is the only real location that I'm proud of. We're adding Dallas to the mix with a brand new E5 node with no corners cut. It's a beast and I'm proud to announce that it continues with my demand for our business. That demand being that every node must be better than the one before it.&lt;/pre&gt;\r\n\r\nNow you know who I am. So what's next? Let me get to know you. Tell me how I can provide you service that you can feel confident in so that you can finally sleep at night. If I know you and your needs, I can even better tailor my brand of system administration to your services. You're welcome to handle everything on your own without filling me in, but I'm offering you the chance to have a provider that can look out for your best interest.\r\n\r\nOpenVZ - Lenoir, NC &amp; Dallas, TX\r\n\r\n&lt;pre&gt;Tall\r\n2 CPU Cores\r\n256MB RAM / PROMO: 512MB\r\n256MB vSwap / PROMO: 512MB\r\n20GB Storage / PROMO: 40GB\r\n300GB Bandwidth @ 1Gbps / PROMO: 600GB\r\nhttp://catalysthost.com/clientarea/cart.php?a=add&amp;pid=32&lt;/pre&gt;\r\n\r\n&lt;pre&gt;Grande\r\n2 CPU Cores\r\n512MB RAM / PROMO: 1024MB\r\n512MB vSwap / PROMO: 1024MB\r\n30GB Storage / PROMO: 60GB\r\n400GB Bandwidth @ 1Gbps\r\nhttp://catalysthost.com/clientarea/cart.php?a=add&amp;pid=33&lt;/pre&gt;\r\n\r\n&lt;pre&gt;Venti\r\n4 CPU Cores\r\n1024MB RAM\r\n1024MB vSwap\r\n40GB Storage / PROMO: 80GB\r\n500GB Bandwidth @ 1Gbps\r\nhttp://catalysthost.com/clientarea/cart.php?a=add&amp;pid=34\r\n*Stock currently only available in Dallas&lt;/pre&gt;\r\n\r\nDenver options still available here: http://catalysthost.com/clientarea/cart.php?gid=4"}