{"id": 60676, "date": "2015-08-14 06:12:32", "user": "Jonchun", "post": "[![](https://manage.gomach5.com/templates/six/img/logo.png)](https://www.gomach5.com/)\r\n\r\nHello Everyone! Go Mach 5 is entering the market with awesome offerings for those at LET. We are a small, privately funded company founded by people who care. Go Mach 5, LLC is a brand that has been under planning for some time and has finally come to fruition in early 2015.\r\n\r\nWhile we were mainly focused on local business clients, we've decided to take the next step and take pre-orders for our new and upcoming dedicated server offerings. This limited edition pre-order guarantees you stock and a much lower price on the best low-end dedicated server offerings coming soon. We're completely revamping the site and our billing portal, so please bear with any minor mistakes you may encounter. (Everything will be ready by full re-launch!)\r\n\r\nWe have made arrangements to colocate a full cabinet to start out with at Psychz (great team they have over there!) and will be using older but solid hardware.\r\n\r\n**Features**  \r\n- FREE 20Gbps Mitigation  \r\n- Tier 1 Bandwidth Providers including CT, CN2, CU  \r\n- 1 Gbps port  \r\n- /29 IPv4 (5 Usable)\r\n- /64 IPv6 (Upon request)  \r\n- Free Hardware Replacement  \r\n- IPMI/KVMoIP  \r\n\r\n**Location:** Los Angeles (Psychz DC)  \r\n\r\n_**Pre-Order Offer**_  \r\nDual L5420 (2x4 cores, 2.5Ghz, 12MB cache)  \r\n16 GB RAM  \r\n500 GB SATA 7200  \r\n/29 IPv4  \r\n5 TB Bandidth @ 1 Gbps  \r\n**$39**/month using **LETPREORDER  **  \r\n[Order Here](https://manage.gomach5.com/cart.php?a=add&amp;pid=1)\r\n\r\nPre-Order Terms:  \r\n- Limited Stock: We are releasing only a very limited amount of stock for the preorder. The pre-ordered server IS transferrable to another client up to ONE time for free. Any other transfers of service require a $10.00 transfer fee.  \r\n- This is a PRE-ORDER. This means that the servers will not be provisioned immediately. You are reserving your spot for when they are ready.  \r\n- Estimated provision time is late August/early September.  \r\n- If your order is not ready by the end of September, you are eligible for a 100% full refund OR a free month's credit.  \r\n- Any chargebacks/refunds during the provisioning window is strictly prohibited. Please make sure you understand that this is a PRE-ORDER.  \r\n\r\n\r\nQuestions?  \r\nCurrently, we will be taking questions only through this thread. Existing clients are being treated through our support portal. All sales/pre-order questions should be either over LET PM or on this thread. Thank you!\r\n\r\nOther:  \r\nApproval of pre-order sale received from @Spirit."}