{"id": 62369, "date": "2015-09-03 18:31:49", "user": "ratherbak3d", "post": "&lt;img src=\"http://virtual6.net/virtual6-logo2.png\"&gt;\r\n\r\nInitially launched in 2013 Virtual6® has since been re-structured and re-formed as both a brand and a company. Now operating as a UK partnership, a substantial amount of time and money has been invested to provide a financially sustainable and profitable service that also offers quality and affordability to the company's and individuals that invest in us.\r\n\r\nBy choosing us you're choosing a passionate team of individuals with a physical presence in the UK, meaning both our support and manufacturing services are provided in house with zero outsourcing. As a business, we're at the forefront of the hosting industry, bringing the latest hardware and components to an outdated and overpriced UK hosting market. Buy purchasing services from us, you're supporting a real UK business partnership ran by local people from Yorkshire, England. And we sincerely appreciate it.\r\n\r\nFor the most part, we own all of our hardware and equipment, located at our UK datacenter in Coventry and as a business we are 100% free from finance or hire purchase agreements. The only exceptions are services we provide abroad whereby we use rented hardware to benefit our ever growing customer requirements. Please contact us today for further information, or a free no obligation quote. Thank you for reading!\r\n\r\n\r\n**V6VS01**\r\n&lt;br&gt;\r\n2GB DDR3 RAM\r\n&lt;br&gt;\r\n100GB SATA HDD\r\n&lt;br&gt;\r\n6.25% Dedicated vCPU\r\n&lt;br&gt;\r\n5TB Bandwidth PCM\r\n&lt;br&gt;\r\n1000Mbps Shared port\r\n&lt;br&gt;\r\n6GB External FTP/S storage\r\n&lt;br&gt;\r\nAuto DDoS detection\r\n&lt;br&gt;\r\nAuto DDoS mitigation\r\n&lt;br&gt;\r\n1x IPv4 w/ rDNS\r\n&lt;br&gt;\r\nKVM Hardware virtualization\r\n&lt;br&gt;\r\nDatacenter: France (RBX4)\r\n\r\nRRP: £6.09/month\r\n&lt;br&gt;\r\nSpecial Offer: £3.88/month \r\n&lt;br&gt;\r\nWith promo \"V6BANKHOLIDAYAUG31\" valid until the 7th of September.\r\n&lt;br&gt;\r\nhttps://virtual6.net/blesta/order/main/index/virtual-servers"}