{"id": 64706, "date": "2015-10-01 13:43:30", "user": "perennate", "post": "&lt;b&gt;Luna Node Dynamic - the Canadian Cloud Virtualization Platform (KVM)&lt;/b&gt;\r\n\r\n&lt;a href=\"https://dynamic.lunanode.com/info.php\" target=\"_blank\"&gt;Luna Node Dynamic&lt;/a&gt; is our powerful cloud virtualization platform featuring rapid virtual machine deployment, snapshotting capabilities, an API for automation, complementary minimal server monitoring and DNS hosting, security groups, detachable volumes, and more. We have locations in Toronto and Montreal, providing reliable virtual private server hosting using the KVM hypervisor and the OpenStack software suite.\r\n\r\n&lt;b&gt;SSD Instances&lt;/b&gt;\r\n\r\nInstances with pure SSD RAID10 storage and Xeon E5-2670 CPU's are now available in Toronto! Pricing starts at $4.5/mo (see details below). SSD-cached instances can easily be resized to these new plans from the panel.\r\n\r\nCheck out the &lt;a href=\"http://serverbear.com/benchmark/2015/09/29/njpitnK5b52mw7H1\"&gt;ServerBear benchmark&lt;/a&gt;.\r\n\r\n&lt;b&gt;Pricing&lt;/b&gt;\r\n\r\nAll plans come with a 1gbps network port, unmetered internal traffic, KVM virtualization (with support for installation from custom ISO's), and optional storage on a &lt;a href=\"https://wiki.lunanode.com/index.php/Volumes\" target=\"_blank\"&gt;distributed Ceph RADOS cluster&lt;/a&gt; (provisioning on a Ceph volume gives high availability in case of host node failure, but SSD instances use the same Ceph cluster as SSD-cached instances).\r\n\r\n* SSD 512 - 512 MB RAM, 1 vCPU, 15 GB SSD-cached storage, 1000 GB bandwidth, $0.0063 hourly ($4.5 monthly)\r\n* SSD 1024 - 1024 MB RAM, 2 vCPU, 20 GB SSD-cached storage, 2000 GB bandwidth, $0.0097 hourly ($7 monthly)\r\n* SSD LL1024 - 1024 MB RAM, 1 vCPU, 15 GB SSD-cached storage, 1000 GB bandwidth, $0.0069 hourly ($5 monthly)\r\n* SSD LL2048 - 2048 MB RAM, 1 vCPU, 20 GB SSD-cached storage, 1500 GB bandwidth, $0.0097 hourly ($7 monthly)\r\n* 512 MB - 512 MB RAM, 1 vCPU, 15 GB SSD-cached storage, 1000 GB bandwidth, $0.005 hourly ($3.6 monthly)\r\n* 1024 MB - 1024 MB RAM, 2 vCPU, 20 GB SSD-cached storage, 1500 GB bandwidth, $0.0072 hourly ($5.18 monthly)\r\n* Special 2048 - 2048 MB RAM, 2 vCPU, 20 GB SSD-cached storage, 2000 GB bandwidth, $0.0097 hourly ($7.00 monthly)\r\n* Special 1536 - 1536 MB RAM, 1 vCPU, 15 GB SSD-cached storage, 2000 GB bandwidth, $0.0072 hourly ($5.18 monthly)\r\n\r\n&lt;b&gt;&lt;a href=\"https://dynamic.lunanode.com/plans.php\" target=\"_blank\"&gt;See full plan list here.&lt;/a&gt;&lt;/b&gt;\r\n\r\n&lt;b&gt;Features&lt;/b&gt;\r\n\r\nWe offer a rich set of cloud features to fit your needs, no matter the application.\r\n\r\n* &lt;b&gt;Hourly billing&lt;/b&gt;: create and destroy virtual machines at any time, and only pay for the hours used. Our service is prepaid, and payments can be made via Paypal or Bitcoin.\r\n* &lt;b&gt;Custom operating systems&lt;/b&gt;: add custom ISO and qcow2 images directly from the panel by submitting a URL to the image; once the panel has finished downloading your image, you can begin provisioning VMs from it immediately.\r\n* &lt;b&gt;&lt;a href=\"https://wiki.lunanode.com/index.php/Snapshots\" target=\"_blank\"&gt;Live snapshots&lt;/a&gt;&lt;/b&gt;: snapshot your running VM at any time (no need to even turn it off!). The disk state will then be saved on a distributed filesystem, and can be cloned to provision more instances with the same configuration, or simply kept as a backup.\r\n* &lt;b&gt;&lt;a href=\"https://wiki.lunanode.com/index.php/API\" target=\"_blank\"&gt;API&lt;/a&gt;&lt;/b&gt;: a powerful API is available to programatically manage your servers and other cloud services.\r\n* &lt;b&gt;&lt;a href=\"https://wiki.lunanode.com/index.php/Virtual_networks\" target=\"_blank\"&gt;Private virtual networks&lt;/a&gt;&lt;/b&gt;: isolate your network traffic and get more control over your network configuration.\r\n* &lt;b&gt;&lt;a href=\"https://wiki.lunanode.com/index.php/Virtual_networks\" target=\"_blank\"&gt;Load balancers&lt;/a&gt;&lt;/b&gt;: HTTP(S) and TCP load balancers can be created within virtual networks to easily set up a distributed and redundant service.\r\n* &lt;b&gt;&lt;a href=\"https://wiki.lunanode.com/index.php/Volumes\" target=\"_blank\"&gt;Detachable volumes&lt;/a&gt;&lt;/b&gt;: create arbitrary-sized block devices (volumes) and attach/detach them to virtual machine instances on the fly. Volumes are stored on a reliable, distributed Ceph RADOS cluster.\r\n* &lt;b&gt;&lt;a href=\"https://wiki.lunanode.com/index.php/Security_groups\" target=\"_blank\"&gt;Security groups&lt;/a&gt;&lt;/b&gt;: define external traffic restrictions on a VM-group level to make securing your software easy.\r\n* &lt;b&gt;&lt;a href=\"https://wiki.lunanode.com/index.php/Startup_scripts\" target=\"_blank\"&gt;Startup scripts&lt;/a&gt;&lt;/b&gt;: specify shell or cloud-config scripts to be run the first time your new VM instances boot.\r\n* &lt;b&gt;Server monitoring and DNS hosting&lt;/b&gt;: we offer complementary server monitoring (with various checks such as ping, TCP connect, and HTTP substring, and alerts over e-mail or SMS) and DNS hosting.\r\n\r\nGet started by &lt;a href=\"https://dynamic.lunanode.com/register.php\" target=\"_blank\"&gt;&lt;b&gt;registering an account in our panel&lt;/b&gt;&lt;/a&gt;!\r\n\r\nYou can open a ticket to request a refund of remaining credit on your account at any time, no questions asked (except in case of abuse).\r\n\r\n&lt;b&gt;Locations&lt;/b&gt;\r\n\r\nAll standard plans and cloud features are available in both our Toronto and Montreal locations. We feature premium DDoS filtering in Montreal, capable of protecting against large network-level attacks.\r\n\r\n* Toronto location (245 Consumers Rd 300 Toronto; Cogent DC): http://toronto-test.lunanode.com/100MB.test\r\n* Montreal location (OVH BHS): http://montreal-test.lunanode.com/100MB.test\r\n\r\n&lt;b&gt;About&lt;/b&gt;\r\n\r\nBased in British Columbia, Canada, LunaNode Hosting Inc. first launched in August 2013, focusing on low-cost, reliable KVM virtual private server hosting. We use OpenStack for our back-end and an in-house billing / VM management panel called lndynamic on the front-end. We are committed to security and &lt;a href=\"https://dynamic.lunanode.com/privacy.php\" target=\"_blank\"&gt;privacy&lt;/a&gt; and believe in the necessity of free software (&lt;a href=\"https://github.com/LunaNode/\" target=\"_blank\"&gt;see our GitHub&lt;/a&gt;). Our staff consists of experienced developers, system administrators, and network engineers; we are constantly monitoring and improving our infrastructure to ensure maximal uptime, and developing new tools to help you better manage your virtual machines.\r\n\r\nUpload your PGP key to https://lunanode.com/gpgmw to receive encrypted email from our mail server.\r\n\r\n&lt;b&gt;New features&lt;/b&gt;\r\n\r\n* Major improvements to complementary monitoring system - less false positives, more reliability, and more versatile check configuration\r\n* API will now return the ID for most create requests\r\n* Various front-end improvements\r\n\r\n&lt;b&gt;Links:&lt;/b&gt;\r\n\r\n* &lt;a href=\"https://dynamic.lunanode.com/info.php\" target=\"_blank\"&gt;More information&lt;/a&gt;\r\n* &lt;a href=\"https://dynamic.lunanode.com/terms.php\" target=\"_blank\"&gt;Terms of service&lt;/a&gt;\r\n* &lt;a href=\"https://dynamic.lunanode.com/privacy.php\" target=\"_blank\"&gt;Privacy policy&lt;/a&gt;\r\n* &lt;a href=\"https://wiki.lunanode.com/\" target=\"_blank\"&gt;Wiki&lt;/a&gt;\r\n* Contact us: sales@lunanode.com\r\n* &lt;a href=\"https://dynamic.lunanode.com/register.php\" target=\"_blank\"&gt;Register an account&lt;/a&gt;"}