{"id": 64754, "date": "2015-10-01 23:27:07", "user": "ElixantTechnology", "post": "Are you looking for a cost effective solution to host your project but have outgrown traditional Website Hosting packages? Get a high performance VPS based on the OpenVZ Virtualization Platform from InstaVM.com! Not only do these VPS provide our customers with the benefits of a Dedicated Server in regards to software customization, but also included the added benefit of our in-house DDoS Protection! You can host multiple projects our websites on a Virtual Server you control and manage with total anonomy.\r\n\r\nInstaVM.com is owned and operated out of Beautiful British Columbia, west coast of the great white north. Sister company to Elixant Technology, we offer powerful VPS to customers at affordable pricing. By leveraging the already implemented infrastructure utilized by Elixant Technology, we are able to provide customers with amazing reliability in the services that we have to offer.\r\n\r\nAs you may have noticed, our prices are extremely competitive and you might be wondering how we are able to offer our VPS at the prices we do while maintaining a high level of performance and reliability.. The easiest way to put it is that rather than spending enormous amounts of money employing a large number of support staff, we offer our customers a completely unmanaged solution. What this means is that we only offer support in regards to our hardware and network, that leaves you (the customer) reliable for any software related issues that you may come across. By providing customers with a serial console to access their systems in the event of an emergency in addition to full unrestricted root access to their VPS, any experienced administrator should have no issues handling any issue they may be faced with. \r\n\r\n    2 vCores\r\n    1GB DDR4 Memory\r\n    20GB SSD Storage\r\n    1TB Monthly Bandwidth\r\n    100Mbps Port Speed\r\n    1 IPv4 &amp; /96 IPv6\r\n    $4.99/month\r\n    https://www.instavm.com/secure/order/config/index/VPS/?group_id=2&amp;pricing_id=1\r\n\r\nYou can visit our website at http://www.instavm.com\r\nYou can find our LookingGlass at http://lookingglass.elixant-tech.com\r\n\r\nServers Location: Montreal, QC"}