{"id": 6828, "date": "2012-12-21 01:00:43", "user": "PhilND", "post": "Happy Holiday folks.. we've had this planned for a few months and with our new facility and our new hardware, we're able to make this a reality. I want to stress a few things about this offer - It is not the typical run of the mill.\r\n\r\n We're focusing on taking our business where it needs to go, I always imagined 'Node Deploy' being a true cloud, where you're literally able to spin up instances and 'Deploy' servers in any of our locations. Now, the offer isn't the same as our previous ones where you're getting a butt load of random I/O to brag about your dd test speeds, this is about true performance on enterprise levels. We're aiming for 100% uptime across all new deployed KVM nodes - A maximum of 32 containers will be on the physical node, ensuring that you're getting guaranteed network through-put and the amount of CPU required to run complex applications.\r\n\r\nOverall this has been a brilliant year and we thank our clients who have done repeated business with us!\r\n\r\nHost node specs -:\r\nE3 1230 V2\r\n32GB DDR3 ECC RAM\r\n4x1TB Adaptec Hardwarer RAID w/ BBU\r\n2x1000Mbit bonded\r\nPhysical MAX of 32\r\n\r\n**The plan -**\r\n4 Cores @ **3.3Ghz** - **825Mhz** dedicated and guarenteed.\r\n**1GB** Dedicated RAM\r\n**50GB ** RAID 10 Backed DISK\r\nUnmetered Inbound / 350GB Out\r\n2x **1000** mbit fully burstable\r\n1 Dedicated IPv4\r\nLocation - Germany only for now.\r\n$6.95/mo\r\n[Order](https://nodedeploy.com/clients/cart.php?a=add&amp;pid=35)\r\n\r\nWhats planned?\r\n\r\nCurrently we're running SolusVM - It's not doing what we need. We're currently developing a custom control panel built from the ground we expect this to be released Q3-4 of next year with select clients being selected to beta test. Features include, HA ip floating automatically, integrated dns, rdns, reinstallation, internal traffic routing and much more that I'm not allowed to talk about.. yet ;)\r\n\r\nWe're also looking into releasing and rolling out SSD Servers around the same time as the control panel.\r\n\r\nThanks,\r\n\r\nPhil\r\n\r\nps. shoot a ticket/pm if I missed something.. tis' late! :)"}