{"id": 68576, "date": "2015-11-16 11:31:33", "user": "virtono", "post": "Hello LET ! \r\n\r\nWe have configured some MONSTER Plans at only 5.99 Euros/month for halloween, but we didn't had the opportunity to post it here then, so we posted now.\r\n\r\nYou will find the plans we are talking about below, but if you want some of our vps standard plans offered on the [www.virtono.com](https://www.virtono.com) website, you can use the coupon code LETMONSTERS to receive a 35% discount on all plans (vps, vds and web hosting).\r\n\r\n------\r\n\r\nMonster Developer - This is a high performance VDS (or virtual dedicated server, which is a virtual server with dedicated hardware resources and kernel and has private virtualized hardware). We use only SSD Storage and KVM virtualization tehnology on powerfull nodes, so the performance of the vds is highly improved on each and every aspect. \r\n\r\nVirtualization: KVM\r\n\r\nCPU : 2 Cores (at 2.26Ghz)\r\n\r\nRam Memory: 4GB \r\n\r\nDisk space: 10GB (on SSD)\r\n\r\nNetwork Speed: 100Mbps (unmetered traffic)\r\n\r\n2x IPv4\r\n\r\n1x IPv6\r\n\r\nPrice: 5.99Eur\r\n\r\nOrder Link: https://www.virtono.com/client-area/cart.php?a=add&amp;pid=76\r\n\r\n--------------------------------------\r\n\r\nMonster Storage - We think the plan's name speaks for itself, it's a low-end vps with high storage space and moderate specs.\r\n\r\nVirtualization: OpenVZ\r\n\r\nCPU : 2 Cores (at 2.26Ghz)\r\n\r\nRam Memory: 2GB\r\n\r\nRam Burst: 4GB\r\n\r\nDisk space: 100GB (on SSD-Caching)\r\n\r\nNetwork Speed: 100Mbps (unmetered traffic)\r\n\r\n1x IPv4\r\n\r\n1x IPv6\r\n\r\nPrice: 5.99Eur\r\n\r\nOrder Link: https://www.virtono.com/client-area/cart.php?a=add&amp;pid=77\r\n\r\n---------------------------------------\r\n\r\nMonster Speed - This plan is for users who needs big bursts of cpu and internet connection speed. The uplink is 1Gbps in best-effort, the cpu has 4 cores and 4gb burstable ram memory. \r\n\r\n\r\nVirtualization: OpenVZ\r\n\r\nCPU : 4 Cores (at 2.26Ghz)\r\n\r\nRam Memory: 2GB \r\n\r\nRam Burst: 4GB\r\n\r\nDisk space: 20GB (on SSD)\r\n\r\nNetwork Speed: 1Gbps (2TB Traffic)\r\n\r\n2x IPv4\r\n\r\n2x IPv6\r\n\r\nPrice: 5.99Eur\r\n\r\nOrder Link: https://www.virtono.com/client-area/cart.php?a=add&amp;pid=78\r\n\r\n---------------------------------------\r\n\r\nWe have made big efforts to be able to provide these vps monster plans at this low price, we hope you will enjoy it!\r\n\r\n\r\n\r\nVirtono.com features:\r\n\r\nNo Downtime! The Virtono.com servers are in a Tier3 Datacenters, designed and equiped with at the highest standards, with high-end UPS and Diesel Power Generators. The internet is supplied from 2 redundant cores.\r\n\r\nHigh-Speed Internet Connections. Besides the redundancy and power issues that our last upgrade solves, it also bring an upgrade on the internet speed , we have a backbone of 400Gbps from many european ISP's.\r\n\r\n100% Solid State Drives All our services ( VPS, VDS, web Hosting ) will be hosted on pure SSD storage, which makes the virtual server to get much higher performance in terms of I/O operations and transfer speed compared to traditional storage.\r\n\r\nAlso we offer free DNS Manager that allows you to control all the DNS aspects directly from your Virtono client area. You can add DNS zones, create A , MX, CNAME and all types of records for your domain. You can also create reverse DNS ( PTR Record ) for the IP's allocated to your services. This feature is free to use for all customers.\r\n\r\nVirtono Networks SRL, it's a company registered in Romania since August 2014, that took over the cloudweb.ro's clients portofolio, resources and system admins. Now the brand Virtono has 2 websites , virtono.com and virtono.ro, and we are selling both international and national.\r\n\r\nHere are the registration details of our company:\r\n\r\nName: Virtono Networks SRL\r\n\r\nAddress: Navodari, Constanta, Romania\r\n\r\nVAT No. : RO33431948\r\n\r\nRegistration no: J13/1532/2014\r\n\r\nWeb: https://www.Virtono.com\r\n\r\nWe are offering unlimited bandwidth, so you should take a look on our terms and conditions first: https://www.virtono.com/tc.html . Virtono applies a policy of common sense and fair usage, giving you the freedom of use on our 100Mb/s infrastructure, however if you choose 1Gbps you should check the terms.\r\n\r\nOur Romanian infrastructure is a Tier3 Datacenter, designed and equiped with at the highest standards, with high-end UPS and Diesel Power Generators. Besides the redundancy and power issues that this upgrade solves, it also bring a huge upgrade on the internet speed , we have a backbone of 400Gbps from many european ISPs.\r\n\r\nWe have two available locations, one in Romania and one in Germany. In Romania we have our own hardware and in Germany we lease them, but in both locations we have our own ip addresses.\r\n\r\nM247 - Bucharest, Romania\r\n\r\nTest IPv4: 85.204.49.17\r\n\r\nTest file: http://test-kvm.virtono.com/1GB.zip\r\n\r\nLooking glass: http://bgp.he.net/AS9009\r\n\r\nMyLoc - Dusseldorf, Germany\r\n\r\nTest IPv4: 188.214.93.122\r\n\r\nTest file: http://test-de.virtono.com/1GB.zip\r\n\r\nLooking glass: http://bgp.he.net/AS24961\r\n\r\nIPv6 it's also available and free of charge, but we are still in testing, so it's not 100% guaranteed that it will work for your server from start, but if it doesn't, open a ticket and we will solve it .\r\n"}