{"id": 71939, "date": "2015-12-27 21:14:38", "user": "ratherbak3d", "post": "![](https://virtual6.net/whmcs/templates/six/img/logo.png)\r\n\r\nVirtual6.net - 2GB KVM in EU w/ DDoS Protection - Proxmox VE - 5TB on 1000Mbps\r\n\r\nWelcome to Virtual6. We're a small team based in Rotherham UK that just love hosting &amp; computing. We formed Virtual6 to fulfill our passion and provide excellent computing and hosting, not only to local businesses in Rotherham and South Yorkshire, but to valued customers across the world.\r\n\r\nWe have over 10 years experience in these particular industries and have been the driving force behind other successful brands still operating today. Our customers are our number one priority and it really does show, from the care taken during our manufacturing process, to the return of a faulty item and everything in-between, we're here for you every step of the way.\r\n\r\nWe welcome you to contact us today with any questions you might have, or for a free no obligation quote on any of our services. Give us a try today, you'll be chuffed that you did!\r\n\r\n**V6VS01**&lt;br&gt;\r\n2GB RAM&lt;br&gt;\r\n100GB RAID HDD&lt;br&gt;\r\n6.25% Guaranteed vCPU (4x2.66GHz Xeon cores)&lt;br&gt;\r\n5TB Monthly data transfer on 1000Mbps shared port&lt;br&gt;\r\n1x Dedicated IPV4 address&lt;br&gt;\r\nDedicated VNC/KVM console w/ virtual media support&lt;br&gt;\r\nBest effort service availability (No SLA)&lt;br&gt;\r\nAutomatic DDoS protection (No SLA)&lt;br&gt;\r\nProxmox VE 3.x control panel&lt;br&gt;\r\nKVM Full hardware virtualization&lt;br&gt;\r\nDeployed and online within one business day subject to stock!&lt;br&gt;\r\n\r\nRRP: £5.00 PCM&lt;br&gt;\r\nLET: £4.70 PCM  with promotion code \"HV2PZDEEA7\"&lt;br&gt;\r\n[https://virtual6.net/whmcs/cart.php?a=add&amp;pid=1](https://virtual6.net/whmcs/cart.php?a=add&amp;pid=1)\r\n\r\n\r\nIf you have any questions at all please do not hesitate to contact me via private message or via the support channels listed on  our website. Thank you!"}