{"id": 72317, "date": "2015-12-31 21:09:58", "user": "Rob_T", "post": "Hello LET!  \r\n  \r\nVPS Hosting shouldn't be complicated. That's why we created [VP Easy](https://www.vpeasy.com). We offer 4 VPS plans with simple yearly billing. All of our plans feature KVM virtualization (no overselling!), RAID-10 pure SSD storage, and we use only dual Intel Xeon hypervisors with 128GB or more RAM (no weak E3 machines here!).  \r\n  \r\nThere's still time to get a great deal on a new VPS with our HOLIDAY SPECIAL! Take an additional 25% off our already low pricing below for your first year of VPS hosting by using coupon code **Holiday2015** at checkout. Coupon code expires January 3, 2016!  \r\n  \r\n  \r\nStarter VPS:  \r\n---------------  \r\n1024MB RAM  \r\n15GB RAID-10 SSD Storage  \r\n1 CPU Core @ 2.4Ghz or faster  \r\n1TB Bandwidth  \r\n1 IP Address  \r\n  \r\n**Only $13.50 for your first year**  \r\nBilled at $18/yr after your first year  \r\n[Order Now!](https://www.vpeasy.com/billing/order/main/packages/VPS/?group_id=1&amp;package_id=1)  \r\n  \r\n  \r\nBusiness VPS:  \r\n---------------  \r\n2048MB RAM  \r\n25GB RAID-10 SSD Storage  \r\n2 CPU Cores @ 2.4Ghz or faster  \r\n2TB Bandwidth  \r\n1 IP Address  \r\n  \r\n**Only $21 for your first year**  \r\nBilled at $28/yr after your first year  \r\n[Order Now!](https://www.vpeasy.com/billing/order/main/packages/VPS/?group_id=1&amp;package_id=2)  \r\n  \r\n  \r\nEnterprise VPS:  \r\n---------------  \r\n4096MB RAM  \r\n50GB RAID-10 SSD Storage  \r\n4 CPU Cores @ 2.4Ghz or faster  \r\n4TB Bandwidth  \r\n1 IP Address  \r\n  \r\n**Only $36 for your first year**  \r\nBilled at $48/yr after your first year  \r\n[Order Now!](https://www.vpeasy.com/billing/order/main/packages/VPS/?group_id=1&amp;package_id=3)  \r\n  \r\n  \r\n**FAQ:**  \r\n  \r\nQ: Who are you guys? How long have you been around?  \r\nA: VP Easy is a division of Versaweb - the guys who sell awesome, cheap dedicated servers. We've been around since 2004, and we've providing VPS hosting services through our other brands since 2008.  \r\n  \r\nQ: What locations are available?  \r\nA: We are currently providing services from our West Coast datacenter in Las Vegas, Nevada. We'll be looking for an East Coast datacenter for expansion soon.  \r\n  \r\nQ: Do you have a test IP / File?  \r\nA: Sure! See our looking glass at http://104.143.15.254  \r\n  \r\nQ: Is there any kind of guarantee?  \r\nA: Buy it and try it for 7 days. if it sucks, we'll give you your money back (as long as you didn't do anything stupid, like SPAM).  \r\n  \r\nQ: How fast will you have my VPS online?  \r\nA: Most orders are provisioned within a few minutes of your payment being received. In some cases, however, we do perform a manual review of some orders to keep fraud to a minimum, which can delay provisioning. To avoid delays, we suggest that you do not use a proxy while ordering, and that the information for your billing method should match the information provided for your order.  \r\n  \r\nQ: Are these managed or unmanaged plans?  \r\nA: These VPS plans are unmanaged. We'll try and help out where we can via our ticket system, but at the end of the day It's all you.  \r\n  \r\nQ: Do you offer Windows on these VPS plans?  \r\nA: Nope - these plans are Linux only. We aren't planning to offer Windows VPS plans at this time.  \r\n  \r\nQ: Who are your network providers?  \r\nA: NTT, Level3, HE.net, and dozens of private peering arrangements. Check it out - AS53340  \r\n  \r\nQ: Can I get IPv6?  \r\nA: Not yet, but soon. We promise. Our network is 100% v6 ready, but we're still testing out some of the new v6 features in SolusVM. Once we're happy, we'll roll it out at no added cost.  \r\n  \r\nQ: How does your DDoS protection work?  \r\nA: Our system automatically detects incoming attacks and null routes the targeted IP, thereby minimizing collateral damage and keeping you online even if you have virtual neighbors who aren't so nice.  \r\n  \r\nQ: How can I use my VPS? Any restrictions?  \r\nA: No TOR, no IRC, no torrents, nothing illegal, no SPAM, no DDoS attacks, etc. Basically, don't do anything stupid, and we'll all get along just fine.  \r\n  \r\nThanks for reading, and have a good day!  "}