{"id": 72573, "date": "2016-01-05 13:27:57", "user": "estnoc", "post": "On behalf of **Estnoc.ee** i can offer virtual private servers from **Estonia, Norway, Netherlands, Romania, Russia, Switzerland and Sweden**. Almost every server you can configure to match your needs while ordering one.\r\n\r\n**Why choose us?** Well, we offer flexible support on all of our services and response time is avg. 15-60 minutes. We choose ONLY the best networking partners to avoid downtimes by networking side. Aswell we use branded hardware and servers. Most important, we do not oversell our servers. Our prices are reasonable and fit well to customers who DEMAND services that are STABLE! We offer multi locations of servers and we are expanding rapidly! Just shortly: you get exactly what you payd for.\r\n\r\n**Like** us on [Facebook](https://www.facebook.com/Estnoc.dot.ee)!\r\n**Follow** us on [Twitter](https://twitter.com/estnoc_ee)!\r\n\r\n Please visit homepage at http://www.estnoc.ee\r\n\r\n**Payments accepted:** Paypal, CreditCard, Skrill, BitCoin, LiteCoin, DogeCoin, PeerCoin and bank transfer.\r\n**Got questions? **please send us an email to sales@estnoc.ee\r\n\r\n Take a look at our [Terms Of Service](http://www.estnoc.ee/terms-of-services) if you got questions a la what is allowed on our servers or what's not. Example: Torrent is allowed on all locations as long its used for legal content and etc...\r\n\r\n\r\n**Networking information:**\r\nFor routing/peering partners and information about networking please take a look [HERE](http://www.estnoc.ee/whmcs/knowledgebase.php?action=displaycat&amp;catid=4)\r\n\r\n\r\n**Following operating systems** are possible to install on all of our servers: CentOS, Debian, FreeBSD, FedoraCore, Ubuntu, Windows Server 2008 R2 Web/Standard/Datacentre, Windows Server 2012 R2 Essentials/Standard/Datacentre and if you don't see your required op sys in list, let us know and we can install it for you.\r\n\r\nWe use KVM. Anyone who's familiar with KVM virtualization knows, it's almost impossible to oversell it. Because KVM gives dedicated resources for each VPS and storage inside its own container.\r\n **You can manage your VPS in SolusVM**, VNC over IP or in our EstNOC Customer Portal (reinstall, reboot,start,stop and ect).\r\n Each VPS have 1 IPv4 address for free, the rest will be charged €3/month. \r\n For those who need webhosting manager, we can offer cPanel/WHM VPS Optimized (€15/mo) and DirectAdmin (€6/mo).\r\n\r\n\r\n**Estonian and Swedish KVM VPS packages with 100% SSD Storage** (instant provision after successful payment):\r\nEstonia and Sweden - dmca free zones\r\n\r\n**1. KVM vps Starter Linux EE &amp; SE:**\r\n256 MB ram memory, 5 GB SSD storage (can upgrade), 1 CPU core, 1 IPv4, 50 Mbit uplink with 500 GB traffic (can upgrade)\r\n --------------------------------------------------------------------------------------------------------------------------------------------------------\r\n Price starts at 5.38usd a month on quarterly payment! No SetUP fee!! Order this VPS package from [Estonia](https://www.estnoc.ee/whmcs/cart.php?a=add&amp;pid=118) or [Sweden](https://www.estnoc.ee/whmcs/cart.php?a=add&amp;pid=132)\r\n\r\n\r\n\r\n**Russian, Romanian, Netherlands and Norwegian KVM VPS** packages (instant provision after successful payment):\r\nNorway is DMCA free zone.\r\n\r\n**1. KVM vps Starter Linux RU/RO/NL/NO:**\r\n256 MB ram memory, 5 GB Raid10 storage, 1 CPU core, 1 IPv4, 50 Mbit uplink with 500 GB traffic (can upgrade), Add-On's: cPanel\r\n ---------------------------------------------------------------------------------------------------------------------------------------------------\r\n Price starts at 5.38usd a month on quarterly payment! No SetUP fee!! Order this VPS package from [Russia](https://www.estnoc.ee/whmcs/cart.php?a=add&amp;pid=113), [Romania](https://www.estnoc.ee/whmcs/cart.php?a=add&amp;pid=41), [Netherlands](https://www.estnoc.ee/whmcs/cart.php?a=add&amp;pid=1) and [Norway](https://www.estnoc.ee/whmcs/cart.php?a=add&amp;pid=104)\r\n**\r\nNB! Please check out all the packages we offer in our homepage.**"}