{"id": 7347, "date": "2013-01-14 15:10:06", "user": "Maounique", "post": "Hello LET !\r\n\r\nThought you forgot the storage deals we have here, so here I come to remind you about them.\r\nFrom premium SAN KVMs to free FTP we got you covered :)\r\n\r\nIntroducing, from our brand new **Iperweb LTD** in UK, the best bargain for quality storage that money can buy on KVM, full-featured SAN storage, premium EU network, dual E5 Supermicro built, customizable, tax-free, low-fat, decaf, etc, starting lower than 1.5 pennies per GB (depending on package, size and payment term):\r\n\r\n**bk-kvm-256**\r\n\r\nCPU:1 Core\r\nRAM:256MB\r\nHDD:200-500 GB\r\nIP Addresses:1 IPv4, /112 IPv6\r\nTraffic included:3TB on 1 gbps shared port\r\nVirtualization:KVM\r\nControl Panel:Proxmox\r\n\r\nOrder link: https://my.iperweb.com/cart/backup-kvm/\r\n\r\nFor those shooting for even lower prices, ready to make their own network of redundancy across providers, pure storage, pure IPv6, Xen with Cloudmin panel, as low as 1 euro-cent a GB (with discount on semi-annual pay):\r\n\r\n**Atomic-200**\r\n\r\nStorage-200 GB\r\nRAM 256 MB\r\nSWAP 1 GB\r\nCPU 2 shared core\r\nTraffic 1000 GB on 100 mbps shared port\r\nIPv6 2\r\nVM MAX 2\r\nControl Panel:Cloudmin\r\n\r\nOrder link: https://www.prometeus.net/billing/cart.php?a=add&amp;pid=78\r\n\r\nYou may wonder what VM MAX 2 means, well, it means you can create 2 instances in those resources, for example one for 50 GB storage and 96 MB RAM, another for 150 GB and 160 MB RAM, you can do that if you wish.\r\nPlease take a look here for more info: http://board.prometeus.net/viewtopic.php?f=8&amp;t=900&amp;sid=519cf8e684056ea48f424e8abc98c2a1\r\nCoupon code (only applies to existing customers as these plans are meant mostly for our customers): **50OFF6MONTH**\r\n\r\nAnd last, but not least, for our loyal customers, absolutely free (with coupon code FREE10):\r\n\r\n**FTP Backup 10**\r\n\r\n10 GB Disk space\r\n100 GB Traffic on 100 mbps shared port\r\nControl Panel: Webmin\r\n\r\nOrder link: https://my.iperweb.com/cart/other-shared-services/\r\n\r\nAs with Atomic-200, coupon code applies only for customers with an active service from us.\r\nWe restocked some of these plans as the initial stock was gone too fast after customers read our newsletter at the beginning of the year, however, they wont be lasting forever (except the FTP backup space), so grab them now while they last !\r\n\r\n**Prometeus** is focused since 1997 solely on high-quality, high-reliability web services and professional consulting. Our network and servers are tuned specifically for maximum performance, and our policies ensure that we remain as efficient as possible.\r\nWe are located in Milan, Italy and have 5 racks collocated in the largest campus/internet exchange of Italy. We are LIR (RIPE NCC member) and do BGP with our Autonomous System Number (AS34971) and a total bandwidth capacity of 10Gb.\r\n\r\nThe only accepted payment method is Paypal, for now. VAT 21% is added if you are an EU citizen/company without a valid VAT ID for Prometeus sites only, products of Iperweb LTD are VAT-free right now.\r\n\r\n\r\n*** Download test can be run with the following urls ***\r\n\r\nhttp://mirrors.prometeus.net/test/test10.bin\r\nhttp://mirrors.prometeus.net/test/test100.bin\r\nhttp://iperweb.net/test/test10.bin\r\nhttp://iperweb.net/test/test100.bin\r\n\r\nTest IPv4: 194.14.179.254 or 195.88.4.7\r\nTest IPv6: 2a00:dcc0:eda:89::254:1"}