{"id": 74462, "date": "2016-01-29 18:33:51", "user": "timnboys", "post": "**CubeData FraudRecord Module -- Native Fraud Module for both WHMCS &amp; Blesta!**\r\n\r\nHello Everyone I am here to announce CubeData's Fraud System Module (it is a native tie in to both whmcs &amp; blesta's native fraud system meaning it will automatically scan and screen orders for you like every other fraud module but there's more this module will actually lookup FraudRecord's database.\r\n\r\nIt will actually query the fraudrecord database and deny any order that the details come up as listed in fraudrecord based on the settings you set for the max acceptable score (or points) that someone has on fraudrecord. To be accepted the order/person has to have lower points than this else the order will be stopped and marked as fraud).\r\n\r\n![](http://license.lc/i/banned-ip.png)\r\n\r\nPlease note our license for this module is $7/month for either the whmcs &amp; blesta versions. You can place your order here(both versions): https://cubedata.net/order/main/index/cart We also offer a free trial license for both versions which lasts for 15 days (which should be more than enough time to validate the fraud module)\r\n\r\n\r\n\r\n![](http://license.lc/i/settings.png)\r\n\r\n\r\nNote we also as a second check in this module besides fraudrecord we use black's api as well from his website getipintel.net to block any fraud possible that gets through the first check. This prevents VPNs or Private networks. We have just recently added a check inside the blesta version of the fraud module to allow you to manually blacklist ip's which this feature runs as a third third check which allows you to block anyone from ordering anything if their ip is listed in the textarea box. \r\n\r\nThis feature will block the order and deny them from ordering no matter what. This feature was suggested by @Licensecart aka Michael Dance after he had issues with a spammer (who kept making fake orders using a home IP. This feature will not even let you pass the create account function of the order process (on Blesta) if you are listed, as it is designed to stop spammers &amp; un-wanted people, therefore with this fraud module you are secure and ensure that no spam/fraud ever reaches your order system!\r\n\r\nAlthough please note this module requires the latest ioncube loader so make sure you have it as this module is ioncube encoded to protect my intellectual property rights.\r\n\r\nPlease check out some of our testimonials:\r\n&gt; The FraudRecord module from CubeData is a must for every business, and I’m not sure where we would be without it.\r\n&gt; - Michael Dance (@Licensecart)\r\n\r\nScreenshots: Note I have explicit permission from Michael Dance @Licensecart to use the logo's in the preview since they are his screenshots he made."}