{"id": 76562, "date": "2016-02-22 18:19:50", "user": "dacentec", "post": "**Redundancy and preparedness.**\r\n\r\nThe Dacentec datacenter in Lenoir NC is a uniquely designed highly available site.\r\n\r\n* Our own building. We control the entire building, so emergency changes and fixes don't require a landlord approval or outside assistance.\r\n* Redundant utility power feeds from Duke Energy. Dual power feeds from two substations take diverse paths to our site where we have redundant transformers.\r\n* Redundant A+B generators. Many sites have redundant power, but share a single ATS/Genset. A and B power have isolated generators.\r\n* Redundant cooling sytems. Our unique design uses hot air containment and 'air corridors'. Servers share CRACs (Computer Room Air Conditioners) for redundancy.\r\n* Redundant Eaton 9395 UPS. Redundant UPS manufactured right here in North Carolina.\r\n* Dedicated facilities and electrical staff. Electrical work is done by Centrilogic employees who work full time at the site all year long.\r\n* Staff and Support. Dacentec is staffed by rotating shifts of dedicated Centrilogic employees. Average tenure is over 3 years.\r\n* The backing and support of Centrilogic, one of the best names in enterprise, hybrid and managed hosting.\r\n\r\n\r\n\r\n\r\n\r\n\r\n**The Dacentec Difference**\r\n\r\n* 7 Day no questions asked money back guarantee for accounts without spam or abuse.\r\n* No notification period for cancellations. Cancel anytime.\r\n* No bandwidth overage charges. One warning without penalty, then a choice of upgrading service or capping bandwidth.\r\n* No long term commitment or lock in, if your business model changes, end customer cancels or you just decide you want to do something different you can cancel all or part of your services with us.\r\n* Special offers and deals can be ordered by new and existing customers, you can even cancel your old service without penalty.\r\n* Flexible billing terms, pay monthly, quarterly, semi-annually or annually. Select the payment date that suits you best.\r\n* 24 Hour setup SLA, even on the weekends, ensures you have the resources you need when you need them.\r\n* Dedicated VLAN, your resources aren't sitting in a 'pool' with other customers resources.\r\n* 24/7/365 Onsite North America Based Sales and Support Gigabit ports\r\n\r\n\r\n**Unmanaged Supermicro Opteron 1385 8GB 2X2TB SATA Rent Only**\r\n\r\nGigabit Port\r\n10 TB monthly transfer.\r\n/29 IP Addresses (w/ justification)\r\nFree IP KVM loan on request\r\nNO LOCK IN - Month-to-Month Contract - Cancel anytime\r\nHardware replacement including disk is free during the rental period.\r\nRemote Reboot\r\nAutomated OS Installs\r\nBandwidth Graph\r\nUNMANAGED.&gt;&gt;&gt;\r\n**[ORDER NOW FOR $25/MONTH](https://billing.dacentec.com/hostbill/index.php?/cart/dedicated-servers/)**\r\n\r\n_**USE THE PROMO CODE “OPTERON2016” TO GET A 50% DISCOUNT ON YOUR FIRST MONTH FOR ANY OPTERON SERVER!!!**_\r\n\r\n**Unmanaged Supermicro 2XL5420 16GB 2x1TB**\r\n\r\nGigabit Port\r\n10 TB monthly transfer.\r\n/29 IP Addresses (w/ justification)\r\nFree IP KVM loan on request\r\nNO LOCK IN - Month-to-Month Contract - Cancel anytime\r\nHardware replacement including disk is free during the rental period.\r\nRemote Reboot\r\nAutomated OS Installs\r\nBandwidth Graph\r\nUNMANAGED\r\nRent To Own - Pay for 12 months and the server is yours, continue colo or take the server.&gt;&gt;&gt;\r\n**[ORDER NOW FOR $35/MONTH](https://billing.dacentec.com/hostbill/index.php?/cart/dedicated-servers/)**\r\n\r\n\r\n**[&gt;&gt;&gt;&gt;&gt;&gt;VIEW OUR COMPLETE LIST OF SERVERS HERE&lt;&lt;&lt;&lt;&lt;&lt;](http://billing.dacentec.com/hostbill/index.php?/cart/dedicated-servers/)**\r\n\r\n--------------------------------------------------------------------\r\n\r\nSSAE16 SOC 2\r\nCustom Rooms, Suites, Half and Full Cabinets\r\nNo long term commitments – Flexible month-to-month terms\r\nPremium Blended Bandwidth\r\nCarrier Neutral – Diverse providers\r\nDual Utility / UPS / Generator\r\n\r\n\r\nTest IP\r\n199.255.156.6\r\n\r\nTest Site\r\nhttp://mirror.dacentec.com\r\n\r\nTest Files\r\nhttp://mirror.dacentec.com/1000MB.bin\r\nhttp://mirror.dacentec.com/100MB.bin\r\nhttp://mirror.dacentec.com/10MB.bin"}