{"id": 7682, "date": "2013-01-30 21:39:20", "user": "Damian", "post": "IPXcore is finally following through with my continued statement that we're going to offer KVM services. **_Soon™: The Time Is Now._**\r\n\r\n&lt;img src=\"http://damianharouff.name/images/tonyonstage.jpg\"&gt;\r\n\r\nWhen we originally started offering OpenVZ a couple of years ago, to be honest, we weren't 100% sure what we were doing, and our systems were not set up in the most ideal manner. In an effort to avoid the same events with KVM, we're offering cheap KVM containers on a one-time, 30 day interval at a very low price, with the idea that we can get some people on there stress testing the hardware. The results of this test will dictate the price/resources of the actual plans.\r\n\r\nThe container will auto-terminate after 30 days. If you like the service and want to keep it, you will be able to continue with the container at the regular price. We should know within a week or two what kind of pricing we'll be able to offer.\r\n\r\nSo why isn't it free? To be honest: to keep out the riff-raff. Requiring a payment brings us a long way in keeping malicious users away. Additionally, anyone participating in the beta test will receive a recurring coupon for a heavy discount when the 'live' plans are available.\r\n\r\n**Some company info:**\r\nWe've been up and running since May of 2011. We're running OpenVZ virtualization on our very own Dell, HP, and Supermicro -powered hardware.\r\nEach server node has it's own 100mbit connection. \r\nPast-30-days support ticket mean response time: 0 Day(s) 0 Hour(s) 19 Minute(s) and 51 Second(s)\r\n\r\n**Serverbear benchmark** for a container on the node: http://serverbear.com/benchmark/2013/01/27/FL8q66XKtsQ6tCE4\r\n\r\n**The offer:**\r\nKVMBetaTest\r\n512mb RAM\r\n20gb Disk Space\r\n300gb transfer\r\n1 IPv4\r\n0 IPv6\r\n\r\n**$2.00 for 30 days:** https://billingcp.us/cart.php?a=add&amp;pid=69&amp;carttpl=modern3&amp;systpl=ipx3\r\n\r\nI've pre-added some Linux and BSD distros. If you don't see your favorite in the list, please let us know what it is, and we'll add it. Non-Windows only, and we won't be doing custom ISOs; we'll download your favorite distro from the distro's website.\r\n\r\n&lt;b&gt;&lt;i&gt;FYI: As outlined in the AUP/TOS ( http://ipxcore.com/auptos/ ), all new registrations MUST be made with verifiable postal address information.&lt;/b&gt;&lt;/i&gt; Repeating your province/state in the address fields will cause your account to be suspended til you update your account information. These plans are auto-verified with Maxmind; if you get auto-tagged for fraud, open a support ticket for resolution. All plans are also subject to manual verifications. Please note that mismatched payment/account information is grounds for suspension til manual verification is complete!\r\n\r\nThis plan does not qualify for our 3 day trial period. \r\n\r\nTest IP: 198.144.190.10\r\nLooking glass with test files: http://carbon.ipxcore.com/lg/"}