{"id": 78584, "date": "2016-03-16 19:07:51", "user": "qps", "post": "Continuing on the success of our previous LowEndBox and LowEndTalk offers, [QuickPacket](https://www.quickpacket.com) is pleased to offer our popular Dual Xeon L5520 server out of Los Angeles, CA or Atlanta, GA.\r\n\r\n**Intel Dual Xeon L5520 - Dell or SuperMicro**\r\n\r\n- Dual Quad Core 2.26 GHz / 2x 8 MB Cache / HyperThreading (16 Threads!)\r\n- 24 GB RAM standard, up to 144 GB RAM for an additional fee\r\n- 1 TB Serial ATA Hard Drive or 128 GB SSD\r\n- 5 IP Addresses on Private VLAN with Reverse DNS\r\n- /64 IPv6 Addresses upon request (More available with justification)\r\n- Dedicated KVM over IP / IPMI (uses 1 IP address)\r\n- 20 TB Bandwidth / 1 Gbps Port \r\n- Unmanaged\r\n- Located in Atlanta, GA or Los Angeles, CA\r\n\r\n**$40 per month - Click the location link to order: [Atlanta](https://www.quickpacket.com/billing/cart.php?a=add&amp;pid=170&amp;promocode=LHP2TXXY15) | [Los Angeles](https://www.quickpacket.com/billing/cart.php?a=add&amp;pid=89&amp;promocode=LHP2TXXY15) (COUPON CODE LHP2TXXY15)**\r\n\r\nQuickPacket also offers a number of software licenses as add-ons:\r\n\r\n- cPanel - VPS $11/month - Server $29.99/month\r\n- KernelCare - $2/month\r\n- CloudLinux - $9/month with cPanel, $11/month without\r\n- Softaculous - VPS $1/month - Server $2/month\r\n- WHMCS - Branded $12.80/month - Unbranded $14.80/month\r\n\r\nFurther details about QuickPacket and the promo offer:\r\n\r\n- QuickPacket was founded in 2003 and is a registered LLC in North Carolina.\r\n- Network providers include PCCW, Cogent, Hibernia, GTT, Zayo, and peering ([AS46261](http://bgp.he.net/AS46261)).\r\n- Looking Glass/Test File: [Atlanta](http://lg.atl.quickpacket.com) | [Los Angeles](http://lg.lax.quickpacket.com)\r\n- Atlanta servers are located in 470 E Paces Ferry Rd NE.  Los Angeles servers are located in 530 W 6th St.\r\n- Warez-related, Bulk Mail, and Spam-related activities are strictly forbidden. Please review our [Terms of Service](http://www.quickpacket.com/tos.html) prior to ordering.\r\n- We accept PayPal, VISA, Mastercard, American Express, Discover, and Bitcoin (through BitPay) payments.\r\n- Coupon code is mentioned above and is embedded in the order links provided. The discounted price will be reflected on the second page of the order form.\r\n- Promotional pricing is available for new customers or existing customers adding additional servers. Promotional offers cannot be combined with other promotional offers.\r\n- Please contact our sales department with any questions prior to ordering. \r\n\r\nThanks for your interest!"}