{"id": 7902, "date": "2013-02-10 23:17:37", "user": "turbovm", "post": "[TurboVM](https://www.turbovm.com/) is a newly started business offering fast and affordable OpenVZ VPS located in Phoenix, Arizona at the Phoenix NAP datacenter.\r\n\r\nAll nodes utilize RAID 10 storage with a baseline specification of a E3-1230 CPU and 32GB RAM.\r\n\r\nTo open the doors we are offering **100% OFF** for the first month as an exclusive offer for both LEB and LET users. This offer is available while stocks last, and is strictly provided as 1 offer per customer.\r\n\r\nSimply use the promotional code **LEB1** when signing up.\r\n\r\nAll of our packages are applicable to this offer, as such the larger plans available will be given out on a first come, first serve basis.\r\n\r\n========== **Available Plans** ==========\r\n\r\n_Please note: We will have IPv6 available to all plans soon, and will be provided as 16 IPv6 addresses per package._\r\n\r\n**256MB OpenVZ**\r\n* RAM: 256MB\r\n* VSwap: 256MB\r\n* CPU Cores: 2\r\n* 25GB RAID 10 Storage\r\n* 100Mbps Uplink\r\n* 1TB Bandwidth\r\n* 1 IPv4 Address\r\nPrice: **$2.45/mo** - [Order Now](https://my.turbovm.com/cart.php?a=add&amp;pid=4)\r\n\r\n**512MB OpenVZ**\r\n* RAM: 512MB\r\n* VSwap: 512MB\r\n* CPU Cores: 2\r\n* 50GB RAID 10 Storage\r\n* 100Mbps Uplink\r\n* 2TB Bandwidth\r\n* 1 IPv4 Address\r\nPrice: **$4.95/mo** - [Order Now](https://my.turbovm.com/cart.php?a=add&amp;pid=1)\r\n\r\n========== **3 Day Free Trial** ==========\r\n\r\nAdditionally to the current LEB/LET exclusive 100% promotion (available even when this promotion ends) we will be providing every potential customer with a 3 day free trial of our 512MB package.\r\n\r\nThis is to try and prove that we have absolutely nothing to hide and are completely open and transparent.\r\n\r\n========== **VPS Information / FAQ** ==========\r\n\r\n**How long has TurboVM been in business?**\r\nTurboVM is a brand new business owned and operated by the sole trader Marc Lough (myself). You can view my WHOIS information at [http://whois.sc/turbovm.com](http://whois.sc/turbovm.com) and email me directly with any questions at [admin@turbovm.com](mailto:admin@turbovm.com) or via Skype at ssrmaclof\r\n\r\nI am from the United Kingdom and have many years experience in Systems Administration and Software Development (currently my full time job apart from TurboVM). \r\n\r\n**How long are your setup times?**\r\nWe provide instant setup on all of our packages providing that we have received receipt of a successful payment. Stocks are strictly limited based on what we can provide instantly.\r\n\r\n**What hardware do you use in your nodes?**\r\nCurrently we have a minimum baseline of the following specification:\r\n* CPU: E3-1230\r\n* RAM: 32GB DDR3 ECC\r\n* Storage: RAID 10 with 4x SATA HDD\r\n\r\nWe do have plans to introduce an E5 / SSD range of nodes in the near future and will outline a separate baseline as and when they become available.\r\n\r\n**Where are your services located?**\r\nWe currently provide OpenVZ services at the Phoenix NAP datacenter in Phoenix, Arizona.\r\n\r\n**Do you have a test IP / file?**\r\nOf course, you are able to ping and traceroute to this IP: **199.231.86.20** as well as test download speed from the following file: [http://199.231.86.20/100mb.test](http://199.231.86.20/100mb.test)\r\n\r\n**What connectivity do the nodes have?**\r\nEvery node has access to 1Gbps of connectivity, however we currently limit each VPS to a maximum of 100Mbps to give each customer the best possible share.\r\n\r\n**What is the best method of contacting support?**\r\nThere are a couple of methods, primarily you can either email directly to [support@turbovm.com](mailto:support@turbovm.com) or submit a ticket directly to our [online helpdesk](https://my.turbovm.com/submitticket.php).\r\n\r\nAlternatively you can use our live chat system (although primarily for sales queries).\r\n\r\n**What methods of payment do you accept?**\r\nWe currently accept Paypal payments only, however will likely to be supporting Google Checkout soon.\r\n\r\n**Do you offer any sort of refunds?**\r\nYes we do indeed. All of our services are applicable for a 72 hour no questions asked money-back guarantee. Simply send us an email/ticket within that time frame and we will issue you with a full refund.\r\n\r\nIf you give us some feedback/suggestions as to what has caused you to have these issues, we may even let you keep the service for the remainder of the money, free of charge.\r\n\r\n**Are there any limitations on what I can use/host?**\r\nWe do not allow customers to host IRC clients/servers, illegal adult content (legal is fine), TOR, phishing websites or any copyrighted material (without permission).\r\n\r\nPlease review our [Terms of Service](https://www.turbovm.com/terms) for more information, or alternatively you can send us an email if you are not completely sure about something."}