{"id": 80123, "date": "2016-04-02 20:47:04", "user": "Zappie", "post": "Hello World.\r\n\r\nWe are very excited to **Officially** announce our new VPS location for Zappie Host.\r\n\r\n**New Delhi, India**\r\n\r\nAs always, the VPS servers are in a low-end price range and native IPv6 is available.\r\n\r\nPlease go here for our looking glass and test IP addresses: [http://lg-in.zappiehost.com/](http://lg-in.zappiehost.com/)\r\n\r\nTo celebrate this new location opening officially we wanted to do a little give away competition, so here goes: \r\n\r\nHow many jelly beans are in this server?\r\n\r\n![](http://i.imgur.com/vyYKb8e.jpg)\r\n\r\n**Prizes:**\r\n\r\n - **1st place** - The first closest 1 person will get a 100% recurring discount on any of our VPS servers (for life)\r\n - **2nd place** - The next closest 3 people will get a 4GB VPS in a location of their choice free for 6 months.\r\n - **3rd place** - The next closest 3 people will get a 2GB VPS in a location of their choice free for 3 months\r\n - **4th place** - The next closest 3 people will get sent our shirts (in their size) for free ([shirt example]\r\n(http://i.imgur.com/NrbHrNw.png))\r\n\r\n_Essentially there will be 10 winners :D_\r\n\r\n**Extra Notes and rules:**\r\n\r\n- Any LET member that has been registered before this post date can compete.\r\n- Place your guess publicly on this thread, only 1 guess per person.\r\n- If, for some reason, you win and you dont want the prize, you can agree with whoever else to claim it on your behalf\r\n- Our terms of services still apply when using the VPS machines.\r\n- Services won are not refundable or exchangeable for money or credit\r\n- Competition closes at 5th April UTC (thats 2 days and ~3hours from this post)\r\n- Countdown can be seen [here](http://www.tickcounter.com/countdown/1459814400000/utc/dhms/FFFFFF3B5998000000FF0000/)\r\n- Jelly beans have been individually counted (yes I had instant regrets as soon as I started pouring them in the server\r\n\r\nGood luck!!"}