{"id": 8626, "date": "2013-03-08 18:44:28", "user": "HostVPS", "post": "[HostVPS](http://www.hostvps.net/) is proud to offer our new exclusive offer for the LET &amp; LEB community, now with double the hard drive space and even more fast bandwidth!\u2028\r\n\r\nThese nodes were custom built with no expense spared for enterprise grade hosting services and use the latest Intel Xeon CPUs and Intel server main boards. Our nodes are all running 3Ware/LSI hardware RAID cards with BBU's installed with WD server grade / RAID spec hard drives.\u2028\r\n\r\n**HostVPS KVM 512\u2028**\r\n• 2 CPU Cores\u2028\r\n• 512MB RAM\u2028\r\n• 512MB SWAP\r\n\u2028• 32GB RAID10 (HW+BBU)\r\n\u2028• 500GB Bandwidth (100Mbit Port)\r\n\u2028• 1 IPv4 Address\r\n\u2028• Optional VPS Management and Daily Backups\r\n\u2028• KVM / Proxmox VE\r\n\u2028• Free OS install and setup the same business day\r\n\u2028• £4.40 /Month \r\n\u2028• [Direct Signup\u2028](https://www.hostvps.net/cart.php?a=add&amp;pid=85)\r\n\r\n**HostVPS OpenVZ 512**\r\n\u2028• 2 CPU Cores\r\n\u2028• 512MB RAM\u2028\r\n• 512MB V.Swap\r\n\u2028• 32GB RAID10 (HW+BBU)\r\n\u2028• 500GB Bandwidth (100Mbit Port)\r\n\u2028• 1 IPv4 Address\r\n\u2028• Optional VPS Management and Daily Backups\r\n\u2028• OpenVZ / Proxmox VE\r\n\u2028• Free OS install and setup the same business day\r\n\u2028• £4.40 /Month \r\n\u2028• [Direct Signup](https://www.hostvps.net/cart.php?a=add&amp;pid=84)\r\n\r\nHostVPS offer an enterprise grade VPS service at affordable prices. We offer a competitively priced VPS hosting service with a fast network and undersold servers that our clients can enjoy with the least amount of usage restrictions possible.\r\n\u2028\r\nAll HostVPS staff have a minimum of 10 years plus experience in hosting services, computer hardware and network engineering and focus on providing our clients with the best VPS hosting services possible.\r\n\u2028\r\nHostVPS have been providing high performance VPS hosting services since 2005 and web hosting, computer/server hardware repair, network engineering and I.T. consulting services since the nineties.\r\n\r\n\u2028\u2028We offer a 99.9% uptime guarantee on our services and accept payment by all major credit cards via PayPal, we offer 7 day money back guarantee on all our hosting services.\u2028\r\n\r\nOur network terms allow any legal usage that does not adversely affect other users on our nodes or network. For more information, please read [Our Terms](http://www.hostvps.net/terms-of-service.php) and [Usage Policy](http://www.hostvps.net/acceptable-usage-policy.php) or [Contact Us](https://www.hostvps.net/contact.php) for more information.\u2028\r\n\r\nHostVPS Network &amp; DC Information:\u2028\u2028\r\n\r\nHostVPS operate our self-owned servers and network equipment from the BlueSquare data centre in Maidenhead, UK.\u2028\r\n\r\nTest IP: 91.186.8.3\r\n\r\n\u2028\u2028[Speed Test [10MB]](http://www.hostvps.net/HostVPS-10MB.dat)\r\n[\u2028\u2028Speed Test [100MB]](http://www.hostvps.net/HostVPS-100MB.dat)"}