{"id": 8640, "date": "2013-03-09 06:33:14", "user": "Jylee", "post": "I got a reseller from beijing teletron (it is said the largest datacenter in Asia)\r\n\r\nI can offer this plan for $5.7\r\n\r\n_CPU:Intel XEON E5620 2.40GHz 1 Core \r\nRAM:512M DDRIII \r\nHDD:60G SAS+40G Cloud \r\nLocation: Beijing\r\nBandwidth: Unlimited Transfer on 5Mbps Port\r\n1 ip address\r\nVMware_\r\nFree Windows 2003 (Chinese only, if you want English version, do it yourself!) and CentOS 5.6\r\nNO OTHER OPERATING SYSTEMS.\r\n\r\nNo Control Panel, just a ticket system (If you don't know Chinese, I can help you submit the ticket at 6:00 p.m GMT +8 for I am still a student ).\r\n\r\n\r\nOrder Link: http://my.starrydns.com/cart.php?gid=7\r\nSwitch to English at right-bottom.\r\n\r\nAccept Payment: Paypal and Alipay.\r\n\r\n\r\nyou can use this vps for:\r\n\r\n1. go inside the Great Firewall of China to experience. (http://en.wikipedia.org/wiki/Great_Firewall_of_China#Technical_implementation)\r\n\r\n2. set a vpn and watch free films on Youku, Tudou or others.\r\n\r\n3. make a website (it has a good speed to China mainland.), You don't need domain real-name registration system until your water meter is checked. If you were checked, your traffic will go through Hongkong.\r\n\r\n4. monitoring your service status in China.\r\n\r\n5. etc....\r\n\r\n\r\nEdit:\r\nbefore you buy this vps, you should know:\r\n1. you must submit a ticket if you wanna reboot/reinstall your system. ( I can help you submit the ticket at 6:00 pm GMT +8 )\r\n2. you may wait a long time (maybe 10 hours) after your ticket get response.\r\n3. the vps is set up by hand (they don't provide api), on Workdays (Monday to Friday) 17:30-18:20,22:00-22:30 GMT+8 and Weekends (Saturday/Sunday) 9:00-22:00 GMT +8.\r\n4. the vps may perform bad (outage, low I/O, low network speed, etc)\r\n\r\n\r\n\r\nSorry for my poor English, I hope you can understand what I mean.\r\n\r\nDon't hesitate to contact me if you have any questions.\r\n\r\nMy Gtalk: lijunyan96@gmail.com"}