{"id": 90743, "date": "2016-08-29 21:05:20", "user": "MikeA", "post": "[**ExtraVM**](https://extravm.com) (Q4 2014) offers OpenVZ and KVM VPS in Montreal, Gravelines and Dallas. Our KVM are more expensive, but OpenVZ are considered budget prices and utilize OVH Game DDoS mitigation, which is known to work well against the majority of attacks with minimal drops for game and VoIP. You can request custom network firewall rules to be assigned for your IPv4. If you're interested check out our LET plans below. We take weekly backups of all OpenVZ VPS, and have multiple resource monitoring setup for our systems. We also support IPv6 and include it with every server.  \r\n  \r\nIf you have a question just [submit a ticket](https://www.extravm.com/billing/submitticket.php?step=2&amp;deptid=3), typical response time during North America daytime hours is under 15 minutes. You can also contact us via live chat on our website if we're available.  \r\n  \r\n**// 512MB OVZ**  \r\n1 CPU Core (4.0GHz)  \r\n512MB Dedicated RAM  \r\n6GB SSD Space  \r\n1TB Bandwidth (Free inbound)  \r\n250Mbps Port  \r\n1 IPv4 + 1 IPv6  \r\nDDoS Protected (Anti-DDoS Game)  \r\n$3.00/month  \r\n  \r\n**// 1024MB OVZ**  \r\n2 CPU Cores (4.0GHz)  \r\n1024MB Dedicated RAM  \r\n15GB SSD Space  \r\n2TB Bandwidth (Free inbound)  \r\n250Mbps Port  \r\n1 IPv4 + 1 IPv6  \r\nDDoS Protected (Anti-DDoS Game)  \r\n$6.00/month  \r\n  \r\nInterested? Order now.  \r\n**Montreal, CA** - [https://www.extravm.com/billing/cart.php?gid=11  ](https://www.extravm.com/billing/cart.php?gid=11)  \r\n**Gravelines, FR** - [https://www.extravm.com/billing/cart.php?gid=15  ](https://www.extravm.com/billing/cart.php?gid=15)  \r\n  \r\n_Use the promotion code \"LET10\" to get 10% off recurring on any OpenVZ plan._  \r\n  \r\nAdditional IPv4 can be requested after ordering for $1.50/month each. We support all common Linux distributions including CentOS 5,6,7, Ubuntu 14,15,16, Fedora 20,21,22,23, Scientific 6, Suse 13, etc. Setup time is typically instant after payment is received, if not then we likely need to replenish IP allocation which generally takes less than 30 minutes. We offer a 3 day money back period, no questions asked.  \r\n  \r\nPayment Methods:  \r\n- PayPal (Debit/Credit)  \r\n- BitPay (Bitcoin)  \r\n- PaymentWall (PaysafeCard, PagSeguro, and 100+ Local Gateways/Currencies)    \r\n  \r\n_Note: We will be expanding to Asia, Australia, and the United States for our OpenVZ VPS in 2017._  "}