{"id": 90998, "date": "2016-09-01 14:49:17", "user": "joepie91", "post": "*(Posting this offer with the permission of Ishaq.)*\r\n\r\nIt's been a while since my last offer, but I'm back - this time, with quite a different kind of offer!\r\n\r\n## The offer\r\n\r\nI'm currently offering my [tutoring and code review services](http://cryto.net/~joepie91/code-review.html) for __€35 per hour__, which is a slight discount from my normal rate of €40 per hour. However, the really interesting part is that __the first two hours are free, no strings attached :)__\r\n\r\nThere is *absolutely no obligation* to continue the lessons after the first two hours, and even if you choose not to continue, you'll still come away from the lesson with useful knowledge.\r\n\r\nThere is also *no skill requirement* - whether you've never programmed before, or whether you're experienced but need help with a complex topic or some code review, the lessons are adapted to your situation. There is no fixed curriculum.\r\n\r\nMore details are available [here](http://cryto.net/~joepie91/code-review.html). In short: we will go through your goals (and/or project) on IRC or XMPP and work on it, in whatever way works best for you. Whether that is pointing you in the right direction for self-directed learning, or explaining things step-by-step. I will adjust my teaching style (and language use) to whatever works for you, and you can ask any questions at any time during the session.\r\n\r\n## The conditions\r\n\r\n* The offer is valid __until September 15__. If you contact me about scheduling before that date, but the session itself is *after* September 15, then the offer will still be valid - what matters is when you take me up on it.\r\n* The offer is valid only once per student.\r\n* The two free hours must be used in a single session.\r\n* You must be motivated. As this is private tutoring, the lessons are adapted entirely to your requirements - which means you get out what you put in.\r\n* There's no hard limit on how many people can take me up on this offer, but it is of course subject to my availability. I don't expect to run into this limit, though.\r\n\r\n## Payment terms\r\n\r\n* Payments can be made through Bitcoin, PayPal, or a SEPA transfer. Or cash, if you happen to live nearby :)\r\n* There's no obligation to pay until the first paid session. You only need to pay __after__ the two free hours.\r\n* For paid sessions, hours must be paid upfront. More details about the payment terms can be found [here](http://cryto.net/~joepie91/code-review.html#payment).\r\n\r\n## Great, how do I take you up on this?\r\n\r\nJust contact me through any of the following:\r\n\r\n* __LowEndTalk:__ Just send me a PM!\r\n* __E-mail:__ [admin@cryto.net](mailto:admin@cryto.net)\r\n* __XMPP:__ joepie91@neko.im\r\n* __IRC:__ joepie91 on Freenode (in #lowendtalk) - however, PMs on IRC tend to go unnoticed, so the other methods are more reliable.\r\n\r\nMake sure to have a code editor of some sort handy - which editor to pick is up to personal preference, but some popular options are [Atom](https://atom.io/), [Brackets](http://brackets.io/), [GEdit](https://wiki.gnome.org/Apps/Gedit), and [vim](http://www.vim.org/). If you're not sure how to use XMPP or IRC, don't worry - I'll help you get that set up before the session.\r\n\r\n## Why am I offering this?\r\n\r\nQuite simply: because private tutoring and code review - at least, the way I approach it - isn't really an established thing in the software development world. This way, people who have no idea what to expect can try it out, and decide whether it's for them.\r\n\r\nI'm confident that you'll *want* to continue after the first two hours, so there's no need for me to *require* you to do so :)\r\n"}