{"id": 94370, "date": "2016-10-15 12:24:08", "user": "seriesn", "post": "Good day fellow LETians. Some of you might know us and most of you most likely don't. But we want you to know us.\r\n\r\n&lt;u&gt;**Who are we? :**&lt;/u&gt;\r\n&lt;center&gt;&lt;a href=\"https://nexusbytes.com\"&gt;We are Nexus Bytes LLC&lt;/a&gt;&lt;/center&gt;\r\n\r\n&lt;p&gt;\r\nYour premium web hosting partner and pure SSD VPS provider.  Nexus Bytes LLC is a privately owned hosting company established in 2016. We are based out of Middletown, Connecticut, USA. \r\nWe are legally incorporated as a business in the State of Connecticut. Nexus Bytes LLC is owned and managed by a very small group of IT enthusiasts who are passionate about web hosting and server management and pride themselves in providing reliable and affordable web hosting service to the masses at a price they can afford.\r\n&lt;/p&gt;\r\n\r\n&lt;u&gt;**Our motto :**&lt;/u&gt;\r\n&lt;p&gt;\r\nWe only believe in providing quality service for an affordable price. Customer satisfaction is, has been and will always be our top priority! \r\nHere at Nexus Bytes LLC, you, our customers are our #1 priority and we strive to make you happy. Your satisfaction is what we care about and we will do everything and anything we can, that is within our policy and capability to ensure your are 100% satisfied. &lt;/p&gt;\r\n\r\n&lt;u&gt;**What are we offering here at LET?**&lt;/u&gt;\r\n&lt;p&gt;Well to keep it short and simple, we are offering 30% off on any of our VPS hosting plans and and for LET users only, we are also offering first month at completely $0. That is right folks. You do not even have to enter your credit card numbers to be able to get first month for 100% free and if you are part of any recent host that went completely deadpool within last 2 months or you are switching from your existing provider, that $0 promo will be extended from 1month to 3 months&lt;/p&gt;\r\n\r\nOkay lets get down to details,\r\n\r\n&lt;u&gt;Plan :&lt;/u&gt;\r\n SSD-1G\r\n&lt;ul style=\"list-style-type:square\"&gt;\r\n&lt;li&gt;1 GB RAM&lt;/li&gt;\r\n&lt;li&gt;10 GB PURE SSD STORAGE&lt;/li&gt;\r\n&lt;li&gt;500 GB Transfer*&lt;/li&gt;\r\n&lt;li&gt;1 CPU Cores @3.2GHz+**&lt;/li&gt;\r\n&lt;li&gt;1 IPv4/10Ipv6&lt;/li&gt;\r\n&lt;li&gt;Locations : Miami/Texas/Florida&lt;/li&gt;\r\n&lt;/ul&gt;\r\n &lt;del&gt;$10/mo&lt;/del&gt; $7/mo with discount code **&lt;i&gt;\" LETOCT1 \"&lt;/i&gt;**\r\n&lt;br /&gt;\r\n&lt;a href=\"https://www.nexusbytes.com/pure-ssd-kvm-vps.html\"&gt;Order and configure here&lt;/a&gt;\r\n\r\n&lt;u&gt;**But you said $0 ?**&lt;/u&gt;\r\n&lt;p&gt;Yes we did and this is where LET exclusiveness kicks in. If you are a verified LET user, after you have placed your order, please send me a pm here with your order number. During your order process, please select paypal as your payment option and that should be it.&lt;/p&gt;\r\n\r\n&lt;u&gt;**I used to be a part of XYZ who deadpooled or I am switching from XYZ**&lt;/u&gt;\r\n&lt;p&gt;If you are part of a sunken ship, we are here to rescue you. If you are not satisfied with your existing provider, we are also here to assist you in finding a better replacement. &lt;br /&gt;\r\n\r\nIf your provider went out of business recently, please supply us with either a copy of your most recent paid invoice or proof of most recent payment (i.e bank statement/paypal confirmation) and promo will be extended to additional 2 more month. &lt;br /&gt;\r\n\r\nIf you are not satisfied with your current provider, please send us a confrimation of your service cancelation with your existing provider, after you have signed up with our service and we will gladly extend $0 promo to 2 additional months. &lt;/p&gt;\r\n\r\n\r\n&lt;p&gt;At the end of your free months of service, price will revert back to promotional $7/mo. Above $0 promo is only valid for our SSD-1G plan advertised above. However, recurring 30% discount can be used for upgrading to a different package that is currently active on our website. \r\n&lt;br /&gt;\r\nLink  to our &lt;a href=\"https://www.nexusbytes.com/terms-of-service.html\"&gt;Terms of Service&lt;/a&gt;, &lt;a href=\"https://www.nexusbytes.com/acceptable-use-policy.html\"&gt;Acceptable use policy&lt;/a&gt;, &lt;a href=\"https://www.nexusbytes.com/privacy-policy.html\"&gt;Privacy Policy&lt;/a&gt; and &lt;a href=\"https://www.nexusbytes.com/service-level-agreement.html\"&gt;Service level agreement&lt;/a&gt;. &lt;br /&gt;\r\n\r\n&lt;a href=\"https://nexusbytes.com/clients/knowledgebase.php?action=displayarticle&amp;id=1\"&gt;Answer to most frequently asked questions&lt;/a&gt; &lt;br /&gt;\r\n\r\n&lt;a href=\"https://nexusbytes.com/clients/knowledgebase.php?action=displayarticle&amp;id=3\"&gt;Data center information&lt;/a&gt;&lt;/p&gt;\r\n\r\nThank you for taking your time and reading up this offer. We look forward towards earning your business.\r\n\r\n\r\n\r\n\r\n\r\n\r\n"}