{"id": 94388, "date": "2016-10-15 18:21:43", "user": "cubedata", "post": "![](https://cubedata.net/img/cd-logo.svg)\r\n\r\nCubeData is happy to announce our FraudRecord anti fraud module for both WHMCS/Blesta will be on sale from now until the day after Black Friday\r\n\r\nAnd by sale we actually mean that our FraudRecord anti fraud module will be FREE! as in free owned licenses for providers!\r\n\r\nthis promotion runs until the day after black friday(due to you cannot tell WHMCS to expire the promo code automatically at a time only a date). Please use this coupon code(`061FE6UXBB`) to get this promotion which will expire automatically the day after black friday. \r\n\r\nWe are doing this once in a lifetime promotion to hopefully help providers with all their fraud/chargeback issues which we have surely seen a drop in since we started using the module ourself!\r\n\r\nYou can order it here: [WHMCS FraudRecord](https://my.cubedata.net/cart.php?a=add&amp;pid=14) [Blesta FraudRecord](https://my.cubedata.net/cart.php?a=add&amp;pid=9) All orders are provisioned instantly, assuming you pass our automated fraud screening system.\r\n\r\nPlease read our [terms of service](https://cubedata.net/terms) and [AUP](https://cubedata.net/aup) before signing up to avoid any possible disappointment down the road including our no refund policy and also our stance on any/all chargebacks.\r\n\r\nThis Coupon Code though will only work for one order only to prevent abuse.\r\n\r\nThe difference between this FraudRecord Module and the official one is it isn't manual it is automated and ties directly into either WHMCS or Blesta's anti fraud system to run just like maxmind and includes the bonus of using black's getipintel.net api as well making sure no fraud even makes it past the shopping cart!\r\n\r\nThis owned license deal is a $100 value free for this limited time!\r\n\r\nTo the skeptics who think this is too good to be true(you are wrong), here is answered questions people have already asked &amp; got answered:\r\n\r\n1 -  Q:With this FraudRecord Owned Module I now have in my account is 100% free for me to use on my website? \r\n\r\nA: Yes\r\n\r\nQ: Are there any limits or will i have to pay for support and updates in the future?\r\n\r\nA: Yes you will have to pay for support and updates in the future(12 months afterward) No other limits are there except the obvious that you can only use it on one domain,etc(Additional Instances will come later)\r\n\r\n2 - Q: What is the catch with this promotion?\r\n\r\nA: There is no Catch we aren't here to try to \"trip\" you up we are here instead with this offer to help out providers with battling fraud/chargebacks\r\n\r\n3 - Q: How much will the support/upgrades cost?\r\n\r\nA: just $25 USD which our WHMCS will automatically convert for you into your own currency."}