{"id": 96618, "date": "2016-11-12 12:20:17", "user": "rmlhhd", "post": "Chattr Ltd is proud to announce the launch of DevCapsule, a new VPS provider based in Manchester. \r\n\r\nAs some of you may already know, over the past few months we’ve been working hard building our own platform and getting our initial Manchester location ready for launch. \r\n\r\nOur platform consists of a brand new control panel and a 3 step server deployment process. It features - \r\n&lt;ul&gt;\r\n&lt;li&gt;Within 60 second deployments – from Click to Online in seconds&lt;/li&gt;\r\n&lt;li&gt;noVNC Console direct to your server&lt;/li&gt;\r\n&lt;li&gt;Detailed Usage Graphs&lt;/li&gt;\r\n&lt;li&gt;Hourly Billing&lt;/li&gt;\r\n&lt;li&gt;One-click reinstalls&lt;/li&gt;&lt;/li&gt;\r\n&lt;li&gt;Custom ISO’s – simply provide a URL\r\n&lt;li&gt;SSH Keys – add a public key and authenticate with your server as soon as it’s deployed&lt;/li&gt;\r\n&lt;li&gt;DNS Management&lt;/li&gt;\r\n&lt;li&gt;BGP Sessions&lt;/li&gt;\r\n&lt;/ul&gt;\r\n\r\nAs mentioned above our initial location is Manchester, based in the Trafford Park M247 Datacentre with connections to LINX providing low-latency connections across the UK and Europe. \r\n\r\nWe’ve got a wide variety of plans available to meet your needs (only our smallest plan meets LET’s rules), our smallest plan offers – \r\n&lt;ul&gt;\r\n&lt;li&gt;1 vCPU&lt;/li&gt;\r\n&lt;li&gt;768MB RAM&lt;/li&gt;\r\n&lt;li&gt;10GB 100% SSD Storage&lt;/li&gt;\r\n&lt;li&gt;1000GB Transfer&lt;/li&gt;\r\n&lt;/ul&gt;\r\n\r\nFor just £3.50 per month or £0.005 per hour. \r\n\r\n**[To deploy or see our other plans signup here\r\n](https://cloud.devcapsule.com/register/)**\r\n\r\nWe accept PayPal as a payment method.\r\n\r\nWe’ve got plans to expand to other locations and are currently in talks with suppliers, subject to high demand The Netherlands is high on our expansion list.\r\n\r\nIf you have any questions, please feel free to comment or submit a ticket :)\r\n\r\nYou can also join #DevCapsule on FreeNode.\r\n\r\nHappy Deploying!\r\n"}