{"id": 96915, "date": "2016-11-16 15:33:15", "user": "JetApps", "post": "BACKUPS BACKUPS BACKUPS!\r\n\r\nAs the fastest growing cPanel backup software, JetBackup is really an addon we can stand behind and be proud to offer you. Have you been looking for a backup solution with Incremental Remote Backups? Lucky for you with “Point-in-time incremental backups”, JetBackup harnesses the power of hardlinks to use less space while backing-up accounts. After your first full backup future backups will only take up space from changed files. \r\n\r\nAre you in need of Multiple Remote Destinations for your backups? You can schedule as many backup jobs as you want with JetBackup from multiple supported backup destinations; Local backups, Remote SSH, Remote FTP, Amazon S3, and Dropbox!\r\n\r\nEXAMPLE OF FEATURES PROVIDED\r\n\r\nComplete cPanel account backup\r\nBackup directly to remote destination\r\nSelf restore GUI for cPanel users\r\nSingle file restore from local/remote backup\r\nDownload files from local/remote backup\r\nDR Mode – Clone accounts by schedule between servers\r\nPoint-in-time local/remote incremental backups\r\nCloudLinux support (put the backup process inside LVE)\r\nAPI Access to backup/restore system\r\nMultiple backup destinations\r\nMultiple backup jobs to multiple destinations\r\nLimit backup space / inodes for users\r\nWHMCS module to sell backup services\r\n\r\n\r\nJetBackup is $3.95/month per cPanel server. Use JetBackup on UNLIMITED cPanel accounts for your entire server! We operate 24/7/365 and are always ready to assist you. Our order process is extremely quick and automated. Order direct from our website and start using JetBackup today! https://www.jetapps.com/order. \r\n\r\nStart selling backup services! Use the JetBackup Manager WHMCS module to easily create backup products for your clients and link them to existing hosting accounts. This WHMCS module will calculate the amount of backup space used and create an invoice directly inside your WHMCS client area. The JetBackup Manager WHMCS module is free with purchase of a JetBackup license!"}