{"id": 97812, "date": "2016-11-25 18:01:13", "user": "AlexBarakov", "post": "![AlphaVPS](http://alphavps.bg/assets/images/logo.png)  \r\n[AlphaVPS](https://alphavps.bg) - offering affordable, yet reliable, OpenVZ and KVM, Virtual Private Servers for the masses.  \r\n  \r\n**AlphaVPS** is a part of DA International Group Ltd. and has been operational since 2013, serving both local and international customers around the world. The company is registered within Bulgaria, EU with UIC: 202826767 .   \r\nOur phisical office is located in Troyan, Bulgaria - Bulgaria, Troyan 5600, VPPK Balkan, floor 1. We are currently serving hundreds of international and local customers. Our range of services include, but are not limited to - web hosting, reseller hosting, specific application hosting (wordpress, joomla, magneto, node.js, etc.), OpenVZ and KVM based VPS, Dedicated servers, DDoS protection, R1Soft licenses, R1Soft managed backups, System administration and much more. All our OpenVZ services are utilizing only blazing fast, full SSD arrays, while our KVM services are using big HDD arrays to accomodate the needs of our customers.\r\n  \r\nOur PoPs are based at:  \r\n- Sofia, Bulgaria @ Telepoint DC  \r\n- London, United Kingdom @London Enfield 1 facility - DDOS Protected   \r\n- New Jersey, USA @ Choopa's facility in NYC Metro. - DDOS Protected   \r\n- Nuremberg, DE - DDOS Protected   \r\n\r\nNetwork information and looking glass will be provided on request in a PM or via email.  \r\n\r\nIn this exclusive Black Friday offer I will include only 4 custom plans for VPS and 1 for dedicated server, no promo code is required.  \r\n \r\n**BlackFriday 6G**  \r\n-6GB Dedicated RAM  \r\n-45GB SSD  \r\n-2TB Bandwith  \r\n-4 Shared CPU Core  \r\n-1gbps Port  \r\n-1 IPv4 IP  \r\n-UK or BG or NY or DE  \r\n-OpenVZ  \r\n-6.30 euros per month  \r\n[ORDER NOW!](https://alphavps.bg/clients/cart.php?a=add&amp;pid=83)  \r\n\r\n**1GB Dedicated RAM**  \r\n-15GB SSD  \r\n-1TB Bandwidth  \r\n-2 shared CPU Cores  \r\n-1gbps port  \r\n-1 IPv4 IP  \r\n-UK or BG or NY or DE  \r\n-OpenVZ  \r\n-3 euros per month OR 12 euros per year  \r\n[ORDER NOW!](https://alphavps.bg/clients/cart.php?a=add&amp;pid=84)  \r\n\r\n**2GB Dedicated RAM**  \r\n-25GB SSD  \r\n-1TB Bandwidth  \r\n-2 shared CPU Cores  \r\n-1gbps port  \r\n-1 IPv4 IP  \r\n-UK or BG or NY or DE  \r\n-OpenVZ  \r\n-4 euros per month OR 20 euros per year  \r\n[ORDER NOW!](https://alphavps.bg/clients/cart.php?a=add&amp;pid=85)  \r\n\r\n**4GB Dedicated RAM**  \r\n-35GB SSD  \r\n-1TB Bandwidth  \r\n-4 shared CPU Cores  \r\n-1gbps port   \r\n-1 IPv4 IP  \r\n-UK or BG or NY or DE  \r\n-OpenVZ  \r\n-5 euros per month OR 30 euros per year  \r\n[ORDER NOW!](https://alphavps.bg/clients/cart.php?a=add&amp;pid=86)  \r\n\r\nDedicated Server, available only in Sofia:  \r\n**Dual Quad Core Xeon L5630**  \r\n-8GB RAM - FREE UPGRADE TO 16GB, during BlackFriday to Cyber Monday including  \r\n-1TB HDD - FREE UPGRADE TO 240GB SSD, during BlackFriday to Cyber Monday including  \r\n-100mbps port - FREE UPGRADE TO 1gbps, during BlackFriday to Cyber Monday including  \r\n-5TB Bandwidth  \r\n-/29 IPv4, dedicated VLAN  \r\n-43 euros per month or 400 euros per year (which is only 33 euros per month)  \r\n**-FREE Upgrade to 72GB RAM on all yearly purchases**  \r\n[ORDER NOW!](https://alphavps.bg/clients/cart.php?a=add&amp;pid=87)  \r\n    \r\nPricing without VAT. If you provide a valid VAT ID during sign up, you will get VAT-free invoice.  \r\n  \r\nCustom plans, resource pools, r1soft licenses and others are available by contacting us [over here](https://alphavps.bg/clients/contact.php)  \r\n    \r\nLowend Dual L5630/L5520s are also available, by reaching to us. Different kind of dedicated servers available for lease or lease to own in Sofia and London, including latest generation of Xeon v5.    \r\n\r\nIPv4 in all RIRs is available for lease on monthly/3-monthly/6-monthly/12-monthly contracts. Contact me directly at alex{at}dagroup.bg to discuss pricing and needs. Got a lot of /24s in stock.  \r\n   \r\n  \r\nAlex\r\n"}