{"id": 9851, "date": "2013-04-19 23:00:12", "user": "William", "post": "Waveride is a new low-cost sub division of EDIS, offering low-cost high-power VPSes.\r\n\r\nCurrently 4 OpenVZ plans are offered, ranging from 4GB RAM and 50GB HDD space (€5 / month), to 8GB RAM and 100GB HDD space (€10 / month). [Orders can be placed here](https://waveride.at/whmcs/cart.php).\r\n\r\nWe use WHMCS and SolusVM, and deployment is fully automated, except for the first order (due to fraud screening). Your VPS is on a SuperMicro Dual E5-2630 (2x Hexacore + HT) node with 160GB RAM and 8 SAS2 drives of either 1 or 2 TB (Seagate Constellation Enterprise) in RAID50 (LSI), on a 1 gigabit connection to our core switch.\r\n\r\nDD: \r\n&lt;pre&gt;\r\ndd if=/dev/zero of=test bs=64k count=16k conv=fdatasync\r\n1073741824 bytes (1.1 GB) copied, 1.59443 s, **673 MB/s**\r\n&lt;/pre&gt;\r\n\r\nNodes are connected to the EDIS backbone, spanning 3 cities (Vienna in Austria, Graz in Austria, and Zurich in Switzerland) with Nx10GE/Nx1GE uplinks/interconnects to VIX (Vienna Internet Exchange), GRAX (Grazer Internet Exchange), ReTN, HE (IPv4 outbound only to avoid HEs inbound congestion), FiberRing (LeaseWeb/OCOM) and private peerings (eg. Swisscom, Akamai, most telcos in ex-Yugoslavia and eastern Europe). Our network is redundant and IPv6-enabled. The physical nodes are located in Vienna, Austria.\r\nFurther info on our AS/Network: http://as57169.net\r\nLooking glass: http://at.edis.at\r\n\r\nNow you might think there is a catch and yes, there totally is - but not necessarily a problematic one. These plans are entirely unmanaged and unsupported. We monitor the nodes and act on resource abuse or hardware problems, but we do not provide any support for software,  routing issues/requests, template requests, control panel installations and so on. SolusVM lets you handle 99,9% of these tasks yourself, and you are expected to do so.\r\nFor emergencies, there is the WHMCS ticket system - don't message or call EDIS directly, it will be ignored!\r\n\r\nOther things:\r\n* VPSes are always delivered with Debian 7 x64 as default operating system, reinstall your VPS in SolusVM if you want something different.\r\n* IPv6 might not work out of the box (on CentOS and similar distributions). If it does not, simply run `ip route add ::/0 dev venet0`. If this does not work, try `ip route add 2000::/3 dev venet0`.\r\n* The initial installation of Debian may be corrupted by SolusVM, and the VPS might not come online. In this case simply reinstall from SolusVM.\r\n* We do not offer an SLA, uptime guarantee, or refund under any circumstances.\r\n* Stock is currently limited to 250 VPSes.\r\n* We don't keep backups, so make your own backups.\r\n* For setup guides and help with Linux, visit http://library.linode.com or http://www.cyberciti.biz\r\n\r\nToS:\r\n* No pointlessly CPU-intensive applications such as cryptocoin mining or Folding@home.\r\n* Minecraft allowed, but you won't be pleased with the performance. The nodes run on E5 CPUs (which have a lower clockspeed), and use a SAS array. Think twice about running it.\r\n* DDoS (either inbound or outbound) is not acceptable. IPs are nullrouted for a minimum of 12 hours, and we reserve the right to cancel your account if you get attacked.\r\n* Torrents and VPNs are acceptable, but we might ask you to stop if you get (too many) DMCA notices.\r\n* The information you provide during ordering **must** match PayPal information (name, e-mail address, country, ...).\r\n\r\n**TL;DR: New EDIS brand, it's great!**\r\n\r\nNow, here is the LEB plan:\r\n* 4 GB RAM\r\n* 50 GB HDD\r\n* 4 vCPU cores\r\n* 2 TB traffic\r\n* 1 IPv4 (no reverse DNS currently, ETA 1 week) / 10 IPv6 (no reverse DNS currently, ETA 2 - 3weeks)\r\nPayments are accepted via PayPal only.\r\nOrder here: https://waveride.at/whmcs/cart.php?a=add&amp;pid=1\r\n\r\n\r\n--The EDIS Staff\r\n:)"}