{"id": 9895, "date": "2013-04-21 18:54:52", "user": "vapornode", "post": "Hello low-end seekers! Chromobyte has a wonderful deal for those lightweight processing tasks such as DNS, email, and websites. This LEB offer contains 256MB and 512MB specials. The hardware behind these consists of E3v2 CPUs and Intel SSDs. All services will be automatically deployed in Chicago, IL, USA within the Steadfast Networks datacenter. Steadfast Networks has direct access to one of the largest carrier hotels in the world with redundancy and uptime among their top priorities.\r\n\r\n**256MB Deal (LEB 1)**\r\n- 256MB RAM\r\n- 8GB SSD Disk Space\r\n- 1 vCPU Core\r\n- 450GB Bandwidth @ 1Gbps\r\n- SolusVM Control Panel\r\n- 1 IPv4 Address\r\n- Unmanaged\r\nPrice: $2.75/mo\r\n[Order Here](https://my.chromobyte.com/?cmd=cart&amp;action=add&amp;id=72)\r\n\r\n**512MB Deal (LEB 2)**\r\n- 512MB RAM\r\n- 12GB SSD Disk Space\r\n- 2 vCPU Core\r\n- 850GB Bandwidth @ 1Gbps\r\n- SolusVM Control Panel\r\n- 1 IPv4 Address\r\n- Unmanaged\r\nPrice: $3.99/mo\r\n[Order Here](https://my.chromobyte.com/?cmd=cart&amp;action=add&amp;id=73)\r\n\r\n**Additional Items**\r\nAdditional IPv4 Address: $2.00/month + $0.50 setup fee\r\n_IPv6 Not Yet Available_\r\n\r\n**Extra Info**\r\nThis is Chromobyte's first appearance here on LET, as far as offering something, and we'd like to make it special. We are not new to the hosting industry as we were founded in Q4 2011 and have been going strong ever since. From the beginning, I have personally taken great pride in the support we offer. We strive to keep prices low while offering considerably high quality services. This philosophy goes hand-in-hand with our support staff as we make every decision strictly based around our customers. Support requests are responded to in helpful, professional, and fruitful replies - no three word answers from us.\r\n\r\nTest IP: 208.117.11.114 (Ping Me!)\r\n\r\n**Operating Systems**\r\nChromobyte utilizes OpenVZ technology. As such, Linux is the only supported operating system. We offer CentOS, Ubuntu, Debian, Fedora, and Scientific as of now. More can be added by request.\r\n\r\n**Payment**\r\nChromobyte currently only accepts payments via PayPal. If you do not have a PayPal account, you can pay with a credit/debit card processed through PayPal.\r\n\r\nWebsite: [chromobyte.com](http://chromobyte.com)\r\nAdditional Plans: [chromobyte.com/openvz](http://chromobyte.com/openvz)\r\n\r\nThanks for your interest!"}