{"id": 1155, "date": "2018-10-15T12:15:15.701Z", "user": "mikho", "post": "<p>Every time I post a new bundle deal there are always one, two or many who asks: What about us who bought the last bundle deal and are now missing this location? We don’t want to buy all again, just the ones we are missing?</p>\n<p>One of the things that were holding me back was that there is no easy way to solve this in WHMCS.</p>\n<p>After giving it much thought and discussing this with a couple of customers and friends I have decided to not offer a bundle deal this time.</p>\n<p>This time it is all about the loyal customers.</p>\n<p>So the offer is this:  <strong>ACTIVE CLIENTS ONLY</strong></p>\n<p>Topup with the locations you are missing and get the same renewal price as you have on your bundle deal!</p>\n<p>Details are as follows:</p>\n<p>You need to have ordered a bundle deal previously.</p>\n<p>Add as many locations you are missing, use promo code ”bundletopup2018” and pay the invoice.</p>\n<p>It has the be the same type of service, IE. You can’t order a 256mb package if you previously bought a 128mb bundle.</p>\n<p>(There will be an additional discount if you are missing/buying more than three locations)</p>\n<p>When the service is provisioned, the renewal date will be set to the same date as your bundle deal and the renewal price will be set to the same amount as your bundle deal.</p>\n<p>You will end up paying full price for less than a year of service but you will instead get as much as 50% discount on renewals without the need to buy all locations again.</p>\n<p>As an extra bonus, you will also get a server in the next planned location, which will be in the United States.</p>\n<p>The server at this new location will be free until the next renewal date where the price will be set to the same amount as your bundle deal. ETA 1-2 weeks from posting this offer.</p>\n<p><a href=\"https://clients.mrvm.net/cart.php?gid=11\" rel=\"nofollow noopener\">Group link for ordering</a></p>\n<p>As always, ask me anything and I will answer!</p>"}