{"id": 1311, "date": "2018-11-20T05:00:14.982Z", "user": "Ryan", "post": "<p><strong> <span>*** View Stock / Buy Now Here: <a href=\"https://incero.com/autoservers\" target=\"_blank\" rel=\"nofollow noopener\">https://incero.com/autoservers</a> ***</span></strong></p>\n<p><strong>Pre Black Friday Promotion Details</strong></p>\n<p>10% Recurring Monthly Discount<br>\n25% off 1 year Prepay<br>\n30% off 2 year Prepay<br>\n35% off 3 year Prepay</p>\n<p>Guarantee: All discounts will be preserved at the end of the billing cycle. So on month 13/25/37, you can switch to monthly at the same % discount for as long as you continue to pay.</p>\n<p><strong>Included with EVERY Auto Deploy Server</strong><br>\n</p><ul>\n<li>IPMI/KVM w/ISO, Dedicated, Firewalled<br>\n</li>\n<li>1 or <span>10gigabit</span> Public Uplink<br>\n</li>\n<li>1 or <span>10gigabit</span> Internal Network (on 2nd NIC), Unmetered Internal Transfer<br>\n</li>\n<li>1x Public IPv4 and Public /64 IPv6, 1x Interal IPv4 (10.x.x.x)<br>\n</li>\n<li>Auto Deploys with Auto OS Load:<ul>\n<li>CentOS 6+7<br>\n</li>\n<li>Debian 9 <br>\n</li>\n<li>Ubuntu 16.04 LTS<br>\n</li>\n<li>iPXE Chain Load<br>\n</li>\n<li>or load your own via IPMI/KVM</li>\n</ul>\n<br>\n</li>\n<li>Free Linux Assistance, Custom OS Loads, cPanel Install, Troubleshooting, etc</li>\n</ul>\n<p><strong> Inventory Available at Time of Posting (Stock Changes Rapidly, First Come First Served) </strong></p>\n<p><strong> <span>*** View Stock / Buy Now Here: <a href=\"https://incero.com/autoservers\" target=\"_blank\" rel=\"nofollow noopener\">https://incero.com/autoservers</a> ***</span></strong></p>\n<p>Here are the answers to some of the questions that we've had via chat and email;</p>\n<p>Can I replace my existing server with one of these servers?<br>\n-- Yes, but your old IPs cannot be moved to the new server.</p>\n<p>Can I get VIP status right away?<br>\n-- Yes, email <a href=\"mailto:sales@incero.com\" target=\"_blank\">sales@incero.com</a> and we can reply with an invoice for adding $1,000 account credits to your account. Just remember that you need to spend $1,000/mo every month to maintain VIP pricing.</p>\n<p>Are the ports dedicated?<br>\n-- Yes, you can reach the full port speed 24/7.</p>\n<p>Can you load _________ OS?<br>\n-- Yes just choose \"I'll load OS via IPMI/KVM\" on the order form and reply to the welcome ticket asking us to load an OS of your choice for you.</p>\n<p>When were you founded and how is your business doing?<br>\n-- Established in 2008. We are profitable, 100% privately owned, and have no outside loans or leases. All of our staff are employed directly by us here in the USA, we never outsource, and we are proud to provide high quality products.</p>\n<p>What payment methods do you accept?<br>\n-- Credit/Debit card, PayPal, Bitcoin</p>\n<p>Where can I view your data center specs?<br>\n-- https://incero.com/dallas-2-data-center</p>\n<p>Is your network redundant?<br>\n-- Yes, we have diverse Juniper routers in diverse POPs connected to diverse carriers, fed back to diverse Juniper cores via diverse fiber paths. All network equipment is powered by 2N power feeds (diverse UPS and generators). We have Juniper certified personnel on our full-time staff.</p>\n<p>Why are you more expensive than ___________?<br>\n-- We probably are not more expensive than any reputable provider for the same quality of service (redundant network, redundant power, 7 days per week on-site staff, etc). Feel free to contact us about other providers and we can highlight the differences between us.</p>\n<p>Why are you cheaper than ____________ ?<br>\n-- Our billing system is 100% automated so we don't hire any billing staff and don't have a CFO. We are a private company so we don't have to pay out dividends to investors and we don't face massive regulatory, PR, and accounting costs that publicly traded companies face. We bootstrapped so we don't have any finance charges or interest on loans to pay off.</p>\n<p><strong> <span>*** View Stock / Buy Now Here: <a href=\"https://incero.com/autoservers\" target=\"_blank\" rel=\"nofollow noopener\">https://incero.com/autoservers</a> ***</span></strong></p>"}