{"id": 1344, "date": "2018-11-23T00:03:05.339Z", "user": "Jarland", "post": "<p>(NOTE: These plans must be purchased as new to be obtained, we cannot change existing plans to these promotions)</p>\n<p>Hey everyone,</p>\n<p>It’s that time of year again where I push myself to make crazy offers to satisfy your need for email that just does the stupid thing it’s supposed to: Arrive at it’s intended destination.</p>\n<p>Email is easy for those with small needs, but quite a few of us have learned how much of a headache it can be when we need to send email to Hotmail, Gmail, Yahoo, Verizon, and AT&amp;T while having it all delivered to every one of those from one server. Quite often the best path to resolution is to pay someone a lot of money for a fancy service that really isn’t that fancy of a service to provide. On that note, I’m happy to say that we’ve been successful in reaching to all of those recipient services thanks to help from our customers.</p>\n<p>MXroute isn’t just an email host, it’s a movement against the notion that you have to pay top dollar to get your emails where they need to be. You’re not just buying the service, you’re supporting our efforts to keep email simple, reliable, sustainable, and affordable.</p>\n<p>The best part? We don’t charge you per user like the big companies do. We charge you based on the physical storage you want to set aside for your accounts. On that note, I’m happy to annouce the <strong>LARGEST</strong> allocation of space in a yearly promo to date, in an offer you can’t refuse.</p>\n<p>Here’s the offer:</p>\n<ul>\n<li>Unlimited Email Accounts</li>\n<li>Unlimited Domains</li>\n<li>300 outbound emails per hour (soft limit)</li>\n<li><strong>100GB of Storage</strong></li>\n<li>$15/year OR</li>\n<li>$25/2years OR</li>\n<li>$30/3years</li>\n<li><a href=\"https://billing.mxroute.com/cart.php?a=add&amp;pid=89\">Order now</a></li>\n</ul>\n<p>AND back by popular request, a $5 plan!</p>\n<ul>\n<li>Unlimited Email Accounts</li>\n<li>Unlimited Domains</li>\n<li>300 outbound emails per hour (soft limit)</li>\n<li>5GB of storage</li>\n<li>$5/year OR</li>\n<li>$10/2years OR</li>\n<li>$15/3years</li>\n<li><a href=\"https://billing.mxroute.com/cart.php?a=add&amp;pid=84\">Order now</a></li>\n</ul>\n<p>These packages include:</p>\n<ul>\n<li>SMTP / IMAP / POP3</li>\n<li>Webmail (Roundcube)</li>\n<li>Crossbox</li>\n<li>Custom in-house outbound cluster for high quality delivery (with 3rd party fallback, ex. MailChannels)</li>\n<li>DirectAdmin-based Control Panel</li>\n<li>Love</li>\n<li>Friendship</li>\n<li>Promise to continue improving the product</li>\n<li><a href=\"https://mxroute.fleeq.io/wiki\">A couple of video tutorials</a></li>\n</ul>\n<p>Thanks so much for supporting MXroute. I’ll keep doing everything I can to support you as well.</p>"}