{"id": 1608, "date": "2019-01-10T21:12:29.679Z", "user": "imok", "post": "<p>As always when leaving dedis, today is a sad day. I’ven been using this little machine for almost 2 years:</p>\n<ul>\n<li>Intel Xeon <strong>E3-1240 v3</strong> Haswell (4 cores / 8 threads @ 3.40 GHz, turbo @ 3.80 GHz)</li>\n<li>16GB Hynix DDR3-1600 ECC memory</li>\n<li>\n<strong>4x 250GB</strong> (1TB) Seagate Constellation ES.2</li>\n<li>Supermicro <strong>IPMI</strong> remote management (reboot, KVM &amp; virtual media)</li>\n<li>\n<strong>/29 subnet</strong>. 5 usable</li>\n<li>\n<strong>50TB</strong> (in+out) @ 1Gbps</li>\n<li>Install your own OS using IPMI</li>\n<li>Location: FDC Servers, Chicago.</li>\n</ul>\n<p>Provided by Heymman Servers, who has been awesome giving <strong>premium unmanaged support</strong>.</p>\n<p>Renewal price is $26/m and next due date is January 22.</p>\n<p>You can see a <a href=\"https://hostedtalk.net/t/heymman-servers-1-year-review/\">detailed Heymman review</a> thanks to <a class=\"mention\" href=\"/u/mason\">@Mason</a>.</p>\n<h2>What do you need to do to get this server?</h2>\n<ul>\n<li>Post a comment here indicating you are interested and you will be randomly selected using an online service. You have until 23:00 EST today Jan 10. You have 2 chances if you are an existing Hostballs user prior to this thread.</li>\n<li>If you get selected, you will have to give me your full name via PM. Yep, that is a provider requirement. Don’t worry, I’m not interested in your live except <a href=\"https://hostedtalk.net/t/im-hungry-what-are-your-favorite-dishes/\">something</a>.</li>\n<li>Also you have to transfer me $26 via Paypal (fees included). That is because I need to recover resources invested installing and migrating services run on this dedi (it has been running as a production server). If you don’t like the idea, you can wait some days and get it for free if nobody wants it.</li>\n</ul>\n<p>I have asked the requirements almost a year ago and I won’t bother support again with that question, if something has changed you will have to understand.</p>\n<p>The server will be transferred as soon as possible tomorrow. The server has not been wiped yet in case you want me to run a benchmark.</p>"}