{"id": 2594, "date": "2019-07-23T23:03:24.336Z", "user": "spinservers", "post": "<p><strong>Instantly deployed dedicated servers in Dallas, fully owned hardware and network. We’re Available To Help:</strong></p>\n<p><strong>Live Chat @ <a href=\"https://www.spinservers.com/\" rel=\"nofollow noopener\">SpinServers.com</a> – Call us @ (833) SPIN SRV – Email <a href=\"mailto:sales@spinservers.com\">sales@spinservers.com</a></strong></p>\n<p>Spin Servers provides dedicated servers and colocation services out of our Dallas datacenter facility. Our motto is to let you “<strong>spin up servers</strong>” fast, seamlessly, and affordably. Here are some of our core features that make us one-of-a-kind:</p>\n<p><strong>Vertically Integrated:</strong> we are one of the first and only hosting providers to be an integrated hardware reseller. We started as hardware enthusiasts that scavenged for deals on undervalued server equipment coming off-lease. We have come a long way since the ‘90’s; we’re now one of the largest resellers of pre-owned servers on the planet.</p>\n<ul>\n<li>We own 100% of the servers that are used for hosting. We have full control over quality and specifications.</li>\n<li>Servers are an <strong>ASSET</strong> to our business, not an EXPENSE. We pass on tremendous cost savings to you.</li>\n</ul>\n<p><strong>Instantly Deploy the following dedicated server…</strong></p>\n<p>Dual Intel Xeon E5-2630L v2, 12x 2.4GHz  <em>(24x 2.4 GHz with HT)</em><br>\n64GB DDR3 ECC Registered RAM<br>\n2x 800GB Enterprise SSD’s<br>\nLSI 9265-8i RAID w/ Cache &amp; BBU<br>\n10TB Monthly Transfer @ 1Gbps<br>\nAuto-provisions within 30 minutes<br>\n6x Bay 2.5 Inch hot-swap chassis  <strong>(scale on demand)</strong><br>\nJust $89/month with promo code “<strong>DUALE5FOR89</strong>”<br>\n<strong>DEPLOY NOW:</strong>  <a href=\"https://www.spinservers.com/cart.php?a=add&amp;pid=16&amp;promocode=DUALE5FOR89\" rel=\"nofollow noopener\">https://www.spinservers.com/cart.php…de=DUALE5FOR89</a></p>\n<p>See our dedicated server inventory here: <a href=\"https://www.spinservers.com/dedicated_servers.php\" class=\"inline-onebox\" rel=\"nofollow noopener\">Dedicated Servers - Spin Servers</a></p>\n<p>Don’t see the specs you want? Call, email, or chat us! Chances are we have what you’re looking for in stock.</p>\n<p><strong>Here’s why we have the advantage:</strong></p>\n<p>To understand our mission at Spin Servers and get a feel for who we are, you need to know our sister company, <a href=\"https://www.metint.com/\" rel=\"nofollow noopener\">MET International</a>.</p>\n<p>Our hosting operations are completely vertically-integrated and have synergies in our operations with MET International - a hardware supplier since 1994 with its own 40,000 sq. ft warehouse in Texas.  <strong>The results:</strong>  our dedicated servers are 50% + cheaper compared to other hosting providers, and all of our hardware undergoes vigorous testing and quality assurance. We provide an exceptionally high level of service, and we use top-tier datacenters.</p>\n<p><strong>Curious to learn more about how Spin Servers is bringing efficiency to the dedicated server hosting market?</strong> <a href=\"https://medium.com/spin-servers/spin-servers-bringing-efficiency-to-the-dedicated-server-hosting-market-30bcb60a3ed1\" rel=\"nofollow noopener\">Read our recent feature on Medium.com here!</a></p>\n<p><strong>Here’s how your business can win with us:</strong></p>\n<p>We operate our own ASN (AS396073), own our IP space, and use redundant network cabling for our servers. From day one, we’re not taking any shortcuts. We have a mission, and our entire team stands firmly behind it. We want to transform how the cloud computing world sees bare metal and hybrid servers, so that large-scale server deployments can become affordable for companies of any size.</p>\n<p><strong>Want to know more? Connect with us here:</strong></p>\n<p><strong>Live Chat</strong>  <a href=\"https://www.spinservers.com/\" rel=\"nofollow noopener\">www.SpinServers.com</a><br>\n<strong>Email</strong>  <a href=\"mailto:sales@spinservers.com\">sales@spinservers.com</a><br>\n<strong>Call Us</strong>  (833) SPIN SRV  <em>(774 6778)</em><br>\n<strong>Follow us on Twitter</strong>  <a href=\"https://twitter.com/spinservers\" rel=\"nofollow noopener\">@spinservers</a><br>\n<strong>Like us on Facebook</strong>  <a href=\"https://www.facebook.com/spinservers\" rel=\"nofollow noopener\">@spinservers</a></p>"}