{"id": 3807, "date": "2019-12-19T20:43:59.074Z", "user": "thedp", "post": "<p>Hey hey hey!</p>\n<p>Auctioning this short domain name.</p>\n<p>Domain: <strong>bawx</strong> (dot) <strong>org</strong><br>\nExpiry: <strong>30th September 2020</strong><br>\nBIN: <strong>$20</strong></p>\n<p><strong>Rules:</strong></p>\n<ol>\n<li>The starting price for the domain name is $5, with a bid increment of $1 (minimum).</li>\n<li>To participate in this auction, you’ll need to be a registered user here on HostBalls with at least 10 non-spammy posts.</li>\n<li>During the auction period, should someone claim the BIN for the domain, it will outbid any existing bids that has been placed thus ending the auction for the domain name instantly.</li>\n<li>No sniping. This will be enforced by extending the auction end time to an additional 5 minutes should there be any bids received within the last 5 minutes of the actual auction end time. If another bid is received within the 5 minutes of extended time, the auction will be extended further for another 5 minutes from the time the last bid was placed. The process will continue until no further bids are received for a 5 minute period and the highest and final bidder will win the auction.</li>\n</ol>\n<p><strong>Payment Method:</strong></p>\n<ul>\n<li>PayPal (Payment to be made within 24 hours from end of auction. Winner covers PayPal fees, if any.)</li>\n</ul>\n<p><strong>Domain Transfer Options:</strong></p>\n<ol>\n<li>Pushed within Dynadot via Dynadot Forum Name.</li>\n<li>EPP/AUTH code will be provided to the winner should the winner chooses to have the domain name transferred out of Dynadot, to a different registrar. Winner takes the cost for the transfer.</li>\n</ol>\n<p><strong>Auction Ends:</strong><br>\n<a href=\"https://www.timeanddate.com/countdown/generic?p0=239&amp;iso=20191224T21&amp;year=2019&amp;month=12&amp;day=24&amp;hour=21&amp;min=0&amp;sec=0&amp;msg=HB%20Domain%20Auction&amp;csz=1\" rel=\"nofollow noopener\">Tuesday, 24 December 2019, 21:00:00 (Stockholm)</a></p>\n<p>Happy Holidays! <img src=\"https://hostedtalk.net/images/emoji/google/slight_smile.png?v=9\" title=\":slight_smile:\" class=\"emoji\" alt=\":slight_smile:\"></p>"}