{"id": 4304, "date": "2020-02-22T17:03:22.445Z", "user": "nem", "post": "<p><a href=\"https://paixhans.apiscp.com:2083/apps/login\" rel=\"nofollow noopener\">Demo</a></p>\n<p>Howdy all,</p>\n<p>A variety of new license classes have been added to <a href=\"https://apiscp.com/\" rel=\"nofollow noopener\">ApisCP</a> (a/k/a APNSCP) including low-cost and free options:</p>\n<ul>\n<li>\n<strong>Startup</strong> : 20 domains, $50/year</li>\n<li>\n<strong>Mini</strong> : 10 domains, $30/year. Works best when paired with a <a href=\"https://docs.apiscp.com/INSTALL/#low-memory-mode\" rel=\"nofollow noopener\">1 GB</a> machine</li>\n<li>\n<strong>DNS-only</strong> : FREE, may not host any domains</li>\n<li>\n<strong>Dev</strong> : FREE, may only host “.test” TLDs otherwise identical to a Pro license (unlimited domains, automatic 30 day renewal)</li>\n</ul>\n<p>All licenses may be purchased or generated through the licensing portal, <a href=\"https://my.apiscp.com/\" rel=\"nofollow noopener\">my.apiscp.com</a>. Volume discounts are available at 10, 50, and 100+ licenses.</p>\n<p>DNS-only is an excellent solution to leverage platform validation in ApisCP when running certain ancillary software such as PowerDNS for a DNS cluster or Bacula for <a href=\"https://docs.apiscp.com/admin/Backups\" rel=\"nofollow noopener\">backups</a>. DNS-only makes piggybacking off a cPanel DNS cluster a breeze for <a href=\"https://docs.apiscp.com/admin/Migrations%20-%20cPanel/\" rel=\"nofollow noopener\">migrations</a>. Dev licenses bridge the concern of being able to test and build for ApisCP without incurring additional costs. Startup and Mini are here by popular demand!</p>\n<p>In addition to new licensing classes, a new documentation portal is available via <a href=\"https://docs.apiscp.com/\" rel=\"nofollow noopener\">docs.apiscp.com</a>. Documentation is searchable and best of all, beautiful to look at.</p>\n<p>Be sure to check out  <strong>Web</strong>  &gt;  <strong>Web Apps</strong>  within the panel. A new feature called “<strong>Snapshots</strong>” is available, powered by git. This feature is intended as a convenient solution for a user to backup a site’s content and database before making significant changes. Snapshots may be rolled back, at any time, restoring both the database and folder content. In the near future snapshots will provide the backbone for one-click staging, which makes transitioning a staging WordPress site to production a cinch.</p>\n<p>Enjoy!</p>"}