{"id": 4385, "date": "2020-03-05T15:42:19.711Z", "user": "Miguel", "post": "<p>Howdy,</p>\n<p>We’d like to tell you about our NOC / Support Ticket whitelabel plans.</p>\n<ul>\n<li>L1, L2 &amp; L3 Support fully covered, including solving any server issues you may need in order to satisfy your clients and sort that tough ticket, as well as direct contact with the Datacenter if needed so you can rest while being ensured that we’ll handle everything for you;</li>\n<li>Over 15 years of experience in the industry - I’ve also been beta tester for many nice stuff you utilize, e.g: cPanel (beta-tester for the new UI design in WHM), DirectAdmin (superb features we suggested!), SolusVM (way too many thousands of VM’s managed there) and plenty other stuff;</li>\n<li>We support cPanel, Plesk, DirectAdmin, SolusVM, Virtualizor, Proxmox &amp; OnApp;</li>\n<li>Cloud Management is also available for AWS, Google Cloud &amp; Microsoft Azure;</li>\n</ul>\n<p>Right now, it’s just me providing support for the 10AM-6PM shift (GMT +0), our team will slowly expand, here’s what we have planned for 2020:</p>\n<ul>\n<li>We’ve rented two offices, a total of 320m2, open space environment that will serve our NOC clients (and a damn nice NOC space you’ll love!) as well as Coworking space, because we damn love supporting local businesses;</li>\n<li>All employees will be local. No exception. Controlled environment, with tight access to what’s needed to do the job and period;</li>\n<li>24/7 Support by the end of the year if all goes well;</li>\n<li>All employees will be trained by me;</li>\n<li>Billingual support: Portuguese &amp; English, though we’re also able to read Spanish &amp; Italian;</li>\n</ul>\n<p>Our plans start for 200€/mo and include 200 tickets, these are billed per shift, so that’ll be 10AM to 6PM (GMT +0), Mon-Fri. In the future, I hope to expand this to 24/7 as mentioned above.</p>\n<p>I have worked for plenty of companies, to name a few:</p>\n<ul>\n<li>VirMach, for over a year as a L3 Senior System Administrator;</li>\n<li>Tapatalk, for over 5 years as their Cloud Architect in AWS and Senior Administrator (joined there when we had 2 employees, left when the company was acquired by a giant VC);</li>\n<li>ServerMania, a few months there, excellent company to work for;</li>\n<li>tmzVPS;</li>\n<li>Grindr, for a few months as a Senior System Administrator/Cloud Architect, we managed over 70 people there;</li>\n<li>HostSolutions (present, as a Senior System Administrator);</li>\n<li>Superior-Host (present, for a few years already, as a Senior System Administrator);</li>\n<li>More. Maybe yours?</li>\n</ul>\n<p>We hate the back and forth on the tickets. Speedy and effective responses - <a href=\"https://myw.pt/whitelabelsupport\" title=\"Hire us\">Hire us</a>.</p>\n<p><a href=\"https://myw.pt/whitelabelsupport\" class=\"onebox\" target=\"_blank\">https://myw.pt/whitelabelsupport</a></p>"}