{"id": 4489, "date": "2020-03-24T02:49:05.993Z", "user": "Andrei", "post": "<h3>Promo Starts On 26 March 2020 at 14:00 UTC Time.</h3>\n<h4>No entries will be considered before the above posted time.</h4>\n<hr>\n<p>Hey there!<br>\nI honestly hope that this post finds you well and healthy during this crazy period we’re going through.<br>\nI thought I’d brighten the mood a little bit with this small giveaway here.</p>\n<p>The way I was doing promos before was spontaneously, and because of that, a lot of people wouldn’t get a chance to participate, so I’m announcing this one ahead of time.</p>\n<p>This promo will be shared between 3 different forums: LET, LES, and <s>HostBalls</s> HostedTalk, so you can participate in any of the threads posted on these forums, but the promo won’t stack if you participate on multiple forums.</p>\n<p>The promo is very simple and it won’t cost you anything. You’re going to get some free extra monitors added to your account, regardless of your package (free or paid).</p>\n<p><strong>Giving away:</strong></p>\n<ul>\n<li>+ 16 extra Blacklist Monitors</li>\n<li>+ 5 extra Uptime Monitors / Server Monitors</li>\n</ul>\n<p>These extra monitors get added to your account for free, no matter on which package you are currently on, and will remain with your account through package upgrades and downgrades forever.</p>\n<hr>\n<p>So, assuming you’re on our Free packages, you’d be getting:</p>\n<p><strong>Blacklist Monitoring:</strong></p>\n<ul>\n<li><strong><s>32</s> 48 Blacklist Monitors</strong></li>\n<li>125+ RBLs<br>\nSee all features on our Blacklist Monitoring Pricing Page:<br>\n<a href=\"https://hetrixtools.com/pricing/blacklist-monitor/\" rel=\"nofollow noopener\"><strong>https://hetrixtools.com/pricing/blacklist-monitor/</strong></a>\n</li>\n</ul>\n<p><strong>Uptime Monitoring:</strong></p>\n<ul>\n<li>\n<strong><s>10</s> 15 Uptime Monitors</strong>  (monitor the uptime status of your website,server,services,etc)</li>\n<li>\n<strong><s>10</s> 15 Server Monitors</strong>  (monitor your server resources and configure alerts for high usage)</li>\n<li>1 minute check frequency</li>\n<li>Select 4 out of 12 monitoring locations</li>\n<li>Domain expiration monitor, SSL expiration monitor, nameservers change detection, etc.<br>\nSee all features on our Uptime Monitoring Pricing Page:<br>\n<a href=\"https://hetrixtools.com/pricing/uptime-monitor/\" rel=\"nofollow noopener\"><strong>https://hetrixtools.com/pricing/uptime-monitor/</strong></a>\n</li>\n</ul>\n<p><strong>Included in all packages:</strong></p>\n<ul>\n<li>Private/Public Uptime Reports</li>\n<li>White Label Reports</li>\n<li>Bulk Reports (<a href=\"https://hetrixtools.com/status/\" rel=\"nofollow noopener\">Public Status Page</a>)</li>\n<li>\n<a href=\"https://docs.hetrixtools.com/free-accounts-inactivity/\" rel=\"nofollow noopener\">Account Activity</a> required for free accounts</li>\n<li>Notifications via Email, SMS, PushBullet, Pushover, Twitter, Slack, Discord, Mattermost, RocketChat, PagerDuty, Telegram, VictorOps, and Webhooks</li>\n<li>All features are included on the pricing pages linked above</li>\n</ul>\n<hr>\n<p><strong>How to obtain this offer:</strong></p>\n<ol>\n<li>Register for a free HetrixTools account (if you don’t already have one)</li>\n<li>Reply in this thread with your account’s Public Key, found here  <a href=\"https://hetrix.tools/public-key\" rel=\"nofollow noopener\">https://hetrix.tools/public-key</a>\n</li>\n<li>Your account will be manually upgraded within 24 hours</li>\n</ol>\n<p><strong>Promo Notes:</strong></p>\n<ul>\n<li>any type of account can participate (free and paid alike)</li>\n<li>this promo will stack with any previous giveaway</li>\n<li>valid only for the first  50 keys or until 31 March, whichever comes first</li>\n</ul>\n<p>Please allow up to 24 hours for your account to be upgraded, after posting your key.<br>\nThere is no need to open a support ticket about this promo upgrade.</p>\n<p>Thanks for taking the time to read this promo post and please stay safe.<br>\nCheers.</p>"}