{"id": 4548, "date": "2020-04-02T06:15:09.550Z", "user": "SERIESN", "post": "<p><a href=\"https://servedez.com\"><img src=\"https://hostedtalk.net/uploads/default/original/2X/a/a45b95407d87c0d60be0e848075f5fdc8849c755.png\" alt data-base62-sha1=\"nrYwibhf8wqh8745jRpK3kHYowB\" width=\"690\" height=\"148\"></a></p>\n<p>So, while being self quarantined, we know it is also the perfect time to start that not so important project that you have been procrastinating about, for who knows how long.</p>\n<p>Well, great news, you can get a no catch, no frills, free hosting and get started on that project today :).</p>\n<p>Most of you already know about us. Those who don’t, <a href=\"https://servedez.com/\">ServedEz </a> ,a Nexus Bytes LLC company; a no frills free web hosting provider.</p>\n<p>I/We have been successfully offering free hosting for ~2 years right now.</p>\n<p>We don’t ask for donation, nor a bait and switch scheme to get premium upgrades. This, in our opinion, is perfect for hosting personal blogs, CV, small startups, projects etc.</p>\n<p>Please don’t be a dick. Feel free to use it for personal projects. All the usual common sense based rules and regulation applies. I don’t sell your info nor spam you with “upgrades/promotions “). I respect your privacy and you as human. However, during the signup process, you still need to provide real info. Granted I won’t be asking for ID proof but if your name is Ben Dover from 69 BIG ROD st, yeah you won’t be getting activated.</p>\n<p>Yes, I know “Unmetered “ storage or data doesn’t exist. You do have to understand that most of the average Joe on the internet, making their first website, they don’t know how things work and we human love to have things in bigger quantities than we actually need. So the idea was to signup for the hosting and use it that’s it. Don’t worry about the nitty-gritty maths to figure out what you need or how much.</p>\n<p>As long as you adhere to the policy (website only content, no resource-hogging/being a dick, etc.) I will bite my tongue and stick to offering “Unmetered “ space for your personal project.</p>\n<p>If you plan to use this for the next Facebook/Backupzilla/Imgur, etc. , this is not for you! It is free for a reason and the reason is, a user domain account is limited to qty of 3 for each core features (FTP/subdomain/database/email etc) and support is strictly via the community forum.</p>\n<p>You have all the jazz of usual hosting (Softaculous auto-installer, DA control panel etc). Multiple PHP version/Node.JS/Python Supported.</p>\n<p>Spamming and other BS activities are strictly prohibited and service will be terminated at the first sign of abuse. Multiple product sign ups are welcome. There’s no catch. No bait and switch. I don’t ask for much. Just be a decent human and don’t abuse it :).</p>\n<p><strong>How to order? Super simple</strong> :<strong>Visit <a href=\"https://servedez.com\">ServedEZ.com</a></strong> <img src=\"https://hostedtalk.net/images/emoji/google/slight_smile.png?v=9\" title=\":slight_smile:\" class=\"emoji\" alt=\":slight_smile:\"></p>\n<ul>\n<li>Orders are manually activated</li>\n<li>You do not need to register for the forum account to activate your hosting. However,</li>\n<li>Support for free hosting is limited via our community forum.</li>\n<li>Location : Germany.</li>\n</ul>\n<p>Usage is monitored and any domain that gets 0 monthly hits or not actively updated (abandoned) after 35 days of no usage gets suspended, followed by a termination of the user don’t response.</p>\n<p>Enjoy. Thanks.</p>"}