{"id": 4809, "date": "2020-05-21T07:30:51.755Z", "user": "Mr_Tom", "post": "<p>Hi all</p>\n<p>To “celebrate” the return of HostBalls (even if it is just the theme) I’ve got a couple of offers. I know not everyone wants managed/semi-managed services, so by early June our unmanaged VPS range should be live when they’ll be some launch offers for the community.</p>\n<p><strong>Semi-managed dual storage VPS</strong></p>\n<ul>\n<li>KVM virtualisation, Germany location</li>\n<li>2 core (Ryzen)</li>\n<li>4GiB ECC ram</li>\n<li>25GiB NVMe OS drive</li>\n<li>\n<s>250</s> 500GiB HDD storage</li>\n<li>2 x IPv4, 2 x /64 IPv6</li>\n<li>£20/month</li>\n<li>\n<a href=\"https://console.vmspecialist.com/order/config/index/order/?group_id=2&amp;pricing_id=43\">Order</a> - Use coupon BALLS10</li>\n</ul>\n<p>Perfect for when you need reasonable resources and NVMe speeds, but also need some HDD space too. Specs can be customised if required.</p>\n<p><strong>What’s covered by “semi-managed”?</strong></p>\n<p>Most of our line up is fully managed which means there’s no virtualisor panel, etc, and orders are manually provisioned to suit client requirements.<br>\nSemi-managed means your VPS will be provisioned setup as requested, including any custom partitioning, but you’re then you’ll get full root access and be free to setup your own software as required going forward. Full support is then available to help keep your needs met, but you’re still in control of the day to day running of the server. Semi-managed services also don’t benefit from managed offsite backups.</p>\n<p><strong>Fully managed dedicated servers</strong></p>\n<p>We’ve also got some dedicated servers in stock and available, including</p>\n<ul>\n<li>Intel E-2276G (6 x 3.8Ghz - 4.9Ghz turbo + hyperthreading)</li>\n<li>16 GB ECC ram</li>\n<li>2 x 512GB NVMe drives</li>\n<li>1 x IPv4, /64 IPv6</li>\n<li>Full management - you tell us your setup and we’ll make it happen including migrations, backups, etc. This includes full phone support as required.</li>\n<li>Amsterdam, NL</li>\n<li>£145/month with discount</li>\n</ul>\n<p>Full range available <a href=\"https://console.vmspecialist.com/order/main/packages/order/?group_id=4\">here</a>, including Frankfurt and London ranges. Use coupon BALLS30 for £30/month off any server listed.</p>\n<p>These are very limited, and first come first serve. Any questions, including about what’s covered in terms of management/semi-management, or custom requests please ask here, or drop an email to <a href=\"mailto:sales@vmspecialist.com\">sales@vmspecialist.com</a>.</p>\n<p>Prices exclude VAT (where applicable). Full company information and terms etc are on <a href=\"https://www.vmspecialist.com/\">our website</a>.</p>\n<p>Thanks for looking! I’m open to feedback to get people’s thoughts for future offers.</p>"}