{"id": 4868, "date": "2020-06-03T12:27:52.114Z", "user": "hostEONS", "post": "<p>Here are some promos and discounts for our VPS services in LA And NY:</p>\n<p><strong>RECURR50</strong> – Gives recurring 50% Off on OVZ 1 – OVZ 7 VPS Packages on annual billing cycles</p>\n<p><strong>RECURR20</strong> – Gives recurring 20% off on VPS 1 to VPS 7 KVM VPS Packages in LA as well as NY</p>\n<p><strong>Free Windows 2019 License</strong> on VPS 3 – VPS 7 KVM VPS Packges on annual billing cycle (Just submit a support ticket after placing order to activate windows license). – No coupon code required and can be used along with other coupons.</p>\n<p><strong>DA</strong> – Free Direct Admin License for KVM VPS 2 and above packages and also OVZ 2 and above VPS Packages</p>\n<p><strong>Free Blesta License</strong> – Just submit a support ticket we will activate Blesta License for free. (No coupon required)</p>\n<p><strong>UPGRADE</strong> – Free Upgrade to Next VPS Package, applicable on KVM VPS 1 – VPS 6 and OVZ 1 – OVZ 6 VPS package</p>\n<p><strong>DOUBLEDISK</strong> – Double disk space for your VPS, applicable on KVM VPS 1 – VPS 6 and OVZ 1 – OVZ 6 VPS package</p>\n<p><strong>Free cPanel Web Hosting</strong> - We are now offering Free cPanel Web Hosting with all our VPS Packages, no coupon code required, just submit a support ticket after placing order and mention domain for web hosting in it (Please note our regular web hosting orders are setup automatically but this free add-on web hosting we set it up manually so it can take upto 24 hours for activation of web hosting). You will get option to add web hosting package in the order form.  (This is limited period special, we may disable it at anytime). It will continue to work as long as your VPS Hosting Package is active.</p>\n<p>Even existing clients can get free cPanel web hosting, just order it from client area under Services menu --&gt; Available Addons.</p>\n<p>Only 1 free web hosting package is allowed per VPS</p>\n<p>It comes with following features:</p>\n<p>Disk Space: 5GB<br>\nBandwidth: 50GB<br>\nEmail Accounts: 10<br>\nSubdomain: 5<br>\nMysql Database: 1<br>\ncPanel: YES<br>\nOne Click Script Installer: YES<br>\nWebSiteBuilder: YES<br>\nCloudLinux:YES</p>\n<p>Check our all our VPS Packages at <a href=\"https://hosteons.com/vps.php\" class=\"inline-onebox\" rel=\"nofollow noopener\">Cheap and best KVM SSD VPS and OpenVZ 7 VPS and VPS Resource Pool with Free DDOS Protection and Free IPv6 - hostEONS.com</a></p>"}