{"id": 5141, "date": "2020-07-08T23:53:04.314Z", "user": "racknerd", "post": "<p><strong>About <a href=\"http://www.racknerd.com/\" rel=\"nofollow noopener\">RackNerd</a></strong></p>\n<p><strong>RackNerd</strong>  introduces infrastructure stability, what everyone desires! RackNerd is led by industry experts providing IaaS (Infrastructure-as-a-Service), Private Cloud solutions, DRaaS (Disaster-Recovery-as-a-Service), load-balanced solutions, flexible Colocation, Virtual Private Servers and advanced DDoS Mitigation services – maintained by a team with decades of experience in managed services, datacenter operations, and Infrastructure-as-a-Service. With an intrinsic focus on client success, growth and vision to expand globally, RackNerd has grown steadily while continuing to provide high-quality hosting services at competitive rates.</p>\n<p>We only use the most reliable enterprise server-grade hardware – ensuring your infrastructure is stable. Each and every customer deployment is unique, this is why we encourage you to reach out to our sales team to discuss your requirements, goals and we’ll help design the best enviornment for your mission-critical applications. Of course, including the most competitive pricing!</p>\n<p>We are available several different ways to assist you:</p>\n<p><strong>EMAIL US</strong> : <a href=\"mailto:sales@racknerd.com\">sales@racknerd.com</a><br>\n<strong>CALL US:</strong>  1 (888) 881-NERD<br>\n<strong>CHAT WITH US:</strong>  <a href=\"http://racknerd.com/\" rel=\"nofollow noopener\">RACKNERD.COM</a></p>\n<p>We are not just experienced in what we do, but we are a steadily growing web-hosting company that will not only meet but exceed your expectations. This is why you should choose RackNerd as your web-hosting provider. Understanding what customers want and putting them first is why we are a success.</p>\n<p><strong>=====================================</strong><br>\n<strong>NEW &amp; NOW AVAILABLE: RackNerd Shared Hosting - AWESOME DEAL</strong><br>\n<strong>=====================================</strong></p>\n<p>20 GB SSD Disk Space<br>\n1TB Monthly Transfer<br>\nUnlimited Databases<br>\n2 Domains<br>\nFree SSL Certificates<br>\nCloudLinux Powered<br>\nSoftaculous Script Installer<br>\nLiteSpeed Web Server<br>\nFree Daily Backups Included<br>\ncPanel Control Panel<br>\n<strong>JUST $7/YEAR</strong><br>\n<strong>ORDER NOW:</strong>  <a href=\"https://my.racknerd.com/cart.php?a=add&amp;pid=100\" class=\"inline-onebox\" rel=\"nofollow noopener\">Shopping Cart - RackNerd LLC</a></p>\n<p><strong>Don’t see a configuration that completely suits your needs? We’re always here to answer questions, and or help anyway we can!</strong></p>\n<p><strong>EMAIL US:</strong>  <a href=\"mailto:sales@racknerd.com\">sales@racknerd.com</a><br>\n<strong>CALL US:</strong>  1 (888) 881-NERD<br>\n<strong>CHAT WITH US:</strong>  <a href=\"https://www.racknerd.com/\" rel=\"nofollow noopener\">RACKNERD.COM</a></p>"}