{"id": 5168, "date": "2020-07-14T15:29:53.960Z", "user": "Access2IT", "post": "<p>In recent months we have invested a lot in new IPv4 ranges, which means that we have enough stock again! We now have more than 180 ranges for rent. To celebrate, there are now no setup costs for the entire month of July, now. Use the discount code: IPv4JULY in your shopping cart.</p>\n<p>Order your Hostio IPv4/24 ranges today via <a href=\"http://bit.ly/hostioip\" rel=\"nofollow noopener\">https://hostio.solutions/ip-rental</a>/ before they are sold out again!</p>\n<p><strong>About Hostio Solutions</strong></p>\n<p>Hostio Solutions offers high performance and a stable VPS platform in The Netherlands. We offer Webhosting, Dedicated Servers, Virtual Servers, IPv4 &amp; IPv6 Lease/Rent, and Remote Hands. Since 2006, Hostio Solutions (a label of Access2.IT Group B.V) has always existed for one purpose: to provide good hosting and servers with personal service. We are privately owned with no shareholders, our customers come first! We always strive to provide hosting that meets and exceeds your high expectations.</p>\n<p><strong>Other information:</strong></p>\n<ul>\n<li>Set your own RIPE netname and description.</li>\n<li>Verified companies can also have their own “Responsible organization” and abuse handling.</li>\n<li>We will assign the prefix as an “ASSIGNED PA”.</li>\n<li>We do NOT provide IP addresses for spam, phishing, or any other illegal activities.</li>\n<li>Blacklisted IP’s must be resolved within 72 hours.</li>\n<li>All prices exclude VAT where applicable.</li>\n<li>Read more information about our blacklist policy via: <a href=\"https://my.hostio.solutions/knowledgebase/12/IP-policy-regarding-blacklisting.html\" class=\"inline-onebox\" rel=\"nofollow noopener\">IP policy regarding blacklisting - Knowledgebase - Hostio Solutions</a>\n</li>\n</ul>\n<p><strong>Company details:</strong></p>\n<ul>\n<li>Hostio Solutions</li>\n<li>Access2.IT Group B.V.</li>\n<li>Curaçaostraat 11, 1339KL</li>\n<li>Almere, The Netherlands</li>\n<li>Phone: +31.85.4016336</li>\n<li>CoC: 58365400</li>\n<li>VAT: NL853006404B01</li>\n</ul>"}