{"id": 5418, "date": "2020-08-22T09:54:35.292Z", "user": "Mr_Tom", "post": "<p><a href=\"https://www.vmspecialist.com\">VM Specialist</a> is a trading name of Styre Limited - registered in the UK.</p>\n<p>Styre Limited was formed from 10 years of hosting and management experience to improve the experience people have when dealing with managed services, as well as providing custom VM setups. Want 16gb RAM and 10gb space? No problem - let us know your requirements and we can help.<br>\nWe offer 24/7 support, including phone support in UK office hours (out of hours phone support for fully managed clients).</p>\n<p><strong>What does semi-managed mean?</strong></p>\n<p>We’ll handle the setup, including any custom configs you require. If you opt for DirectAdmin we’ll prepare and setup the system for you before handing it over. Want a NextCloud setup, we’ll get everything ready. You’ll get additional support going forward - eg, adding new software, network changes, config changes, etc - we’re here to make it easier for you.</p>\n<p><strong>What are the offers?</strong></p>\n<p>Get double disk space (on both the NVMe and HDD sizes) on our semi-mananged offers <a href=\"https://console.vmspecialist.com/order/main/packages/order/?group_id=2\">here</a>.</p>\n<p>1:</p>\n<ul>\n<li>2 core</li>\n<li>2GiB ECC RAM</li>\n<li>\n<s>15</s> 30GiB NVMe</li>\n<li>\n<s>150</s> 300GiB HDD</li>\n<li>5TiB transfer</li>\n<li>1 x IPv4, 1 x /64 IPv6</li>\n<li>£15/month - <a href=\"https://console.vmspecialist.com/order/config/index/order/?group_id=2&amp;pricing_id=45\">Order</a>\n</li>\n</ul>\n<p>2:</p>\n<ul>\n<li>4 core</li>\n<li>4GiB ECC RAM</li>\n<li>\n<s>25</s> 50GiB NVMe</li>\n<li>\n<s>250</s> 500GiB HDD</li>\n<li>5TiB transfer</li>\n<li>1 x IPv4, 1 x /64 IPv6</li>\n<li>£25/month - <a href=\"https://console.vmspecialist.com/order/config/index/order/?group_id=2&amp;pricing_id=47\">Order</a>\n</li>\n</ul>\n<p>YABS results for the NVMe disks is available <a href=\"https://git.styre.net/snippets/2\">here</a> and HDD speeds are <a href=\"https://git.styre.net/snippets/3\">here</a>.</p>\n<p>If you wish to take advance of free DirectAdmin please add this to the order form. Any other software requirements can be added there too.</p>\n<p>We can also swap the NVMe storage for more HDD storage - e.g. offer 2 - keep 25GiB NVMe storage but upgrade to 750GiB HDD. Just put the details in the order form and let us know. Or get in touch for any other custom configurations you need.</p>\n<p>All prices exclude VAT. Orders are manually approved, etc. PayPal/Stripe available for payment. These are provisioned on Hetzner’s FSN network. All feedback on offers welcome!</p>\n<p>Thanks for reading!</p>"}