{"id": 5480, "date": "2020-09-06T11:11:14.791Z", "user": "hostworld", "post": "<p>Hello!</p>\n<p>We’re <a href=\"http://hostworld.uk\" rel=\"nofollow noopener\">hostworld.uk</a>, a UK based web hosting provider with services in the US and UK. If you have any queries about our services please let us know.</p>\n<h2><strong>Introducing… the bespoke plan</strong></h2>\n<p>Submit your order, set what you want to pay, make the payment and if we think it’s reasonable you’re all set! If we think it’s totally unrealistic we’ll just refund you minus the transaction fees.</p>\n<p><strong>Why don’t we refund the transaction fees?</strong> Well it’s simple really, to stop people abusing this service and costing our business a fortune in payment fees. It also shows us your serious about making a purchase with us.<br>\n<strong>What are we likely to accept?</strong> Take a look at our offers and standard plans on our website, you can get a rough idea from those.<br>\n<strong>Why have we introduced this plan?</strong> It saves everyone time, be honest about what resources you actually need with your budget and we’re sure we’ll be able to get you up and running.</p>\n<p><strong>Design your own package here:</strong> <a href=\"https://portal.hostworld.uk/cart.php?a=add&amp;pid=80\" rel=\"nofollow noopener\"><strong>Order here</strong></a><br>\nAt the moment we’re accepting requests on quarterly terms as a minimum. We may roll out monthly in the future.</p>\n<h2><strong>So, what VPS plans do we offer?</strong></h2>\n<p><strong>VPS 0.5</strong></p>\n<p>512MB RAM<br>\n1x vCPU<br>\n15GB NVMe Storage<br>\nFREE 45GB Backup Storage<br>\nUnmetered Bandwidth<br>\nFast 1 Gbps Uplink<br>\nIPv4 &amp; IPv6</p>\n<p>Only £2.99 ($3.74) per month</p>\n<p><strong><a href=\"https://portal.hostworld.uk/cart.php?a=add&amp;pid=61\" rel=\"nofollow noopener\">Order UK</a></strong> - <strong><a href=\"https://portal.hostworld.uk/cart.php?a=add&amp;pid=61&amp;configoption%5B145%5D=1186\" rel=\"nofollow noopener\">Order US</a></strong></p>\n<p><strong>VPS 1</strong></p>\n<p>1GB RAM<br>\n2x vCPU<br>\n30GB NVMe Storage<br>\nFREE 90GB Backup Storage<br>\nUnmetered Bandwidth<br>\nFast 1 Gbps Uplink<br>\nIPv4 &amp; IPv6</p>\n<p>Only £3.99 ($4.98) per month</p>\n<p><strong><a href=\"https://portal.hostworld.uk/cart.php?a=add&amp;pid=9\" rel=\"nofollow noopener\">Order UK </a></strong> - <strong><a href=\"https://portal.hostworld.uk/cart.php?a=add&amp;pid=9&amp;configoption%5B145%5D=1186\" rel=\"nofollow noopener\">Order US</a></strong></p>\n<p>You can view many more NVMe SSD VPS packages here: <a href=\"https://hostworld.uk/ssd-vps\" rel=\"nofollow noopener\">Powerful &amp; affordable super-fast NVMe SSD VPS - hostworld </a></p>\n<h2><strong>VPS Reseller</strong></h2>\n<p>Did you know that we also provide VPS reseller packages?<br>\nBecome your own VPS host, or simply have access to flexible VPS resources that you can tailor to your exact requirements.</p>\n<p>You can view those packages here: <a href=\"https://hostworld.uk/vps-reseller\" class=\"inline-onebox\" rel=\"nofollow noopener\">NVMe SSD VPS Reseller Packages - hostworld</a></p>\n<h2><strong>About hostworld:</strong></h2>\n<ul>\n<li>24/7 expert support and lightning fast ticket responses - we respond to all support tickets within 20 minutes on average!</li>\n<li>We own and operate our own VPS infrastructure and have heavily invested in enterprise-grade hardware and our super-fast network to ensure we have one of the best VPS platforms available. Because we are in full control of our platform start-to-finish, we can provide a fully featured and high level of service at a low cost point.</li>\n<li>Tailor your VPS to suit your needs. Add some extra storage, maybe a little more RAM too, and go all out and increase the number of CPU cores. It’s up to you.</li>\n<li>We only use state of the art NVMe drives in all of our servers - no moving parts means a faster service for you!</li>\n<li>UK &amp; US servers - we currently provide our services from UK &amp; US data centres which provide super-fast connectivity, even if you don’t live there!</li>\n<li>We really do care about your hosting experience - talk to us, send us an email, pick up the phone, we’re real people striving to provide every single one of our customers with a consistent and reliable hosting experience, no matter how much is spent on hosting with us.</li>\n<li>We’re reliable! We provide a 99.9% uptime guarantee because making sure your website is available is essential. You can see our uptime here <a href=\"https://status.hostworld.uk/\" rel=\"nofollow noopener\">https://status.hostworld.uk/</a>.</li>\n</ul>\n<h2><strong>Test Our Network</strong></h2>\n<p>Looking Glass (UK): <a href=\"http://lg.hostworld.uk\" rel=\"nofollow noopener\">http://lg.hostworld.uk</a><br>\nLooking Glass (US): <a href=\"http://lgus.hostworld.uk\" rel=\"nofollow noopener\">http://lgus.hostworld.uk</a></p>\n<h2><strong>What else is included?</strong></h2>\n<p>We don’t just provide basic VPS plans here at hostworld, we provide you with robust, feature rich virtual private servers as well as:</p>\n<ul>\n<li>Instant Activation - place an order with us and have the server up and running within minutes.</li>\n<li>Choice of Operating Systems - select from CentOS, Ubuntu, Debian, Fedora and Webuzo.</li>\n<li>Custom ISO - upload your own ISO.</li>\n<li>Pre-install a Control Panel - have one of the leading control panels installed automatically upon ordering your VPS. Select from cPanel, Plesk, Webmin, Interworx, ISPConfig or CentOS Web Panel (subject to OS compatibility).</li>\n<li>Automatic Backups - we provide a weekly backup of your VPS server as standard (unless you opt out), and retain 3 of these backups at all times. You can even upgrade this to daily backups.</li>\n<li>24/7 Expert Support - we’re here when you need us every day of the year, every step of the way. We’ll always try and help you out of a sticky situation.</li>\n<li>Free DDoS Protection (UK) - we don’t make you pay for the luxury of DDoS protection. The network we utilise is protected by the world’s leading manufacturer of DDoS and cyber threat services as standard.</li>\n<li>Powered by KVM - all our servers utilise the latest available KVM virtualisation technology.</li>\n<li>Industry leading Control Panel - we provide a self-service control panel within our portal, putting you in full control of your VPS.</li>\n<li>Tailor your VPS - customise your VPS package to suit your needs. Add some extra storage, maybe a little more RAM too and go all out and increase the number of CPU cores. It’s totally up to you.</li>\n<li>Upgrade &amp; Downgrade at any time - we like to keep things simple; so you can regrade your VPS package at any time.</li>\n<li>No Contracts - we don’t believe in contracting you into a service and are confident that our VPS hosting service speaks for itself. We provide a no contracts service with no setup fees, giving you peace of mind and flexibility.</li>\n</ul>\n<h2><strong>What do our customers think?</strong></h2>\n<blockquote>\n<p><strong>Great value</strong><br>\nGreat value, great service, great performance. The best of every world with this company. Highly recommended for all types of hosting needs. Andrew specifically has been great to work with.</p>\n</blockquote>\n<blockquote>\n<p><strong>Excellent Team</strong><br>\nSwitched to HostWorld a few months ago and literally could not be any more happier. I’ve been in this game for 20 years and the service these guys provide is the best I’ve experienced. They have gone above and beyond from the start. Highly recommend!</p>\n</blockquote>\n<blockquote>\n<p><strong>Excellent service so far, a provider you will want to stick with.</strong><br>\nI’ve been with hostworld for just over 3 months as I was looking for a reliable UK unmanaged KVM VPS provider that offered unmetered bandwidth and decent hardware for a fair price. So far hostworld has been consistently good. I have not run into any problems with the service. As far as their support goes, their support so far has been excellent. The two times I have opened a ticket (only for RDNS changes) they have been answered and resolved quickly.</p>\n<p>I would definitely recommend hostworld to individuals looking for stable and affordable services that include a friendly support team that truly cares.</p>\n</blockquote>\n<blockquote>\n<p><strong>Excellent Service. Exemplary Staff.</strong><br>\nI’ve worked in the IT Industry for many years. Far back. Back to the days where we painted in caves and when men like me were referred to simply as the ‘Computer Man’. I’ve never; not ever written a product or company review so this is a first for me. However, I felt moved to write a review about <a href=\"http://HostWorld.uk\" rel=\"nofollow noopener\">HostWorld.uk</a>. I’ve had stuff hosted with various companies over many years. I’ve experienced a few really good hosting companies, some average and as has mostly been the case, some terribly mediocre. My experience with <a href=\"http://HostWorld.uk\" rel=\"nofollow noopener\">HostWorld.uk</a> and the service as well as the quality of tech support I’ve received from them is, without question, one of the best if not the very best I ever had from any hosting provider. My migration to you will be my last. Thank you so much guys. Great job. Keep up the good work.</p>\n</blockquote>\n<blockquote>\n<p><strong>I am very happy</strong><br>\nI am very happy with the service I have received from Hostworld so far.<br>\nSupport has been great, they seem to go out of their way to fix issues and in my case they installed an OS they do not use. The server itself preforms very well, no slow downs so far I have no complaints.<br>\nI would recommend them to anyone.</p>\n</blockquote>\n<blockquote>\n<p><strong>Great support, reliable service</strong><br>\nGreat support and very attentive. I’m their customer for about a month now and I didn’t face any issue so far. Their VPS are fast, stable and affordable. I would definitely recommend hostworld.</p>\n</blockquote>\n<blockquote>\n<p><strong>Second to none</strong><br>\nSuper friendly, knowledgeable - anything, anytime, nothing is too much for them and they will happily do the best they can to cater to your needs. I found them whilst looking to expand the locations I offer on an existing business where uptime, speed and reliability is a must and has to be second to none. I am happy to say that hostworld ticks all the boxes.</p>\n<p>I joined hostworld 3 months ago and I can see myself becoming a life long customer.</p>\n</blockquote>\n<blockquote>\n<p><strong>Amazing and friendly support</strong><br>\nAmazing and friendly support! Honestly after being on this business since 2012 I have never encountered such an honest, helpful and understanding team of people, coupled with a fantastic service with even greater price!</p>\n<p>Thank you very much for everything.</p>\n</blockquote>\n<h2><strong>Payment Methods</strong></h2>\n<p>We currently accept payment through the following:</p>\n<ul>\n<li>PayPal</li>\n<li>Credit/Debit Card</li>\n<li>Bank Transfer</li>\n<li>Apple Pay</li>\n<li>Bitcoin</li>\n<li>Alipay</li>\n<li>Unionpay</li>\n</ul>\n<p>If you require something different to what we offer above please don’t hesitate to contact our sales department at <strong><a href=\"mailto:sales@hostworld.uk\">sales@hostworld.uk</a></strong> or send us a message on here <img src=\"https://hostedtalk.net/images/emoji/google/slight_smile.png?v=9\" title=\":slight_smile:\" class=\"emoji\" alt=\":slight_smile:\"></p>\n<p>We look forward to hearing from you!</p>\n<p>Kind Regards,</p>\n<p><a href=\"http://hostworld.uk\" rel=\"nofollow noopener\">hostworld.uk</a> Team</p>"}