{"id": 5515, "date": "2020-09-10T09:35:06.481Z", "user": "alwyzon", "post": "<p>Hello HostedTalk community!</p>\n<p>To introduce you to our new brand Alwyzon, we have created a limited introductory offer for you:</p>\n<p><strong>Our Offer: 19,90 € per year for…</strong><br>\n✓ <strong>1 GB</strong> DDR4 ECC Memory<br>\n✓ <strong>1 vCore</strong> Intel® Xeon® Processor<br>\n✓ <strong>10 GB</strong> SSD Storage (RAID 10)<br>\n✓ <strong>1.000 Mb/s</strong> Up- and Downlink<br>\n✓ Powered by KVM &amp; Proxmox<br>\n✓ 1x IPv4 + /64 IPv6 included<br>\n✓ 5 TB Monthly Unthrottled Bandwidth</p>\n<p><a href=\"https://my.alwyzon.com/index.php?cmd=module&amp;module=31&amp;cid=6\" title=\"[[ ORDER NOW ]]\" rel=\"nofollow noopener\">[[ ORDER NOW ]]</a><br>\nCoupon: <strong>HOSTED2020</strong></p>\n<p>The offer is a recurring discount and based on our regular KVM Server XS package; offer is limited to the first 25 orders and valid until 2020-09-17. To redeem it, use the above order link or manually enter the above coupon code. Prices are exclusive of VAT. If you are located inside the EU, your local VAT rate will be added during the checkout.</p>\n<p>&nbsp;</p>\n<h2>Key Features</h2>\n<p>✓ Instant provisioning of new servers<br>\n✓ Powered by Proxmox and KVM<br>\n✓ Easy to use customer panel<br>\n✓ Reboot, reinstall and VNC console available in client area<br>\n✓ Reverse DNS configurable over client area too<br>\n✓ CentOS. Debian, Fedora, openSUSE or Ubuntu preinstalled<br>\n✓ Or: upload and install your own ISOs in the client area<br>\n✓ Enterprise-grade hardware from major brands<br>\n✓ Reliable Dutch datacenter in Apeldoorn (Tier 3)<br>\n✓ 10 Gb/s network links on each node server<br>\n✓ Fully redundant, UPS-backed power supply (2N+1)<br>\n✓ Generators with initial autonomy of 48 hours</p>\n<p>&nbsp;</p>\n<h2>About Alwyzon</h2>\n<p><a href=\"https://www.alwyzon.com/\" rel=\"nofollow noopener\">Alwyzon</a>, is a trading name of Hohl IT e.U., a small software development company registered in Graz, Austria. All hardware is fully owned by us and solely consist of reliable, enterprise-grade hardware (Dell PowerEdge R630s) colocated in a Dutch datacenter in Apeldoorn, about 70 km to the German border and thus located rather centrally in Western Europe. As a RIPE NCC member, we also own all IPs assigned to any client.</p>\n<p>&nbsp;</p>\n<h2>Our Network</h2>\n<p>• Looking Glass: <a href=\"https://lg.alwyzon.com\" rel=\"nofollow noopener\">https://lg.alwyzon.com</a><br>\n• Test IPv4: 193.219.97.4<br>\n• Test IPv6: 2a0d:f300::4<br>\n• Test Download File: <a href=\"https://lg.alwyzon.com/25MB.test\" rel=\"nofollow noopener\">25 MB</a> <a href=\"https://lg.alwyzon.com/50MB.test\" rel=\"nofollow noopener\">50 MB</a> <a href=\"https://lg.alwyzon.com/100MB.test\" rel=\"nofollow noopener\">100 MB</a></p>\n<p>&nbsp;</p>\n<h2>Frequently Asked Questions</h2>\n<p><strong>What payment methods do you support?</strong><br>\nWe do support Credit Cards (processed by Stripe*), BanContact, EPS, giropay, iDeal and SOFORT. If none of these payment methods is applicable to you, open a ticket to pay via SEPA wire transfer instead.</p>\n<p>*We know your credit card information is very sensitive and thus we will never store your credit card details on our servers. Instead, those are handled by the payment processor Stripe and we only store a token and the last four digits for later reference.</p>\n<p><strong>How long until my virtual server is ready to use?</strong><br>\nProvisioning of new virtual servers is fully automated and takes about 5 minutes. As soon as we receive your payment, the setup process is automatically launched for the operating system you selected in the checkout form. (Provided that our system didn’t flag you as potential fraud.)</p>\n<p><strong>What kinds of usages are accepted?</strong><br>\nWe accept almost every form of usage that does not make excessive use of our hardware and network, and is not consider illegal in Austria or the Netherlands. In addition, public VPNs, Tor nodes and anything Torrent related is forbidden. For a more detailed list, see the “Accepted Usage Policy” section of our <a href=\"https://www.alwyzon.com/terms\" rel=\"nofollow noopener\">Terms of Service</a>.</p>\n<p><strong>Which operating systems are supported?</strong><br>\nWe can provide you with the latest CentOS, Debian, Fedora, openSuse and Ubuntu releases pre-installed on your virtual server; or you can upload any ISO and install whatever operating system you would like to use.</p>\n<p><strong>What level of support is provided?</strong><br>\nThese are unmanaged virtual server offers, so you are expected to install and configure the server yourself. We give you root access to the virtual server, but you will have to setup any software according to your requirements.</p>\n<p><strong>Do you offer monthly billing too?</strong><br>\nUnfortunately, no; we do not offer monthly billing as accounting and bank fees would eat up to much of our profit for such small transactions. Thus, the minimum billing cycle is quarterly for our regular offers and yearly for the above discount.</p>\n<p><strong>Are those discounts recurring?</strong><br>\nYes, they are! And since you were reading all that text, let me give you one more treat: the first user that post a small review below this post will get a 5€ voucher for his next purchase or service renewal.</p>\n<p>&nbsp;</p>\n<hr>\nAlwyzon is a trading name of Hohl IT e.U,  a company registered at the court of Graz (Austria), company number 538746z. This post may be considered marketing communication. A full legal disclosure in accordance with § 5 (1) Austrian E-Commerce Act (ECG) can be found on https://www.alwyzon.com/impressum."}