{"id": 5689, "date": "2020-11-09T06:49:12.572Z", "user": "Jarland", "post": "<p><a href=\"https://config.mxroute.com/mxbf2020.png\"><img src=\"https://hostedtalk.net/uploads/default/original/2X/f/fa6770a48e72fed1d5f61da78e5c5c483f72e728.png\" alt=\"Logo\" data-base62-sha1=\"zJaZbjj9khaRuj9RvKNyU8NGexO\" width=\"690\" height=\"255\"></a></p>\n<h1>MXroute Black Friday Deals!</h1>\n<p>It’s been a crazy year for MXroute, and this is always one of the more exciting parts of it. Even in 2020, if you can believe that anything is exciting in 2020. It’s still 2020 though so maybe put on a mask and I’ll try to keep the fonts large enough to read from 6 feet away.</p>\n<p>MXroute is an email provider where customers bring their own domains. Our customers range from well funded startups to that guy in the corner over there trying to hack all of your cell phones while you read this, just to see if he can do it. We provide all of the universal standards you should expect: IMAP, SMTP, POP3. We have a DirectAdmin-based control panel and while it isn’t everything you’ve dreamed of for managing email it does a pretty damn good job, and it’s not really our selling point. We offer the finest webmail you’ve ever laid eyes upon called Crossbox, both for your browser and with our native branded apps for both iOS and Android. We’re still rocking Roundcube and Rainloop because you’ve gotta have those time tested standbys (and personally I use Roundcube more than anything, just habit). We use rspamd for our inbound filtering system and are currently working on converting our rule sets for inbound to improve our spam detection. Yeah we know it’s not Google’s anti-spam system, but we’re trying to challenge the market not mirror it <img src=\"https://hostedtalk.net/images/emoji/google/wink.png?v=9\" title=\":wink:\" class=\"emoji\" alt=\":wink:\"></p>\n<p>But what really sets us apart? We believe we have the secret sauce for outbound delivery. The reason the answer is no to your question of “Do you offer dedicated IP addresses” is because what we offer could take 1500 dumps on your dedicated IP address by the time you finished writing your email. If we can’t get your email to your recipient, either your recipient doesn’t want it or you typed the wrong email address. If an email is rejected for IP reputation we shuffle the deck and send it from another IP. We do this repeatedly, and from different ranges, until it’s either delivered or we’re absolutely certain they’re not going to accept it. We do this all while rejecting FAR less of your outbound emails than the outbound service we used a few years ago did (back before we completed our in-house relays). We keep you safe from bad neighbors, and you can see for yourself what they think of us: <a href=\"https://www.trustpilot.com/users/5d9dc082d5e7683c5227754c\" class=\"inline-onebox\">Hans Li – 1 business reviews on Trustpilot</a></p>\n<p>A few things we’d like to celebrate before we jump into the offers:</p>\n<ul>\n<li>MXroute is now the proud owner of it’s very own IPs. ARIN has decided that we’re a real business. Have a look: <a href=\"https://bgp.he.net/AS398810\">https://bgp.he.net/AS398810</a>\n</li>\n<li>The reseller plans we introduced last year have been very hard to keep in stock.</li>\n<li>YOU are awesome and MXroute couldn’t have grown into this amazing company without you. It’s you guys driving this whole thing, and I’m out here every day fighting the giant corporations in public and private to repay you by ensuring that no one out there is rejecting your email when it isn’t deserved.</li>\n</ul>\n<p>So let’s get down to the package we’re making available today from our <a href=\"https://mxroute.blackfriday\">https://mxroute.blackfriday</a> website:</p>\n<p>BF2020:</p>\n<ul>\n<li>25GB Storage</li>\n<li>Unlimited Domains</li>\n<li>Unlimited Emails</li>\n<li>300 outbound per hour (per email)</li>\n<li>$15/year<br>\n<a href=\"https://portal.mxroute.com/cart.php?a=add&amp;pid=107\">Order Here</a>\n</li>\n</ul>\n<p>A brief FAQ:</p>\n<p>Q: Can I switch my plan to this promo?<br>\nA: You can purchase a new promo and migrate your own data to it freely, but no action will be taken on our part to assist with the billing or migration when moving to a promo. It’s nothing personal, it’s just how we sustain promotions by relying on our automated systems, and promos are often entirely based on newly provisioned servers.</p>\n<p>Q: Can I really add UNLIMITED domains?<br>\nA: Ok real talk. If you add so many domains that it breaks a server, we have no choice but to consider that “Server Abuse” by our Terms of Service. I don’t know what that number is, but if you have to randomly generate the domain names and push them over the API to add them all by end of year then yeah that’s probably the number. Since 2013 we’ve had 2 customers find out what that number was for them, and I don’t think you’re statistically likely to find yourself in their company. We’re not going to be dicks about it btw, we fully refunded those 2 customers.</p>\n<p>Q: What kind of services don’t you allow?<br>\nA: Good question. Leak forums (forum where people shared leaked password databases), adult forums (you know, porn), anyone who has to send hundreds of emails at a time to <a href=\"http://qq.com\">qq.com</a> (I don’t even know), deceptive use of third party services through us (ex. randomly generating email accounts to sign up for 5,000 Steam accounts), forward-only service for a massive number of domains (11.8k domains under one account was the number that broke it and added that to policy).</p>\n<p>Q: What is your refund policy?<br>\nA: Pitchforks. Please don’t sign up if you think you might want a refund. I’d rather lose the potential sale. I really don’t care if it’s unfriendly, it’s the only way to stop people from forcing me to offer “Free trials” and eating the overhead that they generate. That overhead bleeds into our actual client’s services if I let it, and I will violently refuse to raise prices on my customers.</p>\n<p>Q: Where are your servers located?<br>\nA: Your email will be stored in Hetzner, in Germany.</p>\n<p>Q: Can we choose custom locations?<br>\nA: Afraid not.</p>"}