{"id": 5839, "date": "2020-12-24T00:25:25.086Z", "user": "nem", "post": "<p><a href=\"https://apiscp.com/\" rel=\"nofollow noopener\">ApisCP</a> turns 18 on <a href=\"https://old.apisnetworks.com/apnscp.php\" rel=\"nofollow noopener\">December 26th</a>, which is a great milestone as the codebase can now buy fireworks, purchase spray paint, and get tattoos without parental consent.</p>\n<p>To kick the celebration off and help everyone move past 2020, I’m bringing back the popular 50% off discount (coupon code:  <strong>ANNIVERSARY</strong> ) valid on all <a href=\"https://my.apiscp.com/\" rel=\"nofollow noopener\">lifetime licenses</a>. This discount is valid until January 1 or reseller support officially launches, whichever happens later.</p>\n<p><strong>Pro</strong>  licenses (no domain limit) are $249,  <strong>Startup</strong>  (30 domain limit) is $79, and  <strong>Mini</strong>  (10 domain limit) is $49. These are all one-time costs. Licenses may be revoked and reissued as needed via the licensing portal, <a href=\"https://my.apiscp.com/\" rel=\"nofollow noopener\">my.apiscp.com</a>.</p>\n<hr>\n<p>On to interesting developments since the last major update.</p>\n<h1>CentOS Stream</h1>\n<p>As we know by now  <strong>CentOS is flipping upstream</strong>  to RHEL instead of downstream. I’ve shared <a href=\"https://hq.apiscp.com/future-of-centos-in-apiscp/\" rel=\"nofollow noopener\">my thoughts</a> on this and logged a few days of build hours on <a href=\"https://api.ara.apiscp.com/?label=c8s\" rel=\"nofollow noopener\">E2E tests</a>. Unless something catastrophic happens by July, ApisCP will continue to focus on the Red Hat/CentOS ecosystem to produce the maximum integration afforded by this distro. Having faster release cycles for crucial software like systemd allows me to build more cohesive platforms with less overhead. It’s a win.</p>\n<h1>Reseller support</h1>\n<p>Technology helps accomplish tasks with better precision.  <strong>Reseller system</strong> , which is next to launch now that the <a href=\"https://docs.apiscp.com/admin/Panel%20proxy\" rel=\"nofollow noopener\">panel proxy</a> is done, uses project quotas and cgroup subtrees to allow overselling with online resource enforcement. Resellers can allocate beyond their package allowances to sites, but the sum of all resources can never exceed the total on the reseller; unlike prevailing reseller systems this is enforced realtime by the OS.</p>\n<p>Given the ambitious approach to reseller support, ApisCP will only support resellers on  <strong>CentOS 8 or Stream with xfs</strong>  filesystems. ext4 supports project quotas on 4.x kernels; however, I’ve not explored it to the same extent as xfs project/group/user quotas.</p>\n<h1>Panel proxy</h1>\n<p>Lastly,  <strong>panel proxy</strong>  as touched on earlier allows one to run multiple ApisCP nodes from a single login portal. It’s been part of the magic behind Hostineer for the last 5 years and now it’s cleaned up for a wider audience. Several great minds in the <a href=\"https://discord.gg/wDBTz6V\" rel=\"nofollow noopener\">ApisCP Discord</a> have helped move this along. It’s as simple as a couple <a href=\"https://docs.apiscp.com/admin/Panel%20proxy/#configuration\" rel=\"nofollow noopener\">configuration settings</a> on each node. Panel proxy is broken down into 3 separate components to enhance security. Each component can be run off a free DNS-only license issued via <a href=\"https://my.apiscp.com/\" rel=\"nofollow noopener\">my.apiscp.com</a>. After reseller is implemented, I’ll expand upon this to allow admin to jump locations from a single login.</p>\n<p><img src=\"https://hostedtalk.net/uploads/default/original/2X/a/a9431b3176c2ce956af6e4b97aaf67fb1f80a8e5.svg\" alt=\"\" data-base62-sha1=\"o9msWRHu4IQRpkPouBjYdBNKIJf\" width=\"591\" height=\"411\"></p>"}