{"id": 5861, "date": "2021-01-01T09:46:21.648Z", "user": "VirMach", "post": "<p>Happy new year! For 2021, we’ll be giving away free services for the entire year of 2021. One day only (January 1, 2021.) To reduce abuse, we will only be providing this for “active” customers. If you’ve been a member of HostedTalk for all of 2020, feel free to private message us here as well to get one of these offers if you are not currently a customer.</p>\n<p><strong>Special Offers</strong><br>\n</p><aside class=\"onebox allowlistedgeneric\">\n  <header class=\"source\">\n      <a href=\"https://virmach.com/special-offers/\" target=\"_blank\" rel=\"nofollow noopener\">VirMach.com | The Best &amp; Cheapest VPS Cloud Hosting</a>\n  </header>\n  <article class=\"onebox-body\">\n    <img src=\"\" class=\"thumbnail\" width=\"\" height=\"\">\n\n<h3><a href=\"https://virmach.com/special-offers/\" target=\"_blank\" rel=\"nofollow noopener\">Special Offers &amp; Coupon Codes - VirMach.com | The Best &amp; Cheapest VPS...</a></h3>\n\n<p>Special Offers &amp; Coupon Codes Please note: the location you select may be sold out by the time the product is delivered, in which case your order may be canceled. This may result in a manual delivery that may take up to 48 hours in some cases....</p>\n\n\n  </article>\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p>Get 100% off for the first year of any of the listed services on this page, while supplies last. Please try to order the package you will actually utilize and not just the largest package.</p>\n<p>This <em>will</em> re-occur in most cases by default so just remember to cancel it in advance. We rebill 72 hours in advance before the next term. Please don’t forget to read the special offer terms and our terms of service. Let us know if you have any questions on this thread.</p>\n<p><em>This offer is exclusive for HostedTalk members.</em> We reserve the right to cancel your service (with at least one week’s notice) should we suspect abuse.</p>\n<p>We may ask for a private message to avoid cancellation, thanks for understanding.</p>\n<p>We also have some hardware we can’t really use anymore so we’ll pick out a few people here on this thread and ship them a prize or something so we can complete this parody thread. Probably incorrectly-sized SSDs, an entire older server, flash drives, some random processor, keyboard, maybe the VirMach logo from our office, who knows.</p>\n<p><strong>Bonus hint:</strong> if you want to end up maybe getting migrated halfway through the year to a nicer colocated server in a subjectively nicer datacenter with a better network blend, pick Los Angeles.</p>"}