{"id": 6088, "date": "2021-03-20T09:56:01.525Z", "user": "alwyzon", "post": "<p>&nbsp;</p>\n<p><img src=\"https://hostedtalk.net/uploads/default/original/2X/a/afffcd1c4853f48561df354104c0904dfe314f9a.svg\" alt=\"ALWYZON\" data-base62-sha1=\"p6XBKBMFx9CmeJJmV3xgyHjpLhU\" width=\"690\" height=\"50\"></p>\n<p>&nbsp;</p>\n<p>Dear HostedTalk-community,</p>\n<p><strong>ALWYZON HAS LANDED IN VIENNA, AUSTRIA!</strong></p>\n<p>The new location is operated right out of the <strong>InterXion VIE1</strong>, home to the major Austrian internet hub VIX and an ideal gateway towards Central and Eastern Europe. In matters of services provided, expect comparable service as with our Dutch location: virtual servers running on the <strong>latest generation of Dell PowerEdge servers</strong> (14th Gen) and a <strong>redundant, multigigabit network</strong> powered by brand new Juniper equipment. And, all of that for the same level of incredible prices!</p>\n<p>As a small Austrian firm ourselves, it is especially exciting to launch our services in our—in terms of affordable VPS services—exotic home nation. To share this excitment with you, all orders for the new location are eligible for a <strong>10% recurring discount</strong> with the coupon code: <code>HELLOVIENNA</code>. Check out all possible configurations on <a href=\"https://www.alwyzon.com/\" rel=\"noopener nofollow ugc\">our website</a> or have a look at the featured plans in the table below.</p>\n<p>&nbsp;</p>\n<p><strong>Storage Server 500G</strong><br><s>3,20</s> <strong>2,88</strong> €/month</p>\n<p>✓ <strong>512 MB</strong> DDR4 ECC Memory<br>✓ <strong>1 vCore</strong> Xeon® Silver (2ⁿᵈ Gen)<br>✓ <strong>500 GB</strong> HDD (RAID 6/Cached)<br>✓ <strong>100 Mb/s</strong> Up- and Downlink<br>✓ Located in Vienna, AT<br>✓ Powered by KVM &amp; Proxmox<br>✓ 1x IPv4 + /64 IPv6 included<br>✓ 1 TB Monthly Bandwidth</p>\n<p><a href=\"https://my.alwyzon.com/index.php?cmd=module&amp;module=31&amp;cid=31\" rel=\"noopener nofollow ugc\">[[ ORDER NOW ]]</a></p>\n<p>&nbsp;</p>\n<p><strong>Storage Server 1T</strong><br><s>5,50</s> <strong>4,95</strong> €/month</p>\n<p>✓ <strong>1 GB</strong> DDR4 ECC Memory<br>✓ <strong>1 vCore</strong> Xeon® Silver (2ⁿᵈ Gen)<br>✓ <strong>1 TB</strong> HDD Storage (RAID 6/Cached)<br>✓ <strong>1.000 Mb/s</strong> Up- and Downlink<br>✓ Located in Vienna, AT<br>✓ Powered by KVM &amp; Proxmox<br>✓ 1x IPv4 + /64 IPv6 included<br>✓ 2 TB Monthly Bandwidth</p>\n<p><a href=\"https://my.alwyzon.com/index.php?cmd=module&amp;module=31&amp;cid=32\" rel=\"noopener nofollow ugc\">[[ ORDER NOW ]]</a></p>\n<p>&nbsp;</p>\n<p><strong>Virtual Server E²</strong><br><s>5,20</s> <strong>4,68</strong> €/month</p>\n<p>✓ <strong>2 GB</strong> DDR4 ECC Memory<br>✓ <strong>1 vCore</strong> Xeon® E-2174G<br>✓ <strong>100 GB</strong> SSD Storage (RAID 10)<br>✓ <strong>1.000 Mb/s</strong> Up- and Downlink<br>✓ Located in Vienna, AT<br>✓ Powered by KVM &amp; Proxmox<br>✓ 1x IPv4 + /64 IPv6 included<br>✓ 5 TB Monthly Bandwidth</p>\n<p><a href=\"https://my.alwyzon.com/index.php?cmd=module&amp;module=31&amp;cid=33\" rel=\"noopener nofollow ugc\">[[ ORDER NOW ]]</a></p>\n<p>&nbsp;</p>\n<p><em>Offer valid until 2021-03-24 or as long as stock lasts. All prices are recurring discounts and exclusive of VAT. Your local VAT rate may be added on top of these prices depending on your location. Plans with a pre-discount price of less than 5 € can only be ordered with quarterly or yearly upfront payments. If the above order links do not work, use the voucher code <code>HELLOVIENNA</code> instead to get a recurring 10% discount for any plan available in Vienna.</em></p>\n<p>&nbsp;</p>\n<h2>Key Features</h2>\n<p>✓ Instant provisioning of new servers<br>\n✓ Powered by Proxmox and KVM<br>\n✓ Easy to use client area (reboot, reinstall, VNC console)<br>\n✓ Reverse DNS configurable over client area too<br>\n✓ CentOS. Debian, Fedora, openSUSE or Ubuntu pre-installed<br>\n✓ Or: upload and install your own ISOs in the client area<br>\n✓ Latest enterprise-grade hardware from major brands<br>\n✓ Located in the InterXion VIE1 in Vienna, Austria<br>\n✓ Low-latency network in the heart of Europe<br>\n✓ Redundant, UPS-backed power supply<br>\n✓ Generators with initial autonomy of 72 hours</p>\n<p>&nbsp;</p>\n<h2>About Alwyzon</h2>\n<p>Alwyzon, is a trading name of Hohl IT e.U., a small software development company registered in Graz, Austria. All equipment is fully owned, equity financed and runs on our own network in the InterXion VIE1, one of the largest datacenters in Austria. As a RIPE NCC member, we also own all IPs assigned to any client and currently operate the equivalent of a /21 IPv4 subnet to offer our services.</p>\n<p>&nbsp;</p>\n<h2>About the Network</h2>\n<p>• Looking Glass: <a href=\"https://www.alwyzon.com/lg/vie\" rel=\"noopener nofollow ugc\">alwyzon.com/lg/vie</a><br>\n• Test IPv4: 46.102.157.45<br>\n• Test IPv6: 2a0d:f302:100::2<br>\n• Test Download File: <a href=\"https://lg.vie.alwyzon.net/25MB.test\" rel=\"noopener nofollow ugc\">25 MB</a> <a href=\"https://lg.vie.alwyzon.net/50MB.test\" rel=\"noopener nofollow ugc\">50 MB</a> <a href=\"https://lg.vie.alwyzon.net/100MB.test\" rel=\"noopener nofollow ugc\">100 MB</a></p>\n<p>&nbsp;</p>\n<h2>Frequently Asked Questions</h2>\n<p><strong>Will we see more locations anytime soon?</strong><br>\nNo, definitely not. Think of Alwyzon more like a small boutique; there aren‘t any intentions to build up a global spanning reach. On the contrary, lots of thought have been put into whether it‘s even worth to have two locations to maintain. But, as an Austrian company and since Austria is a much more underserved market than the Netherlands anyhow, that opportunity could not be passed up when a suitable deal arose.</p>\n<p><strong>Why isn’t there any Virtual Server S plan in Austria?</strong><br>\nThe Virtual Server S is the by far most sold plan in the Dutch location, but it is also the plan with the lowest profit margin and those prices simply are not economical at the operating costs that we have to face in Vienna. So for now, these plans are not yet available in Austria.</p>\n<p><strong>What payment methods do you support?</strong><br>\nYou can pay via Credit Cards (processed by Stripe*), BanContact, EPS, giropay, iDeal and Paypal. If none of these payment methods is applicable to you, open a support ticket to pay via SEPA wire transfer.</p>\n<p>*We know your credit card information is very sensitive and thus we will never store your credit card details on our servers. Instead, those are handled by the payment processor Stripe and we only store a token and the last four digits for later reference.</p>\n<p><strong>How long until my virtual server is ready to use?</strong><br>\nProvisioning of new virtual servers is fully automated and takes about 5 minutes. As soon as your payment is received, the setup process is automatically launched for the operating system you selected in the checkout form. (Provided that our system didn’t flag you for manual review.)</p>\n<p><strong>What kinds of usages are accepted?</strong><br>\nIn short: keep it legit and don’t abuse the provided resources. No email spam, no file sharing, no Tor nodes, no Torrent and nothing that will hammer the shared CPU cores to 100% 24/7 (= no crypto currency miners, please). For a more detailed list, see the “Accepted Usage Policy” section of our <a href=\"https://www.alwyzon.com/terms\" rel=\"noopener nofollow ugc\">Terms of Service</a>.</p>\n<p><strong>What operating systems are supported?</strong><br>\nYou can either pick from the latest CentOS, Debian, Fedora, openSuse or Ubuntu releases pre-installed on your virtual server; or you can upload any ISO and install whatever operating system you would like to use instead.</p>\n<p><strong>What level of support is provided?</strong><br>\nThese are unmanaged virtual server offers, so you are expected to install and configure the server yourself. You get root access to the virtual server and a Linux distribution pre-installed, but you will have to setup any software according to your requirements.</p>\n<p>&nbsp;</p>\n<hr>\n<p><em>Alwyzon is a trading name of Hohl IT e.U, a company registered at the court of Graz (Austria), company number 538746z. This post may be considered marketing communication. A full legal disclosure in accordance with § 5 (1) Austrian E-Commerce Act (ECG) can be found on <a href=\"https://www.alwyzon.com/impressum\" rel=\"noopener nofollow ugc\">alwyzon.com/impressum</a>.</em></p>"}