{"id": 6106, "date": "2021-04-04T07:23:56.491Z", "user": "hostEONS", "post": "<p>We have very little stock left out for our KVM VPS in LA and NY, already sold out in Dallas, Las Vegas and Jacksonville (waiting for new vps nodes)</p>\n<p>We have few Ryzen and NVME based KVM VPS available in LA just order any Ryzen based VPS from <a href=\"https://hosteons.com/ryzen_premium_vps.php\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Premium Ryzen KVM VPS on NVME Drives | Multiple Locations LA and Dallas- hostEONS.com</a> and get free upgrade to 10Gbps Port (Shared)</p>\n<p>We even have few Intel E5 based KVM VPS (RAID10 SSD) available in LA and NY just order from <a href=\"https://hosteons.com/kvm_vps.php\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Budget Gigabit KVM Linux and Windows VPS with SSD RAID 10 Storage with Free DDOS Protection | Multiple Locations LA, Las Vegas, New York, Jacksonville, Dallas- hostEONS.com</a> and get free upgrade to 10Gbps Port (Shared)</p>\n<p>Since we have limited stock left out, all coupon codes have been disabled and this offer is for forum users only, so please kindly update this thread after placing order and within 24 hours I’ll upgrade your VPS Port speed to 10G (in LA we still have few VPS nodes on 1G Port so if your VPS is setup on that VPS Node, I’ll have to migrate your VPS to another VPS node and it may even result in IP address Change. though network will remain same)</p>\n<p>Please don’t submit support ticket to get upgrade, just update this thread as support staff won’t be able to do this upgrade.</p>\n<p>Looking Glass:<br>\nLA: <a href=\"https://lg.la.hosteons.com/\" rel=\"noopener nofollow ugc\">https://lg.la.hosteons.com/</a><br>\nNY: <a href=\"https://lg.ny.hosteons.com/\" rel=\"noopener nofollow ugc\">https://lg.ny.hosteons.com/</a></p>\n<p>Standard Features:</p>\n<ol>\n<li>VPS control panel</li>\n<li>Custom ISO Support</li>\n<li>Full RDNS Support in VPS control Panel</li>\n<li>Free Windows 2019 License on annual payment (just submit a a ticket after placing order)</li>\n<li>/64 IPv6</li>\n<li>DDOS Protection</li>\n<li>SMTP Port is blocked by default, please submit a support ticket to get SMTP Port unblocked (We don’t allow bulk mailing or newsletter or spam on our network so such users please stay away)</li>\n<li>Free DA Personal License with Ryzen KVM VPS</li>\n<li>All VPS have Fair Share CPU Usage Policy.</li>\n</ol>\n<p>VPS Nodes Uptime/ Status - <a href=\"https://status.hosteons.com/\" rel=\"noopener nofollow ugc\">https://status.hosteons.com</a> (Some nodes have been recently added to the status page as we recently upgraded most of our VPS nodes from 1G to 10G and also got rid of our Opteron based VPS Nodes, 1-2 nodes are still pending migration to Intel E5, just waiting for new VPS nodes to be racked.)</p>\n<p>This offer is only valid till stock lasts or 1 week whichever is earlier.</p>\n<p>Thanks</p>"}