{"id": 6157, "date": "2021-05-04T08:18:23.503Z", "user": "Aswin", "post": "<p><strong>About CloudStick:</strong></p>\n<p>CloudStick is a SaaS application designed to manage your Digital Ocean, Linode, AWS, Vultr, GCP, Any KVM servers or Dedicated servers for PHP, and Node-based Web Applications. CloudStick is fully packed with Nginx, Apache, PHP, MariaDB, FTP, Cron, Supervisord, Redis, Memcached, Node, Composer, etc. CloudStick’s one Click installer is capable of deploying WordPress, Joomla, NextCloud, and PHPMyAdmin.</p>\n<p>We would like to give a coupon code for the HostedTalk community for a month as an introductory offer on annual plans and it is applicable for Basic and Pro packages (Not trial). You can avail of 50% off on the annual package by paying just $90 with the Promo code.</p>\n<p>We are providing 10 days Free Trial - No Credit Card or Paypal information required to Sign Up.</p>\n<p>Coupon Code: HostedTalk</p>\n<p>(This Coupon is Valid till May 31’st 2021)</p>\n<p>How to install CloudStick?</p>\n<p>You need an account with CloudStick: <a href=\"https://cloudstick.io\" rel=\"noopener nofollow ugc\">https://cloudstick.io</a> to get started.</p>\n<p>You should have a server with the operating system of Ubuntu 16.04 LTS, 18.04 LTS, or 20.04 LTS .</p>\n<p>Once the account is created, you need to click on Connect server then &gt;&gt; Enter your server name and select the provider, and server IP address &gt;&gt; enter the root password to install CloudStick on your server. The installation will take 5 - 8 minutes and your server will be ready to host websites and applications.</p>\n<p><strong>What are the features available in CloudStick?</strong></p>\n<ul>\n<li>Quota for accounts/ Web applications/ System Users.</li>\n<li>Centralized management and the global search for databases, web application, and servers.</li>\n<li>The one-click web application installer.</li>\n<li>Manual SSL</li>\n<li>Free SSL</li>\n<li>Additional FTP accounts for web applications and subdirectories.</li>\n<li>SFTP for web applications.</li>\n<li>Service management.</li>\n<li>Server Time zone management.</li>\n<li>Hostname setup</li>\n<li>Database management with advanced options, such as assigning custom privileges for the user, easy remote access, and many more.</li>\n<li>Git Deployment and WebHooks.</li>\n<li>Multiple PHP versions - 5.5, 5.6, 7.0, 7.1, 7.2, 7.3, 7.4, 8.0</li>\n<li>EasyPHP - which allows customers to install the required PHP module without a command-line interface, such as pgsql, mcrypt, redis, geoip, imagick, ioncubeloader and igbinary, ZMQ, etc.</li>\n<li>Easy SSH access management.</li>\n<li>Advanced server firewall with automated triggering.</li>\n<li>Server Health Statistics.</li>\n<li>Advanced web application file manager.</li>\n<li>Isolated cache management system.</li>\n<li>Advanced Web application management utilities, such as manage redirection, cores management, etc.</li>\n</ul>\n<p><strong>What are the Upcoming Modules?</strong></p>\n<ul>\n<li>Team management - which is free for Basic and Pro package owners. Will be released in 15 - 20 days.</li>\n<li>DNS - Which is also a free module for all customers even for free too.</li>\n<li>Backup - Incremental backup with addon pricing.</li>\n</ul>\n<p><strong>What are the benefits of using CloudStick?</strong></p>\n<ul>\n<li>24/7 Free ticket support with 20 minutes response time.</li>\n<li>Free migration.</li>\n<li>No additional cost for support</li>\n<li>API availability</li>\n</ul>\n<p>Company info:<br>\nCloudStick LLC , 651 N Broad St <span class=\"hashtag\">#205-1557</span> , Suite 205, Middletown, DE 19709 ,<br>\nUnited States</p>"}