{"id": 6382, "date": "2021-08-27T23:02:05.539Z", "user": "VirMach", "post": "<p>VirMach has a ton of empty servers right now due to a transition taking placing, where essentially all services at one time or another throughout 2022 will be upgraded to using Ryzen nodes. So for as long as any services on our website (excluding a few obvious things that would still cost us money such as cPanel licenses and domains, and low-stock service/location combinations) are <em>absolutely free</em> for HostedTalk members. This will expire when it is migrated to Ryzen and/or is no longer with our current provider (the C word which shall not be named.)</p>\n<p><strong>Requirements</strong></p>\n<p>Requirements may change at any time, so please re-read this right before you want to apply for one.</p>\n<p>Any of the following profile stats on HostedTalk will make you eligible for this offer, based on <a class=\"mention\" href=\"/u/imok\">@imok</a> activity levels except divided by the amount of time he’s been here to represent a version of him that’s existed for only a month, rounded.</p>\n<ul>\n<li>30 Days on HostedTalk</li>\n</ul>\n<p>AND just one of the below but please don’t spam:</p>\n<ul>\n<li>30 Days Visited (wait, <a class=\"mention\" href=\"/u/imok\">@imok</a> does that mean you’re here every day?)</li>\n<li>6 Hours Read Time</li>\n<li>35 Topics Viewed</li>\n<li>1K Topics Viewed</li>\n<li>45 Likes Given</li>\n<li>2 Topics Created</li>\n<li>40 Posts Created</li>\n<li>40 Likes Received</li>\n</ul>\n<p>Finally, to keep your service, just maintain some level of activity on HostedTalk. This will be checked no more than once a month, so as long as you do any of the following once a month, you’re good. If you believe this is too much for 30 days, then take it up with <a class=\"mention\" href=\"/u/imok\">@imok</a> and tell him to stop being so active.</p>\n<p>If you become inactive, we will not immediate suspend your service, it will be set to require a payment 7 days later @ original price (which you can pay or decide not to pay, in which case it will terminate naturally.)</p>\n<p>Any ONE of the following:</p>\n<ul>\n<li>30 Days Visited</li>\n<li>6 Hours Read Time</li>\n<li>35 Topics Viewed</li>\n<li>1K Topics Viewed</li>\n<li>45 Likes Given</li>\n<li>2 Topics Created</li>\n<li>40 Posts Created</li>\n<li>40 Likes Received</li>\n</ul>\n<p>For now, please post what service you’d like here, and just make sure we have associated your VirMach email with your HostedTalk (you can private message it for now.) Let us know in your post what project you’ll be using it for, this is partially an anti-abuse and spammy behavior measure but it could also be interesting. For now, we will consider giving you more than one service if you need it and justify it accordingly. Your needs do not need to be non-commercial, as in it’s OK if you’re using it to your advantage to make money in some way as long as it’s abiding by our terms. We’ll probably make the process easier/more automated if this catches on or starts annoying everyone by being constantly bumped.</p>\n<p>Oh, and this should not be used to replace a current paid service you have with us, and we reserve the right to not process your order if we believe something shady to be going on in one way or another (e.g, we start seeing one person trying to make like 50 VirMach accounts to get free services.)</p>\n<p>Any questions, let me know. I’ll try to come back often and also update the original post with more information.</p>"}