{"id": 6421, "date": "2021-09-05T23:21:08.051Z", "user": "Jarland", "post": "<p>Today we’re opening up a new addon service to our resellers. You can have your very own branded Android and/or iOS email app and submit it to the Apple App Store and/or Google Play Store. Now, we want to give you the addon description we’ve filled in to the billing system first:</p>\n<p><em>This will require hard work from you and us. You will need to work with us to get the code generated to deploy your own Android and/or iOS app for your brand. It will be built by Crossbox, and you will need to deploy it under your own developer account with Google/Apple. You will need to provide us with google-services.json and GoogleService-Info.plist from your own Firebase account in the process. We will open a ticket with you when you purchase this addon.</em></p>\n<p>Before purchasing this addon, you should also read these guides for submission to the two stores:</p>\n<p>iOS – <a href=\"https://crossbox.io/documentation/page/ios\" class=\"inline-onebox\">iOS | CrossBox</a><br>\nAndroid – <a href=\"https://crossbox.io/documentation/page/android\" class=\"inline-onebox\">Android | CrossBox</a></p>\n<p>This task isn’t for just anyone, and it can be difficult. When we launched ours with the help of the developers of Crossbox, we really had their help and needed it. For that reason, we don’t want to walk through this process with anyone who isn’t committed and invested. The setup fee for this addon is $100, and there is a recurring $25/m fee as well. You are going to want to push updates to the app on occasion, at your desired pace, and that will require working with us each time. If you’re up for it, we’re ready!</p>\n<p>New resellers will see this addon available at time of purchase. For existing resellers, log in at <a href=\"https://accounts.mxroute.com/\">accounts.mxroute.com</a>, click on the name of your service on the right side of the page, and then look for the link to add the addon.</p>\n<p>To see the marketing material on this product, visit the <a href=\"https://crossbox.io/white-label-branding\">Crossbox white-label page</a>.</p>\n<p>Our reseller plans can be found at the bottom of this page: <a href=\"https://mxroute.com/pricing/\">Pricing | MXroute</a></p>"}