{"id": 6639, "date": "2021-11-05T16:56:24.492Z", "user": "Friendly", "post": "<p>Hello there I am here to sublet my dedicated server for game/application hosting as we just started with a solid commitment on the following setup…<br>\ni7 8068K (6 cores/12 threads)<br>\n16GB Installed (2x8GB Modules at 3,200MT/sec)<br>\n2x500GB SSDs in Software RAID 1 (SLC Cache plus TLC backed storage)<br>\nPremium DDoS protection<br>\nLocated in North Carolina United States<br>\nNFS Encrypted Share linked for on demand/scheduled Backing up from the Pterodactyl Game Panel.<br>\nRunning off of Latest Pterodactyl Game Panel</p>\n<p>Therefore this is fairly large to our <a href=\"http://deafblindminetestgaming.com\" rel=\"noopener nofollow ugc\">deafblindminetestgaming.com</a>’s needs and secured this box because…</p>\n<ol>\n<li>We wanted to be assured of service even during this ongoing financial crisis (we’re on a commitment).</li>\n<li>More options for upgrabliabities/going forward.</li>\n<li>Ensuring performance (this box crushed a i9 9900K “Premium”  VPS we migrated from, both IOPS and CPU Single Thread).</li>\n</ol>\n<p>There’s was just one “small” problem with us gone this route. These are far more resources than we ever gonna ends up using so I figured I would sublet here if anybody elses would want to benefit from the same! Interested? Here are my “mate rates” and what’s included…</p>\n<p><strong>Resources/Additions</strong></p>\n<p><strong>RAM (at 512MB increments)</strong> $1.50 per month</p>\n<p><strong>Storage (at 1GB increments)</strong> $0.25 per month<br>\n*<em>This is managed backed up storage, you have access to 3 “on demand” and/or scheduled slots on your Pterodactyl Game Panel per service. As well as 30 days retention on our off-network quality RAID 10 HDD VPS.</em></p>\n<p><strong>Additional Backups’ Slot(s) (on Local NFS Encrypted Share Only)</strong> $2 per month per slot</p>\n<p><em>Interested of long term partnering with us? I will knock off 25% of your grand totals if you decides to prepay for a year or more ahead of time.</em></p>\n<p><strong>Services Included</strong></p>\n<p><strong>Unmetered Resources</strong> CPU and network resources are both unmetered, while disk activity is set to same priority across services.</p>\n<p><strong>Panel Operations</strong> such as but not limited to start/stop/restarting, changing versioning(s), replacing service types (service eggs), setting up schedule(s) and so on where/if possible.</p>\n<p><strong>Best Efforts General Support Services</strong> Everything from remote manual backups’ restorations to game/application’s configurations to individual requests/needs I will happily see what I can do.</p>\n<p><em>Terms</em></p>\n<ul>\n<li>\n<p>Your know the rules, generally if it’s not illegal or excessively abusing the machine itself you should be fine. It’s even okay to go to several CPU cores or something like that <em>if you talk to us first</em> about doing your Minecraft World(s) Pregenerations or whatever your up to. <img src=\"https://hostedtalk.net/images/emoji/google/slight_smile.png?v=10\" title=\":slight_smile:\" class=\"emoji\" alt=\":slight_smile:\"></p>\n</li>\n<li>\n<p>Additionally as we simply are trying to cover our bills, you understand we are a not a business and therefore you disconnection (and conversely data loss) may occurs at any moment after you overdue with us. We will not let you be on our machine “rent free”.</p>\n</li>\n</ul>\n<p><em>Interested? PM me here or contact me directly at <a href=\"mailto:rickytorres551@gmail.com\">rickytorres551@gmail.com</a>.</em></p>"}