{"id": "3161001", "date": "2020-11-28T16:46:37+00:00", "user": "ViridWeb", "post": "\n<div class=\"Message userContent\">\n<blockquote class=\"UserQuote\"><div class=\"QuoteText\">\n<p><a href=\"https://www.lowendtalk.com/profile/smallbibi\" rel=\"nofollow\">@smallbibi</a> said:</p>\n<div class=\"QuoteFoldingWrapper\"><a href=\"\" class=\"QuoteFolding\">show previous quotes</a></div><blockquote class=\"UserQuote QuoteFolded\" style=\"display: none;\"><div class=\"QuoteText\">\n<p><a href=\"https://www.lowendtalk.com/profile/chocolateshirt\" rel=\"nofollow\">@chocolateshirt</a> said:</p>\n<blockquote class=\"UserQuote\"><div class=\"QuoteText\">\n<p><a href=\"https://www.lowendtalk.com/profile/Myself5\" rel=\"nofollow\">@Myself5</a> said:</p>\n<blockquote class=\"UserQuote\"><div class=\"QuoteText\">\n<p><a href=\"https://www.lowendtalk.com/profile/mhasandx\" rel=\"nofollow\">@mhasandx</a> said:<br>\nanyone receieved viridweb money to paypal. in my paypal, its showing that my payment refunded but my paypal balance is still zero. i mean i have not received my 6$ on paypal</p>\n</div></blockquote>\n<p>They manually sent a payment to me earlier today, maybe you should try creating a support ticket.</p>\n<p>They also sent out emails to everyone affected:</p>\n<blockquote class=\"UserQuote\"><div class=\"QuoteText\">\n<p>Because of huge number of orders we do cancelled few orders as we do not want to oversell our resources,<br>\nI think as a user you can understand the situation when a company oversell a server, we really don't want to do that to our clients.</p>\n<p>Users who did not received refund for cancellation of their service or order please open a ticket within 24hrs</p>\n<p>Our billing team will issue full refund to you ASAP</p>\n<p>Your account will be removed from our database within next 24hrs as we do not store, share data of our clients</p>\n<p>So if you failed to open a ticket on time and account got delete then kindly contact us directly on Skype before you open a dispute with PayPal as we have no intention to hold money of our clients when we failed to deliver the service to them.</p>\n</div></blockquote>\n<p>Sadly, PayPal had the decency to demand 20% fees so I ended up receiving 4.15€ of the 5.24€ I paid, but that's nothing I can blame <a href=\"https://www.lowendtalk.com/profile/ViridWeb\" rel=\"nofollow\">@ViridWeb</a> for.</p>\n</div></blockquote>\n<p>Why manual transfer instead automatic refund?</p>\n</div></blockquote>\n<p>Yeah, I don't think you get charged fees if viridweb did a refund instead of sending you a payment. I wonder if it's because viridweb loses some kind of reputation score when they do too many refunds</p>\n</div></blockquote>\n<p>We have to send refund manually as per Indian law we can't hold money on our paypal account.</p>\n<p>Most of time we are sending payment of $7 to $8 when user paid $6</p>\n<p>We have failed to provide services to user so it's pur duty to refund them in full amount no matter how much money we lost</p>\n</div>\n"}