{"id": "3187101", "date": "2021-01-01T05:58:53+00:00", "user": "cubedata", "post": "\n<div class=\"Message userContent\">\n<blockquote class=\"UserQuote\"><div class=\"QuoteText\">\n<p><a href=\"https://www.lowendtalk.com/profile/fbmy\" rel=\"nofollow\">@fbmy</a> said:</p>\n<div class=\"QuoteFoldingWrapper\"><a href=\"\" class=\"QuoteFolding\">show previous quotes</a></div><blockquote class=\"UserQuote QuoteFolded\" style=\"display: none;\"><div class=\"QuoteText\">\n<p><a href=\"https://www.lowendtalk.com/profile/cubedata\" rel=\"nofollow\">@cubedata</a> said:<br>\nSorry but the offer is over anyway, and for the record CubeData's Anti Fraud Team did allow one person in because they followed the manual verification process and was found the anti fraud was wrong in considering them fraud.</p>\n</div></blockquote>\n<p>I got a problem when ordering, even though I'm not using Proxy / VPN / Bad IP</p>\n<p>However, I feel very lucky not to get your license.<br>\nif I took a FraudRecord license, it would probably waste our time and potential clients.<br>\nI followed several offers from Cubedata at LET, lastly I intended to buy Modules, but the same problem occurred.</p>\n<p>I think the fault is not from the CubeData's Anti Fraud system, but the people behind it who are too strict.</p>\n</div></blockquote>\n<p>Actually, FraudRecord module which CubeData uses as well, is set to be strict which it can be set to be relaxed as well if you read CubeData's website. CubeData's Management &amp; Anti Fraud Teams has set the FraudRecord Anti Fraud settings very strict, so that there will not be any chance of chargeback/dispute risk, this was done with the intention that the people who do manage to get through the automated screening, which some do and have no problems with, are 100% guaranteed to have zero risk of chargeback/disputes which is why the settings are turned so strict for. Of Course while it negates a lot of people, it also stops 100% of would be chargeback/disputes by using three different anti fraud detection API Services to ensure no one that gets through has any risk related to chargeback/disputes which of course is important to any provider(especially in the LET realm) to keep margins from going to Stripe/PayPal dispute charges, while CubeData never had that many chargebacks/disputes which was only related to certain geographical countries where sadly there is a language barrier, it was decided that one chargeback/dispute was one too many(even though they was very far &amp; few in between and limited as stated to specific countries.)</p>\n<p>Hopefully this clears up, that the FraudRecord anti fraud module is not at fault here, but more so related to ensuring that Chargeback/Dispute/Fraud Risk remains at 0%</p>\n</div>\n"}