{"id": 10086, "date": "2013-04-29 14:51:04", "user": "ryanarp", "post": "**Hello everyone!**\r\nFor those of you who don't know us, Catalyst Host is a product of @jarland Donnell and myself (Ryan Arp). What I want you to know is that we're not just a service provider. We are active on Lowendtalk and we're also customers. Catalyst Host continues to grow, thanks to our loyal customers **You guys ROCK!**. We look forward to growing and providing new products over the coming months. \r\n\r\nMost of you guys know @halfeatenpie by now, he did our last offer and has been an awesome team member here at Catalyst. He is more than happy to assist you in any way that he can. He is the one that will probably answer your ticket with the utmost professionalism.\r\n\r\n**Now for the reason you are reading this, the promo deals!**\r\nPromo Code:  \"LET40\" 40% Off Recurring Lifetime \r\nLimited Quantity of 10: $7 Promo Trenta VPS (Promo Code Does Not Apply To This Plan)\r\n\r\n&lt;pre&gt;\r\nTall (Dallas)\u2028\r\n2 CPU Cores\u2028\r\n256MB RAM \u2028\r\n128MB vSwap\r\n\u202830GB Storage\u2028\r\n600GB Bandwidth @ 1Gbps \r\n1 Domain DNS Entry\r\n1 User Created Backup\r\n$4.79 USD Monthly (Promo Code \"LET40\")\r\nhttps://catalysthost.com/clientarea/cart.php?a=add&amp;pid=32\r\n&lt;/pre&gt;\r\n\r\n&lt;pre&gt;\r\nGrande\u2028 (Dallas)\r\n2 CPU Cores\u2028\r\n512MB RAM \r\n256MB vSwap\u2028\r\n40GB Storage\r\n800GB Bandwidth @ 1Gbps \r\n1 Domain DNS Entry\r\n1 User Created Backup\r\n$6.59 USD Monthly (Promo Code \"LET40\")\r\nhttps://catalysthost.com/clientarea/cart.php?a=add&amp;pid=33\r\n&lt;/pre&gt;\r\n\r\n&lt;pre&gt;\r\nLimited Trenta Promo (Quantity: 10)\u2028 (Dallas)\r\n4 CPU Cores (E5-2620)\r\n2048MB RAM\r\n512MB vSwap\r\n60GB Storage\r\n2TB Bandwidth @ 1Gbps\r\n1 User Generated Backup\r\n$7/m\r\nhttps://catalysthost.com/clientarea/cart.php?a=add&amp;pid=45\r\n&lt;/pre&gt;\r\n\r\nSpeedTest Mini: [Click Here](http://192.211.54.101/test/)\r\n\r\n**Data backup policy:**\r\nAll data on these plans are backed up weekly in Dallas and stored offsite. Our backups are for emergencies. Your user generated backups are for small issues. We only guarantee access to our offsite backups if we are responsible for data loss. This helps keep our costs reasonable while providing two different layers of backups for your important data.\r\n\r\n**About our Dallas datacenter:**\r\nThe network behind our Dallas servers is multi-homed with multiple 10Gbit connections and redundant Juniper routing with HSRP failover. Network and hardware conditions are monitored 24/7/365. Spare hardware is always stocked and available on site. We utilize A+B power for redundancy in case of brownouts, which are rare in Dallas.\r\n\r\n**Our hardware is as follows in Dallas:**\r\n&gt; Node5:\u2028\r\n1x Xeon E5-2620\u2028\r\n64GB ECC Memory\r\n\u20284x 1TB Enterprise SATA\r\n\u2028LSI 9260-4i w/BBU &amp; 512MB Cache\r\n\r\n&gt; Node6 (Current standard for future nodes):\u2028\r\n2x Xeon E5-2620\r\n\u202864GB ECC Memory\r\n\u20288x 500GB Enterprise SATA\r\n\u2028LSI 9260-8i w/BBU &amp; 512MB Cache`\r\n\r\n**What makes Catalyst Host a special company?**\r\nIf you're not going to do something right, don't bother doing it.\r\nCatalyst Host has been in business since early 2011.\r\nWe are not here to give you the most imaginary resources you can't use for the least dollar signs. We are here to give you the best quality, with what I estimate to be some of the least oversold nodes in our market. You have the peace of mind that you services are in good hands, that your service will operate as expected, and that your data will remain safe."}