{"id": 101415, "date": "2016-12-31 21:04:54", "user": "perennate", "post": "Sorry all, I wrote this late last night...\r\n\r\nHappy new year's! To brighten your day while you take a break from work to ponder the opportunity that 2017 presents for humanity to continue fucking up the environment to the point where climate change displaces hundreds of millions, or for us to kill ourselves more directly with nuclear warfare or a \"super virus\", we're again offering our double credit promotion!\r\n\r\nFor those of you who don't know, &lt;b&gt;&lt;a href=\"https://lunanode.com/\"&gt;Luna Node&lt;/a&gt;&lt;/b&gt; is the #1 hosting provider within 400,000 kilometers of earth. But, we're #1, so of course you knew that already. You might be wondering how we became the best. Well, we're happy to share!\r\n\r\n* &lt;b&gt;Hourly billing&lt;/b&gt;: the days of having thousands of idle virtual private servers lying around because you don't need them anymore are over. We bill per-hour, so once your VM is no longer needed, you can immediately delete it and stop paying for it. Or, if you want to take a break from your project and go vacation on the moon for a couple weeks, you can &lt;a href=\"https://wiki.lunanode.com/index.php/Shelving\" target=\"_blank\"&gt;shelve&lt;/a&gt; your VM so that you only pay for disk space and its IP address(es). Once you're back in 1g, just hit unshelve and your VM will launch right back into orbit.\r\n* &lt;b&gt;&lt;a href=\"https://wiki.lunanode.com/index.php/Snapshots\"&gt;Snapshots&lt;/a&gt;&lt;/b&gt;: remember the last time that you had to recover your application from your backups? The database dumps were on the primary backup server, but then the user-uploaded files were rsync'd to your own hard drive, and the images... oops, you forgot to backup the images. Snapshots extract a consistent state of your entire virtual disk, meaning that recovering from a backup is as simple as deploying a new VM from the snapshot (although also backing up files inside the VM is always a good idea). We support live snapshots, where your VM never has to deviate from its flight path: a consistent disk state is extracted while the VM is running; any disk sectors that are modified during the snapshot process are written to a separate file, which is merged once the process completes. In addition to using snapshots for backups, you can also use them as a templating system. For example, you can set up desired software once, take a snapshot, and then deploy many servers from that snapshot running the same software.\r\n* &lt;b&gt;Custom Images&lt;/b&gt;: right from our control panel, you can upload your own ISO images and qcow2 templates, and immediately begin provisioning VM instances from them. Use the browser-based noVNC client or your own desktop VNC client to complete installation from ISOs.\r\n* &lt;b&gt;&lt;a href=\"https://wiki.lunanode.com/index.php/Volumes\"&gt;Volumes&lt;/a&gt;&lt;/b&gt;: why pay for better engines when all you want is a larger cargo hold? Volumes are storage devices that are managed separately from VMs. Like modular cargo containers, they can be attached to and detached from VMs on demand. So, if you need 500 GB of space to store user content on a VM that only has 512 MB RAM, that's fine -- create a 512 MB VM, create a 500 GB volume, and then attach the volume to the VM; the volume will show up on the VM as a new block device that you can format and mount. Volumes are stored on a high availability Ceph RBD cluster, where data is replicated three times. If you want your VM's root partition to be on a volume, you can create a volume from a template image, and then select the volume when provisioning the VM (then, if a hypervisor fails, your VM can immediately be migrated to another hypervisor).\r\n* &lt;b&gt;&lt;a href=\"https://wiki.lunanode.com/index.php/Security_groups\"&gt;Security Groups&lt;/a&gt;&lt;/b&gt;: manually updating your ACLs across all of your many space stations and spaceships is tedious work. Security groups allow you to define ingress and egress traffic restrictions on groups of virtual machines. Unlike iptables and similar firewalls that run inside your VM, security groups are enforced at the infrastructure level and can be applied to multiple VMs; this removes the possibility of accidental firewall deactivation and simplifies firewall management.\r\n* &lt;b&gt;&lt;a href=\"https://wiki.lunanode.com/index.php/API\"&gt;API&lt;/a&gt;&lt;/b&gt;: it's ugly and unRESTful, but hey, it's better than nothing! Automate deployment of your applications with our powerful API. You can create and manage virtual machines, snapshots, volumes, IP address, etc. all from the API.\r\n* &lt;b&gt;&lt;a href=\"https://wiki.lunanode.com/index.php/Server_monitoring\"&gt;Uptime Monitoring&lt;/a&gt;&lt;/b&gt;: we developed an &lt;a href=\"https://github.com/lunanode/gobearmon\"&gt;open-source, fault-tolerant uptime monitoring application&lt;/a&gt; and provide it as a free service (excluding SMS and phone call notifications) that is configurable directly from our panel. Add HTTP, TCP, ICMP, and SSL certificate expiration checks so that you know when you need to send a repair drone to patch up your VM.\r\n* &lt;b&gt;&lt;a href=\"https://wiki.lunanode.com/index.php/DNS\"&gt;Advanced DNS Hosting&lt;/a&gt;&lt;/b&gt;: our DNS service, which is free for up to one million queries per month, includes advanced monitoring and geo-targeting functionality. Couple records with our uptime monitoring system to failover from a failed primary server to a backup server, or to disable specific records in a round-robin group when a subset of servers go down.\r\n\r\nBefore we get into the new year's promotion, we have a very exciting project that we will be releasing in August 2017:\r\n\r\n&lt;b&gt;TOTAL FUCKING SOLAR ECLIPSE&lt;/b&gt;\r\n\r\nThat's right, we've been working on it for years, and we're finally ready to present you with a total solar eclipse on August 21, 2017! Join us on http://lowendtalk.com to watch it... we'll be serving up another promotional offer!\r\n\r\n&lt;b&gt;Double Credit Promotion&lt;/b&gt;\r\n\r\nYet again, we're offering a double credit promotion. No promotion code is required. Just &lt;a href=\"https://dynamic.lunanode.com/signup\"&gt;sign up for an account&lt;/a&gt; and add credit before midnight January 1, 2017, and we'll double your credit up to an additional $25.00. So, if you deposit $15.00, you'll get $30.00 total in credit, while if you deposit $50.00, you'll get $75.00 total. Existing customers are eligible too!!!!11\r\n\r\n* &lt;b&gt;&lt;a href=\"https://www.lunanode.com/pricing\"&gt;Check out our pricing&lt;/a&gt;&lt;/b&gt;. We have locations in Toronto and Montreal in Canada, and Roubaix in France.\r\n* &lt;b&gt;&lt;a href=\"https://dynamic.lunanode.com/signup\"&gt;Sign up!&lt;/a&gt;&lt;/b&gt;\r\n* Read our &lt;a href=\"https://www.lunanode.com/terms\"&gt;Terms of Service&lt;/a&gt; and &lt;a href=\"https://www.lunanode.com/privacy\"&gt;Privacy Policy&lt;/a&gt;.\r\n* Check out our &lt;a href=\"https://wiki.lunanode.com/\"&gt;Wiki&lt;/a&gt; for more information."}