{"id": 102408, "date": "2017-01-11 16:44:38", "user": "jgolliher", "post": "Hello, LowEndTalk,&lt;br /&gt;\r\nPleased to meet you, and thanks for reading our little introduction. We're here to change the way that you think about companies in the LowEnd market.&lt;br /&gt;\r\n\r\nWhat do we actually do that is different from most LowEnd hosts?&lt;br /&gt;\r\n\r\n1)\tWe offer only what we can feasibly provide – No unlimited disk space, no unlimited IP addresses, and no accounts for life. Fair enough. &lt;br /&gt;\r\n2)\tWe are smart about servers – We believe in good server management practices. Stuffing 300 VPS onto a poor node doesn’t work, and you deserve better than that.&lt;br /&gt;\r\n3)\tWe care about our clients – Niceness and formalities are great, but when it comes down to the real matters, we bend over backwards for our clients. &lt;br /&gt;\r\n\r\n\r\nWhat kind of features separate you HostKana from the rest of the pack? &lt;br /&gt;\r\n\r\n1)\tBackups – We take weekly backups even of our VPS nodes on a weekly basis, and if you ask us to restore them, we won’t hit you with a fee.&lt;br /&gt;\r\n2)\t24/7 Competent Support – We don’t bounce tickets back and forth. We investigate the issue, fix it, and make sure it doesn’t happen again.&lt;br /&gt;\r\n3)\tVPS Pools with KVM Virtualization – Almost all companies offering pooled resource VPS solutions are doing so with OpenVZ. By running KVM servers, we are offering you privacy and a higher quality experience. &lt;br /&gt;\r\n4)\tDDoS Protection – Given how common DDoS attacks have become, they can happen to anyone, and you need to be protected from them. &lt;br /&gt;\r\n\r\nWhat locations are available?&lt;br /&gt;\r\n\r\n1)\tQuebec, Canada – OVH&lt;br /&gt;\r\n2)\tRoubaix, France – OVH &lt;br /&gt;\r\n3)\tHong Kong, China [Planned]&lt;br /&gt;\r\n4)\tLong Angeles, California [Planned] &lt;br /&gt;\r\n\r\n\r\n**What is actually being offered?**&lt;br /&gt;\r\n\r\nVPS Resource Pools&lt;br /&gt;\r\nThese are VPS solutions that allow you to create virtual machines on-the-fly. You can make, manage, and delete custom virtual machines. Need a Windows 2008 VM? You’ve got it. What about a 2GB RAM CentOS 6 64-bit machine? Got that too. You can spin them up and delete them immediately, making it very similar to DigitalOcean or Vultr, but with a better price tag, different locations, and other features.  &lt;br /&gt;\r\n\r\n**Kana – VPS Resource Pool**&lt;br /&gt;\r\n2 IP Addresses&lt;br /&gt;\r\n1024 MB RAM&lt;br /&gt;\r\n1500 GB Bandwidth&lt;br /&gt;\r\n30 GB SSD-Accelerated Space&lt;br /&gt;\r\nMonth-to-month price: $5/m &lt;br /&gt;\r\n\r\nwith: 24/7 Support, 99.9% Uptime Guarantee, DDoS protection, All Linux Distros Supported, Windows Supported&lt;br /&gt;\r\n\r\n[[ Order Now ]](https://ac.hostkana.com/cart.php?a=add&amp;pid=12 ) \r\n\r\n&lt;br /&gt;\r\n**Big Kana – VPS Resource Pool**&lt;br /&gt;\r\n4 IP Addresses&lt;br /&gt;\r\n2048 MB RAM&lt;br /&gt;\r\n3000 GB Bandwidth&lt;br /&gt;\r\n50 GB SSD-Accelerated Space&lt;br /&gt;\r\nMonth-to-month price: $7/m &lt;br /&gt;\r\n\r\nwith: 24/7 Support, 99.9% Uptime Guarantee, DDoS protection, All Linux Distros Supported, Windows Supported&lt;br /&gt;\r\n\r\n[[ Order Now ]](https://ac.hostkana.com/cart.php?a=add&amp;pid=13)   \r\n\r\n**Bonus promotion!**\r\nGet entered to win $25 in account credit by signing up for our email list to stay on top of news and promotions! \r\n\r\nThis will end Friday January 20, 2017 \r\n\r\nEnter here - http://eepurl.com/clhO29 \r\nBonus bonus promotion: Sign up for our email list and get a month of free cPanel hosting! "}