{"id": 103884, "date": "2017-01-26 03:19:24", "user": "jgolliher", "post": "&lt;p&gt;Hello LowEndTalk! I’m John from HostKana and today’s offer is all about VPS resource pools. That’s right, we’re talking about the custom VPS that you can create on-the-fly without any waiting. We’re a revolutionary web hosting company looking to disrupt the industry from the low-end first and are bringing great features like a 99.99% network uptime guarantee, live chat support, weekly backups, and DDoS protection to you.&lt;/p&gt;\r\n\r\n&lt;b&gt;How does it work?&lt;/b&gt;\r\n\r\n&lt;p&gt;It’s pretty simple, actually. Once your account has been set up, just follow these steps:&lt;/p&gt;\r\n&lt;ol&gt;\r\n&lt;li&gt;Log into our secure hosting control panel&lt;/li&gt;\r\n&lt;li&gt;Choose your VPS pool service from your service&lt;/li&gt;\r\n&lt;li&gt;Create a custom VPS by clicking on the server icon&lt;/li&gt;\r\n&lt;/ol&gt;&lt;br /&gt;\r\n&lt;b&gt;What is being offered?&lt;/b&gt;&lt;br /&gt;&lt;br /&gt;\r\n\r\n&lt;b&gt;Kana - $5/m&lt;/b&gt;&lt;br /&gt;\r\n2 IP Addresses&lt;br /&gt;\r\n1024 MB RAM&lt;br /&gt;\r\n1500 GB Bandwidth&lt;br /&gt;\r\n30 GB SSD-Accelerated Space&lt;br /&gt;&lt;br /&gt;\r\n$5/m - &lt;a href=”https://ac.hostkana.com/cart.php?a=add&amp;pid=12”&gt;Order Now&lt;/a&gt;&lt;br /&gt;&lt;br /&gt;\r\n\r\n&lt;b&gt;Big Kana - $7/m&lt;/b&gt;&lt;br /&gt;\r\n4 IP Addresses&lt;br /&gt;\r\n2048 MB RAM&lt;br /&gt;\r\n3000 GB RAM&lt;br /&gt;\r\n50 GB SSD-Accelerated Space&lt;br /&gt;\r\n$7/m - &lt;a href=”https://ac.hostkana.com/cart.php?a=add&amp;pid=13”&gt;Order Now&lt;/a&gt;&lt;br /&gt;&lt;br /&gt;\r\n\r\nNeed something bigger? No problem -- you can order multiples and we can combine the resources for you.&lt;br /&gt;&lt;br /&gt;\r\n\r\nOffer expires February 10, 2017. &lt;br /&gt;&lt;br /&gt;\r\n\r\n\r\n&lt;b&gt;Frequently asked questions.&lt;/b&gt;&lt;br /&gt;&lt;br /&gt;\r\n\r\nWhat virtualization is being used? &lt;br /&gt;\r\nWe use KVM. It supports a lot that OpenVZ does not, and it provides additional privacy for each individual VPS.&lt;br /&gt;&lt;br /&gt;\r\n\r\nWhat operating systems do you have?&lt;br /&gt;\r\nAll major Linux and Windows distributions in 32-bit and 64-bit. We can also add individual templates or ISO’s on request.&lt;br /&gt;&lt;br /&gt;\r\n\r\n\r\nWhy is this better than a regular VPS?&lt;br /&gt;\r\nIt’s much more flexible. You can make a new machine on the fly with custom specifications -- and do it wherever in the world you desire.&lt;br /&gt;&lt;br /&gt;\r\n\r\n\r\nDo you have a test IP or looking glass?&lt;br /&gt;\r\nWe sure do!&lt;br /&gt;\r\nFrance looking glass - https://5.196.92.154:6767/LookingGlass-1.3.0/ &lt;br /&gt;\r\nCanada looking glass - https://144.217.68.26:6767/LookingGlass-1.3.0/ &lt;br /&gt;&lt;br /&gt;\r\n\r\nHow many VPS can I create on my plan?&lt;br /&gt;\r\nYou can make as many VPS as you have IP addresses. So, if you have 4 IP addresses, you can make up to 4 VPS. &lt;br /&gt;&lt;br /&gt;\r\n\r\nHow many CPU cores do I have access to?&lt;br /&gt;\r\nYou have access to as many CPU cores as you have IP addresses. So, if you have 4 IP addresses, you could make 4 smaller VPS each with 1 core, or you could pool them together to create one mega VPS with 4 cores. &lt;br /&gt;&lt;br /&gt;\r\n\r\nWhat locations are you offering?&lt;br /&gt;\r\nFor the initial phase, we are offering OVH’s France and Canada’s locations. Within the next few quarters, we expect to offer additional locations like Los Angeles and one in Asia. As new locations are added, existing customers are grandfathered in :)&lt;br /&gt;&lt;br /&gt;\r\n\r\n\r\nDid we not answer your question? No problem. Feel free to contact us and we’ll answer it for you. "}