{"id": 105834, "date": "2017-02-15 02:58:06", "user": "LizCat", "post": "NyaVM - We provided the cheapest OVH VPS to every one.\r\n\r\nBut it doesn't mean we don't provide good support. Enterprise Hardware, Skilled Staff, Budget Prices is our philosophy.\r\n\r\n**_Packages_**\r\n\r\nPrices listed are in USD, Paypal and Alipay are available with no extra transaction fee.\r\nMonthly and yearly billing are available. Yearly billing only costs you 10 months' price.\r\nMultiple OS are available for installation, including Ubuntu 12.04/14.04/16.04, CentOS 5/6/7, Debian 6/7/8 and Fedora 17/18/20/23 (all are 64bit version).\r\nPrices listed here are discounted price. Please use **_LETONLY_** to get lifetime 20% OFF.\r\n\r\n**_Features Include_**\r\n\r\n* Unmetered Traffic (Initial data transfer limitation is 10TB/Mo but you can request more FOR FREE)\r\n* Powerful Intel Xeon CPU\r\n* KVM Full Virtualisation\r\n* 1Gbps Port\r\n\r\n**_DIY Package (OVH)_**\r\n\r\n* 1 vCore\r\n* 2 GiB Dedicated RAM (DDR4)\r\n* 20GB RAID10 HDD\r\n* 1 IPv4 Address\r\n* 1 Gbps Port\r\n* Free 10 TiB Data Transfer (Ask more for free)\r\n* DDoS Protect Enabled\r\n* Unmanaged server\r\n* Prorata Billing (Every month 1st)\r\n* $2.4/Month\r\n* You can decide the rest of the ingredients!\r\n\r\n\r\nAvailable in Poland Warsaw,  France Gravelines,  France Roubaix and  Canada Beauharnois.\r\n[Order Here](https://my.nyavm.com/cart.php?a=add&amp;pid=40)\r\n\r\n**_Available KVM Operating Systems_**\r\n\r\n* CentOS 5/6/7\r\n* Debian 6/7/8\r\n* Ubuntu 12/14/16\r\n* Fedora 17/18/20/23\r\n\r\n**_QnA_**\r\n\r\n1. What's the time required for delivering?\r\n\r\nUsually within 300 seconds after payment is received. If your service is still pending after 300 seconds, you may contact us via Tickets.\r\n\r\n2. Do you support Paypal Automatically Payment?\r\n\r\nNo, we don't.\r\n\r\n3. What applications or services are prohibited to run on your server?\r\n\r\nPlease refer to our ToS.\r\n\r\n4. Do you have other smaller/bigger packages?\r\n\r\nThere are no smaller packages available. Bigger packages are available and you may submit a ticket after you place an order (don't pay first) and tell us how much resource you need. We can calculate the cost for you. Of course, Life Time 20% off also applies to customized servers.\r\n\r\n[Our Telegram Group link](https://t.me/LizCat) Feel free discuss with us!"}