{"id": 10608, "date": "2013-05-20 07:53:49", "user": "mrnothersan", "post": "[url=\"http://www.premiumvm.com\"]PremiumVM[/url] is back! We've extended this deal, so please don't miss it as we cannot guarantee it will come back. Some providers call their services \"unmanaged\" and then don't give you any support at all. We advertise \"basic\" management - this means that your services aren't fully managed, however we won't leave you in the dark. We will help you. We have more great deals to come, but this one won't last long so grab one before stock runs out.\r\n\r\n[b]Terms:[/b] This offer is for the [b]next 3 orders ONLY[/b]. The 4th order onwards will get the below package, however without the double RAM (so RAM will be 1GB).\r\n \r\n[b]Package 1:[/b]\r\n30GB Disk Space\r\n350GB Bandwidth\r\n[s]1GB[/s] 2GB RAM (first 5 orders)\r\n[s]1.5GB[/s] 2.5GB Burstable (first 5 orders)\r\n4 CPU Cores\r\n1 IP Address\r\nOpenVZ\r\nColumbus, OH\r\n \r\n[url=\"https://premiumvm.com/clients/cart.php?a=add&amp;pid=5\"]ORDER NOW[/url] - $4/month\r\n \r\nTest IP available on request. Custom packages available on request (contact us).\r\nWe use SolusVM where you can reboot/start/stop/re-install, [...] your VPS\r\nNo coupon required, just use that order link and submit a ticket when your order has been accepted to claim the upgrade. Orders made during business hours should be activated within a couple of hours at most (usually a few minutes).\r\n \r\nIf you have any questions, please either:\r\n \r\nSubmit a ticket - https://premiumvm.com/clients/submitticket.php?step=2&amp;deptid=1\r\nLive Chat - bottom right hand corner of our website\r\nor..PM dominicl on LET\r\n\r\nRegards,\r\nPremiumVM\r\n\r\n[i]Please note: changed from vSwap to Burstable as our other offers should have been 512MB vSwap and not 2.5GB. Existing clients with an active service have 512MB vSwap, and can request burst upon request. New orders will receive 2.5GB burstable instead. You can request 512MB vSwap if you prefer.[/i]"}