{"id": 106128, "date": "2017-02-17 20:14:32", "user": "ratherbak3d", "post": "![](https://virtual6.net/wp-content/uploads/2016/10/cropped-Virtual6-Logo.png)\r\n\r\nHello LET Members/Visitors, thank you for taking the time to view this, our most recent offer, which is exclusive to LET.\r\n\r\nWe own and maintain our own enterprise level server cluster. Below we explain more about our technical infrastructure, including the network and power that is provided to our hardware. Please view our uptime history which is published at [https://stats.uptimerobot.com/X6jL5C4Kj\r\n](https://stats.uptimerobot.com/X6jL5C4Kj)\r\n\r\n**This weeks deal:-**\r\n\r\n&lt;ul&gt;\r\n&lt;li&gt;30GB RAID-10 6Gbps SATA Storage&lt;/li&gt;\r\n&lt;li&gt;768MB DDR3 ECC RAM&lt;/li&gt;\r\n&lt;li&gt;1TB Bandwidth PCM @ 100Mbps&lt;/li&gt;\r\n&lt;li&gt;1x Dedicated IPv4 Address&lt;/li&gt;\r\n&lt;li&gt;2 x 3.4GHz vCPU Cores - Fair Share&lt;/li&gt;\r\n&lt;li&gt;&lt;del&gt;£5.00&lt;/del&gt; £4.00 PER MONTH PLUS YOUR SECOND MONTH IS FREE WITH PROMO CODE \"LET\"!&lt;/li&gt;\r\n&lt;li&gt;https://virtual6.net/virtual-machines/&lt;/li&gt;\r\n&lt;/ul&gt;\r\n\r\n**Features:-**&lt;br&gt;\r\nInstant Deployment (Subject to automated fraud check)&lt;br&gt;\r\nControl, Billing and Support in one secure control panel&lt;br&gt;\r\nKVM Virtualization with Zero Overselling guaranteed&lt;br&gt;\r\nOne UK registered IPv4 address with custom rDNS support&lt;br&gt;\r\nPermanent VNC access via client, Java or HTML5 console&lt;br&gt;\r\nCustom ISO support (Upload your own .ISO install image)&lt;br&gt;\r\n99.90% Uptime guaranteed, account credit for downtime&lt;br&gt;\r\nAutomatic upgrades for easy on demand scaling&lt;br&gt;\r\nUK Based customer services team, no outsourcing&lt;br&gt;\r\nFull disk encryption, custom kernel(s) and modules&lt;br&gt;\r\n24/7 Pro-active monitoring of our hardware and network&lt;br&gt;\r\nWe’re within 11 miles of our fully owned servers,  should we ever need to access them\r\n\r\n**Power:**\r\n\r\nMains power is coupled with secondary power and is switched automatically on mains failure using an ATS, secondary power is provided by a 100kVA onsite diesel generator. This redundant setup is blackout tested every two weeks to confirm it’s working. The generator has enough fuel for 8 hours of constant running, with fuel re-supply arrangements in place should a critical situation ever arise. UPS Protected clean power is dual fed to the rack and in turn, to the physical server equipment eliminating any single point of failure up to the server itself.\r\n\r\n**Network (and SLA):**\r\n\r\nWe utilise Virgin Media Business and Level3 as our bandwidth carriers and operate redundant Vyatta edge-routers with auto fail over BGP ensure continuous internet connectivity. We back our physical network further by offering a 99.90% uptime guarantee. If we fail to provide 99.90% service uptime in any given month, you will be issued a 50% credit towards your invoice.\r\n\r\n**Datacenter:**\r\n\r\nOur servers are housed within a private purpose built facility at Sheffield, UK. Aside from the power and network advantages, this facility also provides Water chilled Evaporative Cooling rather than traditional method air conditioning systems, this along with Hot Aile Containment ensures systems run at there designed operating temperatures all of the time and also reduces our carbon footprint. Better yet, we’re a ten minute drive away from physical access to our servers, meaning if we need to access them, we can do so easily.\r\n\r\n**Hardware:**\r\n\r\nWe only use tried and trusted brand name hardware. Expect to see recently commissioned Supermicro Servers and Motherboards, Xeon E3 1240v3 processors, Kingston RAM and 6Gbps Seagate Enterprise hard drives in a RAID-10 array. We own all of our hardware and it’s free of any lease or finance arrangements. We aren’t a middle man and invested thousands up front into our hardware to offer you the best deals. We have spares at hand in case of hardware failures and can often have a replacement completed in as little as an hour. We run KVM as the underlying virtualization, offering a near native experience and true performance with features such as pre BIOS level VNC access, custom kernel support and fully encrypted disks.\r\n\r\n**Support:**\r\n\r\nWe monitor our hardware and network 24/7 and are responsible for the administration and timely repair of both. We do not offer support to end users for anything at an operating system level (Excluding customers with a Managed subscription). Your service is your responsibility. Abuse of our hardware or network is not tolerated and we proudly reserve the right to suspend without warning if overall performance is affected by your service. This policy ensures quality for our loyal customers. Our UK based customer services team are available to assist you between the hours of 08:00 and 17:00 GMT Monday to Friday. Outside of these hours, both on site and remote engineers watch over our stuff and respond if and when required. Sleep well."}