{"id": 107778, "date": "2017-03-06 15:03:59", "user": "qps", "post": "Continuing on the success of our previous LowEndBox and LowEndTalk offers, [QuickPacket](https://www.quickpacket.com) is pleased to offer our popular Xeon E3-1270 server out of Los Angeles, CA.\r\n\r\n**Xeon E3-1270**\r\n\r\n- Quad Core 3.4 GHz / 8 MB Cache / HyperThreading (8 Threads!)\r\n- 16 GB RAM standard (32 GB RAM available for $20 additional)\r\n- 1 TB Serial ATA Hard Drive or 128 GB SSD\r\n- 5 IP Addresses on Private VLAN with Reverse DNS\r\n- /64 IPv6 Addresses upon request (More available with justification)\r\n- Dedicated KVM over IP / IPMI (uses 1 IP address)\r\n- 20 TB Bandwidth / 1 Gbps Port \r\n- Unmanaged\r\n- Located in Los Angeles, CA\r\n\r\n**$40 per month - Click the location link to order: [Los Angeles](https://www.quickpacket.com/billing/cart.php?a=add&amp;pid=119&amp;promocode=C3Z5WKSTN0) (COUPON CODE C3Z5WKSTN0)**\r\n\r\nDDoS filtering is available for $25 per month per server.  We currently utilize Voxility in Los Angeles for filtering.\r\n\r\nQuickPacket also offers a number of software licenses as add-ons:\r\n\r\n- Windows Server Standard (single CPU) - $17.50/month\r\n- cPanel - VPS $11/month - Server $29.99/month\r\n- KernelCare - $2/month\r\n- CloudLinux - $9/month with cPanel, $11/month without\r\n- Softaculous - VPS $1/month - Server $2/month\r\n- WHMCS - Branded $12.80/month - Unbranded $14.80/month\r\n- DirectAdmin - VPS $5/month - Server $9/month\r\n\r\nFurther details about QuickPacket and the promo offer:\r\n\r\n- QuickPacket was founded in 2003 and is a registered LLC in North Carolina.\r\n- Network providers include PCCW, Cogent, TSS (Hibernia, GTT, Telia, QuadraNet and peering) ([AS46261](http://bgp.he.net/AS46261)).\r\n- Looking Glass/Test File: [Los Angeles](http://lg.lax.quickpacket.com)\r\n- Los Angeles servers are located in 530 W 6th St.\r\n- Warez-related, Bulk Mail, and Spam-related activities are strictly forbidden. Please review our [Terms of Service](http://www.quickpacket.com/tos.html) prior to ordering.\r\n- We accept PayPal, VISA, Mastercard, American Express, Discover, and Bitcoin (through BitPay) payments.\r\n- Coupon code is mentioned above and is embedded in the order links provided. The discounted price will be reflected on the second page of the order form.\r\n- Promotional pricing is available for new customers or existing customers adding additional servers. Promotional offers cannot be combined with other promotional offers.\r\n- Please contact our sales department with any questions prior to ordering. \r\n\r\nThanks for your interest!"}