{"id": 10814, "date": "2013-05-29 18:42:47", "user": "NYCServers_Nick", "post": "**DaringHost.com - We Dare To Be Different**\r\n\r\n**Daring Host** understands that the internet world never shuts down or closes. It runs constantly: 24x7, 365 days of the year without interruptions. We understand that your website needs to be reached by the world every second of the day. This is why **Daring Host's** **goal is to provide you with the most stable and reliable VPS service you've ever experienced**. All of our plans are scalable. We offer you the option to upgrade individual parts of your plan at anytime. We also offer you the option to upgrade your management plan in case you need more help than you orginally expected.\r\n\r\n**Daring Host** was founded in April of 2010, and has not looked back since. We have been here day in and day out for the past year and a half, without breaks. We take pride in helping our clients grow and becoming successful. We are not afraid to go the extra mile if it means our clients will have a better chance at successfully running their website or business. \r\n\r\n**Why pick Daring Host over the others?**\r\n\r\n&gt;**Experience** - We have been in business since 2010. We know what works, how it works, and why it works. Don't let your website or business fail due to incompetent hosting providers.\r\n\r\n&gt;**Scalibility** - Each plan we offer is scalable. You can upgrade your configuration at anytime without any downtime or IP address changes. It's really that easy!\r\n\r\n&gt;**Customization** - Do our pre-made plans not match your requirements? No problem. We offer fully customizable plans to exactly meet your requirements.\r\n\r\n&gt;**Reliability** - We believe that no corners should be cut in our business. We use top of the line enterprise grade Supermicro servers on a rock solid network.\r\n\r\n&gt;**Support** - Tired of waiting hours for support to reply to your ticket? That won't be a problem at DaringHost. Our support team is staffed 24x7x365 with knowledgeable technicians to help with any support related tasks.\r\n\r\nBelow is our **exclusive LowEndTalk** offer:\r\n\r\n--------------------------------------------------\r\n&gt; **VPS Plan Includes**:\r\n\r\n&gt; Instant Setup\r\n\r\n&gt; SolusVM Control Panel\r\n\r\n&gt; Rock Solid Network (100% Network Uptime Guarantee!)\r\n\r\n&gt; Reliable and Competent Support Staff\r\n\r\n&gt; Add Full VPS Management For Only $15/month\r\n\r\n\r\n--------------------------------------------------\r\n\r\n\r\n--------------------------------------------------\r\n&gt; **LEB 1GB Ram Special - $5.00 Per Month or $25 Per Year**\r\n\r\n&gt;CPU: 2 Core @ 3.3GHz\r\n\r\n&gt;Disk Space: 30GB\r\n\r\n&gt;Dedicated Ram: 1GB\r\n\r\n&gt;Burstable Ram: 2GB\r\n\r\n&gt;Bandwidth: 2000GB\r\n\r\n&gt;IPv4 Addresses: 1\r\n\r\n&gt;Management: Unmanaged\r\n\r\n&gt;**Price: $5.00 Per Month or $25 Per Year**\r\n\r\n&gt;**Order:** [Click Here To Order](http://www.daringhost.com/billing/cart.php?gid=30)\r\n \r\n--------------------------------------------------\r\n\r\n**Free VPS Migration** \r\n\r\nWant to switch from another host to DaringHost? No worries! We offer free VPS transfers with every plan. We will move and restore your VPS on our servers at no extra cost. Just open a support ticket after you place an order.\r\n\r\n \r\n**Datacenter + Network**:\r\n \r\nOur VPS nodes are located in Steadfast's 725 S Wells Facility (Chicago, Illinois) \r\n\r\nOur VPS nodes are connected to a rock solid fully redundant BGP4 network (AS32748 - Steadfast Networks) consisting of multiple Tier 1 bandwidth providers. \r\n\r\nTest IP Address: 208.100.4.54 \r\n\r\n**Contact Us**\r\n\r\nLive Chat: [Visit Our Website](http://daringhost.com/)\r\n\r\n[Click Here](http://daringhost.com/billing/submitticket.php?step=2&amp;deptid=1) To Open a Pre-Sale Support Ticket\r\n\r\nSkype - Daringhost\r\n\r\nEmail - support@daringhost.com"}