{"id": 10946, "date": "2013-06-04 17:57:44", "user": "HalfEatenPie", "post": "Long time no see LET! \r\n \r\nYou asked for it?  We have it!  Catalyst now provides KVM!  We’ve got a fantastic line started up and we’re planning on continuing our quality of support and services you’ve loved!\r\n \r\nFor those of you guys who don’t know us, Catalyst Host was started by Ryan Arp (@ryanarp ) and the Jarland Donnell (@jarland ) focused on providing our brand of hosting.  We just want you all to know that we’re more than just another provider, we are customers too.  We know what customers want, and we focus on exactly that!  Just letting you all know, we’re also Catalyst customers ourselves!  We want the best out of everything we get, and we’ll work hard to make sure you get the best we can give!  \r\n \r\nWe’d just like to thank our loyal customers for helping us become where we are now!  \r\n \r\nIntroducing our latest node, TaylorSwift!  (Yeah buddy!)\r\n\r\nDual E5-2620&lt;br&gt;\r\n128 GB ECC RAM&lt;br&gt;\r\n6x 2TB SATA in HW RAID10&lt;br&gt;\r\n2x 240GB SSD in HW RAID1 for SSD Cache (Read and Write)&lt;br&gt;\r\n1Gbps Network (CoreXchange Dallas)&lt;br&gt;\r\nA/B Power and Network Redundancy&lt;br&gt;\r\n \r\nOur KVM Introductory offer is below!\r\n \r\n**Tall KVM**\r\n\r\nLocation: Dallas, Texas, USA&lt;br&gt;\r\n1 CPU Cores (E5-2620)&lt;br&gt;\r\n256MB RAM&lt;br&gt;\r\n15GB Storage&lt;br&gt;\r\n1TB Bandwidth at 1Gbps&lt;br&gt;\r\n$6.50/month&lt;br&gt;\r\n\r\nhttps://catalysthost.com/clientarea/cart.php?a=add&amp;pid=53 \r\n\r\n**Promo Code:** LET35\r\n \r\n\r\nThe promo code **LET35** provides 35% off for any of our other plans as well, and isn’t set to expire!  \r\n \r\n\r\nHere’s our OpenVZ Offer!\r\n \r\n**Tall OpenVZ**\r\n\r\nLocation: Dallas, Texas, USA&lt;br&gt;\r\n2 CPU Cores (E5-2620)&lt;br&gt;\r\n256MB RAM&lt;br&gt;\r\n128MB vSwap&lt;br&gt;\r\n30GB Storage&lt;br&gt;\r\n600GB Bandwidth at 1Gbps&lt;br&gt;\r\n$5.19/month&lt;br&gt;\r\n\r\nhttps://catalysthost.com/clientarea/cart.php?a=add&amp;pid=32 \r\n\r\n**Promo Code:** LET35\r\n \r\n**All Promotion Codes are Recurring FOR LIFE!**\r\n \r\nTest IP/File: http://192.211.54.101/test/\r\n \r\n&lt;h2&gt;About our Dallas Datacenter:&lt;/h2&gt;\r\n \r\nThe network behind our Dallas servers is multi-homed with multiple 10Gbit connections and redundant Juniper routing with HSRP failover. Network and hardware conditions are monitored 24/7/365. Spare hardware is always stocked and available on site. We utilize A+B power for redundancy in case of brownouts, which are rare in Dallas.\r\n \r\n&lt;h2&gt;What Makes Catalyst Host a Special Company?&lt;/h2&gt;\r\n \r\n“If you’re not going to do something right, don’t bother doing it.”\r\n \r\nWe seriously made this company for ourselves.  We wanted a service to our quality, and when we realized that what we were doing actually worked we decided that we shouldn’t keep it for ourselves.   We don’t settle for mediocre, we care about our clients, and in reality this isn’t about the money.    \r\n \r\nWe are not here to give you the most imaginary resources you can't use for the least dollar signs. We are here to give you the best quality, with what I estimate to be some of the least oversold nodes in our market. You have the peace of mind that you services are in good hands, that your service will operate as expected, and that your data will remain safe.\r\n \r\n&lt;h2&gt;Reviews&lt;/h2&gt;\r\nOur service really does speak for itself.  But here’s some reviews (the first one's about our new KVM system)!\r\n\r\nhttp://vpsboard.com/index.php?/topic/378-catalysthost-2gb-trenta-kvm-vps-review/\r\nhttp://www.lowendhelp.com/catalyst-host-review/\r\nhttp://lowendtalk.com/discussion/7953/catalyst-host-review/\r\nhttp://lowendtalk.com/discussion/6030/catalyst-host-review/\r\nhttp://lowendtalk.com/discussion/8454/my-five-month-review-of-catalysthost\r\nhttp://lowendtalk.com/discussion/8654/review-catalyst-host/\r\nhttp://www.lowendbox.com/blog/catalysthost-17year-128mb-openvz-and-7-2gb-in-dallas-texas/#comments\r\n \r\nThanks guys, and rock on!\r\n \r\nHalfEatenPie"}