{"id": 1169, "date": "2012-01-19 13:30:08", "user": "SrvisLLC", "post": "This is ErrantWeb's (techically) first offer on LowEndTalk. We are a new hosting provider with services being offered in Metro-Detroit. We want to provide the best for our customers and that is why we do manual reviews of each order that comes in to make sure that it is not fraudulent. This will help us and you when it comes to owning a VPS. The fact that we do manual reviews means that it cost us more money and can slow down your first order, but it also allows us to make sure that we don't get abusive users on our node, and it helps keep out the spammers.\r\n\r\nOur LowEndTalk plans are as listed below, if you would like to talk to us about a custom plan because you are not finding what you are looking for please open a sales ticket in our billing panel: https://www.errantweb.com/client/\r\n\r\n\r\nI/O Test Performed on the Node:\r\n`dd if=/dev/zero of=test bs=64k count=16k conv=fdatasync\r\n16384+0 records in\r\n16384+0 records out\r\n1073741824 bytes (1.1 GB) copied, 8.46736 s, 127 MB/s`\r\nI/O Test Performed on a VPS:\r\n` dd if=/dev/zero of=test bs=64k count=16k conv=fdatasync\r\n16384+0 records in\r\n16384+0 records out\r\n1073741824 bytes (1.1 GB) copied, 5.78707 s, 186 MB/s\r\n`\r\n\r\n\r\n**Plan 512MB:**\r\nGuaranteed-Ram: 512MB\r\nvSwap: 256MB\r\nRAID Storage: 25GB\r\nBandwidth: 100GB\r\nvCPU Cores: 1\r\nLocation: Metro-Detroit\r\n**Price: $6.50/m**\r\n_Promotion: 18.75% Off_\r\nhttps://www.errantweb.com/client/cart.php?a=add&amp;pid=2\r\n\r\n\r\n**Plan 256MB:**\r\nGuaranteed-Ram: 256MB\r\nvSwap: 128MB\r\nRAID Storage: 15GB\r\nBandwidth: 50GB\r\nvCPU Cores: 1\r\nLocation: Metro-Detroit\r\n**Price: $4.06/m**\r\n_Promotion: 18.75% Off_\r\nhttps://www.errantweb.com/client/cart.php?a=add&amp;pid=1\r\n\r\n**Coupon Code:**\r\n`LowEndTalk`\r\n\r\n_This code will take 18.75% off of any of our plans and is recurring._\r\n\r\nOur Terms of Service, Privacy Policy, and Acceptable Use Policy is at the bottom of every page on our website, and it is also avaliable in a PDF format. If you have any questions regarding our services please contact us via our billing panel in a sales ticket: https://www.errantweb.com/client/\r\n\r\nAll sales are being verified by a phone call, we will attempt a phone call to you and if you do not answer then you will get a email telling you to let us know when you are ready to accept the phone call. If you live in the United States then this phone verification system will automaticly occur as soon as you place your order.\r\n\r\nSome invoices are not being marked as paid currently, we are looking into this issue and will have it resolved shortly, if you have paid you do not need to worry, when we verify your order we will check for payment. "}