{"id": 119696, "date": "2017-07-18 14:40:37", "user": "mikho", "post": "I've been thinking along time about stepping up the game from shared hosting and add VPS as a service and after some work together with the guys at Virtualizor I can now proudly present the first package that I will offer.\r\n\r\nI'm reaching out for you guys to help me test the waters and provide valuable feedback before offering it to the public.\r\nAt first there will be only 30 servers available, the number might change up or down depending on how well the server performs. \r\n\r\n\r\nFollowing in the foot prints of LowEndSpirit you will get the same base deal as everyone else does: \r\n&gt; 20 (+1 ssh) ports forwarded. &lt;br /&gt;\r\n&gt; /112 IPv6  &lt;br /&gt;\r\n&gt; Haproxy domain name forwarding ([b]supporting HTTPS[/b]) &lt;br /&gt;\r\n&gt; Manual provisioning &lt;br /&gt;\r\n&gt; \r\n\r\n\r\nSome basic information about this deal:\r\n&lt;hr /&gt;\r\n&gt; Location: Falkenstein, Germany        &lt;br /&gt;\r\n&gt; RAM: 128 mb      \r\n&gt; Disk: 3 gb      \r\n&gt; Transfer: 300GB       \r\n&gt; Price: $4/year (prorata is used so price on first invoice could be different)      \r\n&gt; VPS management in WHMCS\r\n&gt; \r\n\r\n\r\n[Signup using this link](https://my.freecpanelsharedhosting.com/link.php?id=9)\r\n\r\nQuick Q &amp; A:\r\n===========\r\nQ. When will the next location be available? \r\nA. a month or two after initial feedback and any major issues has been resolved.\r\n\r\nQ. Why are you using that stupid domain name?\r\nA. It was once created as part of a joke but the name worked while offering shared hosting alone. It will be changed somewhere in the future.\r\n\r\nQ. Why are you using a default WHMCS template? \r\nA. The old template used broke when upgrading whmcs and adding the modified Virtualizor module and this was the fastest way to get going.\r\n    A new template is on the road map.\r\n\r\n\r\nI'm sure there are more questions, I'm more then happy to answerall of them.\r\n"}