{"id": 120809, "date": "2017-07-29 04:53:01", "user": "GM5", "post": "![](https://www.gomach5.com/assets/images/logo.png)\r\n\r\nHey there - We're back to provide more quality dedicated and virtual servers at incredibly affordable pricing.\r\n\r\nWe are colocated at Psychz in Los Angeles and fully own **all** of our hardware.\r\n\r\n**ALL** of the resources in our VPS's are completely dedicated except where explicitly stated.\r\n\r\n**KVM2G**\r\n\r\n    - 2GB DDR4 RAM   \r\n    - 30GB of RAID10 pure SSD storage    \r\n    - 1 CPU @ 3.5GHz (Fair share)   \r\n    - 1 Dedicated IP address and 1 IPv6 address    \r\n    - 1TB Bandwidth on 1Gbps port   \r\n    - 20Gbps of DDoS protection     \r\n    - Located in Los Angeles, California\r\n\r\n[**ORDER HERE**](https://manage.gomach5.com/cart.php?a=add&amp;pid=22&amp;promocode=LETKVM7)\r\n\r\n&lt;del&gt;$10&lt;/del&gt; **$7** per month -  use coupon **LETKVM7** to bring this down to just $7 recurring per month.\r\n\r\nVPS not for you? No problem we've got Dedicated Servers available too!\r\n\r\n\r\n&gt; **All of our Dedicated Servers Feature**\r\n&gt; \r\n&gt; - FREE 20Gbps Mitigation\r\n&gt; \r\n&gt; - Tier 1 Bandwidth Providers including CT, CN2, CU\r\n&gt; \r\n&gt; - 1 Gbps port as standard\r\n&gt; \r\n&gt; - /29 IPv4 (5 Usable) - /64 IPv6 (Upon request)\r\n&gt; \r\n&gt; - Free Hardware Replacement\r\n&gt; \r\n&gt; - KVMoIP on demand\r\n&gt; \r\n&gt; - And are 100% PIE approved ( @PieNotEvenEaten )\r\n&gt; \r\n&gt; **Location:** Los Angeles\r\n\r\nWe have limited stock of the following configuration up for grabs.\r\n\r\n    Dual L5420 (8 cores, 2.5Ghz, 12MB cache)    \r\n    16 GB RAM    \r\n    2x 500GB GB SATA 7200RPM\r\n    /29 IPv4 (DDoS Protected!)    \r\n    5 TB Bandwidth @ 1 Gbps    \r\n    $35/month\r\n\r\n[**ORDER HERE**](https://manage.gomach5.com/cart.php?a=add&amp;pid=12)\r\n\r\nNeed more bandwidth or perhaps you want more drives? No problem - we've got you covered.\r\n\r\n    Dual L5420 (8 cores, 2.5Ghz, 12MB cache)    \r\n    16 GB RAM    \r\n    2x 500GB GB SATA 7200RPM (Upgrade to 4x500GB SATA 7200RPM for just $7/mo extra)\r\n    /29 IPv4 (DDoS Protected!)    \r\n    10 TB Bandwidth @ 1 Gbps    \r\n    $40/month\r\n\r\n[**ORDER HERE**](https://manage.gomach5.com/cart.php?a=add&amp;pid=6)\r\n\r\nPlease note, if services are not paid for within 48 hours machines will be returned back to stock for others. Clients paying on an annual basis get 12 months for the price of 10. Contact sales for more information on this\r\n\r\n**Need more disk? No problem we have upgrades!**\r\n\r\n120 GB SSD - $10/mo (Added as an additional disk)\r\n1Tb Enterprise SATA - $10/mo (Added as an additional disk)\r\n\r\nBringYourOwnDisk! - $25 setup [Disk Replacements are client's responsibility]\r\n\r\n**== Information about ordering ==**\r\n\r\nProvisioning is guaranteed to be within 2 business days of ordering, not including holidays. However, the expected provisioning time is significantly less. If your server has not been provisioned at the end of the 2nd business day, you are entitled to a full refund.\r\n\r\nAny offers marked \"Special\" are for new clients only. Existing clients may order another server with us, but cannot be used to replace an existing service.\r\n\r\nWhile most of our dedicated servers have IPMI it is **not guaranteed** for our LE* offers. If this absolutely necessary for you then please contact sales@gomach5.com prior to purchasing and we will see what can be done.\r\n\r\n**== Questions? ==**\r\n\r\nWe will be answering questions through this thread or at sales@gomach5.com. Existing clients should use proper support channels as needed. All sales questions will be responded to within 24 hours.\r\n\r\nThank you!\r\n\r\nTest IP: http://la-lg.gomach5.com/\r\n\r\nWebsite: https://www.gomach5.com/\r\n\r\n\r\n&gt; @mackenzie10 said: Love it! I can definitely vouch for the great support and commitment to continued development of the service's feature set. I feel pretty lucky to have found gomach5 and it fits my needs perfect as a box for some code projects. I just wanted to show some support too!\r\n\r\n.\r\n\r\n&gt; @lukesUbuntu said: very fast deployment was super quick! so far so good\r\n\r\n.\r\n\r\n&gt; @doghouch said: Never tried a GoMach VPS before, but the shared hosting is good. Plus, I know that Jonchun puts a lot of effort, considering the fact that the support is near-to-instant. 100% recommended :)\r\n\r\n.\r\n \r\n&gt; @PieNotEvenEaten said: 100 percent PIE approved provider!\r\n \r\n.\r\n\r\n&gt; @jarland said: Can vouch for this guy. He's really giving 110% to provide great service.\r\n\r\n.\r\n\r\n&gt; @hawc said: They are some pretty sweet deals - and support is fantastic too. I get replies in under 10 minutes, and they exceed what I was expecting too.\r\n\r\n.\r\n\r\n&gt; @lontong said: Got mine @ $31. Extremely satisfied with the network performance. Would definitely recommend your services to everyone!\r\n\r\n.\r\n\r\n&gt; @vavai said: I pick a new one on Jan 1. jonchun are quite responsive. Server was up within 1 day. I got a little problem regarding bridge network on Debian 8/Proxmox network but jonchun help me within minutes. Quite satisfied so far both for support response and server performance.\r\n\r\n.\r\n\r\nWith so many happy clients, I'm sure you want to be one too!"}