{"id": 122321, "date": "2017-08-17 05:19:54", "user": "YourLastHost", "post": "We are **YourLastHost**, the only web host that **guarantees to be the very last web host that you will ever need**. \r\n\r\n**A few of our key features:**\r\n\r\n- 99.99% uptime guarantee\r\n- 90 day money back guarantee. (one of the longest in the industry!)\r\n- Proactive service status checking. (yes, really!)\r\n- Live chat help &amp; support\r\n- Over 1 year in business\r\n- Great reviews &amp; stellar reputation **[check us out](http://yourlasthost.repuso.com)**\r\n- 24/7 Support\r\n- Voxility 500GBPS DDoS Protection (Jacksonville only)\r\n- Free VPS migrations -- Switch between any of our great locations!\r\n\r\n**Special LowEndTalk KVM VPS Plans - Jacksonville, Florida &amp; Los Angeles, California**\r\n\r\n**LET KVM 256**\r\n\r\n- 256 MB RAM\r\n- 256 MB vSwap (Linux only)\r\n- 15 GB RAID-10 Storage\r\n- 1.5 TB Bandwidth\r\n- 1 IPv4 Address\r\n- Pricing: Just $6.95/qtr ($2.31/m)\r\n- Extra Annual Discount: $12.95/yr (just $1.24/m)\r\n- **[Order here](https://clients.yourlasthost.com/cart.php?a=add&amp;pid=94)**\r\n\r\n**LET KVM 512**\r\n\r\n- 512 MB RAM\r\n- 512 MB vSwap (Linux only)\r\n- 25 GB RAID-10 Storagek\r\n- 3 TB Bandwidth\r\n- 1 IPv4 Address\r\n- Pricing: Just $3.49/m\r\n- Extra Annual Discount: $23.95/yr (just $1.99/m)\r\n- **[Order here](https://clients.yourlasthost.com/cart.php?a=add&amp;pid=95)** \r\n\r\n**What Others Are Saying**\r\n\r\n**[Trayton;9879688](http://www.webhostingtalk.com/showthread.php?t=1644275):** Just signed up tonight, due to issues with another host (will remain un-named at this point).  Very good replies usually had a reply within the hour if not sooner to any of my updates in a ticket (even pre-sales).  Very friendly and welcoming.  They even transfered my accounts from the previous host very quickly and got me all setup and no downtime for my clients :)\r\n\r\n-- A+ So far I'll update later as to how things are in a few weeks.\r\n\r\n-- I've been with these folks now since April 20th 2017,\r\n\r\n-- The transition was very smooth, they were very quick to respond to any questions I had and I did open about 3 tickets I believe (all just questions mostly on how to transfer my clients with minimal downtime.\r\n\r\n-- There were also a few other questions related to getting things setup and keeping customers happy.  In all of these their responses were in a timely manor, very educated and helpful.\r\n\r\n-- They were very kind and easy with me and did a lot of initial hand holding\r\n\r\n-- Billing seems to be on point and no fluctuation or anything (I know this isn't something mentioned much in reviews but its nice to have familiarity and not worry about jumps in costs etc.\r\n\r\n-- I'm very happy with the service and would recommend.  If anyone has any specific questions or concerns feel free to PM me and I'll do my best to respond appropriately.\r\n\r\nYour Last Host -&gt; thanks for having me as a customer and I do appreciate your time and effort you took with me to get things started hopefully I wasn't to annoying :)\r\n\r\nHave thoughts about YourLastHost? Let us know! :)"}