{"id": 122636, "date": "2017-08-21 14:38:48", "user": "perennate", "post": "[LunaNode](https://lunanode.com) is the #1 cloud platform within 400,000 kilometers of earth, with locations in Toronto, Montreal, and Roubaix. Our [extensive array of cloud features](https://www.lunanode.com/features) significantly simplifies the process of managing your servers.\r\n\r\n&lt;b&gt;Promotion&lt;/b&gt;\r\n\r\nIn addition to bringing those of you in North America the total solar eclipse today, we are also tripling the credit for new customers!\r\n\r\nThat means that if you pay $10, then you get an extra $20 in promotional credit for a total $30. The offer is limited to $20 in promotional credit, so if you pay $20, then you will get a total of $40 credit.\r\n\r\nSimply &lt;a href=\"https://dynamic.lunanode.com/signup\"&gt;sign up for an account&lt;/a&gt;,\r\nand then enter ECLIPSE for the promotion code when making your payment.\r\n\r\n&lt;b&gt;Features&lt;/b&gt;\r\n\r\n* &lt;b&gt;Snapshots&lt;/b&gt;: whether you use it for templating or for backups, it's hard to live without snapshots once you get used to them. We support &lt;b&gt;live snapshots&lt;/b&gt; across our platform, where you can capture the disk state of a running virtual machine (no need to shut it off!); a copy-on-write system ensures data consistency.\r\n* &lt;b&gt;Firewalls&lt;/b&gt;: security groups allow you to define restrictions on ingress and egress traffic in the cloud. You can put several VMs into one security group so that when you find that you need to update your firewall rules, you only need to update them in one place. The awesome thing about security groups is that you can authorize traffic specifically to other security groups! For example, you can have a frontend security group for your web application servers and a backend security group for your database cluster; then, you can isolate your database cluster from everything but the web application servers by adding a rule allowing traffic from the frontend group into the backend group. This is great because when you spin up more web application servers, as soon as you add those VMs to the frontend group, they will be able to connect to the backend group.\r\n* &lt;b&gt;Volumes (Block Storage)&lt;/b&gt;: block storage enables scaling your application's storage requirements independently from its compute requirements. You can allocate disk space on a storage cluster that is managed independently from the VM host nodes. This disk space can then be attached and detached from volumes on the fly (you can mount it on your VM with e.g. mount /dev/vdb /mnt/data), or used as the root partition of a VM. So, if you need 200 GB of disk space on a 512 MB VM, you can just create a volume for it. If suddenly tomorrow you need 400 GB, it's easy to extend the volume size while using the same VM plan. Volume pricing is just $0.03/GB/mo, or $0.0000417/GB/hr.\r\n* &lt;b&gt;Floating IPs&lt;/b&gt;: with floating IPs, the network interface on a VM is configured with an internal IP address, and an external IP is associated with the internal IP via direct 1:1 NAT. You can easily switch over the external IP from one VM to another from the panel or API without having to update the network configuration on any VM. Use cases include failover and zero-downtime upgrades.\r\n* &lt;b&gt;Bandwidth Pool&lt;/b&gt;: rather than tying the bandwidth allocation for a VM directly to that VM's traffic usage, we tie it to a per-region account pool. If you have three VMs in the same region, each with a 1 TB bandwidth allocation, then we simply give you 3 TB total in that region. So if your traffic pattern changes one month and 90% of the traffic all gets used on one VM, that's fine! Additionally, our affordable &lt;b&gt;$0.003/GB&lt;/b&gt; pricing for traffic usage in excess of your allocation means that you don't have to worry about figuring out how much bandwidth you'll use in advance.\r\n* &lt;b&gt;Load Balancers&lt;/b&gt;: our new load balancing platform is free except bandwidth costs. TCP, HTTP, and HTTPS are supported for both connections from users to the load balancer and for connections from the load balancer to your VMs. With HTTPS, you can either manually input certificate/key data, or you can opt to have certificates automatically managed via Let's Encrypt. Once your load balancer is set up, you can associate a monitor to it so that VMs are removed from the load balancer if they go offline. You can listen on an arbitrary set of ports, with different protocols and backend VMs for each port, so you can use the same external IP for HTTP, HTTPS, SMTP, IMAP, etc.\r\n\r\n&lt;b&gt;Pricing&lt;/b&gt;\r\n\r\nWe have two sets of plans, the second has a higher memory-to-CPU ratio. All of our services are KVM with 1gbps port speed.\r\n\r\n* SSD 512: 512 MB RAM, 1 vCPU, 15 GB disk, 1 TB bandwidth for $0.0063/hr ($4.5/mo)\r\n* SSD 1024: 1024 MB RAM, 2 vCPU, 20 GB disk, 2 TB bandwidth for $0.0097/hr ($7/mo)\r\n* SSD 1024 (high-memory): 1024 MB RAM, 1 vCPU, 15 GB disk, 1 TB bandwidth for $0.0069/hr ($4.97/mo)\r\n* SSD 2048 (high-memory): 2048 MB RAM, 1 vCPU, 20 GB disk, 2 TB bandwidth for $0.0097/hr ($7/mo)\r\n\r\n&lt;a href=\"https://dynamic.lunanode.com/info\"&gt;See pricing table&lt;/a&gt; or &lt;a href=\"https://lunanode.com\"&gt;get started now&lt;/a&gt;!\r\n\r\n&lt;b&gt;More Features&lt;/b&gt;\r\n\r\n* &lt;b&gt;Startup Scripts / User Data&lt;/b&gt;: create bash scripts or cloud-init configuration to run on the VM the first time it boots. You can also use this system to pass custom user data to the VM, which software on the VM can then retrieve from http://169.254.169.254/latest/user-data.\r\n* &lt;b&gt;Affinity Groups&lt;/b&gt;: sometimes, you prefer to have your VMs on different servers so that a host node failure can only take down one VM. Other times, you want them all on the same server so that inter-VM communication has minimal latency. Affinity groups support both of these cases: when you provision VMs into an affinity group, the system ensures that the VM is provisioned on a host node that satisfies your affinity preference ('affinity' for same node or 'anti-affinity' for different nodes).\r\n* &lt;b&gt;DNS&lt;/b&gt;: customers can host their domains on our advanced DNS platform, which supports geo-targeting and automatic failover.\r\n* &lt;b&gt;Uptime Monitoring&lt;/b&gt;: monitor your services using ICMP, TCP, HTTP, and DNS checks so that you get an e-mail, SMS message, or phone call if they go offline.\r\n* &lt;b&gt;E-mail Hosting&lt;/b&gt;: we provide a basic webmail+IMAPS/SMTPS e-mail hosting platform if you need a place to host e-mail for your domain. The first GB of storage and first 5,000 outgoing e-mails per month are free for LunaNode customers. Additional storage is $0.2/GB, and additional e-mails are $0.1 per 1,000 messages.\r\n\r\n&lt;b&gt;Locations&lt;/b&gt;\r\n\r\n* Toronto - 245 Consumers Rd 300: http://toronto-test.lunanode.com/100MB.test\r\n* Montreal - Beauharnois - OVH BHS: http://montreal-test.lunanode.com/100MB.test\r\n* Roubaix, FR - OVH RBX: http://rbx-test.lunanode.com/100MB.test\r\n\r\n&lt;b&gt;&lt;a href=\"https://lunanode.com/\"&gt;Get started now!&lt;/a&gt;&lt;/b&gt;"}