{"id": 123698, "date": "2017-09-03 16:04:18", "user": "VPSlices", "post": "Hello,\r\n\r\nThis is Karim from VPSlices LTD, we are fairly a new company, but that doesn't change the fact that we provide quality service and we care about our customers.\r\n\r\n#### Current Plans (prices are VAT incl.)\r\n\r\n* **OVZ STORAGE 1 - 1 vCore @ 3.5 Ghz, 250 GB HDD, 1 GB DDR4 RAM, 1 IPv4, 3 TB @ 100 Mbps - £4.99/m**\r\n* * New Jersey, US: https://my.vpslices.com/cart.php?a=add&amp;pid=16\r\n* * Moscow, RU: https://my.vpslices.com/cart.php?a=add&amp;pid=20\r\n\r\n* **OVZ MICRO - 1 vCore @ 3.5 Ghz, 10 GB SSD, 256 MB DDR4 RAM, 1 IPv4, 1 TB @ 100 Mbps - £1.00/m (annually)** \r\n* * New Jersey, US: https://my.vpslices.com/cart.php?a=add&amp;pid=18\r\n* * Moscow, RU: https://my.vpslices.com/cart.php?a=add&amp;pid=22\r\n\r\n* **OVZ MINI - 1 vCore @ 3.5 Ghz, 25 GB SSD, 512 MB DDR4 RAM, 1 IPv4, 1 TB @ 100 Mbps - £1.50/m (quarterly)** \r\n* * New Jersey, US: https://my.vpslices.com/cart.php?a=add&amp;pid=19\r\n* * Moscow, RU: https://my.vpslices.com/cart.php?a=add&amp;pid=23\r\n\r\n* **More of our promotional plans can be found [here](https://my.vpslices.com/cart.php?gid=4).**\r\n\r\n* We have higher specification plans, visit our website at https://vpslices.com and choose whatever plan that suits your needs.\r\n\r\n\r\n#### What we provide with each VPS\r\n\r\n* Semi Managed: Our techs will help you with managing your VM.\r\n* DDoS Protection: We offer free 50 Gbps DDoS protection with our USA plans.\r\n* 30 Minutes Support: We usually reply to tickets within 30 minutes.\r\n* Instant Deploy: Just order and get the VM running in seconds.\r\n* Clean IPv4: All of the IPs provided with our service is clean and isn't listed anywhere.\r\n* Extra IPv4: We offer extra IPv4 addresses for £1.00 per IP, up to 5 IP addresses per VM.\r\n* rDNS: We will change the reverse DNS for your IP to whatever you like for free.\r\n* Extra Mile!: We will go the extra mile to assist you, always!\r\n* Love: We love our customers, hugs and kisses can be requested via live chat.\r\n\r\n#### We accept:\r\n\r\n* PayPal\r\n* Bitcoin\r\n\r\n_We refund any unsatisfied client on request within 7 days of the first invoice, please read the refund policy in ToS for more information_\r\n\r\n#### Legal Documents:\r\n\r\n* ToS: https://vpslices.com/tos.html\r\n* AUP: https://vpslices.com/aup.html\r\n* PP: https://vpslices.com/privacy.html\r\n\r\n#### Looking for a custom quote or having a question about something? Contact us!\r\n\r\nThank you!"}