{"id": 125411, "date": "2017-09-23 06:11:14", "user": "Treudler", "post": "Hello LET!\r\nWe are alive and ready to show you off some new offers! \r\n\r\nAs you maybe know, we are growing so fast (much more than expected and planned on our roadmap). We now have 10 active locations (Gravelines, Roubaix, Strasbourg, Frankfurt, London, Warsaw, Beauharnois, Sydney, Singapore) and more are coming during this 2017! Our main mission is to provide low-end prices for high-end services.\r\n\r\n###Just a little note regarding our features:\r\n  * 10 available locations;\r\n  * Virtualizor control panel;\r\n  * OVH PRO/GAME DDoS protection;\r\n  * Custom made IP(s) management interface (you can add or remove an rDNS, adjust the GAME firewall (adding per game/service profiles), set new rules in the VAC (upstream level firewall), activate or deactivate the permanent mitigation or see if your IP is under forced mitigation (which means that you are under attack and all the traffic is routed throught the firewall);\r\n  * SSH keys installation (using Virtualizor);\r\n  * Custom ISO uploading system (currently in BETA, may be not available some times);\r\n  * 60s activation (on normal conditions, if IPs are out stock there may be some delays);\r\n  * A lot of Operating Systems are available with 1-click installation;\r\n  * IPv4, IPv6 (1 each VM for now, subnets will come in the next weeks) and internal IP are always included with your server;\r\n  * Triple replicated nightly backups  (GRA-RBX-BHS) and weekly archive to C14 underground storage;\r\n\r\n**We just launched our KVM-SSD line also in London and Limburg (Frankfurt, Germany) for the same prices as always (starting from as little as 2,93€/m).** Powered by SSD, Intel Xeon and up to 10Gbps as burst (unlimited traffic).  Check them out (24H delivery) -\r\n https://www.treudler.net/virtual-server/ssd/ or https://app.treudler.net/cart.php?gid=25\r\n\r\n*In addition, to thanks all of you, we decided to make some new deals!*\r\n    \r\n**VPS-GAME-SYD-WTH** (OVH Game, Sydney - APAC) (30 available)\r\n2 GB RAM DDR4 ECC 2400 MHz\r\n1 vCore @ i7 6700K\r\n30 GB SSD \r\n1 Gbps Port (250 GB traffic, afterwards 10mbps outbound, reset on 1st of each month)\r\n5€/mo or 12€/3mo or 20€/6mo or 35€/12mo!\r\n**Order it now!** https://app.treudler.net/cart.php?a=add&amp;pid=246\r\n\r\n**VPS-GAME-SGP-WTH** (OVH Game, Singapore - APAC) (30 available)\r\n2 GB RAM DDR4 ECC 2400 MHz\r\n1 vCore @ i7 6700K\r\n30 GB SSD\r\n1 Gbps Port (250 GB traffic, afterwards 10mbps outbound, reset on 1st of each month)\r\n5€/mo or 12€/3mo or 20€/6mo or 35€/12mo!\r\nOrder it now! https://app.treudler.net/cart.php?a=add&amp;pid=245\r\n\r\n**VPS-GAME-SBG-WTH** (OVH Game, Strasbourg - EU) (28  available)\r\n1 GB RAM DDR4 ECC 2400 MHz\r\n½ vCore @ i7 6700K 4.0-4.4 GHz\r\n20 GB SSD\r\n1 Gbps Port\r\n3€/mo or 15€/6mo\r\n**Order it now!** https://app.treudler.net/cart.php?a=add&amp;pid=254\r\n\r\n**VPS-SSD-LON-WTH** (HydraCom, London) (23 available)\r\n1 GB RAM DDR4 ECC 2400 MHz\r\n1 vCore @ Xeon E3 1240v6 3.7-4.1 GHz\r\n20 GB SSD\r\n1 Gbps Port\r\n3€/mo or 15€/6mo\r\n**Order it now!** https://app.treudler.net/cart.php?a=add&amp;pid=253\r\n\r\n###Frequently Asked Questions - FAQ\r\nQ. What type of virtualization do you use? For VPS-* we use OpenVZ meanwhile for KVM-* and vDEDI-* we use KVM. \r\n\r\nQ. Are my resources dedicated? Yes, your resources are fully dedicated to you, that means you can use them fully at any time. Otherwise we apply a fair-use policy to CPUs (if you need to use 100% of your CPU H24/7, you can simply buy a vDEDI where CPUs are fully DEDICATED).\r\n\r\nQ. Are your services monitored? Yes, all our systems are monitored by our technical engineers all the day and alerts are setuped to ring when an issue is detected.\r\n\r\nQ. Is the traffic really unmetered? Yes, we love (legit) traffic leaving or entering our network. Of course nothing illegal (refer to our Terms of Service for more about that) is permitted but DMCA is ignored here. Traffic limits are applied only to our APAC plans and terms are specified in the product description.\r\n\r\nQ. What are the available payment gateways? Actually you can pay with PayPal (fast and secure), bank transfer, CoinGate (BTC/Altcoins) or PaySafeCard. If you choose to pay by bank transfer or PSC, delivery time may be delayed. Meanwhile, if you use PayPal as your gateway, your VPS will be delivered in a few minutes (in normal conditions). \r\n\r\nQ. Do you allow torrenting? No, torrents or any other application that may lead to our node stability are highly forbidden.\r\n\r\n###Useful links\r\nWebsite: https://www.treudler.net/\r\nStatus page: https://www.treudler-status.net/\r\nLegal disclosure: https://www.treudler.net/legal\r\nTerms of Service: https://www.treudler.net/terms-of-service\r\n\r\n![](https://cdn.treudler.net/web/logo/virtualizor-noc.png)\r\n\r\n*If you have any other question, just leave us a PM here or send an email to support@treudler.net! Thank you &lt;3*\r\n\r\n"}