{"id": 125588, "date": "2017-09-25 01:40:22", "user": "IonSwitch", "post": "Don't tell @IonSwitch_Stan, but I smuggled some NVME into our datacenter in a shiny new Dell R620. We've had some amazing feedback about the performance of our existing SSD offerings, lets see how folks like some real servers E5 based hosts.  We're really proud of our new 10GB active/active core, and want to bring NVME to the Seattle area. We may have also accidentally bought a full rack, so hit us up if you need colo.  \r\n\r\n[IonSwitch, LLC](https://www.ionswitch.com) is an affordable quality host based in Seattle, WA. Our team of multiple professionals who are heavily experienced in the network and hosting field has provided private hosting to partners. We offer a fairly uncommon location in Seattle, WA (at least in the low-end space), with a focus on fully redundant enterprise hardware and a very premium network with multiple peering links into our edge, resulting in high-end reliability at a very competitive price. We operate our own BGP Network (AS395970), which consists of Telia, Spectrum (Wave Broadband), Cogent, Hurricane Electric, and direct peering with over 100+ providers, some prime examples being Google, Amazon, TELUS, Dropbox, Google, and many more!\r\n\r\nHypervisor Specs:\r\n\r\n-2x Intel Xeon E5-2670 CPU  \r\n-128GB RAM  \r\n-2x1TB Samsung 960 EVOs  \r\n-RAID1  \r\n-10Gbps uplink \r\n  \r\nNETWORK INFORMATION:  \r\nSabey Intergate West - Seattle, WA, United States  \r\n- Test IPv4: 66.11.126.103  \r\n- Test IPv6: 2605:fb80:e000:09b2::1  \r\n- Test file: http://lg.ionswitch.com/static/100MB.test  \r\n- Looking glass: http://lg.ionswitch.com/  \r\n- AS395970\r\n  \r\nOFFERS:  \r\n  \r\n-512MB RAM  \r\n-1x vCPU  \r\n-5GB NVMe SSD  \r\n-500GB Transfer  \r\n-1Gbps Uplink  \r\n-1x IPv4  \r\n-/64 IPv6  \r\n-KVM/Virtualizor  \r\n-Coupon: None needed!  \r\n-$22.50/year  \r\n-Order Link https://clients.ionswitch.com/cart.php?a=add&amp;pid=23  \r\n  \r\n-1GB RAM  \r\n-1x vCPU  \r\n-10GB NVMe SSD  \r\n-1TB transfer  \r\n-1Gbps uplink  \r\n-1x IPv4  \r\n-/64 IPv6  \r\n-KVM/Virtualizor  \r\n-Coupon: None needed!  \r\n-$4.50/month  \r\n-$45.00/year (2 Months Free)  \r\n-Order link https://clients.ionswitch.com/cart.php?a=add&amp;pid=20  "}