{"id": 126848, "date": "2017-10-11 10:28:48", "user": "OnApp_Terry", "post": "A special to kick off a 'do-good' program we're launching.\r\n\r\nCDN.net Giveabit is a new program, where each month we'll be donating 10% of a client's first payment to a [tech related project](https://www.globalgiving.org/dy/v2/content/search.html?vo=true&amp;hl=true&amp;fq=cb01_themeName_ms%3ATechnology%7C&amp;q=) on [GlobalGiving](https://www.globalgiving.org). The 1st of each month we will produce a transparency report, showing which projects we have supported. Our customers won't need to opt in to anything - it's something we'll be doing by default.\r\n\r\n**The Details**\r\n\r\n&lt;ul&gt;\r\n&lt;li&gt;Each plan comes with 1 TB of bandwidth.&lt;/li&gt;\r\n&lt;li&gt;Manage through HostBill or direct with OnApp.&lt;/li&gt;\r\n&lt;li&gt;Static resources only - no live streaming available.&lt;/li&gt;\r\n&lt;li&gt;Unlimited CDN zones can be created.&lt;/li&gt;\r\n&lt;li&gt;SSL supported - shared or you can provide your own&lt;/li&gt;\r\n&lt;/ul&gt;\r\n\r\n**Worldwide CDN**  \r\n10 Total PoPs  \r\nAmsterdam, Ashburn, London, Milan, Portland, Provo, Santa Clara, Sao Paulo, Singapore, Sydney  \r\nPing/Traceroute: 633205012.r.worldcdn.net  \r\nPrice: $5 a month  \r\nReady to order? [Worldwide CDN](https://hb.cdn.net/?cmd=cart&amp;action=add&amp;id=41)  \r\n\r\n**European CDN**  \r\n12 Total PoPs, 8 cities  \r\nAmsterdam x2, Budapest, Frankfurt, Lviv x2, London x3, Milan, Paris, Sheffield  \r\nPing/Traceroute:  823407910.r.worldcdn.net  \r\nPrice: $5 a month  \r\nReady to order? [European CDN](https://hb.cdn.net/?cmd=cart&amp;action=add&amp;id=56)  \r\n\r\n**USA CDN**  \r\n14 total PoPs, 8 cities  \r\nAshburn x3, Atlanta, Chicago, Dallas x2, Newark x2, Salt Lake City x2, Santa Clara x2, Seattle  \r\nPing/Traceroute:  333741869.r.worldcdn.net  \r\nPrice: $5 a month  \r\nReady to order? [USA CDN](https://hb.cdn.net/?cmd=cart&amp;action=add&amp;id=55)  \r\n\r\n**Why use a CDN?**  \r\nA few reasons: better worldwide performance. Reduce resource consumption on your server. Reduce bandwidth usage on your server.\r\n\r\n**Do you have PoPs in China?**  \r\nYes, we do! You'll need to provide an ICP license, at which point we can create a custom plan including PoPs in China.\r\n\r\n**Where else do you have PoPs?**  \r\nWe use the OnApp federation for our infrastructure and have a little over 160 PoPs worldwide. Every continent but Antartica!\r\n\r\n**Do you do PAYG CDN?**  \r\nUnfortunately no. We need to sell at a certain price to ensure the cost of support is covered. Likewise, a CDN is most effective when a site has steady traffic. If your site only has a small amount of traffic, I actually suggest focusing on optimizing the code, and images before implementing a CDN.\r\n\r\nAny questions? Looking for a specific PoP? I'm flexible - Ping me: t@cdn.net"}