{"id": 12775, "date": "2013-08-18 14:17:27", "user": "RichardLeik", "post": "![Armorshark](http://armorshark.com/assets/img/logo.png)  \r\n\r\nRead a few of our client reviews and discover why Armorshark is a match for your VPS needs:  \r\n\r\n1. Trevor, via [WHT post](http://www.webhostingtalk.com/showpost.php?p=8671839&amp;postcount=6)   \r\n&gt; I personally never tried linode before, but I can vouch for a company called armorshark. I have 3 VPS servers with them for around 2 months without any issues. Prices are the cheapest I've seen in the industry by far as well. PM me if you want more information regarding my experience.\r\n&gt;  \r\n\r\n2. Reed H., client of 8 months, via support ticket\r\n&gt; I will no longer be requiring your VPS services beyond this billing cycle. Thank you for your excellent hosting and know that my decision is not reflective on your companies services. I have and will continue to refer people to your hosting solutions because they offer a cost effective balance of power and usability. Thanks for hosting my server.\r\n&gt; \r\n\r\n3. Konstantin Boyandin of VPSeer.com, test VPS, via support ticket\r\n&gt; I was surprised at the speeds of your disk and network. Your VPS offering is better than most of the other providers I've tested thus far. Keep up the excellent work.\r\n&gt; \r\n\r\n4. Gavin M., client of 4 months, via support ticket\r\n&gt; I'd like to use you guys again in the future as the site worked perfectly for the client\r\n&gt; \r\n\r\n5. Gerard D., client of 6 months, via support ticket\r\n&gt; You guys offer way more than Linode for way cheaper. I'll be sticking with armorshark for a long time.\r\n&gt;   \r\n\r\n6. Malam Minggu, client of 6 months, via support ticket\r\n&gt;Hello,\r\nI love to be your costumer, I have 4 services on you working perfectly...\r\n&gt;\r\n\r\n**Datacenter Information:** [Choopa datacenter](http://www.choopa.com) in Piscataway, New Jersey. The absolute fastest network speeds on the East Coast. Our server and network hardware are 100% owned.\r\n\r\nTo introduce ourselves to LET, we are offering a phenomenal 53% off promotion.   \r\nUse code: **HILET**  \r\n_____________________________________________________________\r\n**Shark 1536OVZ**  \r\n    1536Mb RAM  \r\n    1536Mb VSWAP  \r\n    4x E1245 CPU Cores  \r\n    50Gb RAID-10 SSD Storage (Intel 520, Samsung 840 Pro)  \r\n    3500Gb Premium Bandwidth  on a 1Gbps Port (No Cogent or Hurricane Electric)  \r\n    1 IPv4 Address (rDNS available!)  \r\n    16 IPv4 Addresses (rDNS available!)  \r\n    TUN/TAP  \r\n    Weekly Backups  \r\n    Price: &lt;del&gt;$15.00/month&lt;/del&gt; $7.00/month for life! | [ORDER NOW!](https://www.armorshark.com/clients/cart.php?a=confproduct&amp;i=0)  \r\n\r\n_____________________________________________________________  \r\n\r\nClick [here](https://www.armorshark.com/clients/knowledgebase.php?action=displayarticle&amp;id=1) to view a list of available templates \r\n\r\n**FAQ**  \r\n**Where can I find a test IP and test file?** Please send an email to admin@armorshark.com with heading \"Test IP\" or \"Test File\" and you'll receive a response shortly.\r\n\r\n**When will my VPS be setup?** You'll receive your VPS details instantly after payment.  \r\n\r\n**How can I pay?** You can pay via Paypal or credit card. We are considering accepting Dwolla payments; send an email to admin@armorshark.com if this payment method interests you.  \r\n\r\n**How long have you guys been in business?** Armorshark, LLC has been in business since May 2010. We are registered in Virginia.  \r\n\r\n**What support methods are available?** We offer live chat, Skype, and ticket support.  \r\n\r\n**What are your nodes built on?** Our nodes use Intel Ivy Bridge E1245v2 CPUs, DDR3 ECC RAM, and enterprise Samsung and Intel SSDs (e.g. Cherry 520).  \r\n\r\n**What can I use my VPS for?** Check our [Acceptable Usage Policy](http://www.armorshark.com/clients/knowledgebase.php?action=displayarticle&amp;id=34) for the full run-down. Essentially, we allow most any activity that is legal under US law.\r\n\r\n**What operating system are available?** See the list here.  \r\n\r\n**Do you provide backups?** Yes, each node is backed up weekly to an offsite storage cluster.  \r\n\r\n**How do I contact you with pre-sales questions?** Send in an email to sales@armorshark.com or use the live-chat feature on our website.  \r\n\r\n**What is your refund policy?** We offer a 3-day refund policy.   \r\n\r\n**About Us**  \r\nWe are a registered LLC in the state of Virginia. Armorshark, LLC currently operates a corporate VPN network, a public VPN service (TigerVPNS.com with our custom-coded Android application), and a VPS hosting service. Our goal is to provide affordable and sustainable high-performance VPS for anyone who wants the speed of SSD arrays at a fraction of the price."}