{"id": 129671, "date": "2017-11-16 18:09:20", "user": "MikePT", "post": "Hello LET!\r\n\r\nIt's with great, great pleasure that we announce that, after a few years in the IT business, mainly providing NOC and Server Management Services, we now work with a Datacenter (Carrier-1/Incero) to provide you the best offers in the Dedicated Server market, hence, we launched FiberFy, a WNDP - WebNegócio Lda. division, a company registered in Portugal (VAT PT513782540). \r\n\r\nNote that, even though we're resellers, we do add some value, mainly bilingual technical support in English, Portuguese/BR, Spanish and French (best effort), by email, ticket, phone or chat), basic support included in all servers (need any advice to build your superb Application? We'll help you achieving your goals.), server management services for small one-time fees, additional licenses available in the portal to consolidate your services, cluster management services and much more to come.\r\n\r\nDo make sure to read about us: [Our values](https://fiberfy.com/why-choose-us.php) / [Company information](https://fiberfy.com/company.php)\r\n\r\nThese servers are in stock, and will be provided in less than an hour, normally in 5 to 15 minutes. Should we run out of stock, we'll add more stock later :-).\r\n\r\n\r\n-----------\r\n\r\n**Server Offers**\r\n\r\nCPU: X3440 @ 2.53GHz\r\n\r\nRAM: 16 GB\r\n\r\nDisk: 128 GB SSD\r\n\r\nBandwidth: 100 TB @ 1Gbps + 1 Gbps Unmetered Internal Port (order multiple servers and build your cluster!)\r\n\r\n1 IPv4 + /64 IPv6 Subnet\r\n\r\nIPMI Access (install any OS you'd like to!)\r\n\r\n$25 USD first month (coupon code: **LET1BF2017**), $49 USD recurring, [ORDER NOW](https://fiberfy.com/cart.php?a=add&amp;pid=44)!\r\n\r\n--\r\n\r\nCPU: X3440 @ 2.53GHz\r\n\r\nRAM: 16 GB\r\n\r\nDisk: 120 GB SSD\r\n\r\nBandwidth: 100 TB @ 1Gbps + 1 Gbps Unmetered Internal Port (order multiple servers and build your cluster!)\r\n\r\n1 IPv4 + /64 IPv6 Subnet\r\n\r\nIPMI Access (install any OS you'd like to!)\r\n\r\n$25 USD first month (coupon code: **LET2BF2017**), $49 USD recurring, [ORDER NOW](https://fiberfy.com/cart.php?a=add&amp;pid=45)!\r\n\r\n-----------\r\n\r\nAre you looking for something else, more powerful? Check our [LET Black Friday 2017 Offers](https://fiberfy.com/cart.php?gid=7) (these offers are not within LET prices, though first month is below $49 USD for all servers listed here).\r\n\r\nLooking Glass available at: http://lg.fiberfy.com\r\n\r\nTerms of Service: https://fiberfy.com/terms-of-service.php\r\n\r\nNotes:\r\n\r\n- All orders are subject to manual fraud check and all clients must read and comply to the ToS;\r\n\r\n- We're already in touch with the Datacenter to get some more stock for these offers and we'll be adding more stock as soon as those are ready;\r\n\r\n- Our Datacenter is working on an API that'll allow you to manage your Dedicated Servers directly in the portal, ETA is around a month. For now, clients can do it using the IPMI, send a ticket to reinstall it with an available OS from the list in the order form, or we can install a custom OS for a $10 USD fee per reinstall."}