{"id": 13049, "date": "2013-08-30 05:28:19", "user": "PhaseNetworks", "post": "Phase Networks has been providing Minecraft servers to the gaming community for a little over 1 year now. We are now one of the larger Australian based Minecraft hosts with over 900+ Minecraft servers under our belt. We have seen our expansion as an opportunity to offer more services to the community, the next being VPS hosting! Our OpenVZ based plans are affordable &amp; reliable unmanaged solutions for you or your businesses VPS hosting needs.\r\n\r\nPhase Networks offers all the services you and/or your business need to grow online - from world-class web hosting to great value domain names, powerful VPS servers, effective web design, Minecraft Servers and online marketing services. Sick and tired of overseas call centres or fed up with endless hosting problems? Not to worry, make the switch today and experience unrivalled support and performance all within your budget!\r\n\r\nIT managers, businesses and everyday consumers are facing constraints on space, power, and costs. In the midst of these growing demands, a new class of Hosting solutions is emerging to transform the way we host. Phase Networks saw this as an opportunity to deliver cloud-based solutions by building the foundation architecture to allow easy and rapid deployments of; VPS servers, Minecraft Servers and other shared cloud services. The Phase Networks Cloud is specifically designed to optimize cloud availability resilience, ease of use and ease of maintenance. It is a true cloud system with self-healing and automatic fail-over; multi-hypervisor support; dynamic resource allocation; and multi-layered security to state of the art standards. \r\n\r\nUse the promo code “**VPSOPEN**” and receive 50% off your first month with Phase Networks!\r\n\r\nWe look forward to hearing from you!\r\n\r\nWebsite:   www.phasenetworks.com.au&lt;br /&gt;\r\nEmail: admin@phasenetworks.com.au\r\n\r\nLive Chat available on website!\r\n\r\nKindest Regards,&lt;br /&gt;\r\nPhase Networks"}