{"id": 130523, "date": "2017-11-24 04:30:13", "user": "VirMach", "post": "![](https://virmach.com/images/logo.png)\r\n\r\nVirMach is bringing back our flash deals for another Black Friday weekend. From Friday until Monday (while supplies last) we will be posting several unique flash deals. Each flash deal is extremely limited in quantity, so purchase it quickly before it goes away forever. We recommend bookmarking our special offers page and checking back for new deals. \r\n\r\n&lt;h2&gt;How does it work?&lt;/h2&gt;\r\n_____________\r\n&lt;ul&gt;&lt;li&gt;&lt;strong&gt;Different deals&lt;/strong&gt; will be posted throughout the day.&lt;/li&gt;\r\n&lt;li&gt;&lt;strong&gt;Virtualization&lt;/strong&gt; will vary from KVM to OpenVZ, but mostly KVM.&lt;/li&gt;\r\n&lt;li&gt;&lt;strong&gt;Location&lt;/strong&gt; will also change,so check back for different locations.&lt;/li&gt;\r\n&lt;li&gt;&lt;strong&gt;Term lengths&lt;/strong&lt;/strong&gt; will generally be annually, but quarterly may be available.&lt;/li&gt;\r\n&lt;li&gt;&lt;strong&gt;Storage&lt;/strong&gt; will feature RAID 10, Solid State Drives&lt;/li&gt;\r\n&lt;li&gt;&lt;strong&gt;Free Support&lt;/strong&gt; is provided, but you can opt out of support to save $5 per year.&lt;/li&gt;\r\n&lt;li&gt;&lt;strong&gt;You will only have 5 minutes&lt;/strong&gt; to complete your checkout, to avoid errors.&lt;/li&gt;\r\n&lt;/ul&gt;&lt;br /&gt;\r\n\r\n\r\n&lt;h2&gt;Special Flash Sale&lt;/h2&gt;\r\n_____________\r\n[VIEW BLACK FRIDAY &amp; CYBER MONDAY FLASH DEALS](https://virmach.com/special-offers/)\r\n&lt;br /&gt;\r\n\r\n\r\n&lt;h2&gt;More LET Offers&lt;/h2&gt;\r\n_____________\r\nDon't like flash sales? We still saved a few specials for you. [VIEW MORE DEALS.](https://virmach.com/special-offers)\r\n&lt;br /&gt;\r\n\r\n\r\n&lt;h2&gt;Learn More&lt;/h2&gt;\r\n_____________\r\n\r\n&lt;strong&gt;ToS:&lt;/strong&gt; http://virmach.com/terms-conditions\r\n\r\n&lt;strong&gt;Looking Glass:&lt;/strong&gt; http://lg.virmach.com/\r\n\r\n&lt;strong&gt;Refund Policy:&lt;/strong&gt; We will not offer any refunds or guarantees for this special offer.\r\n\r\nPlease do not contact our live chat or sales department with questions in regards to this sale. If you have any questions, please post them on this thread. We apologize for any errors/typos within this offer. If your service is not properly generated and is broken, we &lt;strong&gt;cannot&lt;/strong&gt; regenerate the offer for you. If you do not check out within &lt;strong&gt;5 minutes&lt;/strong&gt; our system may charge you for the next special in queue and provide you with completely different server specifications and pricing. We &lt;strong&gt;will not&lt;/strong&gt; cancel any orders for &lt;strong&gt;any reason&lt;/strong&gt; including any errors in what you receive as a result of not checking out in time. &lt;strong&gt;If you select no support&lt;/strong&gt; we will not provide free assistance, even if something is wrong with your service so we &lt;strong&gt;highly recommend&lt;/strong&gt; keeping your support."}