{"id": 133639, "date": "2017-12-24 23:40:42", "user": "huntercop", "post": "This offer is being posted, per allowance referenced below:  \r\nhttps://www.lowendtalk.com/discussion/133621/free-for-all-on-offers-for-christmas-day-and-boxing-day-go-go-go#latest  \r\n  \r\n  \r\nThis is exactly the same as the Cyber Monday offer... details repeated again below.  \r\n\r\nSo over the years, I've had many idling reseller accounts. I've decided I want to put up a deal for free hosting so it's at least being used! This is recommended only for lowend sites, not a bohemoth.  \r\n  \r\nThere is limited supply, so sign up while there are spots left. I am not running a business and support is not offered. This is simply a free giveaway so you will never get an email solicitation or anything from me. Your email and other information will be collected in case you use the hosting for anything illegal. Limit 1 per person, anyone who attempts to get multiple accounts will be ignored and banned from any future free offers. Your LEB account must also exist prior to October 2017 to be eligible for the offer. \r\n  \r\nHosting Specs:  \r\n512MB Storage  \r\n10GB Bandwidth  \r\n1 Domain  \r\nUnlimited Subdomains  \r\n3 FTP Accounts  \r\n5 Emails  \r\n6 Databases  \r\nShared IP Address  \r\ncPanel Control Panel  \r\nSoftaculous Script Installer  \r\nAbsolutely ZERO Support  \r\nDDoS Protection Included (from snipped) Domain registration not offered  \r\nYou need to update nameservers on your own  \r\n[Sign up link](https://goo.gl/forms/QJiMqY59Vde4t5ol1)  \r\n  \r\nAnyone who signs up for this free plan accepts the [ToS and AUP from snipped](https://www.snipped.com/tos-aup.html).  \r\n  \r\nAdditional ToS and AUP: No uptime guarantee nor compensation will be offered for downtime or any other issues to clients. All hosting will be at your own risk and you should conduct your own backups. Service may be terminated for inability to use service without support. snipped or @cheapwebdev from LET is not liable for any actions performed on your account, you are accountable for all actions performed on your account.  \r\n  \r\nAccounts will be set up in January.  "}