{"id": 136168, "date": "2018-01-23 09:14:36", "user": "Hetzner_OL", "post": "Today, Hetzner Online officially released five different cloud \r\npackages to the worldwide market. All five of the Hetzner Cloud \r\nmodels come equipped with NVMe SSDs and Intel Skylake Xeon CPUs, \r\nso you'll profit from Hetzner Cloud's high level of performance. \r\nYou may also choose between local storage and network storage \r\n(NVMe SSD RAID or Ceph).   \r\n\r\nBilling for the Hetzner Cloud is flexible and transparent. There \r\nis no minimum contract period. Each Hetzner Cloud model is capped \r\nat a maximum monthly price, but if you only use your Hetzner Cloud \r\na little, you can pay by the hour. Hetzner Online will automatically\r\ncharge you the smaller of these two options.\r\n\r\nHetzner Cloud's flexible payment options make it the ideal solution \r\nfor a wide range of IT projects, and the various package sizes \r\nprovide the suitable amount of resources, regardless of what you need. \r\n\r\nThe entry-level model, the CX11, costs a mere €2.49 a month and \r\nincludes 1 CPU, 2 GB RAM, 20 GB SSD and 20 TB of traffic. If you \r\nneed more traffic, it is just €1.00 for each additional TB. \r\n\r\nUsing Cloud Console, the customer administration interface, you can \r\ncreate new server instances and deploy them almost instantly, often \r\nin under ten seconds. Cloud Console also includes a feature with \r\nwhich you can easily add team members and assign roles, making Cloud\r\nConsole ideal for administering your larger team projects. With Cloud \r\nConsole, you may also use additional low-cost features such as backups, \r\nsnapshots, and floating IPs with just a few clicks.\r\n\r\nCloud Console also incorporates a real-time, graphical monitoring \r\ntool so you can check the performance of the CPU, disks, and network \r\non which your Hetzner Cloud is based. Further features make it easy \r\nfor you to automate your Cloud infrastructure administration, and \r\nCloud Console includes a REST-API and a CLI tool for developers.\r\nHetzner Cloud’s thorough documentation, together with programming \r\nexamples, make getting started easy.\r\n\r\nAll Hetzner Cloud instances are hosted in Hetzner Online's own data \r\ncenters in Germany. The data centers operate in accordance with ISO \r\n27001 guidelines while also adhering to strict German data protection \r\nregulations. \r\n\r\nAn overview of the complete Hetzner Cloud line-up is available at  \r\nhttps://cloud.hetzner.com.\r\n\r\nAll prices are excl. VAT.\r\n\r\nPosted by mod: NOTE: 90% of the questions asked here are well covered in the comprehensive Hetzner FAQ: https://wiki.hetzner.de/index.php/CloudServer/en it is worth reading."}