{"id": 137116, "date": "2018-02-03 17:02:52", "user": "MikePT", "post": "![](https://mxroute.io/images/logo.png)\r\n\r\n**MXroute.io - SMTP Relay Service, by MailChannels**\r\n \r\nThis time this won't be just a simple offer thread, this is a small story to tell you, and way to thank you for your support. \r\n\r\nWhen MXroute.io first started with @Jarland, we were very, very small. We had a volume of 1M emails per month, and we predicted that we'd maybe hit 5M emails in the summer, gosh, it was already exciting to join this business, as a DevOp myself, I wouldn't imagine I'd join the email biz. \r\n\r\nWe're currently targeting the 10M volume because the 5M goal has already been reached in a month and a half, and we predict that we'll hit the 10M goal next month. That's some serious growth here.\r\n\r\nWNDP - WebNegócio Lda. is a company based in Portugal, Europe. As a very small firm located in Portugal, owned by two individuals, we appreciate every single customer that signs up with us. We launched MXroute.io as a partnership with @Jarland, where we both own and operate our MXroute brands, while we look at growing both businesses as well, that is, MXroute.com (for email hosting) and MXroute.io (for SMTP Relay Service).\r\n\r\nWe never thought we'd reach our 5M goal so fast, and this was, absolutely, due to the great customers we have. This got us so excited, that we even heavily modified our WHMCS interface to integrate MailChannels completely with all the shiny stats, and design that makes us look a more serious company (™). Also, automated suspensions to avoid getting huge overages for our clients (and we do not actually bill for small overages), as well as a great support (™), even when @Jarland is sleeping.\r\n\r\nWNDP - WebNegócio Lda. would like to thank @Jarland for the opportunity he gave us as it allowed our company to be noticed in this market niche and grow superbly fast, and thank our clients for the trust they deposit on us. \r\n\r\nAlright, enough stories. We're going to list our yearly plans and a monthly plan here and do not expect to have these yearly plans available for the coming months.\r\n\r\n \r\n**LET 5k**\r\n  \r\n**5k emails per month**\r\n  \r\nSMTP Relay Access\r\n   \r\nMailChannels Cloud Access\r\n   \r\n30€ per year - [Signup here](https://mxroute.io/LET.html#plans)\r\n\r\nStock: 10\r\n   \r\n----------------------------------\r\n   \r\n**LET 2k**\r\n   \r\n**2k emails per month**\r\n  \r\nSMTP Relay Access\r\n  \r\nMailChannels Cloud Access\r\n  \r\n20€ per year - [Signup here](https://mxroute.io/LET.html#plans)\r\n\r\nStock: 5\r\n \r\n----------------------------------\r\n \r\nMonthly plans:\r\n \r\n**Starter**\r\n  \r\n**10k emails per month**\r\n  \r\nSMTP Relay Access \r\n  \r\nMailChannels Cloud Access\r\n   \r\n5€ per month - [Signup here](https://mxroute.io/#plans) \r\n\r\nStock: No stock limit, this is a standard plan :-)\r\n\r\nMore monthly-based plans available in our website https://mxroute.io\r\n\r\n----------------------------------\r\n   \r\nBenefits of signing up for our plans:\r\n  \r\n- MailChannels integration in WHMCS (including overages, full automation);\r\n\r\n- Automated account suspension to avoid extreme overages, not only to protect ourselves, as our clients;\r\n   \r\n- 2FA available in WHMCS (secure your account properly);\r\n   \r\n- Support provided by us and MailChannels - as you're a Cloud user, you're entitled for their 24x7 Support as well;\r\n  \r\n- Plugins available for cPanel/Plesk;\r\n  \r\n- Awesome email delivery by MailChannels;\r\n\r\n- Beautiful interface to manage your service with us;\r\n\r\n- Proper stats shown directly in our panel;\r\n\r\n- Upgrade/Downgrade whenever you need to with a simple click;\r\n\r\n- MailChannels Cloud account - setup your notifications/webhooks, automate account suspensions and much more;\r\n   \r\n_*Listed prices do not include VAT - EU residents are subject to VAT as per the MOSS Agreement (companies with a valid VAT number are VAT exempt where individuals without a valid VAT number are charged the countries VAT rate)._\r\n  \r\nBig volume plans available at www.mxroute.io \r\n\r\nBy the way, here's a teaser of our interface, with stats grabbed directly from the API:\r\n\r\n![](https://i.gyazo.com/3110dab140705acdcc59534d51902612.png)\r\n\r\nCheers,\r\n\r\nMiguel"}