{"id": 13820, "date": "2013-09-23 20:29:48", "user": "ModulesFactory", "post": " Modules Factory pleased to announce the release of version 1.2.7 with the following changes and new features.\r\n\r\n**New Features:**&lt;br /&gt;\r\n\r\n&lt;ul&gt;&lt;li&gt;Server Setup Automation: version 1.2.7 comes with Auto discover for automatic proxmox nodes detection and import into WHMCS servers db, also it offer an add node wizard for ability to add a single node, this also features ability to unconfigure the servers again.&lt;/li&gt;\r\n\r\n&lt;li&gt;Manual Provisioning : Beside Auto provisioning, Module now support Manual Provisioning for expanding capability to manually assign/release a VPS from a client service without deleting or affecting the VPS, quite usefull for Migration and maintenance, plus also powerfull for clients who wish to go manual without the use of Auto provisioning.&lt;/li&gt;\r\n\r\n&lt;li&gt;Custom Fields for Username/Password/Confirm are now Optional, module can automatcally generate random username/password if those fields not set.&lt;/li&gt;\r\n\r\n&lt;li&gt;Operate VM now support buttons,  you have option to switch between :  Local =&gt; Operate buttons (default),  Remote =&gt; proxmox login Operate console.  You can modify this setting from Product Setting.&lt;/li&gt;\r\n\r\n&lt;li&gt;Module now support utilizing root-password field that comes with VPS products type in WHMCS this applies to internal vps user and Openvz VPS root password.&lt;/li&gt;&lt;/ul&gt;\r\n\r\n\r\n**Bug Fixes:**&lt;br /&gt;\r\n\r\n&lt;ul&gt;&lt;li&gt;Default template not showing on edit.&lt;/li&gt; \r\n\r\n&lt;li&gt;Username and password checking on all products in cart instead of proxmox.&lt;/li&gt;\r\n\r\n&lt;li&gt;Mailto/exludes not showing on edit.&lt;/li&gt;\r\n\r\n&lt;li&gt;Default port on client area KVM manage media set to 0.&lt;/li&gt;\r\n\r\n&lt;li&gt;number of rows not working in Proxmox Addon page.&lt;/li&gt;&lt;/ul&gt;\r\n\r\n[Screenshots](https://modulesfactory.com/features.php) | [Read more and Order](https://www.modulesfactory.com/)\r\n\r\n\r\n\r\nThanks&lt;br /&gt;\r\nModules Factory"}