{"id": 14175, "date": "2013-10-01 02:58:11", "user": "ryanarp", "post": "**Catalyst Host    \r\nStill Providing Quality Services**\r\n\r\n**About Us\u2028**   \r\nFor those of you guys who don’t know us, Catalyst Host was started by a group of friends focused on providing our brand of quality hosting. We just want you all to know that we’re more than just another provider, we are customers too. We know what customers want, and we focus on exactly that! We’re also Catalyst customers ourselves! We want the best out of everything we get, and we’ll work hard to make sure you get the best we can give! \u2028 \u2028\r\n\r\n**Our Philosophy\u2028**   \r\nIf you're not going to do something right, don't bother doing it. Catalyst Host has been in business since early 2011. We are not here to give you the most imaginary resources you can't use for the least dollar signs. We are here to give you the best quality, with what I estimate to be some of the least oversold nodes in our market. You have the peace of mind that you services are in good hands, that your services will operate as expected, and that your data will remain safe.\u2028  \r\n\r\n**Our Dedication to Quality Networks and Powerful Hardware\u2028**  \r\nThe network behind our Dallas servers is multi-homed with multiple 10Gbit connections and redundant Juniper routing with HSRP failover. Network and hardware conditions are monitored 24/7/365. Spare hardware is always stocked and available on site. We utilize A+B power for redundancy in case of brownouts, which are rare in Dallas. As a standard we use dual E5 Intel Xeon Processors with a minimum of 64GB of Ram and Raid 10 setup with 4 to 8 Enterprise Grade Drives. Recently we started using SSD Cache on our KVM Node(s). These Node(s) currently have 6 Enterprise Grade Drives in Raid 10 and 2 SSD Drives in Raid 1 for Cache. You can expect this to be a standard on future nodes.\u2028 \u2028 \r\n\r\n**Transparency**  \r\n\u2028Our VPSs are located in Dallas, TX. We utilize the Incero Network inside CoreXchange. While we do not own our hardware, we are renting some of the finest hardware available. This is a choice that we made to guarantee the quality of our services. We also know a tech on site, I hear he is a pretty cool guy.\u2028 \u2028\r\n\r\n**EACH PLAN COMES WITH**      \r\n* SolusVM Control Panel   \r\n* Free DNS Hosting    \r\n* Weekly Off Site Backup    \r\n* Instant Setup     \r\n* Custom KVM ISO/Template | OpenVZ Templates Uploads On Request     \r\n* 1Gbps Fair Share Port     \r\n\r\n**Test IP:** http://192.211.54.101/test/\u2028     \r\n**TOS:** https://catalysthost.com/terms-of-service/    \r\n**AUP:** https://catalysthost.com/acceptable-use-policy/    \r\n**Payments:** Credit Card | Paypal | Amazon Simple Payments | Google Checkout   \r\n**Datecenter:** CoreXchange Dallas - Incero Network Blend  \r\n**Test IP:** http://192.211.54.101/test/  \r\n\r\n**PLAN 1**    \r\n**Limited Stock Micro OpenVZ**\r\n&gt; * Cores: 1 CPU Core @ 2.0GHz+\r\n&gt; * 128MB RAM\r\n&gt; * 128MB VSWAP\r\n&gt; * 50GB Raid 10 Protected\r\n&gt; * 1TB Bandwidth @ 1Gbps\r\n&gt; * 1 IPV4\r\n&gt; * Control Panel: SolusVM\r\n&gt; * $17 Yearly    \r\n&gt; https://portal.catalysthost.com/cart.php?a=add&amp;pid=44\r\n\r\n**Plan 2**     \r\n**Limited Stock Tall KVM**   \r\n&gt; * RAM: 256MB    \r\n&gt; * Cores: 1 CPU Core @ 2.0GHz+    \r\n&gt; * 15GB RAID10 Storage with SSD Cache     \r\n&gt; * 1 TB Bandwidth    \r\n&gt; * 1 IPv4 Address    \r\n&gt; * Control Panel: SolusVM    \r\n&gt; * Price: $28.00/year or $14/semi      \r\n&gt; * https://portal.catalysthost.com/cart.php?a=add&amp;pid=65"}