{"id": 144176, "date": "2018-05-11 08:36:17", "user": "willie", "post": "Based on discussion in this thread:\r\n\r\nhttps://www.lowendtalk.com/discussion/144128/colo-offers-do-you-want-to-see-them-here\r\n\r\nProviders please feel free to post colo offers in this thread.  No price limits but provider tag is required.  Let's see what happens: we can always make changes if it seems like that will help.\r\n\r\nThis thread is set (for now) to NOT automatically sink.\r\n\r\nAdmin edit: this will be more heavily moderated than regular threads.\r\n\r\n* BASIC Common sense.\r\n\r\nIf you find an offer in this thread and it is not a company you are pretty familiar with (and even in some cases even if you are).\r\n\r\n1) Make sure you validate the company is real, it is easy to find public business registrations etc online.\r\n\r\n2) Ask if they are just leasing rack space or if they own their own DC/equipment (and verify this with their upstream if required.\r\n\r\n3) **Always** insure your server unless you are fully prepared for it to go missing and or get damaged.\r\n\r\n4) Make sure there is a contract in place.\r\n\r\n5) Make 110% sure that whoever you chose confirms receipt of the server in writing.\r\n\r\n6) Do not do your negotiations or any follow up over skype or similar\r\n\r\n7) If a deal is to good to be true, it probably is.\r\n\r\n8) Do not expect the DC/Host to just store your server box for you for the life of your contract, arrange to have it collected/returned if the package is important to the safe return of your equipment.\r\n\r\n9) Make sure you know all the costs up front, additional power charges may apply and remote hands can get very expensive.\r\n\r\nThere are outright con/scam artists/criminals on LET just waiting to take advantage of you, we have no powers of enforcement if you get burned by them, do not take colo from anyone here that does not have a provider tag already.\r\n\r\nIf you take a colo offer from LET and get burned and any of the above basic common sense advice was not followed and you want to make a complaint about a company and your post or subsequent replies contain the words \"I know but\" or similar you can be pretty sure, you are at least in part to blame."}