{"id": 146408, "date": "2018-06-12 11:33:53", "user": "wavecomas", "post": "We offer discounted **OpenVZ** and **KVM** VPS servers that are housed in our brand new, state of art data center.\r\n\r\nData center located in Tallinn, Estonia was finished in 2018 and is designed to meet TIER 3 specifications.   \r\n\r\nMore info about the data center: [https://www.wavecom.ee/en/dc](https://www.wavecom.ee/en/dc/)\r\n\r\nPrices starting from as low as **2.4 € / month**. `2.83 USD/month`\r\nDiscounted prices are only available using the special links under each product together with the **COUPON CODES**.\r\n\r\n---\r\n##OpenVZ\r\n\r\n* 1 - 8 CPU cores\r\n* 1 - 16 GB RAM\r\n* Enteprise FC Storage SSD\r\n* 1 Gbit/s network speed\r\n* 1 TB Traffic included\r\n* 1 - 10 IP addresses\r\n* Linux OS\r\n* Instant provision\r\n* Solus CP management\r\n* Reverse DNS management\r\n  \r\nExample config 1: **1 CPU, 1GB RAM, 5GB SDD**   \r\nPrice: **2.40€/month** `2.83 USD/month` using COUPON CODE **LETVPS20**\r\n\r\nExample config 2:  **1 CPU, 2GB RAM, 15GB SDD**  \r\nPrice: **4.43€/month** `5.22 USD/month` using COUPON CODE **LETVPS20**\r\n\r\n[**ORDER HERE**](https://clients.wavecom.ee/?cmd=cart&amp;action=add&amp;id=364&amp;languagechange=English)\r\n\r\n---\r\n##KVM\r\n\r\n* 1 - 8 CPU cores\r\n* 1 - 16 GB RAM\r\n* Enteprise FC Storage SSD\r\n* 1 Gbit/s network speed\r\n* 1 TB Traffic included\r\n* 1 - 10 IP addresses\r\n* Linux OS\r\n* Instant provision\r\n* Solus CP management\r\n* Reverse DNS management\r\n  \r\nExample config 1: **1 CPU, 1GB RAM, 5GB SDD**   \r\nPrice: **3.20€/month** `3.77 USD/month` using COUPON CODE **LETVPS20**\r\n\r\nExample config 2:  **1 CPU, 2GB RAM, 10GB SDD**  \r\nPrice: **5.64€/month** `6.65 USD/month` using COUPON CODE **LETVPS20**\r\n\r\n[**ORDER HERE**](https://clients.wavecom.ee/?cmd=cart&amp;action=add&amp;id=363&amp;languagechange=English)\r\n\r\n---\r\n\r\n**1 month free for semi-annual and 2 months FREE for annual orders. Discounts for quarterly orders.**\r\n\r\nWe accept following payement methods: **Major credit cards (VISA, Mastercard), Bitcoin, PayPal, BankLink and wire transfer.**\r\n\r\nOur hosting environments run on multiple HP BL460-G9 servers. Data is stored on Enteprise FC Storage SSD.\r\n\r\n**OpenVZ I/O test result: 1000 MB/s**  \r\n**KVM I/O test result: 796 MB/s**\r\n\r\nSuch hardware is characterized by ultra-high availability and redundancy in all of its components.\r\n\r\nOur servers are housed in our brand new datacenter in Tallinn, Estonia finished in 2018. \r\nWe spared no expense when designing and constructing the new center. Only Schneider Electric/APC equipment has been used. \r\n\r\n##Network\r\nThree separate fibre-optic cables, with a transmission speed of 60Gbit/s, run from the data centre to Estonia’s most important communication centres. \r\nJust in case, the optic cables are backed up by a network of ultra-high-speed radio links.\r\n\r\nThere are three Cisco Nexus Data Center switches in the data centre, with an expansion module in each cabinet \r\nthat is connected to a 2 x 10 Gbit base system. The minimal speed of each client’s port is 1 Gbit/s.\r\n\r\n##Electricity\r\nElectrical power comes from two different substations that are connected to Schneider Galaxy UPS units located in separate power rooms.\r\nIn the unlikely event that both substations should break down, a generator will take over. \r\n\r\n##Climate control\r\nFor cooling we use an innovative multi-layered Schneider system, in which the water circulated for cooling is, in turn, cooled by the outdoor temperature. \r\n\r\nThe cooling is made even more efficient by the fact that the cabinets are installed in a Schneider APC modular system. Enclosed cold air corridors are used, \r\nfrom which the server cabinets pull in cold air. The warm air is expelled behind the cabinet into a warm air corridor\r\nand from there it is directed out of the room for re-cooling.\r\n\r\n##Security\r\nOur ultramodern access system includes fingerprint and finger vein ID as well as facial recognition.\r\nEvery possible corner is covered with digital, microwave and infrared sensors, and, with the help of facial recognition, \r\nthe modern system makes sure that people only move in the areas of the building where they are permitted. \r\nThe entire area is covered with an automatic gaseous fire suppression that is harmless to people. \r\nThe security system meets FBI quality assurance standards. \r\n\r\nOur monitoring system monitors and analyses continuously our servers, RAID massives, fans, temperature and other parameters.\r\n\r\nRead more about the data center: [https://www.wavecom.ee/en/dc](https://www.wavecom.ee/en/dc/)\r\n\r\nTo see the full list of WaveCom AS offers, please visit our website [https://www.wavecom.ee/en/](https://www.wavecom.ee/en/)\r\n\r\nWaveCom has been in business since 2001. We offer web hosting, cloud servers, dedicated servers, colocation and VOIP.\r\n\r\n**We are not re-sellers!** All the servers are located in our data center in Estonia. (Tallinn)\r\n\r\nCustomer service in **English**, **Russian** and **Estonian** languages.\r\n\r\nWaveCom AS is connected to **Gogent** and **Citic Telecom** global networks as well as Tallinn Internet Exchange **RTIX**.![]()\r\n\r\nNB! All prices exclude VAT tax!! Estonian residents will be billed with VAT20%, EU residents with valid VAT registry ID will be billed with 0 % VAT. All others EU residents will be billed with home country VAT.\r\nAll non-Estonian and non-EU residents will be billed with 0% VAT.\r\n\r\n![](https://www.wavecom.ee/sites/default/files/news/uudiskiri_12_2017/endla3.jpg)\r\n\r\n![](https://www.wavecom.ee/sites/default/files/2018-05/20180529_144449-2_0.jpg)\r\n\r\n![](https://www.wavecom.ee/sites/default/files/2018-05/20180531_090737-2.jpg)\r\n\r\nMore photos of our data center: [https://www.wavecom.ee/en/dc](https://www.wavecom.ee/en/dc/)"}