{"id": 146513, "date": "2018-06-13 19:50:48", "user": "combahton_it", "post": "**[KMS-Hosting.com](https://www.kms-hosting.com)** offers hosting solutions from Shared Webhosting to Dedicated Servers since 2012. We operate our own hardware and Juniper based 10/40Gbit network (AS30823) within two datacenters in Frankfurt am Main, Germany.\r\n\r\nOur physical servers are based on HP Enterprise servers with Intel Xeon E5 CPUs, Hardware Raid, ECC Ram and 10Gbit Uplink each. Every server comes with our award winning Inhouse DDoS-Protection which is based on years of research and development, mitigating even complex attacks up on layer7 like http floods.\r\n\r\n**NEWS:** We were hard working in the last weeks and added some new, very attractive enterprise features to our customer area. You can now build up your own network infrastructure in a very short time, upgrade your server and automatically order ipv4-subnets.\r\n\r\n**Virtual Private Lan (VPL) are isolated private networks**, which you can use with our KVM Rootserver offerings. VPL is useful for interconnecting servers over a private network, making you able to use your own ip-address space (e.g. 10.10.10.0/24) across multiple instances. For example, you can build a typical firewall-server infrastructure (e.g. with vyos) or loadbalancer-webserver scenarios. Data transfer is free of charge, you can fully use the assigned speed at any time.  \r\n\r\n**You can upgrade your rootserver instance at any time** to a higher available product. The upgrade is automated and requires a downtime of your server. All data, ip-addresses and configuration stays as it is. Your servers CPU, Memory and Disk is increased. Normally, enough ressources are available on the current node, hosting your server. In that case, your server is upgraded immediately and requires just a shutdown and afterwards manual start. In case, there are not enough ressources available, your server is moved to another node, which provides sufficient capacity. Depending of your servers disk size, this can take from 10 minutes up to six hours.\r\n\r\n**In case you need more ip-addresses**, we do offer now also automated, prepaid ip-subnets. You can order ipv4-subnets up to /27, which are automatically provisioned and routed on your server.\r\n\r\n**New os images are available**, Debian Jessie + Plesk, Debian Stretch + Nextcloud, Ubuntu 18.04 LTS and Ubuntu 18.04 LTS with RDP.\r\n\r\nWe are also working on bookable snapshot based daily backups, automated iso image mounting, instance cloning, automated (cheap) bgp sessions and our api, which will provide extended functionality in the future. You miss something? Just open a ticket, send us a private message or mail to support@kms-hosting.com.\r\n\r\n\r\n**Our features:**  \r\n\r\n-KVM bare metal virtualization  \r\n-Dedicated CPU and RAM  \r\n-Fast Raid 10 Storage  \r\n-DDoS-Protection included  \r\n-Out of band VNC access  \r\n-Own ISO Images possible  \r\n-Automated Reinstallation  \r\n-Automated server upgrades  \r\n-Virtual Private Lan (VPL)  \r\n-Performant 10Gbit connectivity  \r\n-Server-Hardware from HP Enterprise  \r\n-Prepaid - No long term contracts  \r\n-BGP Sessions possible  \r\n\r\n**Network details:**  \r\nASN: AS30823  \r\nLooking Glass / Speedtest: [https://lg.combahton.net/](https://lg.combahton.net/)  \r\nSmokeping Latency Monitoring: [https://smokeping.combahton.net](https://smokeping.combahton.net)  \r\n\r\nKVM HDD offers:\r\n\r\nKVM S Gen2 - 2,99€ per month  \r\n-1x Intel Xeon E5 CPU Core  \r\n-1GB ECC Ram  \r\n-30GB Raid10 HDD  \r\n-10Gbit Uplink Shared  \r\n-10TB Traffic per month (Fair Use)  \r\n\r\nKVM M Gen2 - 3,79€ per month  \r\n-1x Intel Xeon E5 CPU Core  \r\n-2GB ECC Ram  \r\n-60GB Raid10 HDD  \r\n-10Gbit Uplink Shared  \r\n-10TB Traffic per month (Fair Use)  \r\n\r\nMore details and offers are available on our webpage, see [https://www.kms-hosting.com/rootserver](https://www.kms-hosting.com/rootserver).\r\n\r\n**Screenshots of our self developed control panel**\r\n\r\n![](https://abload.de/img/screenshot2018-06-13aueyjn.png) ![](https://abload.de/img/screenshot2018-06-13a0ya0d.png)  ![](https://abload.de/img/screenshot2018-06-13a8kzfz.png)\r\n\r\nQuestions? Special requirements? Feel free to contact us!"}