{"id": 146792, "date": "2018-06-17 08:44:14", "user": "farnox", "post": "We recently launched a new generation of our SSD-based CloudServers:\r\n\r\n(1 EUR ~ 1.162 USD)\r\n\r\n**[CloudServer c1.mini](https://www.farnox.cloud)**  \r\nCPU: 1 Core  \r\nMemory: 1024 MB DDR4 ECC  \r\nDisk: 15 GB SSD  \r\nNetwork: 1000 mbps (Fair Use)  \r\nPrice: **3.50€ per month** (or 36€ per year)\r\n\r\n\r\n**[CloudServer c1.small](https://www.farnox.cloud)**  \r\nCPU: 2 Cores  \r\nMemory: 2048 MB DDR4 ECC  \r\nDisk: 20 GB SSD  \r\nNetwork: 1000 mbps (Fair Use)  \r\nPrice: **5.00€ per month** (or 48€ per year)\r\n\r\n\r\nThese servers are hosted on Xeon E5 nodes with DDR4 ECC memory using the KVM hypervisor. Most CPU features are exposed.\r\n\r\nOur new management panel comes with many features including support for ISO images and live bandwidth statistics. If you already have a farnoX account, please register again or, if you still have credit in your previous account, drop us an email and we'll transfer your account. Existing CloudServers will stay in the previous panel for the moment but can be migrated on request. This panel (just as our old one) was built in-house and we're always trying to improve it.\r\n\r\n\r\nWe have our own colocation with own hardware at the Accelerated DC in Frankfurt am Main, Germany. The network has direct peerings with many providers including Deutsche Telekom (DTAG), Level 3, GTT, Vodafone and many more. It is present at DE-CIX and AMS-IX internet exchange points. \r\n\r\n\r\nSince this is LET, we also have a few special offers for you:\r\n\r\n**[CloudServer SPECIAL-MAI18-512](https://www.farnox.cloud)**  \r\nCPU: 1x vCore  \r\nMemory: 512 MB DDR3  \r\nDisk: 20 GB HDD  \r\nNetwork: 100 mbps (Fair Use)  \r\nPrice: **15.00€ per year** (That's just 1.25€ per month)\r\n\r\n\r\n**[CloudServer SPECIAL-MAI18-1024](https://www.farnox.cloud)**  \r\nCPU: 1x vCore  \r\nMemory: 1024 MB DDR3  \r\nDisk: 20 GB HDD  \r\nNetwork: 100 mbps (Fair Use)  \r\nPrice: **20.00€ per year**\r\n\r\n\r\n**[CloudServer SPECIAL-MAI18-4096](https://www.farnox.cloud)**  \r\nCPU: 2x vCore  \r\nMemory: 4096 MB DDR3  \r\nDisk: 40 GB HDD  \r\nNetwork: 100 mbps (Fair Use)  \r\nPrice: **12.00€ per quarter** (or 45.00€ per year)\r\n\r\n\r\nThese offers are highly limited and won't be available for long. They are installed on older nodes and can not use all of the new features (e.g. CPU features are not exposed). The performance of these specials can not be compared to our regular offers which are listed on top of this post and on our website.\r\n\r\nIPv4 is included in all offers.\r\n\r\n**How to order:**  \r\nSign up on our panel at https://manager.farnox.cloud, add a payment method (or add credit) and create your CloudServer. It will be available within around 60 seconds after ordering.\r\n\r\nIf you do not immediately receive a confirmation email after sign up, your account was likely flagged for manual approval. In this case, just wait a few minutes.\r\n\r\n**Payment Methods**  \r\nWe accept all major credit cards (Visa, Mastercard, Amex), PayPal billing agreements and PayPal one-time payments.\r\n\r\n\r\nFor more information, visit our [main website](https://www.farnox.cloud), our [wiki](https://help.farnox.cloud/doku.php?id=start) or contact us at support@farnox.de."}