{"id": 14802, "date": "2013-10-12 17:39:35", "user": "AnthonySmith", "post": "Hi Folks,\r\n \r\nI have not posted on offer on LET for a while mainly due to stock etc, but thought I would give the lowendspirit brand a push.\r\n\r\n \r\nhttp://lowendspirit.com is a non-profit project financially backed and ran by Inception Hosting, you get 5 x Native IPv6 addresses and have a shared IPv4 address.\r\n \r\n------------------\r\n \r\n**Locations and packages**:\r\n\r\n \r\n**Netherlands - i3d.net - rotterdam**\r\n\r\n1 CPU Core\r\n\r\n64mb Ram\r\n\r\n3 GB HDD Space\r\n\r\n500GB @ gbit BW\r\n\r\n5 x IPv6\r\n\r\n1 x NAT IPv4\r\n\r\n \r\n**UK - WildcardNetworks - Newcastle Upon Tyne**\r\n\r\n1 CPU Core\r\n\r\n128mb Ram\r\n\r\n3 GB HDD Space\r\n\r\n100 GB @ 100mbit BW\r\n\r\n5 x IPv6\r\n\r\n1 x NAT IPv4\r\n\r\n \r\n**Italy -  SEflow - Milan**\r\n\r\n1 CPU Core\r\n\r\n128mb Ram\r\n\r\n2 GB Pure SSD HDD Space\r\n\r\n500 GB @ 100mbit (DDOS Protected)\r\n\r\n5 x IPv6\r\n\r\n1 x NAT IPv4\r\n\r\n \r\n \r\n**ORDER LINKS:** http://lowendspirit.com/locations.html\r\n\r\n \r\nAll servers come with IPv4 connectivity with 20 TCP and UDP ports forwarded to your local IPv4 on your VPS, think about the way your home router holds the external IP and your PC has a local e.g. 192.168.0.67 address, this works in much the same way.\r\n\r\n \r\nIf you do not have native IPv6 or an IPv6 tunnel set up at home you can simply connect via the serial console (SolusVM) update your sshd port to one of the ports assigned to you and then connect over IPv4 as normal.\r\n\r\n \r\nSo what if you want to host a website but dont want a funky URL with an odd port number like domain.com:4453 ?, not a problem, you have 2 options.\r\n\r\n \r\n1) As haproxy runs on all lowendspirit nodes you simply need to request a reverse proxy entry, when your user asks for your domain.com haproxy reads the TCP header finds domain.com and forwards that on to your VPS look at http://forum.lowendspirit.com this sits behind haproxy on a local IP address.\r\n\r\n \r\n2) If you use cloudflair then you can use the full IPv6 &lt;-&gt; IPv4 translation they offer example here: http://forum.lowendspirit.com/viewtopic.php?id=441\r\n\r\n \r\n**Common uses for these servers include:**\r\n \r\n\r\nTeamspeak 3 server\r\n\r\nShoutcast\r\n\r\nirc clients and bouncers\r\n\r\nprivate proxy\r\n\r\nVPN/OpenVPN\r\n\r\nMany people buy more than 1 and replicate the data between them for very affordable HA/DC independent websites\r\n\r\nRetro game servers\r\n\r\n \r\n**What you cannot do:**\r\n \r\n\r\nTor (of any type)\r\n\r\nOpen Proxies\r\n\r\nTorrents - Yes this means via a VPN/Proxy too\r\n\r\n\r\n**Example sites hosted on this service:**\r\n\r\n\r\nhttp://lowendspirit.com - multi homed between UK and NL, just a static site.\r\n\r\nhttp://forum.lowendspirit.com - this is a forum (obviously) running on one of the 64mb NL packages\r\n\r\nhttp://noted.pw - a paste bin type site hosted on one of the Italy packages.\r\n\r\n\r\nThe DDOS protection is useful however please note due to this not being considered a commercial production grade service DDOS magnets will not be tollorated.\r\n\r\n\r\nAll packages come with SolusVM access and instant IPv6 rDNS.\r\n\r\n \r\nStill not sure if this is right for you? ask any questions you have below or here: http://forum.lowendspirit.com/viewforum.php?id=13"}