{"id": 150335, "date": "2018-08-04 19:45:13", "user": "jar", "post": "Hey friends!\r\n\r\nIt's been an interesting time for MXroute, iteration after iteration, phases of good times and bad. The one thing that has never changed is my commitment to deliver you from the hell that running your own mail server can be (and if that's not you, no worries!) for a price that makes Google nervous. None of this \"$X per user\" stuff. Just the best delivery and receiving I can offer, at the best price I can challenge myself to charge.\r\n\r\nLet's get down to what I'm offering you today:\r\n\r\n- 40GB Storage  \r\n- Unlimited Email Accounts  \r\n- Unlimited Domains  \r\n- Webmail  \r\n- Custom URL for webmail (use the domain you signup with, CNAME webmail.yourdomain.tld to the hostname of the server you're assigned to)  \r\n- A commitment to high quality delivery (can't tell the rest of the internet what to do, but I can damn well try)  \r\n- IMAP / POP3 / SMTP  \r\n- cPanel control (because you know how to use it, and they have an extremely active development team)\r\n\r\nAll this for $30 (recurring discount) every 2 years. You up for it? Click the link below to order:\r\n\r\n&lt;a href=\"https://billing.mxroute.com/cart.php?a=add&amp;pid=79\"&gt;Order Here&lt;/a&gt;\r\n\r\nSome quick notes about the service:  \r\n- Email is limited to 300 outbound per email account per hour. Automatic suspension above that to prevent spammers or compromised accounts from impacting your delivery.  \r\n- Webmail is Roundcube, Horde, and Squirrelmail  \r\n- We've replaced MailChannels with our own in-house system, with the support of HostUs  \r\n- We've brought on a new team member to help with support, Louis is incredible and you're going to love him instantly.  \r\n\r\nThank you all for your support in these last... nearly 5 years? Yeah, it's been almost that long. We've seen ups and downs, but we keep moving forward. We're not going anywhere. We're stronger than ever. Let us take the problems you have with email off your hands."}