{"id": 151749, "date": "2018-08-30 09:06:14", "user": "combahton_it", "post": "We have restructured and expanded our hosting offering. Our brand kms-hosting is now fastpipe.io which stands for flexible Cloud Servers, individualisation and fast scaling. Our new website is live since yesterday evening, including new Cloud Server offerings, starting at 3,49€ per month.  \r\n\r\n\r\nIn order to run your applications at a flexible, scalable and modern level, we provide multiple professional features.\r\n\r\n**Daily backups:** Let us backup your instances every night at 02:00 am (CEST), without any service interruption. Backups are restorable for two days and can be used as an interesting alternative to manually making backups or maintaining extra scripts or services.  \r\n\r\n**Snapshots:** Create permanently available snapshots of your instances. You can restore a snapshot at any time. We suggest to use snapshots as instant available backup before applying any critical configuration changes to your instances.  \r\n\r\n**Duplicate:** In case you want to create a equal clone of a existing instance, we provide the ability to duplicate one instance into multiple instances. Clones keep exactly the same configuration and data as your source instance has, this provides you the advantage to spin up multiple instances from one existing instance within a short time, without the need of manually copying files and configuration data between them.  \r\n\r\n**Private Lan:** Run your own private network between multiple instances and enjoy the benefits of a fully private network which you can use e.g. for replication, your own network infrastructure and in general internal traffic. We currently provide 1Gbit, 2Gbit and 5Gbit interfaces for private lans. You can spin up multiple isolated private lans and assign multiple interfaces on your instances.  \r\n\r\n**Anti-DDoS:** Protect your instances and applications from ddos attacks by using our advanced and all-layer covering ddos-protection. We even protect web applications up on activating layer7 ddos protection, you can also add your own ssl certificates in order to protect ssl secured sites.\r\n\r\n**ISO Images:** Dont want to use our precreated Linux, BSD and Windows installation images? Just use your own iso images and install the operating system of your choice.\r\n\r\n\r\n\r\n**The smallest package Cloud HE-1 starts with:**   \r\n\r\n-1x Intel Xeon E5 CPU Core  \r\n-1GB ECC Memory  \r\n-10GB Disk Storage  \r\n-10Gbit Uplink Shared  \r\n-Unlimited Fair Use Traffic  \r\n\r\nAt 3,49€ per 30 days  \r\n  \r\n  \r\n**Our Cloud HE-2 package comes with even more power:**  \r\n\r\n-1x Intel Xeon E5 CPU Core  \r\n-2GB ECC Memory  \r\n-20GB Disk Storage  \r\n-10Gbit Uplink Shared  \r\n-Unlimited Fair Use Traffic  \r\n\r\nAt 4,85€ per 30 days  \r\n  \r\n  \r\nPlease see our website https://www.fastpipe.io/cloudserver for more details.  \r\n\r\n\r\nIn case of questions, you can use our contact form. Thanks for your attention!"}