{"id": 152757, "date": "2018-10-12 13:54:46", "user": "wavecomas", "post": "If you need highest quality hardware with reasonable prices, look no further. \r\nWe offer Hewlett Packard Enterprise (HPE) Blade servers with excellent price/quality ratio. Instant provision, HPE ILO3 remote management.\r\n\r\nData center located in Tallinn, Estonia was finished in 2018 and is designed to meet TIER 3 specifications.   \r\n\r\nMore info about the data center: [https://www.wavecom.ee/en/dc](https://www.wavecom.ee/en/dc/)\r\n\r\n---\r\n##HP ProLiant BL465 G7 Instant\r\n\r\n* Xeon® L5640 6 core HT 2.26 GHz\r\n* 16 GB ECC RAM\r\n* 2x300GB SAS 10K Mirrored Raid\r\n* 1 Gbit/s  Network connectivity\r\n* 3 usable IP addresses in private VLAN\r\n* HPE ILO3 remote management\r\n* Proactive hardware monitoring and replacement.\r\n* Instant automatic setup (no setup fees)\r\n\r\nPrice: **47.50€/month** `55 USD/month` using COUPON CODE **LETDEDI**\r\n\r\n[**ORDER HERE**](https://clients.wavecom.ee/?cmd=cart&amp;action=add&amp;id=217&amp;languagechange=English)\r\n\r\n---\r\n\r\n**1 month free for semi-annual and 2 months FREE for annual orders. Discounts for quarterly orders.**\r\n\r\nFor a complete list of our servers [**CLICK HERE**](https://www.wavecom.ee/en/dedicated)\r\n\r\nWe accept following payment methods: **Credit cards (VISA, Mastercard), Bitcoin, PayPal, BankLink and wire transfer.**\r\n\r\nOur servers are housed in our brand new data center in Tallinn, Estonia finished in 2018. \r\nWe spared no expense when designing and constructing the new center. Only Schneider Electric/APC equipment has been used. \r\n\r\n##Network\r\nThree separate fibre-optic cables, with a transmission speed of 60Gbit/s, run from the data centre to Estonia’s most important communication centers where our routers are housed. \r\nJust in case, the optic cables are backed up by a network of ultra-high-speed radio links.\r\n\r\nWe are using Cisco Nexus 5596 Data Center switch clusters, with an expansion module in each cabinet that is connected to a 2 x 10 Gbit base system. The minimal speed of each client’s port is 1 Gbit/s.\r\n\r\nEvery server we provide has GLBP implemented gateway redundancy.\r\n\r\nWaveCom AS redundant routers are connected to **Citic Telecom** and **Hurricane Electric** global networks as well as Tallinn Internet Exchange **RTIX**.\r\n\r\n##Electricity\r\nElectrical power comes from two different substations that are connected to Schneider Galaxy UPS units located in separate power rooms.\r\nIn the unlikely event that both substations should break down, a generator will take over. \r\nOur self-service feature enables clients to manage the power supply and see the level of their power consumption.\r\n\r\n##Climate control\r\nFor cooling we use an innovative multi-layered Schneider system, in which the water circulated for cooling is, in turn, cooled by the outdoor temperature. \r\n\r\nThe cooling is made even more efficient by the fact that the cabinets are installed in a Schneider APC modular system. Enclosed cold air corridors are used, \r\nfrom which the server cabinets pull in cold air. The warm air is expelled behind the cabinet into a warm air corridor\r\nand from there it is directed out of the room for re-cooling.\r\n\r\n##Security \r\n\r\nOur ultramodern access system includes fingerprint and finger vein ID as well as facial recognition. \r\nEvery possible corner is covered with digital, microwave and infrared sensors, and, with the help of facial recognition,\r\nthe modern system makes sure that people only move in the areas of the building where they are permitted. \r\nThe entire area is covered with an automatic gaseous fire suppression that is harmless to people and servers. \r\nThe security system meets FBI quality assurance standards.\r\n\r\n##Monitoring\r\n\r\nOur redundant monitoring system with more then 500 sensors continuously monitors humidity, dew point, temperature, airflow and every other component in data center. The smart monitoring robot reports any problems by phone. \r\nSchneider Data center management software can visualize the data center on a 3D map, \r\nwhich enables running \"what if\" analyses.\r\n\r\nHardware components are proactively monitored. Any faulty components are usually replaced before the client even notices.\r\n\r\nRead more about the data center: [https://www.wavecom.ee/en/dc](https://www.wavecom.ee/en/dc/)\r\n\r\nTo see the full list of WaveCom AS offers, please visit our website [https://www.wavecom.ee/en/](https://www.wavecom.ee/en/)\r\n\r\nWaveCom has been in business since 2001. We offer web hosting, cloud servers, dedicated servers, colocation and VOIP. \r\nWaveCom is ISO 9001 certified. \r\n\r\n**We are not re-sellers!** All the servers are located in our data center in Estonia. (Tallinn)\r\n\r\nCustomer service in **English**, **Russian** and **Estonian** languages.\r\n\r\nNB! All prices exclude VAT tax!! Estonian residents will be billed with VAT20%, EU residents with valid VAT registry ID will be billed without VAT (VAT is reverse charged). All others EU residents will be billed with home country VAT.\r\nAll non-EU residents will be billed with 0% VAT.\r\n\r\n![](https://wavecom.ee/sites/default/files/Data%20collage%20(2).jpg)\r\n\r\nMore photos of our data center: [https://www.wavecom.ee/en/dc](https://www.wavecom.ee/en/dc/)\r\n\r\n\r\n"}