{"id": 154337, "date": "2018-12-13 00:43:32", "user": "MikePT", "post": "Hi guys!\r\n\r\nFirst of all, let's show off our new logo that José designed for us:\r\n\r\n![](https://iroute.io/img/logos/logo.png)\r\n\r\nDisclaimer: We paid him $7 for it. And a cookie.\r\nWebsite: [https://iroute.io](https://iroute.io)\r\n\r\nNow the whole story!\r\nIt's no secret that our previous brand was acquired by MailChannels. We truly miss our clients. They're in good hands, but actually, it was a very fun ride (while it lasted), so we thought of continuing to work with MailChannels but this time not reselling the service, instead, we launched a brand that consists of sending email, done right.\r\nHere are a few reasons to consider using our services:\r\n\r\n- All emails are sent using MailChannels to ensure the best deliverability possible;\r\n- Our servers consist of RAID 10 SSD Arrays, even for emails;\r\n- Full White-label service - IRoute.io is only seen in our Console, where cPanel, CrossBox and MX servers are pure, beautiful white-label (and using a white-label domain);\r\n- CrossBox included with all accounts;\r\n- Public status page for full transparency regarding the quality of our service: https://status.iroute.io\r\n- Dallas location, more locations coming soon;\r\n- GDPR Compliant Company and Servers (Including JetBackup with enabled GDPR);\r\n- Single server hostname for IMAP/POP3/SMTP, no matter the server you're assigned to, this is a functionality we suggested to the guys at CrossBox and they've done it!\r\n- Daily backups with the ability to self-restore, download backups and such, using JetBackup;\r\n- Stickers will come soon ;-)\r\n- Beautiful Console, we spent quite some time working on its UI to improve its efficiency;\r\n- Support provided by Geeks;\r\n- Ex-largest MailChannels Resellers, meaning that you'll get top-notch service with guaranteed solutions for any issue you may experience.\r\n\r\nHere's our recommended package for LET:\r\n\r\n**20 GB SSD Storage\r\nUnlimited Domains\r\nUnlimited Email Accounts\r\nMailChannels Email Delivery\r\nWhite-label CrossBox, cPanel, MX**\r\n\r\n5€ per month - [Order now!](https://iroute.io/console/cart.php?a=add&amp;pid=53)\r\nOr 50€ per year, make sure to apply the coupon: TWOMONTHSFREE\r\n_Plus VAT if applicable._\r\nOther plans available at [https://iroute.io](https://iroute.io)\r\n\r\nAbout IRoute.IO:\r\nIRoute.IO is a division of WNDP - WebNegócio Lda., an IT/Design company located in Portugal. VAT number: PT513782540\r\nWNDP - WebNegócio Lda. is applying MOSS as per the EU law.\r\n\r\nTime to show off!\r\n\r\nHome\r\n\r\n![](https://i.gyazo.com/437416a9d5a2842a8ef6c9ccf453b29c.png)\r\n\r\nBilling? Good luck with your budget\r\n\r\n![](https://i.gyazo.com/5f85985593af4538828dd3aafce7924b.png)\r\n\r\n2FA - secure your account\r\n\r\n![](https://i.gyazo.com/e71cab6fc6f0e723ae2dedc039b34b35.png)\r\n\r\nWhat about our cPanel interface? Tweaked it just a bit, but looks good. We'll also tweak the Console integration in the future.\r\n\r\n![](https://i.gyazo.com/5013c7de69229fb4dbe9f943c4385933.png)\r\n\r\n\r\nAny questions feel free to ask guys!"}