{"id": 154684, "date": "2018-12-28 13:25:55", "user": "MikePT", "post": "![](https://iroute.io/img/logos/logo.png)\r\n\r\nDear LET members,\r\n\r\nWe've just launched reseller plans available at https://iroute.io/resellers.php as there is quite a bit of demand for these. We're not listing the packages here as these are above the price limit. Can be configured to work with popular Hosting panels such as WHMCS, HostBill, Blesta, and such, using the native cPanel modules.\r\n\r\nIRoute.io continues serving happy customers by hosting and delivering their emails, here's what we've got:\r\n\r\nHere are a few reasons to consider using our services:\r\n\r\n- All emails are sent using MailChannels to ensure the best deliverability possible;\r\n- Our servers consist of RAID 10 SSD Arrays, even for emails;\r\n- Full White-label service - IRoute.io is only seen in our Console, where cPanel, CrossBox and MX servers are pure, beautiful white-label (and using a white-label domain);\r\n- CrossBox included with all accounts;\r\n- Public status page for full transparency regarding the quality of our service: https://status.iroute.io\r\n- Dallas location, more locations coming soon;\r\n- GDPR Compliant Company and Servers (Including JetBackup with enabled GDPR);\r\n- Single server hostname for IMAP/POP3/SMTP, no matter the server you're assigned to, this is a functionality we suggested to the guys at CrossBox and they've done it!\r\n- Daily backups with the ability to self-restore, download backups and such, using JetBackup;\r\n- Stickers will come soon ;-)\r\n- Beautiful Console, we spent quite some time working on its UI to improve its efficiency;\r\n- Support provided by Geeks;\r\n- Ex-largest MailChannels Resellers, meaning that you'll get top-notch service with guaranteed solutions for any issue you may experience.\r\n\r\nHere's our recommended package for LET:\r\n\r\n**20 GB SSD Storage\r\nUnlimited Domains\r\nUnlimited Email Accounts\r\nMailChannels Email Delivery\r\nWhite-label CrossBox, cPanel, MX**\r\n\r\n5€ per month - [Order now](https://iroute.io/console/cart.php?a=add&amp;pid=53)\r\nOr 50€ per year - [Order now](https://iroute.io/console/cart.php?a=add&amp;pid=53&amp;billingcycle=annually)\r\nPlus VAT if applicable.\r\n\r\nOther plans available at https://iroute.io\r\n\r\nAbout IRoute.IO:\r\nIRoute.IO is a division of WNDP - WebNegócio Lda., an IT/Design company located in Portugal. \r\n\r\nVAT number: PT513782540\r\nWNDP - WebNegócio Lda. is applying MOSS as per the EU law."}