{"id": 155493, "date": "2019-01-31 14:56:28", "user": "mikho", "post": "Apologies for my absence, I had some health issues that had to be dealt with.\r\n\r\nThe much appreciated 50% recurring discount on both NAT bundle alternatives is back!\r\n\r\nPayment options:\r\nPaypal, Bitcoin, and 43 Altcoins \r\n\r\n 10 NAT locations around the world,\r\n Norway, France, Germany, and Bulgaria in Europe.\r\n Lenoir, Berkeley Springs and Kansas City in the United States.\r\n Sydney, Perth in Australia and Singapore in Asia.\r\n\r\n_**From what I have heard, Singapore IPv4 is blocked by GFW**_\r\n\r\nFeatures:\r\n* Virtualizor Powered\r\n* RAID1 or RAID10 on all locations\r\n* VPS Control Panel integrated with WHMCS\r\n* HAProxy support for HTTP and HTTPS (Install your certificate in your container)\r\n* IPv6 primarily service\r\n* NAT IPv4 (shared among others)\r\n\r\n 1 vCPU\r\n 128mb ram\r\n 3gb storage\r\n shared IPv4 and either /112 or /80 ipv6\r\n [Order link](https://clients.mrvm.net/cart.php?a=add&amp;bid=12) Price: $2.00/year/VPS\r\n\r\n 1 vCPU\r\n 256 mb ram\r\n 5 gb storage\r\n shared IPv4 and either /112 or /80 ipv6\r\n [Order link](https://clients.mrvm.net/cart.php?a=add&amp;bid=11) Price: $3.50/year/VPS\r\n\r\n**_Note_**: When ordering the bundle you will be presented with a regular single VPS, you complete this order and it will automatically take you to the next location and the next as you need to set the password and hostname for each server.\r\n\r\n\r\nAs Norway is one of the most popular locations, I've decided to offer a limited deal on a new server in the same location (meaning not the same NAT IP).\r\n2 vCPU    \r\n1GB RAM    \r\n15 GB disk   \r\n\r\nPrice: $10/year     \r\n[Order Link:](https://clients.mrvm.net/cart.php?a=add&amp;pid=85)     \r\n\r\n Hetzner - Falkenstein, Germany\r\n Looking glass: http://lg-de-fks.mrvm.net/\r\n\r\n Telepoint Data Center - Sofia Bulgaria\r\n Looking glass: http://lg-bg-sof.mrvm.net/\r\n\r\n TerraHost - Sandefjord, Norway\r\n Looking glass: http://lg-no-san.mrvm.net/\r\n\r\n Ikoula - Reims, France\r\n Looking glass: http://lg-fr-rhe.mrvm.net\r\n\r\n Nocix - Kansas City, Missouri - USA\r\n Looking glass: http://lg-us-kck.mrvm.net/\r\n\r\n Dacentec - Lenoir, North Carolina - USA\r\n Looking glass: http://lg-us-ler.mrvm.net/\r\n\r\n Equinix - Sydney, Australia\r\n Looking glass: http://lg-au-syd.mrvm.net\r\n\r\n NextDC P1 - Perth, Australia\r\n Looking glass: http://lg-au-per.mrvm.net\r\n\r\n Equinix SG3 - Singapore\r\n Looking glass: http://lg-sg-sin.mrvm.net\r\nDC - Berkeley Springs, West Virginia - USALooking Glass: http://lg-us-bei.mrvm.net\r\n\r\nIf you ever forget what ports you are assigned or the external IP of your service, visit the Product details page and all this information is now displayed.\r\nSupport and community over at the LES forum being a perfect example of what can be hosted on LowendSpirit servers, the LES forum runs on a little 128mb LES server!\r\n\r\nIf you are lucky enough to have native IPv6 or are already running a tunnel then you can simply connect via your IPv6 address just as you would do usually via IPv4.\r\nIf you do not have native IPv6 or a tunnel then it is suggested you consider getting an IPv6 tunnel. This page will not cover this as many online guides and places to get a tunnel set up already exist such as: http://tunnelbroker.net/ or http://www.sixxs.net/\r\nOptions do exist for connecting over IPv4 such as DNAT port forwarding and console connectivity. In one of the first emails you get from us after signing up, you will find details on which ports have been configured to forward IPv4 connections to your VPS; one of which will be for SSH connectivity.\r\n\r\nOther uses: proxies, Teamspeak, general dev boxes, VPN etc and plenty more.\r\nGeneral special rules for LES aside from the standard terms.\r\n* No TOR\r\n* This is a no refund product.\r\n* Support only via the forums.\r\n* No BitTorrent\r\n\r\n\r\n\r\n\r\n\r\nQuestions? Ask me anything and I will reply.\r\n"}