{"id": 158695, "date": "2019-07-02 18:27:04", "user": "MikePT", "post": "Howdy guys!\r\n\r\nWNDP - WebNegócio Lda. is proud to launch the new brand [MyW](https://www.myw.pt). This brand was recently established in order to provide WebHosting IT Solutions for the global market. We have been operating WNDP - WebNegócio Lda. since December 2015, our company is 3 years and 7 months old. I, personally, have been selling WebHosting since 2004, that makes it 15 years in the business (yes, we still have clients from that time!).\r\n\r\nRecently, with all the cPanel drama, we thought it would be a challenge for us to start selling WebHosting to the whole world, instead of just to local customers, and the drama gave us a boost to try alternatives which were pretty productive after we explored the ins and outs about DirectAdmin.\r\n\r\nMyW focus on delivering reliable Shared and Reseller Hosting for our customers, with the following setup:\r\n- SSD Arrays\r\n- DirectAdmin \r\n- MailChannels for Outbound Delivery\r\n- LiteSpeed (in progress, shall be activated within a few days)\r\n- Softaculous (in progress, shall be activated within a few days)\r\n- Daily backups (although, JetBackup isn't compatible with DirectAdmin yet, so these are the regular daily, compressed backups).\r\n\r\n\r\nWorried about migrations? No worries, we will migrate your account(s) for our servers.\r\ncPanel to DirectAdmin, or DirectAdmin to DirectAdmin. We got you covered.\r\n\r\n---\r\n\r\nServer location: Germany, Hetzner.\r\n\r\nShared Hosting plan:\r\n\r\nBasic \r\n25GB SSD \r\nUnlimited Emails, FTP Accounts, Domains, etc.\r\n2.50€ per month, plus VAT if applicable - [ORDER](https://myw.pt/manager/cart.php?a=add&amp;pid=8)\r\nCoupon code: 50OFF\r\n\r\nReseller Hosting plan:\r\n\r\nEntry\r\n50GB SSD\r\nUnlimited Accounts\r\n5€ per month, plus VAT if applicable - [ORDER](https://myw.pt/manager/cart.php?a=add&amp;pid=6)\r\nCoupon code: 50OFF\r\n\r\n\r\nNote: LiteSpeed/Softaculous is being worked on, we're fine-tuning it and will set it to production as soon as possible. For now, the setup consists of Apache and PHP-FPM.\r\n\r\nShould you guys have any further questions please let us know!"}