{"id": 158907, "date": "2019-07-10 22:22:29", "user": "intovps", "post": "We are now including a **DirectAdmin license for free** with each VPS. Including with the $5 base package.\r\n\r\nThis is valid for the lifetime of the VPS, not a one time promo.\r\n\r\nOur packages are based on:\r\n\r\n* KVM\r\n* OpenStack cloud with 5 regions (6th region, Cluj, coming soon)\r\n* real 24/7 phone and email support. Level 1 is covered by 4+1 guys working 12h-on/24h-off followed by another 12h-on/24h-off with 20 days yearly vacation. No outsourced support. We consider this to be core business.\r\n* we own all the hardware we're using and collocate in top-notch data centers\r\n* we operate our own AS and are RIPE and ARIN members\r\n* Fleio control panel developed by sister company\r\n\r\n![](https://i.ibb.co/GsyD4j8/vm-details.png)\r\n\r\n\r\n**M2 packge** includes:\r\n\r\n* 2GB RAM\r\n* 20GB SSD storage\r\n* 1TB taraffic\r\n* 1 vCPU core\r\n* 1 IPv4\r\n* KVM virtualization\r\n* Free DirectAdmin license included\r\n\r\nFor 5$ / month or 0.0075$ / hour\r\n\r\nDirectAdmin license activation requires VPS paid for full month, not hourly.\r\n\r\nFull pricing list: https://intovps.com/all-plans.html\r\n\r\nAvailable options:\r\n\r\n* packages from 2GB RAM to 64GB RAM\r\n* cPanel/WHM license 13$ / month\r\n* extra IPv4 $1 / month\r\n* Windows license +60% of the VPS package price\r\n* servers in Bucharest, Amsterdam, Londra, Dallas and Fremont\r\n\r\n**Compute nodes specs**\r\n\r\n* Intel Xeon E5-2640v4 CPU\r\n* 64GB, 128GB or 256GB RAM\r\n* 4 x 1TB SSDs\r\n* RAID10\r\n* 1Gbps uplink\r\n\r\n**Why choose IntoVPS**\r\n\r\n* We've been in the hosting business since 2004 selling hosting on elvsoft.com. Elvsoft has was renamed to Hosterion in November 2016. IntoVPS, our unmanaged VPS brand, was launched in June 2009.\r\n* Hosterion is a Google Cloud Platform partner, Microsoft Certified Partner with the Hosting Competency, RIPE and ARIN member\r\n* We have support staff working in 3 shifts, 24 hours a day 7 days a week.\r\n* 99.9% uptime guaranteed.\r\n* Self-service instant automated deployment. All VPS packages are automatically deployed. Are you tired of waiting hours or even days for a VPS to be set up? Order now and your VPS is ready to be used in about 60 seconds!\r\n* No overloaded servers.\r\n* we offer additional IP v4 addresses for your VPS\r\n* Fast &amp; free OS reload: Reload your VPS operating system any time you want. It usually takes less than 10 seconds and, of course, we don't charge for it.\r\n\r\nLooking for managed VPS? See https://hosterion.com\r\n"}