{"id": 159373, "date": "2019-07-31 15:23:21", "user": "MeanServers", "post": "After celebrating 5 years in business this past May and a complete infrastructure overhaul in our Denver facility, Mean Servers is returning to our roots with a special offer for the LET community! This is a one-time limited time offer available in limited quantities so order before it's too late. In the future, this special LET exclusive plan will only have 2GB of RAM!\r\n\r\nMean Servers is located in Denver, Colorado with facilities in both Denver and Los Angeles. We own and operate all of our own equipment (including IP addresses) and run a 100% Juniper network (with the exception of a lone ASA device for OOB management) with transit via CenturyLink/Level 3 and Cogent in Denver and Psychz in Los Angeles. Although we are a more mid-tier provider, we plan on having the occasional special for our fans in the LET community.\r\n\r\nLET &lt;del&gt;2GB&lt;/del&gt; 4GB Exclusive Plan\r\nCPU: 1 Intel Core\r\nRAM: &lt;del&gt;2GB&lt;/del&gt; 4GB\r\nHard Drive: 60GB SSD Storage\r\nBandwidth: 4,000GB on 1Gbps\r\nIP Address: 1 IPv4 &amp; 1 /64 IPv6\r\nrDNS: Yes, via the control panel\r\nSpecial LET Price: $7/mo\r\nLimited Quantity: 20\r\n[Order NOW before stock runs out!](https://www.meanservers.com/billing/cart.php?a=add&amp;pid=221)\r\n\r\nImmediate setup!\r\n\r\nThis offer is available at both our Denver and Los Angeles locations! Need to change a component? No problem! We have additional options for your selection during the checkout at steep discounts over our normal plans!\r\n\r\nWe accept Visa, MasterCard, Discover, American Express, PayPal and BitCoin!\r\n\r\nOur network looking glass can be viewed at [https://www.meanservers.com/looking-glass.php](https://www.meanservers.com/looking-glass.php) (note that the Network Tests are presently undergoing a revamp and may not work correctly).\r\n\r\nWe have a wide array of Linux operating systems available, check out the order form for the full list. Special requests for other than what is available on our website unfortunately cannot be fulfilled with this plan to keep overhead low, nor is any Windows operating system available with this plan. If you have a special request, you are more than welcome to purchase a plan via our website and we will be happy to fulfill your special request with that plan.\r\n"}