{"id": 160070, "date": "2019-09-03 13:46:24", "user": "FHR", "post": "Hello again!\r\nI would like to introduce SkylonHost.com. We are a European based KVM VPS (cloud) provider with knowledgeable, European based support and unique features.\r\n\r\n**What makes us unique?**\r\n* Hourly billing\r\n* High bandwidth limits, guaranteed port speed\r\n* Intuitive, fast, in-house control panel Cloudie\r\n* Located in Prague, Czech Republic (Central Europe) and powered by our own custom, highly optimized network, we offer high throughput and good latency to North American, European and Middle East markets.\r\n* Infrastructure colocated in a secure TIER III rated datacenter\r\n* We own all our hardware and IP space\r\n* Hardware cached, battery backed RAID 10 SSDs\r\n…\r\n\r\n**Enough of the yapping, I want offers!**\r\n* 512MB / 1 core / 10GB SSD / 5000GB @ 500Mbps / 2.99€/month OR 0.005€/h\r\n* 1GB / 2 cores / 15GB SSD / 10000GB @ 500Mbps / 4.99€/month OR 0.008€/h\r\n(We do have more packages but not within LET's price range)\r\n**1 EUR = 1.09 USD**\r\n\r\nOrder here: https://cloudie.skylonhost.com\r\n\r\nA special offer to all LowEndTalk members (with an account older than a month): **we will add 10% to any top-up** you do, just open a ticket saying you came from here.\r\n\r\n*Since we're a small company, no VAT is charged and the listed prices are final*\r\n\r\n**Network details**\r\nWe run our own network under [AS202297](https://bgp.he.net/AS202297#_graph4). Our transit blend consists of GTT, Telia, Cogent and Core Backbone, as well as Peering.cz internet exchange (direct low latency access to Hetzner, Google, CloudFlare, Hurricane Electric, Digital Ocean Frankfurt…)\r\n\r\nLooking glass is available here: [lg.skylonhost.com](https://lg.skylonhost.com/)\r\nLatencies to common destinations:\r\n\r\n    CloudFlare 1.1.1.1 - 0.299ms\r\n    Google 8.8.8.8 - 0.264ms\r\n    speed.hetzner.de - 10.1ms\r\n    Vultr London - 17.5ms\r\n    ping.online.net - 24.4ms\r\n    Vultr New Jersey - 97.6ms\r\n\r\nAll our servers automatically come with a single routed IPv4 and a routed /64 prefix. Additional bandwidth is available at a low price of **0.5€/TB** (we don't charge that unless you grossly exceed the bandwidth limit and agree to it). We can also provide BGP sessions to customers, free of charge.\r\n\r\n**Custom control panel?**\r\nWe were tired of using buggy, slow and unusable control panels. That is why we created **Cloudie**, a software which brings billing and VPS management under a single, easy to use interface.\r\n\r\n![21|690x325,100%](https://rabbitcdn.ml/708627_Screen%20Shot%202019-09-02%20at%2002.16.21.png) \r\nWe pride ourselves in providing high performance, good quality services. In an effort to be more transparent, we allow you to view system utilization of the node your VPS is on:\r\n![45|690x258,100%](https://rabbitcdn.ml/638963_Screen%20Shot%202019-09-02%20at%2002.16.45.png)   \r\n\r\n—\r\n\r\n![51|690x368,100%](https://rabbitcdn.ml/413808_Screen%20Shot%202019-09-02%20at%2002.16.51.png) \r\n\r\n**Offered Operating Systems**\r\n* CentOS 7\r\n* Debian 10\r\n* Ubuntu 18.04\r\n* Custom ISO on request (just open a ticket with a link to it)\r\n\r\n**Legal stuff**\r\n[Terms of Service](https://skylonhost.com/terms-of-service.html)\r\n[Acceptable Use Policy](https://skylonhost.com/acceptable-use-policy.html)\r\ntl;dr; no malware, don't spam, don't use hacking tools (including port scanners), no public VPNs/TOR exits (private ones are OK), no hosting of pirated content"}