{"id": 160118, "date": "2019-09-05 11:00:13", "user": "Abdullah", "post": "Hi all,\r\n&lt;br /&gt;\r\n\r\nHere are the special deals from our two newer locations. London and Chicago. \r\n&lt;br /&gt;\r\n\r\nThese will be available from today to the end of 10th September (GMT-4). They will be available again for few days depending on availability later on. This is so people who miss it the first time can get it in the second go. We do not offer any refunds on special plans.\r\n&lt;br /&gt;\r\n\r\n\r\n**Storage deal:**\r\n\r\n&lt;pre&gt;\r\nBase plan:\r\n1x 3.0 GHz\r\n3 GB RAM\r\n3 TB usable storage\r\n9 TB bandwidth\r\n$84 per year\r\nAdd more: 1 GB RAM, 1 TB storage and 3 TB bandwidth chunks for $2.5 per month each. Up to 30 TB storage per VM. This pricing is only for servers created during the promotion.\r\n&lt;/pre&gt;\r\n\r\n&lt;pre&gt;\r\nNote: We can do this plan on monthly billing if at least 5 TB storage is bought.\r\nNote2: Servers can be upgraded with chunks after the promotion period at the same pricing, as long as the server was ordered within the promotional period. Depends on availability.\r\n\r\n\r\nExample: A plan with 4 CPU cores, 12 TB storage, 36 TB bandwidth will cost $29.5 per month. You can calculate your own pricing and add more or less chunks to the original base plan.\r\n&lt;/pre&gt;\r\n\r\nThese are reliable storage servers with very good performance, however we recommend that you only use them for large storage intensive purposes. We offer NVMe plans for other usage.\r\n\r\n&lt;br /&gt;\r\n\r\n**NVMe plans:**\r\n\r\n&lt;pre&gt;\r\n1 CPU core (15% dedicated)\r\n512 MB RAM\r\n8 GB NVMe disk (RAID-10)\r\n1 TB bandwidth\r\n$15 per year\r\nFree upgrade with double RAM, double disk, and 5x bandwidth\r\nFree 40 Gbps DDoS protection available on request\r\n&lt;/pre&gt;\r\n\r\n\r\n&lt;pre&gt;\r\n1 CPU core (30% dedicated)\r\n1 GB RAM\r\n10 GB NVMe disk (RAID-10)\r\n1 TB bandwidth\r\n$30 per year\r\nFree upgrade with double RAM, double disk, and 5x bandwidth\r\nFree 40 Gbps DDoS protection available on request\r\n&lt;/pre&gt;\r\n\r\n&lt;br /&gt;\r\n\r\nAny bigger plans on our website can be bought with 2x RAM, 2x storage, 5x bandwidth and free DDoS protection - in Chicago and London. Only while this promotion lasts.\r\n\r\n&lt;br /&gt;\r\n\r\n\r\n**Additional storage plans:**\r\n\r\n&lt;pre&gt;\r\n1 CPU core\r\n512 MB RAM\r\n250 GB storage\r\n1 TB bandwidth\r\n$15 per year\r\n(available in limited quantities)\r\n&lt;/pre&gt;\r\n\r\n\r\n&lt;pre&gt;\r\n1 CPU core\r\n1 GB RAM\r\n1 TB storage\r\n4 TB bandwidth\r\n$12 per quarter\r\n&lt;/pre&gt;\r\n\r\n&lt;br /&gt;\r\n\r\nPlease note that all of the plans listed in this post are only available in London and Chicago. All plans come with private networking - so you can configure your own combination of Storage and NVMe plans like many of our customers.\r\n\r\n&lt;br /&gt;\r\n\r\n**Network:**\r\n\r\nChicago: http://172.107.196.100/200MB.test\r\nLondon: http://45.91.93.250/100MB.test\r\n\r\nIf you see better routing/network performance from another provider in the same location, please contact us with traceroutes and other related information. We are always happy to make adjustments and will do our best to deliver similar or better performance.\r\n\r\n&lt;br /&gt;\r\n\r\n**To order:**\r\n\r\nTo order, please sign up/login at manage.hosthatch.com and deposit the appropriate amount of funds. Then open a ticket with sales mentioning the promotion/location you want. All special orders are manually provisioned so please allow up to 24 hours.\r\n\r\n&lt;br /&gt;\r\n\r\nThanks guys!"}