{"id": 160885, "date": "2019-10-20 09:14:33", "user": "GameTownProjects", "post": "I have been offering server hosting for more than 7 years now and have experienced both good and bad times. Throughout the time, we were always available when it came to downtime or other infrastructure issues and stick to this approach to customer satisfaction.\r\n\r\nAfter our problems in May, our new panel is now equipped with the most important features and is stable, so I offer free resources for someone who knows exactly what he is doing.\r\n\r\nWe DO NOT support server setup and we will NOT refund money if panel or server does not meet the expectations! NO backups are created by the servers and NO availability guaranteed (typically over 99.9%).\r\n\r\nTo order the offers must be currently registered on https://panel.haendler.it. In the order system vServer can be ordered, which are delivered automatically and immediately after payment.\r\n\r\nAll offers are located in the Netherlands, which has been connected to Frankfurt since this month as well as directly to Frankfurt to keep the latency as low as possible.\r\nAs DDoS Protection Voxility is used to be able to filter in both Amsterdam and Frankfurt.\r\n\r\nGigabit connection, up to 2 TB traffic, voxility DDoS protection, an IPv4 address and unlimited on request IPv6 addresses are included in all these offers.\r\n\r\n\r\n&gt; **KVM HDD vServer - 2 GB Ram**\r\n&gt; * 1 vCore\r\n&gt; * 2 GB Ram\r\n&gt; * 20 GB HDD\r\n&gt; \r\n&gt; Only 2,28 € / month\r\n\r\n\r\n&gt;&gt; **KVM HDD vServer - 4 GB Ram**\r\n&gt;&gt; * 2 vCores\r\n&gt;&gt; * 4 GB Ram\r\n&gt;&gt; * 60 GB HDD\r\n&gt;&gt; \r\n&gt;&gt; Only 3,18 € / month\r\n\r\n\r\n&gt;&gt; **KVM HDD vServer - 8 GB Ram**\r\n&gt;&gt; * 4 vCores\r\n&gt;&gt; * 8 GB Ram\r\n&gt;&gt; * 150 GB HDD\r\n&gt;&gt;  \r\n&gt;&gt; Only 5,06 € / month\r\n\r\n\r\n&gt; **KVM SSD vServer - 2 GB Ram**\r\n&gt; * 1 vCores\r\n&gt; * 2 GB Ram\r\n&gt; * 20 GB SSD\r\n&gt; \r\n&gt; Only 2,47 € / month\r\n\r\n\r\n&gt;&gt; **KVM SSD vServer - 4 GB Ram**\r\n&gt;&gt; * 2 vCores\r\n&gt;&gt; * 4 GB Ram\r\n&gt;&gt; * 30 GB SSD\r\n&gt;&gt; \r\n&gt;&gt; Only 3,45 € / month\r\n\r\n\r\n&gt;&gt; **KVM SSD vServer - 8 GB Ram**\r\n&gt;&gt; * 4 vCores\r\n&gt;&gt; * 8 GB Ram\r\n&gt;&gt; * 60 GB SSD\r\n&gt;&gt; \r\n&gt;&gt; Only 5,50 € / month\r\n"}