{"id": 16154, "date": "2013-11-06 17:14:59", "user": "ModulesGarden", "post": "Are you tired of ineffective and time-consuming management of IP addresses?\r\nWe have a solution for you!\r\n\r\n**ModulesGarden** is proud to present you the** IP Manager For WHMCS 1.2!**\r\nOur module will allow you to effectively manage IP pools and automatically assign IP addresses to your servers, products, addons or configurable options!\r\nWould you like to also assign an IP pool for a specified client, export IP pools, integrate with 3rd party applications like cPanel or Plesk? Not a problem! \r\n\r\nWe have got something for your customers too!\r\nIP Manager For WHMCS will let your customers will be able to integrate with WHMCS client area and manage their IP addresses within it. \r\n\r\nWould you like to fully automate management and assignment of IP pools in your WHMCS?\r\n**IP Manager For WHMCS is a solution you are looking for!**\r\n\r\n\r\nSeeing huge interest in this module, we decided to gather together all your feedback and quickly prepare new, improved version. So what is new in the IP Manager For WHMCS 1.2?\r\n\r\n\r\n**Changelog:**\r\n\r\n♦ Added support for IPv6 \r\n\r\n♦ Added new feature: Export IP pools, with the information assignment to XML and CSV format\r\n\r\n♦ Added new feature: Create an IP pool by a range instead of a CIDR (for IPv4)\r\n\r\n♦ Added new feature: Exclude (reserve) selected IP addresses from a pool\r\n\r\n♦ Added new feature: Delete single IP address or a bunch of IP addresses from a pool\r\n\r\n♦ Added new filters in the IP List\r\n\r\n♦ Added integration with Plesk module\r\n\r\n♦ Clients selection at the pool configuration, replaced with the autocomplete field (for better database performance)\r\n\r\n♦ Improved interface to be more user-friendly\r\n\r\n♦ Major bug fixes\r\n\r\n**Are You Interested?**\r\n[✔ Order IP Manager For WHMCS Now!](http://www.modulesgarden.com/products/whmcs/ip_manager/pricing)\r\n\r\n**Do You Need More Information?**\r\n[✔ Read More About IP Manager For WHMCS](http://www.modulesgarden.com/products/whmcs/ip_manager/features) \r\n\r\n**Are You Looking For Complete Documentation?**\r\n[✔ Visit IP Manager For WHMCS Wiki](http://www.docs.modulesgarden.com/IP_Manager_For_WHMCS)\r\n\r\n**Coming Next:**\r\n\r\n♦ Parallels Cloud Server For WHMCS\r\n\r\n♦ cPanel Extended For WHMCS 2.2\r\n\r\n♦ Proxmox VPS For WHMCS 1.2 + Proxmox Cloud For WHMCS\r\n\r\n♦ Resellers For WHMCS 1.2\r\n\r\n\r\n\r\n**Do You Need Custom Software Development?**\r\n[✔ Don't hesitate any longer! Contact us now!](https://www.modulesgarden.com/order/request)"}