{"id": 161592, "date": "2019-11-26 03:36:22", "user": "SplitIce", "post": "[![](https://www.x4b.net/img/marketing/red-1.png)](https://www.x4b.net)\r\n\r\n[X4B Anycast DDoS Protection](https://www.x4b.net/) Black Friday deals! Available for any product in our Remote Protection product line.\r\n\r\n## What do we provide?\r\n\r\nWe provide Remote DDoS protection offerings, Anycast CDN services &amp; Load Balancing / Failover in a single reasonably priced product. We have been in business for over 5 years and run our own network (AS136165) with PoPs on 4 continents.\r\n\r\n## AS136165: The network\r\n\r\n[![](https://drive.google.com/a/x4b.net/uc?id=1QloRTRrOEgSGo7wKO-xE_EG39bCpif5r)](https://www.x4b.net/protection/ddos-prices)\r\n\r\nCurrent PoPs:\r\n\r\n - Amsterdam, Netherlands\r\n - London, United Kingdom\r\n - Los Angeles, CA, USA\r\n - Dallas, TX, USA\r\n - Ashburn, VA, USA\r\n - Miami, FL, USA\r\n - Tokyo, Japan\r\n - Singapore, Singapore\r\n\r\nLooking Glass: https://lg.x4b.net/ (103.249.70.2)\r\n\r\n## The Deal\r\n\r\nGet up to 66.66% off (3 months for the price of 1) when you purchase DDoS protection plans of any standard size from us with your friends.\r\n\r\nOffers:\r\n - Get 3 months for the price of one when you register with 2 of your friends (66%+ off).\r\n - Get 2 months for the price of one when you register with 1 friend (50% off).\r\n\r\nHow to claim:\r\n1. Have friends\r\n2. Agree on a common plan, all customers must order a plan of the same value\r\n3. Place and pay for order (every customer in the group must do this).\r\n4. One person in the group open a support ticket to claim with the service IP addresses of everyone in the group.\r\n\r\nAll bonus months must be claimed before 24/12/2019 (GMT+11). Bonus months will be added within 5 business days.\r\n\r\nTerms:\r\n - Available only for new customers and services\r\n - All customers in a group must be eligible for the offer\r\n - All groups must make contact to claim additional months within 6 days of purchase. All services must have been registered after the posting of this offer.\r\n - Not valid with ANY other offer, Addons/Extras or Management\r\n \r\nLink: https://www.x4b.net"}