{"id": 161653, "date": "2019-11-28 01:59:35", "user": "jar", "post": "![MXroute%20Black%20Friday%20Banner|690x255](https://hostballs.com/uploads/default/optimized/2X/3/3e92e95401c4a4e9c95f59ebc1f45c83688577aa_2_690x255.png) \r\n\r\nIf you're familiar with us and want to skip the introduction, you can find our offers here:\r\nhttps://mxroute.com/black-friday/\r\n\r\nIf you're new to MXroute, let me tell you a bit about it. MXroute is an e-mail hosting service with a primary focus on outbound delivery. However, we're continually improving on the inbound and user interface side as well. Our most recent product iteration uses DirectAdmin to allow you to add domains, create e-mail accounts, and configure your service. We offer the things you expect with an e-mail service:\r\n\r\nProtocols: SMTP, IMAP, POP3\r\nWebmail: Roundcube, Rainloop, Crossbox\r\nFeatures: Forwarding, Plus Aliasing, Sieve Filters\r\n\r\nYou can create unlimited e-mail accounts on unlimited domains, each with their own unique login information for your friends, family, or customers. Every e-mail account has a limit of 300 outbound e-mails per hour.\r\n\r\nDelivery: We have a very complex system that sends all outbound emails to one of two redundant outbound filters. Those then send out to random redundant relays which attempt delivery. If delivery fails, the email is forwarded to another IP to try again. After a number of failures, it goes out for a last try through a third party service like MailChannels or SpamWall. If we bounce it back to you, it's a pretty safe bet that e-mail wasn't going to get there no matter what you did. We keep our IPs incredibly clean to ensure that you get inbox delivery if possible. We can't force someone to deliver to the inbox, but we can confirm that all of our IP ranges can deliver to the inbox of all major e-mail services (like Yahoo, Hotmail, Gmail) if they will accept yours (by testing our own domains through each).\r\n\r\nOur first offer is a new reseller package. Let me give you some answers to the questions you might have about that:\r\n[What is reseller and how is it different?](https://community.mxroute.com/t/what-is-reseller-and-how-is-it-different-from-your-other-services/)\r\n[Do reseller accounts have different sending limits?](https://community.mxroute.com/t/do-reseller-accounts-have-different-sending-limits)\r\n[Can I oversell disk space?](https://community.mxroute.com/t/can-i-oversell-disk-space-with-a-reseller-account)\r\n\r\nNormally this package will be $25/m. I know I've said in the past that Black Friday packages were limited and then continued selling them, but this promotion is only sustainable for 300 orders. It is specifically calculated for the usage we expect of resellers, and can only be deployed on one of two servers in Hetzner Germany. If you miss this, the only way to get it will be to pay $25/m.\r\n\r\nPromo: Reseller150\r\n- 150GB Storage\r\n- Unlimited Email Accounts\r\n- Unlimited Domains\r\n- Unlimited Control Panel User Accounts\r\n- 300 outbound emails per hour per sender\r\n- [You have to set this up yourself to look like our service, or your own](https://mxroutehelp.com/index.php/category/reseller/)\r\n- $84/year\r\n- [Order here](https://portal.mxroute.com/cart.php?a=add&amp;pid=94)\r\n\r\nNow I'm also giving a normal, non-reseller promo. This is the standard MXroute e-mail service, and will be much more polished because you'll already have our custom user template for the control panel, rather than having to set up your own (even though our tutorial for doing that on reseller is pretty easy).\r\n\r\nPackage: Black Friday 2019\r\n- 25GB Storage\r\n- Unlimited Email Accounts\r\n- Unlimited Domains\r\n- 300 outbound emails per hour per sender\r\n- $10/year\r\n- [Order here](https://portal.mxroute.com/cart.php?a=add&amp;pid=96)\r\n\r\nPlease note that we do not migrate accounts to promotions, nor upgrade current packages to promotions. Promotions are deployed on specific servers that are built with a specific financial calculation, these packages can only be purchased as new. You are welcome to purchase them and manually move your data to them on your own, if desired.\r\n\r\nOh by the way, we have a little surprise. If you want to test out our Android app, you can download it here: https://mxroute.com/app-debug.apk"}