{"id": 162184, "date": "2019-12-20 15:00:41", "user": "seriesn", "post": "[![](https://files.servedez.com/logo/logo_big.png)](https://nexusbytes.com)\r\n\r\n**Ho! Ho! Ho! Santa Nexus Bytes is coming to TOWN!**\r\n\r\n![](http://thinknice.com/wp-content/uploads/2012/12/Dancing-Santa-Reindeer-Funny-Christmas-GIF.gif)\r\n\r\nIt is Christmas, the season of giving, and the Nexus Bytes elf workshop has been very, very busy. The elves have come up with three Christmas raffles for the LET community! \r\n\r\n----------\r\n\r\n![](https://thumbs.gfycat.com/EnragedFatherlyKingbird-small.gif)\r\n\r\n**1. The Spirit of Giving Raffle**\r\n\r\nThis is the season of giving and we want to give back to the LET community for their tremendous support this year! One lucky forum member will receive a [VPS-2G plan](https://nexusbytes.com/cart.php?a=add&amp;pid=83) for a year!\r\n\r\nHowever, because it is the season of giving, you will be Santa, not us. Every VPS order from now until 24th December 2019 is entitled to nominate one forum member to receive this gift. Not only do you get a shiny new VPS for Christmas, you also get to give out a shiny new box to someone else! \r\n\r\n**_How does it work?_**\r\n\r\n  * Receiver has to be an active member of this community (active for at least 60 days with minimum 10 post count).\r\n  * Post the last 4 digits of your order number in a comment below and tag the LET member that you wish to nominate to receive the prize. One nomination per order. The same forum user can be nominated by multiple users.\r\n  \r\n----------\r\n**2. Pick your Double Raffle**\r\n\r\nSome of us need more cores. Some are RAM hungry. Others have storage obsessive compulsion disorder. Not to fret. The Nexus Bytes elves have made **one special box** this Christmas that **doubles** any resource, forever!\r\n\r\n**_How does it work?_**\r\n\r\n * Only applicable for orders with minimum 6 months payment term. Both new and existing Nexus Bytes Family Members are eligible. Every order has one chance to double a resource.\r\n * Please leave a note/additional comment on your order that you wish to be considered for the \"Pick your Double Raffle\" and which resource you wish to double on that order (choose either CPU, RAM or Storage).\r\n * Double your chances by posting the last 4 digits of your order in a comment below together with the resource you wish to double.\r\n\r\n----------\r\n**3. Speeding Ticket Raffle**\r\n\r\nThe Nexus Bytes elves got together and asked themselves how fast a VPS could they make this Christmas. They made **one special box** that has a port speed of **10Gbps** and **doubles** the bandwidth of that box, forever! Any faster and you will be getting a speeding ticket for Christmas.\r\n\r\n**_How does it work?_**\r\n\r\n * Only applicable for orders with minimum 6 months payment term. Both new and existing Nexus Bytes Family Members are eligible.\r\n * Please leave a note/additional comment on your order that you wish to be considered for the \"Speeding Ticket Raffle\".\r\n * Double your chances by posting the last 4 digits of your order in a comment.\r\n\r\n----------\r\n\r\n**Christmas Raffle FAQ** \r\n\r\n  * Valid for all paid VPS orders placed between December 20th to December 24th 2019 _(est)_\r\n  * Each order is eligible to enter all three raffles.\r\n  * Winners will be announced on Christmas Day itself.\r\n\r\n-----------"}