{"id": 163635, "date": "2020-03-26 15:45:39", "user": "ratherbak3d", "post": "Virtual6 Ltd are a small family owned IT &amp; Hosting company founded in December 2018. We're based in Rotherham, United Kingdom, but we work with customers and service partners from all around the world.\r\n\r\nThere are tons of reasons why we think you should choose Virtual6 Ltd for your IT &amp; Hosting requirements. Here are just three of our favorite features:-\r\n\r\n**1) QUALITY UK BASED SUPPORT**\r\n\r\nOur customer services team are based in-house and located in the United Kingdom, we don't outsource any part of this work. That means you get quality support that is consistent, knowledgeable and provided within a time frame which is set by us. Did you know that we guarantee a response to ALL inquiries within just 3 working hours as standard?\r\n\r\n**2) 24/7/365 MONITORING &amp; RESPONSE**\r\n\r\nEvery part of our network is actively monitored in real time, with issues and downtime automatically reported to our on-call staff member. This monitoring takes place 24/7/365 and our on-call staff also operate 24/7/365 on rotation to deal with any reported problems. Whilst customer services may not be provided out of hours, updates and announcements are provided at our blog.\r\n\r\n**3) HONEST &amp; COMPETITIVE PRICING**\r\n\r\nWe regularly compare our prices with industry leaders and other suppliers to ensure we provide honest yet competitive pricing. In regards to hosting products, we do not oversell our services and you will always be able to utilize what you have paid for. We may not always be the cheapest option on the market, but we are confident that our combination of price, service and support are unrivaled.\r\n\r\nAs an introduction to the LET community we're offering 50% OFF, which is recurring for the life of your service. Simply click the order URL and enter the promotion code.\r\n\r\n**VM1GB**\r\nUnmetered Traffic\r\n1 Gbit/s Shared Network Port\r\n1 x Dedicated IPV4 Address\r\n1 GB DDR3 RAM (ECC)\r\n125 GB RAID-10 Storage (W/ BBU)\r\n2 X Intel(R) Xeon(R) vCPU @ 3.40GHz\r\nFalkenstein, Germany Datacenter\r\nInstant Setup\r\n£3.18 PER MONTH ($3.84 AT TIME OF POSTING) (PAID MONTHLY, NO CONTRACT)\r\nPromotion Code: Not Required\r\nOrder URL: https://virtual6.co.uk/blesta/order/main/packages/virtual-machines/?group_id=2\r\n\r\n**Who are you doing business with?**\r\n\r\nVirtual6 Ltd are a registered company in England &amp; Wales (#11709426). Please find our registered office address details below, please send all legal correspondence to this address.\r\n\r\nVirtual6 Ltd\r\nUNIT A\r\n82 James Carter Road\r\nMildenhall\r\nSuffolk\r\nIP28 7DE\r\nUnited Kingdom\r\n\r\nTel: 0843 289 1615\r\n\r\nTerms of service:\r\nhttps://virtual6.co.uk/blesta/plugin/support_manager/knowledgebase/view/4/terms-of-service/3/\r\n\r\nAcceptable usage policy:\r\nhttps://virtual6.co.uk/blesta/plugin/support_manager/knowledgebase/view/3/acceptable-usage-policy/3/\r\n\r\n**How can I pay?**\r\n\r\nWe currently accept PayPal and UK Bank Transfer, we now support BTC (Bitcoin) payment too!\r\n\r\n**I have questions..**\r\n\r\nFor the fastest response please visit https://virtual6.co.uk/#contact and either submit a ticket or start a live chat. Alternatively, send me a PM here on LET or simply reply to this thread.\r\n\r\nThank you for reading."}