{"id": 164318, "date": "2020-04-29 05:42:39", "user": "EvolutionHost", "post": "Hello LowEndTalk community,\r\n\r\nWe're going to have somewhat of a competition for the LET community.\r\n\r\n[Evolution Host](https://evolution-host.com/ \"Evolution Host\") is **giving away up to 30 Enterprise grade VPS ** for those who can design a top-notch banner graphic.\r\n\r\nThe servers we'll be giving out can range from our Starter VPS package (https://evolution-host.com/vps-hosting.php?package=Starter) to our Professional VPS package (https://evolution-host.com/vps-hosting.php?package=Professional)\r\n\r\nWhich server we offer is dependent upon how suitable/well designed the Evolution Host team deem the image/banner/advert to be.\r\n\r\nThe offer is initially capped at 30 servers however if we continue to receive quality submissions  we'll take it on a case-by-case basis.\r\n\r\n**Guidelines**\r\n* The image can be any dimensions you want. We want to get a nice mixture.\r\n* Do not use profanity in the image\r\n* The banner can be regarding our [VPS Hosting](https://evolution-host.com/vps-hosting.php \"VPS Hosting\"), our [GAME VPS Product](https://evolution-host.com/vps-game.php \"GAME VPS Product\") or any of our [game servers](https://evolution-host.com/gameservers.php \"game servers\")\r\n* Applicants can submit more than one graphic to increase their chances or to try to win multiple VPS\r\n* You do not need to send us the image source until after your application has been approved\r\n* If your application is approved, we will require the source\r\n* The VPS will remain yours free of charge permanently as long as you do not violate our terms of service. We may occasionally request that you publish an honest review of the service.\r\n\r\nTo apply, **simply shoot us over an E-mail to business@evolution-host.com ** with the graphic/banner embedded in the E-mail. We'd ask that you do not add it as an attachment for quick-review purposes.\r\n\r\nIf you have any questions feel free to ask.\r\n\r\nWe look forward to seeing what you guys come up with.\r\n\r\nBest of luck!"}