{"id": 164605, "date": "2020-05-11 19:08:41", "user": "oplink", "post": "-----------------------\r\n**About Oplink.net**\r\n-----------------------\r\nOplink.net is an independently owned company. Our network is located in a secure private suite inside the Houston CenturyLink/Level3 Tier1 “Premier Datacenter”. This datacenter is the main routing point serving the Houston Metropolitan area. For Internet bandwidth, our dedicated uplink is 100Gb/s over fiber directly to Tier 1 CenturyLink/Level3. CenturyLink/Level3 is multi-homed and multi peered, so we deliver highest reliability and lowest latency access to the Internet. In addition, we use Corero DDos Mitigation to protect your server.\r\n\r\nBy owning and managing all equipment, we have total control of how our services are deployed, managed, secured, and supported. In our suite we use new Cisco hardware, resulting in some of the fastest routing on the market. Each rack has a 10Gb/s uplink so there is always plenty of bandwidth to all customers for every service we sell. Many providers resell lower Tier data at the mercy of some other companies’ priorities and equipment problems - Not Oplink.net. Most other providers don’t come close to the quality of bandwidth and services we offer.\r\n\r\nWhen you’re looking for a provider these things are important. Choose Oplink.net for the best, most reliable, secure, and fastest solution.\r\n\r\n-----------------------\r\n**Company News**\r\n-----------------------\r\nFeb, 2020: We are now offering 1 Gbps Unmetered ports with all colo servers and dedicated servers.  [See Fair Use Bandwidth Policy](https://my.oplink.net/index.php?rp=/knowledgebase/88/Is-my-Oplink.net-Colocation-traffic-really-unmetered-per-month.html \"See Fair Use Bandwidth Policy\")\r\n\r\nMay, 2020: Deployed a Corero Smartwall to provide DDos attack protection to our customers. We chose Corero protection because it delivers the best layer 3 to layer 7 DDos mitigation in seconds before disruption of any Oplink.net service. To learn more visit: https://www.oplink.net/ddos.html\r\n\r\n\r\n-----------------------\r\n**Offers**\r\n-----------------------\r\n\r\n**VPS 1GB (KVM)**\r\n40 GB SSD Local Storage\r\n1 Core\r\n1 GB Memory\r\n5TB data per month\r\n$5/month\r\nOrder : https://my.oplink.net/cart.php?a=add&amp;pid=135\r\n\r\n**Dedicated Server: E3-1270 V3**\r\n32 GB DDR3\r\n1TB Samsung SSD\r\n1 IPv4\r\n1 Gbps Unmetered Traffic  [See Fair Use Bandwidth Policy](https://my.oplink.net/index.php?rp=/knowledgebase/88/Is-my-Oplink.net-Colocation-traffic-really-unmetered-per-month.html \"See Fair Use Bandwidth Policy\")\r\n$59/month\r\nOrder : https://my.oplink.net/cart.php?a=add&amp;pid=199\r\n"}