{"id": 165188, "date": "2020-06-10 17:07:34", "user": "oneilonline", "post": "This is an EXCLUSIVE offering just on Low End Talk!\r\nA massive discount of 33% on our OpenVZ 512MB VPS @ Seattle\r\n\r\n&lt;b&gt;OVZ-VPS-512&lt;/b&gt;\r\n512MB RAM / 512MB vSwap\r\n20GB RAID-10 SSD Storage\r\n1 CPU Core @ 3.70Ghz\r\n1Gbps Uplink\r\n1TB Transfer\r\n10Gbps DDoS Protection Included\r\n$36.00/yr &lt;b&gt;NOW $24.00/yr&lt;/b&gt;\r\n&lt;a href=\"https://portal.oneilonline.com/cart.php?cart=1&amp;rd=1&amp;site=WA&amp;service=VPS%20Hosting&amp;title=OVZ-VPS-512&amp;cycle=Yearly\"&gt;[ORDER NOW]&lt;/a&gt;\r\n&lt;b&gt;Coupon Code: 12OFFMYVPS&lt;/b&gt;\r\n\r\n------------------------------------------------------\r\n&lt;b&gt;Network Info:&lt;/b&gt;\r\n&lt;b&gt;&lt;a href=\"https://www.oneilonline.com/ourdatacenter-status.php?city=Seattle\"&gt;Seattle, WA Datacenter&lt;/a&gt;&lt;/b&gt;\r\nTest IPv4:\r\nping 74.121.188.138\r\nping 207.244.149.242\r\nTest File: &lt;a href=\"http://207.244.149.242:8080/100MB.test\"&gt;100MB.test&lt;/a&gt; / &lt;a href=\"http://207.244.149.242:8080/1000MB.test\"&gt;1000MB.test&lt;/a&gt;\r\n\r\n------------------------------------------------------\r\n\r\n&lt;b&gt;What's included with your VPS:&lt;/b&gt;\r\nSolusVM Control Panel to manage your VPS.\r\nCentOS, Ubuntu and Debian OSs available!\r\nCPanel, DirectAdmin, and Webmin Control Panels Available!\r\nManaged Server Services Available!\r\nOffsite Backup Available!\r\nAdditional IPs Available!\r\n1Gbps Uplink Port On All VPS Containers\r\n10Gbps Uplink Port On All VPS Nodes\r\nSSD Hard Drives On All Nodes\r\nRAID-10 Redundancy On All Nodes\r\nDDoS Protection up to 10Gbps - Automated Null Route at 10+Gbps spike\r\nSLA 99.99% Uptime at all our datacenters\r\n\r\n&lt;hr&gt;\r\n\r\n\r\n&lt;b&gt;Over 25 years in business&lt;/b&gt;, Watta Server has the experience in the hosting industry to know how to do it right.\r\n\r\n&lt;b&gt;We do a lot more than just hosting, we are a full service hosting company.&lt;/b&gt; If you need a control panel installed like cpanel, webmin or tcadmin: &lt;b&gt;we can do it for you&lt;/b&gt;. If you need us to secure your server, setup and config a firewall, or just monitor your server security or uptime: &lt;b&gt;we can do it for you&lt;/b&gt;. If you need us to migrate your data or systems, or create a cluster for more computing power: &lt;b&gt;we can do it for you&lt;/b&gt;. &lt;b&gt;38 Datacenters worldwide with 100+ available servers, we have what you need.&lt;/b&gt; Everything from web servers, domain servers, game servers, database servers, voice servers, web design, web development, or an ecommerce web site: &lt;b&gt;we have the knowledge and experience to take care of you.&lt;/b&gt;\r\n\r\nWe have been around since 1994 because we genuinely care about our customers. We are here for YOU! Our USA Based support and tech staff are online 24/7 available to support you, and will work with you through the entire process from start to finish. Give us a try, test us! Submit a support ticket today and see how fast our response time is!\r\n\r\n&lt;b&gt;Pride in our Network!&lt;/b&gt;\r\nWe maintain facilities located across the US and Europe to ensure the best response times and latency times. Our highly scalable network with more than 1000+ Gigabit per second network capacity has diverse paths from each of our datacenters to provide for industry-leading quality fiber optic connectivity through such providers as Internap, Level3, Savvis, Spectrum, Comcast, Telia, Zayo, Hibernia, GTT, Time Warner Cable, Qwest, CenturyLink, Abovenet, and Cogent. Our fully redundant, load balanced, core network and backbone connectivity is unsurpassed in its efficiency and performance. This unique combination provides a superior network infrastructure with an unmatched quality of service.\r\n\r\nThousands of clients around the globe choose Watta Server for the superior reliability our world-class data centers provide, with unparalleled security, network availability, capacity, processing power and operations management. With your IT infrastructure safe in our data centers, you can focus on cutting operational costs and on managing your core business success, not its servers.\r\n\r\n&lt;a href=\"http://www.wattaserver.com\"&gt;WattaServer.com&lt;/a&gt;\r\n&lt;a href=\"http://www.wattaserver.com/vps-openvz.php\"&gt;Watta OpenVZ VPS&lt;/a&gt;\r\n&lt;a href=\"http://www.wattaserver.com/vps-kvm.php\"&gt;Watta KVM VPS&lt;/a&gt;\r\n&lt;a href=\"http://www.wattaserver.com/dedicatedservers.php\"&gt;Watta Dedicated Server&lt;/a&gt;\r\n\r\n&lt;hr&gt;\r\n\r\n● &lt;a href=\"http://www.wattaserver.com\"&gt;Watta Server&lt;/a&gt; is a brand of &lt;a href=\"http://www.oneilonline.com\"&gt;ONeil Online&lt;/a&gt;, founded in 1994 @ Seattle, WA.\r\n● &lt;a href=\"http://www.wattaserver.com/testimonials.php\"&gt;Read what our customers have to say! Customer Testimonials!&lt;/a&gt;\r\n● Network Details, Realtime Status, Test IPs, Test File links and more info &lt;a href=\"https://www.wattaserver.com/ourdatacenter.php\"&gt;can be found here&lt;/a&gt;\r\n● Sorry, IPv6 only available at our Chicago datacenter.\r\n● Warez-related, Bulk Mail, and Spam-related activities are strictly forbidden. Please review our &lt;a href=\"http://www.wattaserver.com/termsofservice.php\"&gt;TOS&lt;/a&gt; and &lt;a href=\"http://www.wattaserver.com/acceptableusepolicy.php\"&gt;AUP&lt;/a&gt; prior to ordering.\r\n● We accept PayPal, Stripe, VISA and MasterCard payments. No Bitcoin.\r\n● Promotional offers cannot be combined with other promotional offers.\r\n\r\nDo you have a question? Feel free to hop on live chat for a quick talk @ &lt;a href=\"http://www.wattaserver.com\"&gt;www.WattaServer.com&lt;/a&gt;.\r\n\r\nThanks for your interest!\r\n"}