{"id": 165214, "date": "2020-06-11 23:05:19", "user": "hostworld", "post": "Hello there!\r\n\r\nWe're hostworld.uk, and we're a UK &amp; US based web hosting provider. Let's cut to the chase, here are some key things you _need_ to know about us before you buy our plans and join us on your VPS hosting journey:\r\n\r\n- 24/7 expert support and lightning fast ticket responses - we respond to all support tickets within 20 minutes on average!\r\n- We own and operate our own VPS infrastructure and have heavily invested in enterprise-grade hardware and our super-fast network to ensure we have one of the best VPS platforms available. Because we are in full control of our platform start-to-finish, we can provide a fully featured and high level of service at a low cost point.\r\n- Tailor your VPS to suit your needs. Add some extra storage, maybe a little more RAM too, and go all out and increase the number of CPU cores. It's up to you.\r\n- We only use state of the art NVMe &amp; SSD drives in all of our servers - no moving parts means a faster service for you!\r\n- UK &amp; US servers - we currently provide our services from UK &amp; US data centres which provide super-fast connectivity, even if you don't live there!\r\n- We really do care about your hosting experience - talk to us, send us an email, pick up the phone, we're real people striving to provide every single one of our customers with a consistent and reliable hosting experience, no matter how much is spent on hosting with us.\r\n- We're reliable! We provide a 99.9% uptime guarantee because making sure your website is available is essential. You can see our uptime here https://status.hostworld.uk/.\r\n\r\nIf you need to know anything else about us send an email to sales@hostworld.uk and we'll be back in touch!\r\n\r\n------------\r\n**So, what plans are limited edition?**\r\n------------\r\n\r\nWe've recently made the move to NVMe nodes. With that, we are now cleaning up some of our old stock and thought why not pass some of the fantastic savings onto our customers.\r\n\r\nThe below packages are completely limited edition, and are only available whilst stock lasts, so grab one (or maybe two?) whilst you can!\r\n \r\n**SSD Limited Edition 1**\r\n\r\n40GB SSD Storage\r\n1x vCPU\r\n1GB RAM\r\nFREE 120GB Backup Storage\r\nUnmetered Bandwidth\r\nFast 1 Gbps Uplink\r\nIPv4 &amp; IPv6\r\n\r\n**Only £3.49 ~ $4.39 per month!**\r\n\r\n**[Order Now](https://portal.hostworld.uk/cart.php?a=add&amp;pid=76 \"Order Now\")**\r\n\r\n**SSD Limited Edition 2**\r\n\r\n80GB SSD\r\n2x vCPU\r\n4GB RAM\r\nFREE 240GB Backup Storage\r\nUnmetered Bandwidth\r\nFast 1 Gbps Uplink\r\nIPv4 Only\r\n\r\n**Only £5.59 ~ $7.00 per month!**\r\n\r\n**[Order Now](https://portal.hostworld.uk/cart.php?a=add&amp;pid=75 \"Order Now\")**\r\n\r\n------------\r\n**What other plans do you offer?**\r\n------------\r\n\r\nMinus the limited edition SSD LE 1 &amp; SSD LE 2 packages above, all other packages are available in both the UK &amp; US with NVMe storage. To view more packages please visit https://hostworld.uk/ssd-vps or take a look at our VPS 0.5 package below.\r\n\r\n**VPS 0.5**\r\n\r\n512MB RAM\r\n1x vCPU\r\n15GB NVMe Storage\r\nFREE 45GB Backup Storage\r\nUnmetered Bandwidth\r\nFast 1 Gbps Uplink\r\nIPv4 &amp; IPv6\r\n\r\nOnly £2.99 ($3.74) per month\r\n\r\n**[Order UK](https://portal.hostworld.uk/cart.php?a=add&amp;pid=61 \"Order UK\") - [Order US ](https://portal.hostworld.uk/cart.php?a=add&amp;pid=61&amp;configoption[145]=1186 \"Order US \")**\r\n\r\n------------\r\n**Test Our Network**\r\n------------\r\n\r\nLooking Glass (UK): [http://lg.hostworld.uk](http://lg.hostworld.uk)\r\nLooking Glass (US): [http://lgus.hostworld.uk](http://lgus.hostworld.uk)\r\n\r\n------------\r\n**What do our customers think?**\r\n------------\r\n\r\n&gt; **Great value**\r\n&gt; Great value, great service, great performance. The best of every world with this company. Highly recommended for all types of hosting needs. Andrew specifically has been great to work with.\r\n\r\n&gt; **Excellent Team**\r\n&gt; Switched to HostWorld a few months ago and literally could not be any more happier. I've been in this game for 20 years and the service these guys provide is the best I've experienced. They have gone above and beyond from the start. Highly recommend!\r\n\r\n&gt; **Excellent service so far, a provider you will want to stick with.**\r\n&gt; I've been with hostworld for just over 3 months as I was looking for a reliable UK unmanaged KVM VPS provider that offered unmetered bandwidth and decent hardware for a fair price. So far hostworld has been consistently good. I have not run into any problems with the service. As far as their support goes, their support so far has been excellent. The two times I have opened a ticket (only for RDNS changes) they have been answered and resolved quickly. \r\n&gt; \r\n&gt; I would definitely recommend hostworld to individuals looking for stable and affordable services that include a friendly support team that truly cares.\r\n\r\n&gt; **Excellent Service. Exemplary Staff.**\r\n&gt; I’ve worked in the IT Industry for many years. Far back. Back to the days where we painted in caves and when men like me were referred to simply as the ‘Computer Man’. I’ve never; not ever written a product or company review so this is a first for me. However, I felt moved to write a review about HostWorld.uk. I’ve had stuff hosted with various companies over many years. I’ve experienced a few really good hosting companies, some average and as has mostly been the case, some terribly mediocre. My experience with HostWorld.uk and the service as well as the quality of tech support I’ve received from them is, without question, one of the best if not the very best I ever had from any hosting provider. My migration to you will be my last. Thank you so much guys. Great job. Keep up the good work.\r\n\r\n&gt; **I am very happy**\r\n&gt; I am very happy with the service I have received from Hostworld so far.\r\n&gt; Support has been great, they seem to go out of their way to fix issues and in my case they installed an OS they do not use. The server itself preforms very well, no slow downs so far I have no complaints.\r\n&gt; I would recommend them to anyone.\r\n\r\n&gt; **Great support, reliable service**\r\n&gt; Great support and very attentive. I'm their customer for about a month now and I didn't face any issue so far. Their VPS are fast, stable and affordable. I would definitely recommend hostworld.\r\n\r\n&gt; **Second to none**\r\n&gt; Super friendly, knowledgeable - anything, anytime, nothing is too much for them and they will happily do the best they can to cater to your needs. I found them whilst looking to expand the locations I offer on an existing business where uptime, speed and reliability is a must and has to be second to none. I am happy to say that hostworld ticks all the boxes. \r\n&gt; \r\n&gt; I joined hostworld 3 months ago and I can see myself becoming a life long customer.\r\n\r\n&gt; **Amazing and friendly support**\r\n&gt; Amazing and friendly support! Honestly after being on this business since 2012 I have never encountered such an honest, helpful and understanding team of people, coupled with a fantastic service with even greater price!\r\n&gt; \r\n&gt; Thank you very much for everything.\r\n\r\n------------\r\n**Payment Methods**\r\n------------\r\n\r\nWe currently accept payment through the following:\r\n\r\n- PayPal\r\n- Credit/Debit Card\r\n- Bank Transfer\r\n- Apple Pay\r\n- Bitcoin\r\n- Alipay\r\n- Unionpay\r\n\r\nAll plans come with no contracts! Any questions or sales enquiries? Call us on (+44) 0800 678 5914 or email us sales@hostworld.uk. If you require something different to what we offer above please don't hesitate to contact our sales department for a custom quote.\r\n\r\nWe look forward to hearing from you! \r\n\r\nKind Regards,\r\n\r\nhostworld.uk Team"}