{"id": 167464, "date": "2020-10-15 21:40:06", "user": "dustinc", "post": "![](https://my.racknerd.com/assets/img/logo.png  \"\")\r\n\r\nhttps://www.racknerd.com/ We're a real company recently expanded our office space (see pictures here) https://www.racknerd.com/about\r\n\r\nWhen building out our Windows VPS platform, we wanted to deliver an experience that is light years ahead. That means we didn’t cut any corners when building out our infrastructure, we rigorously tested and designed our Windows VPS IaaS offering exclusively with AMD Ryzen 3900X processors, featuring DDR4 RAM and enterprise-grade Intel NVMe drives. The performance of each Windows VPS is stunning.\r\n\r\nPerformance was a heavy emphasis when designing our new Windows VPS platform. When it comes to Windows VPS, we understand that consumers simply want an experience that is rapid, responsive, and highly available. As an illustrative example - in a soft-launch we ran, we’ve even had some users tell us that their Ryzen-powered Windows VPS with us with just 1 core outperforms their Windows VPS with another host that had 4 Intel Xeon Cores! This is thanks to our platform leveraging the unmatched performance of AMD Ryzen and Enterprise Intel NVMe SSD drives.\r\n\r\nWe are available several different ways to assist you:\r\n\r\n**EMAIL US:** sales@racknerd.com\r\n**CALL US:** 1 (888) 881-NERD\r\n**CHAT WITH US:** https://racknerd.com/\r\n\r\nWe are not just experienced in what we do, but we are a steadily growing web-hosting company that will not only meet but exceed your expectations. This is why you should choose RackNerd as your web-hosting provider. Understanding what customers want and putting them first is why we are a success.\r\n\r\n&lt;hr&gt;\r\n**RackNerd's LATEST WINDOWS VPS PROMOTION for LET!**\r\n**2GB - AMD Ryzen Windows VPS with NVMe SSD (Exclusive LET promotion)**\r\n1x AMD Ryzen CPU Core\r\n35 GB NVMe SSD Storage\r\n2 GB DDR4 RAM\r\n2000GB Monthly Premium Bandwidth\r\n1Gbps Public Network Port\r\nFull Administrator Access\r\nRemote Desktop (RDP) Access\r\n1 Dedicated IPv4 Address\r\nKVM / SolusVM Control Panel - Reboot, Reinstall, Manage rDNS, &amp; much more\r\nLOCATION: Los Angeles\r\n~~NORMALLY $14.59/Month~~\r\n**JUST $21/Quarterly**\r\n**ORDER NOW:** https://my.racknerd.com/cart.php?a=add&amp;pid=299\r\n_Limited Inventory, if there's still stock while attempting to order, order fast!_\r\n\r\n&lt;hr&gt;\r\n**Don't forget, we're always here to answer questions, and or help any way we can!**\r\n&lt;hr&gt;\r\n\r\n**Looking Glass / Network Test:**\r\n\r\n**Test IPv4:** 204.13.154.3\r\n**Test File:** http://lg-lax02.racknerd.com/100MB.test\r\n**Looking Glass:** http://lg-lax02.racknerd.com/\r\n**Network Carriers Include:** CenturyLink, Cogent, GTT, NTT, China Telecom, China Unicom, ChinaNet\r\n&lt;hr&gt;\r\n**Don't see a configuration that completely suits your needs? Needing a quote on a different server specification? We're always here to answer questions, and or help any way we can!**\r\n&lt;hr&gt;\r\n**EMAIL US:** sales@racknerd.com\r\n**CALL US:** 1 (888) 881-NERD\r\n**CHAT WITH US:** https://racknerd.com/\r\n"}