{"id": 16930, "date": "2013-11-20 22:51:59", "user": "servarica_hani", "post": "Hi LET\r\n\r\nWe are excited to offer you our new offers based on our new infrastructure. We own our own network and we own all our hardware including all our network devices\r\n\r\n\r\n**Node Configurations:**\r\n\r\n     This offer will be based on our new infrastructure which consist of several xenservers in a high availability pool with high performance shared SAN.\r\n     Our SAN is accelerated using both SSD caching for writing and RAM caching for reading making reading speeds very high\r\n     Each node is equipped with 2 X E5-2560, ECC DDR3 memory and high end redundant networking devices. Also our network is fully redundant with redundant routers,switches and SAN switched.\r\n     Our infrastructure use 2 independent power sources and each of these sources is backed up by power generator.\r\n\r\n**The offer:**\r\n\r\n     Yearly Linux Special 1\r\n     1 VCPU\r\n     1GB RAM Dedicated\r\n     15GB SAN storage (SSD cached)\r\n     1 TB Bandwidth\r\n     1 IPv4\r\n     Xenserver Based (xen-pv)\r\n     1 Gbps port\r\n     Price : 48$/Year\r\n     https://servarica.com/clients/cart.php?a=add&amp;pid=176\r\n\r\n\r\n\r\n**Test IP and Download link:**\r\n\r\n     204.93.54.203\r\n     http://204.93.54.203/file_100MB.bin\r\n\r\n**Reviews:**\r\n\r\n     http://lowendbox.com/blog/servarica-7month-1gb-windows-xen-hvm-or-1-5gb-linux-pv-in-montreal-canada/\r\n\r\n**Setup time:**\r\n\r\n     Usually the acceptance process and setup of the VM may take up to 8hours. This is due to the fact that some orders need billing screening to manually accept them. \r\n     Once the billing approve the order the setup time shouldn’t take more than 2 hours.\r\n\r\n\r\n**SLA :**\r\n\r\n     With these offers we are providing the current monthly SLA level\r\n     99.9% and above --normal operation\r\n     99.0% and above --15% refund of monthly charges\r\n     97.0% and above --30% refund of monthly charges\r\n     95.0% and above --50% refund of monthly charges\r\n     Less than 95% --100% refund of monthly charges\r\n\r\n**Notes :**\r\n\r\n     1- We accept paypal (credit cards are accepted through paypal) and payza.\r\n     2- Here are some points that will make your order acceptance as fast as possible\r\n     a. We will not accept any order coming from a proxy,VPN or hosting IP address (please stop the proxy/VPN before ordering)\r\n     b. Please use a correct address on your order that correspond to your location at order time.\r\n     3- For this offer we offer 7 days full refund with no question asked (actually we will ask but the user does not have to answer )\r\n     4- if you wish to have bigger VPS which is multiplication of this offer you can order any quantity of this offer and tell us in the notes to combine it all in one big VPS.\r\n     5- You will use our own control panel. http://servarica.com/xen/\r\n     6- TOS and AUP : http://servarica.com/terms-of-service/\r\n     7- Our IPs appears in some geolocation websites as they are originating for US. Thats not true . All our servers in Canada and simply the databases of those websites are out dated.\r\n\r\n\r\nplease ask your questions here if you need anything\r\n"}