{"id": 18451, "date": "2013-12-17 11:12:07", "user": "rds100", "post": "Here is a pre-Xmas special offer from us. It includes two small dedicated\r\nservers. These are one-of-a-kind - we only have one of each of these\r\nmotherboard/CPU combinations left and they are not available anymore to buy,\r\nso the offer will not reappear unless there is a cancellation.\r\n\r\nFor those who don't know our servers are located in Varna, Bulgaria.\r\n\r\nThe offer is exclusive for active LET community members which i class as\r\n\"low risk\", no-trouble. I get to decide who can get it and who can't. So PM me\r\nif you would like to claim one of the servers. People seeking for warez hosting,\r\nseedboxes, spammers, etc. should not apply.\r\n\r\n\r\nServer1 is: &lt;b&gt;[AVAILABLE]&lt;/b&gt;\r\n\r\nCPU: Atom D2500 (2 cores, 1.86GHz, CPU benchmark score 404)  \r\nRAM: 2GB DDR3  \r\nHDD: 1x &lt;b&gt;3TB&lt;/b&gt; Seagate SV35 series, model ST3000VX000-9YW166 with 0 reallocated sectors and 2216 Power On hours.  \r\nBandwidth: 4TB on 100Mbps port  \r\nPrice: &lt;b&gt;30 USD / month or 85 USD / quarter&lt;/b&gt;  \r\n\r\nIt's ideal for storing backups of backups, adding it to a tahoe-lafs\r\ncluster, etc. And i believe it's the cheapest 3TB of dedicated storage you can\r\ncurrently rent.\r\n\r\nFor people in EU - 30USD is currently a little less than 22 EUR, but there\r\nis +20% VAT for EU end users.\r\n\r\n\r\n\r\nServer 2 is: &lt;b&gt;[SOLD] &lt;/b&gt;\r\n\r\nCPU: AMD E350 (2 cores, 1.6GHz, CPU benchmark score 763, &lt;b&gt;Supports hardware virtualization&lt;/b&gt;  \r\nRAM: 4GB DDR3  \r\nHDD: &lt;b&gt;2x 500GB&lt;/b&gt; sata 7200RPM, not new  \r\n- HDD1 is Seagate ST3500418AS with 14450 Power on hours and 0 reallocated sectors  \r\n- HDD1 is Seagate ST3500418AS with 14794 Power on hours and 0 reallocated sectors  \r\nBandwidth: 3TB on 100Mbps port\r\nPrice: &lt;b&gt;20 USD / month or 55 USD / quarter&lt;/b&gt;  \r\n\r\n20 USD is about 14.5 EUR today, excluding the VAT.  \r\nProbably the cheapest virtualization capable and RAID1 capable server you can buy today.\r\n\r\n\r\n\r\nEach server comes with either 1 IP, or 5 free IPs. If you choose 5 IPs, a\r\n/29 subnet will be assigned (SWIPed) in your name.\r\n\r\nRemote reboot and automatic installations (noc-ps) is included with all the servers.\r\nWe can also give you an IP KVM for initial setup in case it is needed. For\r\ninstance with the 3TB HDD server it would probably be needed, because\r\n\"normal\" parittions can be at most 2TB big, and for 3TB HDD gpt partitions\r\nare used. However ubuntu's and debian's grub are stupid and don't want to\r\ninstall when gpt partitions are used. Some manual intervention is required\r\nin this case.\r\n\r\n\r\nWhy choose us:\r\n- We are a small privately owned, 100% debt free company, in business since 1998  \r\n- We are RIPE LIR since the year 2000 - own the IP address space and the AS number  \r\n- We own all the server hardware  \r\n- We own all the network hardware, etc.  \r\n- We are not french  \r\n- We don't have stupid cancellation policies and will not make you write us a registered letter if you decide to cancel your server.  \r\n- We know what we are doing.    \r\n- I'm a nice guy. Sometimes ;-)   \r\n\r\n\r\n\r\nOur regular dedi offers can be found here - https://www.fitvps.com/members/cart.php?gid=2\r\n\r\nOr at these LET threads:  \r\nhttp://lowendtalk.com/discussion/13614/ivy-bridge-dual-core-dedicated-from-30-month-and-more  \r\nhttp://lowendtalk.com/discussion/10468/atom-n2800-dedicated-servers-from-25-month  \r\nhttp://lowendtalk.com/discussion/8926/dual-core-4-threads-1-86ghz-atom-n2800-with-4gb-ram-from-25-month  \r\nhttp://lowendtalk.com/discussion/8326/atom-n2800-from-25-month  \r\n\r\nReviews? Here is one:  \r\nhttp://lowendtalk.com/discussion/17598/fitvps-review\r\n\r\n\r\nFAQ:\r\nQ: test-ip?  \r\nA: https://www.fitvps.com/test-ip  http://lg.fitvps.com\r\n\r\nQ: warez allowed?  \r\nA: No\r\n\r\nQ: porn allowed?  \r\nA: No\r\n\r\nQ: torrents allowed?  \r\nA: if we don't receive any complaints, we don't know you are torrenting. If we start receiving complaints you have to either stop or leave.\r\n\r\nQ: IRC?  \r\nA: please don't, unless it's just you peacefully chatting.\r\n\r\nQ: ipv6?  \r\nA: Yes\r\n\r\nQ: rDNS?  \r\nA: via ticket. For ipv6 routed netblocks we can delegate it to your name servers\r\n\r\nQ: \"email marketing\"?  \r\nA: HELL NO!\r\n\r\nQ: Can we transfer the ownership of a server?  \r\nA: No. You can cancel, we will put it back in stock and the other person can order it. But no transfers."}