{"id": 1910, "date": "2012-03-21 20:44:19", "user": "Aldryic", "post": "[Mods - this thread is intended for discussion, hence the General category.  If this needs to be in Offers, my apologies, tag me and I'll change it ASAP]\r\n\r\nWell, word's already out, so I suppose we should make it official.  The elusive stock will be available this Friday, starting at 0600h PST (currently GMT-7) (inb4franlied).  Quoted directly from the mass email I'm currently sending out to our clientbase:\r\n\r\n&gt; More good news!  The long wait for more stock is finally over - this Friday (23 Mar) at 0600h PST (currently GMT-7) we will be releasing a large batch of KVM and OVZ plans.  Over 1000 total available OpenVZ slots, and a good handful of KVM plans will be made available over the course of this release, split up over a predetermined schedule.  The initial release count will be as follows:\r\n\r\n&gt; OpenVZ Plans\r\n    - 25x 128/256MB (15$/yr)\r\n    - 20x 256/512MB (3,50$/mo)\r\n    - 20x 512/1024MB (5,95$/mo)\r\n    - 5x 1024/2048MB (12,95$/mo)\r\n    - 5x 2048/4096MB (24,95$/mo)\r\n\r\n&gt; KVM Plans\r\n    - All Available Stock\r\n\r\n&gt; This initial batch will be replenished on Monday (26Mar) following the release schedule in Our Wiki.  As always, stock is first-come-first-serve;  please don't ask for reservations, as that's just unfair for all the other folks that've been waiting patiently.\r\n\r\nAt this time we're still undecided on how we want to handle Storage plan sales, as they will not be an inclusion in this stock release.  You can find details on all of our other plans at http://buyvm.net.  As always, all orders are processed manually, and first-time-buyers are audited after order placement, so we ask that you expect a 1-3 hour delay on order provisioning (we like to take the time to ensure that everything is setup correctly and not leave someone hanging).\r\n\r\nAnother upcoming feature we're excited to present is... DoS Filtering!  Anyone with existing services can acquire a filtered IP less than 2ms from our home racks for 3$/mo.  These filtered IPs can handle up to a 6-10gbit flood before it's considered a potential issue, meaning no more sleepless nights worrying about some kiddy with a forum-bought C&amp;C booter taking down your VPS.  All clients are welcome to request filtered IPs for their services;  and for anyone that might've been asked to leave our network in the past due to being an unfortunate target... Welcome Back!  We're looking at having this available early-to-mid next week.\r\n\r\nLastly, after some discussion with the bossman, we've decided on a revision of our TOS/AUP in regards to TOR.  As a good compromise that allows clients to handle the annoyances before they reach us, TOR nodes will be allowed on our network with the following restrictions:\r\n\r\n&gt;  - Clients wanting to run a TOR node or private site _MUST_ acquire a /29 from us, and have the IPs SWIP'd into their name before starting the service.\r\n\r\n&gt;  - Clients must handle any and all abuse complaints from the TOR activities. \r\n\r\nThis policy will go into effect once I've had time to properly amend our TOS/AUP and announce the change internally.. so let's go ahead and put an effective date of Monday on that.  And yes, running TOR services without following the above stipulations will still be grounds for immediate dismissal :3\r\n\r\n@Maounique - (╯°□°）╯︵ ┻━┻\r\n\r\nYou can expect an update from either myself or Fran 24hrs and 1hr before this sale goes live.  If you have any questions, I'll be more than happy to address them here ^_^\r\n\r\n"}