{"id": 19474, "date": "2014-01-03 19:10:35", "user": "jar", "post": "Looking for an alternative to Google Apps for e-mail hosting for your domain? Perhaps you want something a bit simpler in nature, more tailored the specific task of e-mail hosting than something like a cPanel account?\r\n\r\nMeet &lt;a href=\"http://mxroute.com\"&gt;MXroute&lt;/a&gt;. The idea is simple. You want e-mail hosting for your domain(s) and you want it to meet several key criteria. Affordable, secure, private, and simple. Server security is important to me. Nothing on the internet is ever guaranteed, but what makes all the difference in the world is knowing that the person providing your services is experienced and devoted to stability and security. I'm not claiming to be perfect, I'm not claiming that I can keep the NSA from tapping the upstream. All I can guarantee is to work hard, respect your privacy, and frequently audit and adjust as necessary.\r\n\r\nMXroute currently offers three plans. The first of which, is free! Get 10% off the other packages in this exclusive LET offer, promo code MXLET.\r\n\r\nMXfree&lt;br&gt;\r\n1 Domain&lt;br&gt;\r\n1 E-mail Account&lt;br&gt;\r\n10GB Storage&lt;br&gt;\r\nFREE&lt;br&gt;\r\n&lt;a href=\"https://portal.catalysthost.com/cart.php?a=add&amp;pid=68\"&gt;Order here&lt;/a&gt;\r\n\r\nMXone&lt;br&gt;\r\n1 Domain&lt;br&gt;\r\n25 E-mail Accounts&lt;br&gt;\r\n30GB Storage&lt;br&gt;\r\n$10/year&lt;br&gt;\r\n&lt;a href=\"https://portal.catalysthost.com/cart.php?a=add&amp;pid=67\"&gt;Order here&lt;/a&gt;\r\n\r\nMXfive&lt;br&gt;\r\n5 Domains&lt;br&gt;\r\n50 E-mail Accounts&lt;br&gt;\r\n75GB Storage&lt;br&gt;\r\n$25/year&lt;br&gt;\r\n&lt;a href=\"https://portal.catalysthost.com/cart.php?a=add&amp;pid=70\"&gt;Order here&lt;/a&gt;\r\n\r\nThis is a project of myself and Ryan Arp. While it's own product, MXroute is treated as a product of Catalyst Host for billing, policies, and all legal purposes. We have a simple system that has been tailored specifically to e-mail hosting. As a former member of the Catalyst Host team, I am currently involved with Catalyst Host as far as maintaining (only) the MXroute product and support. It's more of Ryan supporting my project and helping out a friend. We've worked together on projects for 15 years, this was something we could work on together without being a conflict of interest.\r\n\r\nAdditional Policies:&lt;br&gt;\r\n- This is not a mass mailing service.&lt;br&gt;\r\n- Spam will not be tolerated, you will be caught before blacklisted. My exim logs don't say what you're sending, but I know how to identify spam from patterns, I do it every day.&lt;br&gt;\r\n- Catalyst Host policies apply.\r\n\r\nQuestions? Feel free to ask!"}