{"id": 1979, "date": "2012-03-26 07:54:18", "user": "PhoenixVPS", "post": "We are new to this community, so I will try to write up this offer by the book.\r\nOur website is: http://www.toratek.net\r\n\r\nWe offer both OpenVZ VPS servers and Xen VPS servers. This offer is only for our OpenVZ VPS servers (the VPS 512 plan).  We have servers in both Chicago, IL and Phoenix, AZ, but our OpenVZ VPS servers are available currently only in Phoenix, AZ.\r\n\r\nOpenVZ **VPS 512** Plan ( http://www.toratek.net/openvz-vps-servers/ )\r\n- CPU Cores: 4 (8 Threads)\r\n- Guaranteed RAM: 512MB\r\n- VSwap - 512MB\r\n- RAID 10 Disk Space: 20GB\r\n- Bandwidth: 200GB\r\n- Network Speed: 100 Mbit\r\n- Dedicated IP Addresses: 1\r\n- Control Panel: SolusVM\r\n- $6.99 / month - use promo code **LET699** at checkout\r\n- Test IP: 108.170.27.139 - there is no test file at the other end, but we will add one in the coming days\r\n- No Setup Fees (or any hidden fees)\r\n- 7 day money back guarantee\r\n- Direct Ordering Link: https://www.toratek.net/portal/?ccce=cart&amp;a=add&amp;pid=1\r\n\r\nSome things you may ask or want to know:\r\n- All our OpenVZ nodes are Dual Quad Core Xeon 5620 /w HT enabled and 48GB RAM\r\n- We don't use burst RAM (we like to call it imaginary RAM). We allocate 2GB for the host node, and the rest is allocated strictly for customers. If you paid for 512MB RAM, then you will get 512MB RAM. Once we allocated all the resources, we bring online another node. We don't need to oversell our servers, we got plenty of them.\r\n- VSwap is enabled by default but we have to allocate it to each account manually. So be patient, we will make sure that everyone will have VSwap enabled.\r\n- Our platform for OpenVZ is CentOS 6, so VSwap is enabled. Many of you may know that the RHEL 6 kernel has brought some noticeable improvements to OpenVZ.\r\n- There is a well known issue with Ubuntu 11.10, OpenVZ and SolusVM where there is no Terminal or Console enabled by default. If you install Ubuntu 11.10 and you find yourself in this situation, just submit a ticket and we will fix it for you. Solus Labs has a couple of proposals how to permanently fix this bug, but we don't like any of them so we just do it by hand.\r\n- We have prorated billing. This basically means that if you sign up before the 15th of each month your first payment will be prorated for whatever is left of the current month. If you sign up after the 15th then your first payment will be for whatever is left of the current month plus the next month. So for example those that sign up now will have to pay again on May 1st. Other companies are doing this as well in order to stay better organized when it comes to billing.\r\n- Yes, the coupon is good for the life of the account. It will only work for the OpenVZ 512MB plan.\r\n- Please limit one coupon per customer so that everyone can take advantage of this offer.\r\n- Provisioning is instant once your payment has cleared. You will receive all details in your email. Please also check your SPAM box. Gmail and other providers have hardened their SPAM rules as of lately, so we had reports from our customers that our emails landed in their SPAM boxes.\r\n- We have several fraud prevention methods enabled, so if you find yourself in a situation where your order doesn't go trough please call us or contact us via live chat.\r\n- Because we always get folks on live chat asking about some old coupon, we have to set time limits on them. For now this coupon code will be valid until 03/30/2012 or until supplies last.\r\n\r\nI tried to be as informative as possible about our offer, but if you have any questions, please don't hesitate to ask.\r\n\r\n--------------\r\nMarc Mironescu\r\nCEO Toratek LLC"}