{"id": 20028, "date": "2014-01-14 23:53:15", "user": "jnguyen", "post": "You read the title right! It's another unbelievable GreenValueHost VPS offer thread. In case you don't already know about us, we are LowEndTalk's EXCLUSIVE \"more bang for your buck\" provider. No other company in this industry dares to come anywhere close to offering the VPS allocations that we offer at anywhere near the same prices. They've been talking about how it's unsustainable and about how the business model is going to collapse, but the difference between those companies and us is that we're SPECIAL and we make GREAT THINGS HAPPEN.\r\n\r\nThis sale is being made in honor of our recent Los Angeles, California expansion. Clients are now able to purchase virtual servers in **Buffalo, New York** (USA East Coast), **Dallas, Texas** (USA Central), and **Los Angeles, California** (USA West Coast). Our New York location has EXCELLENT connectivity to all parts of the eastern US along with EUROPE, our Dallas location has EXCELLENT connectivity to ALL PARTS of the US, and our Los Angeles location has UNBELIEVABLY FANTASTIC connectivity to all parts of ASIA! &lt;- THIS IS A MILESTONE!\r\n\r\nHere's the plans that we have to offer for ya'll:\r\n\r\n**Mid-January LET Blowout Special #1**&lt;br&gt;\r\n250GB RAID-10 SSD Accelerated Disk Space&lt;br&gt;\r\n100,000GB (100TB) Premium Bandwidth on a 1 Gbit Port&lt;br&gt;\r\n4048MB Guaranteed RAM&lt;br&gt;\r\n8192MB vSwap RAM&lt;br&gt;\r\n2 IPv4&lt;br&gt;\r\n**$5.00 per month OR $45.00 per year**&lt;br&gt;\r\n**[Order Link]**: https://secure.greenvaluehost.com/cart.php?a=add&amp;pid=192\r\n\r\n**Mid-January LET Blowout Sale #2**&lt;br&gt;\r\n50GB RAID-10 SSD Accelerated Disk Space&lt;br&gt;\r\n8,000GB (8TB) Premium Bandwidth on a 1Gbit Port&lt;br&gt;\r\n2024MB Guaranteed RAM&lt;br&gt;\r\n4048MB vSwap RAM&lt;br&gt;\r\n1 IPv4&lt;br&gt;\r\n$3.00 per month OR $30.00 per year&lt;br&gt;\r\n**[Order Link]**: https://secure.greenvaluehost.com/cart.php?a=add&amp;pid=193\r\n\r\n**Mid-January LET Blowout Sale #3** - JUST NEED BANDWIDTH? CHOOSE THIS PLAN!&lt;br&gt;\r\n10GB RAID-10 SSD Accelerated Disk Space&lt;br&gt;\r\n10,000GB (10TB) Premium Bandwidth on a 1Gbit Port&lt;br&gt;\r\n512MB Guaranteed RAM&lt;br&gt;\r\n1024MB vSwap RAM&lt;br&gt;\r\n1 IPv4&lt;br&gt;\r\n$2.00 per month OR $20.00 per year&lt;br&gt;\r\n**[Order Link]**: https://secure.greenvaluehost.com/cart.php?a=add&amp;pid=194\r\n\r\n&gt;&gt; FIRST 10 ORDERS RECEIVE 1 FREE MONTH OF SERVICE!! HURRY AND ORDER **NOW** TO SECURE THIS UNBELIEVABLE ORDER! GreenValueHost is one of LowEndTalk's LARGEST and MOST POPULAR PROVIDERS. Our plans go FAST so don't wait, HURRY NOW!\r\n\r\n**Control Panel:** SolusVM&lt;br&gt;\r\n**Virtualization Type:** OpenVZ&lt;br&gt;\r\n**Reseller Friendly?** YES!!&lt;br&gt;\r\n**OVERLOADED NODES?** Absolutely NOT! We do not overload our nodes and NEVER WILL!\r\n\r\nQuestions? Comments? Concerns? Please feel free by all means to voice them by either submitting a ticket to our sales or management department or by posting in this thread. GreenValueHost is PROUD to be an OPEN BOOK company, and we have absolutely NO SECRETS to hide. We DO NOT believe in LYING to our customers and we always strive to provide a PREMIUM and CUSTOMER-CENTRIC hosting experience.\r\n\r\nHappy New Year everyone!!\r\n\r\nThe GreenValueHost Team"}