{"id": 20206, "date": "2014-01-17 20:16:33", "user": "fapvps", "post": "Datacenter:Dacentec\r\n\r\nDatacenter location: Lenoir, North Carolina\r\n\r\nping 192.111.147.110\r\n\r\nhttp://192.111.147.110/100MB.bin\r\n\r\nCloudmin control panel\r\n\r\nSingle Core Lite KVM\r\n\r\n-------------------------------------------------\r\n\r\n    1 Core\r\n    256 MB RAM\r\n    5GB RAID 10 Storage\r\n    Monthly Bandwidth 120GB\r\n    100Mbps Connection\r\n    1 IPv4 Address\r\n    Weekly Backup\r\n\r\n$15 per year\r\n\r\n-------------------------------------------------\r\n\r\nhttps://fapvps.com/billing/cart.php?a=add&amp;pid=10\r\n\r\nFAPVPS was established to provide exactly what the name says: Fast, Affordable, Professional Virtual Private Servers. With years of experience in the web hosting industry and a passion to deliver a high quality service, our number one goal is customer satisfaction. We own all the hardware and never oversell resources. Our nodes are monitored 24 hours a day 7 days a week.\r\n\r\nWhat we offer:\r\n\r\nWeekly backups are included with all our plans. If you ever need to restore your VPS simply submit a ticket and we will restore the latest backup image we have available.\r\n\r\nSecure access to the graphical console via VPN. All our plans include this feature so it is possible to troubleshoot network configuration issues in case a misconfiguration securely.\r\n\r\nThe plans that we offer are competitively priced. We understand that pricing is important so we give you more for your money.\r\n\r\nFull control of your VPS. Our service is for experienced professionals and we know it is important to have complete control. We provide you with a powerful control panel that allows you to reboot, shutdown, start-up your VPS. We also provide numerous templates to have you up and running with a new installation in minutes or you can install your OS manually from an ISO.\r\n\r\nProfessional customer service if any issues arise. We strive to provide our customers with high quality service and our commitment to resolve any issues that arise quickly.\r\n\r\nhttp://fapvps.com"}