{"id": 20718, "date": "2014-01-27 07:10:18", "user": "[Deleted User]", "post": "Hello!\r\n \r\nWe are extremely pleased to announce our new line of OpenVZ SSD-Accelerated Plesk panel VPS in our western USA (Los Angeles) datacenter with excellent connection to the rest of the world.\r\n\r\n#Features:\r\n\r\n:: **100% Genuine** Plesk License! [Click Here](http://i.imgur.com/Il1ETlg.png)\r\n\r\n:: **Feathur** VPS Control Panel\r\n\r\n:: **SSD Accelerated** Storage\r\n\r\n:: Perfect for hosting your own websites or sell hosting with no additional cost\r\n\r\n \r\n#Plan Info:\r\n\r\n     **2 CPU** Cores\r\n     \r\n     **1 GB** Memory\r\n     \r\n     40 GB SSD-Accelerated Disk Space\r\n     \r\n     1000 GB Bandwidth\r\n     \r\n     1 Dedicated IP address\r\n\r\n     FREE Plesk 10 Domains License\r\n\r\nOnly &lt;del&gt;$10&lt;/del&gt; $7/mo using coupon **PLESK**\r\n\r\n[Order Now!](https://www.pinenook.com/clients/link.php?id=1)\r\n\r\n#License:\r\nBy default, you'll receive a 10-domain license with your purchase. 100-domain licenses and unlimited-domain licenses are available @&lt;del&gt;$7&lt;/del&gt; $4.9/&lt;del&gt;$14&lt;/del&gt; $9.8/mo.\r\n\r\nWe also provide Plesk Power Pack for $6/mo, which includes: MS SQL/Postgre SQL Support, Tomcat, Coldfusion, Kaspersky Antivirus, Unity Mobile.\r\nMore Information: http://www.parallels.com/products/plesk/parallels-plesk-power-pack/\r\n \r\n#More Info:\r\n**What is Plesk Panel?**\r\n\r\nPlesk Panel is one great alternative to cPanel, it helps you to host and manage your websites easily and efficiently. You can also sell shared/reseller hosting accounts with Plesk.\r\n\r\n **What is a SSD-Accelerated VPS?**\r\n \r\n Everybody knows that traditional hard drives (HDD) are a lot slower compared to SSD (solid state drives). However, SSD drives are a lot more expensive than HDD and comes with less space. With our SSD acceleration technology (combined with RAID 10 as well), we accelerate your \"hot\" data using SSD, while keeping less-accessed files on the HDD. The whole process is seamless and is done automatically, the result is up to 500% faster disk reading speed!!\r\n With our SSD acceleration technology, you can have near-SSD speed with cheap, HDD-like price.\r\n \r\n **Frequently Asked Questions**\r\n\r\n **Q:** What can I do with the VPS?\r\n\r\nA: You should use this VPS for hosting purposes only.\r\n\r\n **Q:** How long does it to set up?\r\n\r\nA: We set up your VPS instantly upon payment and the Plesk license will be provided within 48 hours. You are welcome to install the Plesk panel and use the trial version before receiving the license.\r\n \r\n **Q:** Where is the datacenter located?\r\n \r\n A: We use the ColoCrossing datacenter in Los Angeles. Test IP: 192.210.148.250\r\n \r\n **Q:** What's the virtualization technology that you use?\r\n \r\n A: We use OpenVZ for our servers, we also include a free and easy-to-use VPS management panel for each VPS.\r\n \r\n **Q:** Which payment methods do you accept?\r\n \r\n A: We use PayPal as our payment gateway, you can either use your credit card or your PayPal balance.\r\n \r\n **Q:** Can I purchase additional IP Addresses?\r\n \r\n A: Certainly! One IP costs $1.5 per month.\r\n \r\n Thank you for looking at our offers,\r\n Have a good day!"}