{"id": 21031, "date": "2014-02-01 21:29:47", "user": "fileMEDIA", "post": "We (fileMEDIA) proudly announce our new CloudVM line up with many features which cannot found in other offers in the LEB maket. We started in 2011 with the new development of a cloud web gui and the infrastructure behind it. It based on Proxmox as virtualization layer and a WHMCS module to manage your CloudVM from the customer’s site to reduce the costs of license fees which ends in less product prices for our customers. Proxmox needs lot’s of custom patches and developments to integrate it in our solutions for example with the VXLAN tagging to offer private networks and our integrated reinstall system for all of our customers. This patched caused a long delay to release it for our customer because it cannot found in the public and must be done in-house.\r\n\r\n**What is a CloudVM?** CloudVM specify a group of resources you can handle with it to create virtual machine instances in our clusters. It specifies CPU Power, CPU Sockets, CPU cores, RAM, Traffic, Backup Space for snapshots and backups, IPv4 and IPv6 addresses. One CloudVM can hold different CloudVM instances as long as you have enough free resources for it in your CloudVM. Thus, you can deploy an application in a CloudVM which needs different virtual machines. For example you can put on front of it a VM as router and firewall to protect your other VMs. Behind this firewall other machines can stay there which build your application. Webservers, proxies, storage VMs and more can talk in the internal network and can be reachable over your firewall. With this design you can build every application you want to deploy.\r\n\r\nA CloudVM instance is a virtual machine hosted on a Proxmox node which is hosted in our cluster. The CloudVM use advantages from a VPS and from cloud instances. It combines both methodes to built a flexible, dynamically and powerful virtual machine with cloud features for very less price.\r\n\r\nAll other old plans with solusvm will be migrated in the next two months for free.\r\n\r\n**What features offer our CloudVM:**\r\n\r\n-\tDynamic resources: resources can up- and downgraded at any time\r\n-\tPay as you need: You can up- an downgrade your CloudVM and you pay only that which you added to your service. When you downgrade it, your money fort hat resources go back to your balance and can be used for other ressources or services.\r\n-\tFlexible disk management\r\n-\tIsolated private network with two NICs (privte/public)\r\n-\tBackup space and backup management for snapshots (automatic/manual)\r\n-\tCloning, you can use a backup to deploy a new CloudVM instance from it\r\n-\tIP management\r\n-\tVNC console\r\n-\tReinstall system\r\n-\tCD/DVD mount\r\n\r\n**What features come in the future:**\r\n\r\n-\tHA functions\r\n-\tLocal and SAN storage\r\n-\tDifferent locations selectable for each instance\r\n-\tCustom ISO upload\r\n-\tTemplate upload function\r\n-\tGlobal firewall management for your CloudVM\r\n-\tand many other\r\n\r\n**Our LEB plans:**\r\n\r\n**CloudVM HDD 20 for 3.49€ per month: https://www.filemedia.de/pricing.html**\r\n\r\n- Up to 100 CloudVM Instances\r\n- 20GB HDD Storage Space (local)\r\n- 512MB DDR3 ECC RAM\r\n- 1x vCPU Cores\r\n- 100 vCPU Power\r\n- 1x IPv4 Address\r\n- 10x IPv6 Addresses\r\n- 20GB Backup Space\r\n- 10x Backup Files\r\n- 1 Gbit/s Public Network\r\n- 1 Gbit/s Internal Network\r\n- 1TB Public Traffic\r\n- Unmetered Internal Traffic\r\n- Upgradeable resources\r\n\r\n**CloudVM SSD 10 for 3.99€ per month: https://www.filemedia.de/pricing.html (currently sold out)**\r\n\r\n- Up to 100 CloudVM Instances\r\n- 10GB SSD Storage Space (local)\r\n- 512MB DDR3 ECC RAM\r\n- 1x vCPU Cores\r\n- 100 vCPU Power\r\n- 1x IPv4 Address\r\n- 10x IPv6 Addresses\r\n- 10GB Backup Space\r\n- 10x Backup Files\r\n- 1 Gbit/s Public Network\r\n- 1 Gbit/s Internal Network\r\n- 1TB Public Traffic\r\n- Unmetered Internal Traffic\r\n- Upgradeable resources\r\n\r\n**Try it out: https://www.filemedia.de**"}