{"id": 2147, "date": "2012-04-05 04:50:58", "user": "SrvisLLC", "post": "I'm here today to offer you guys a great deal on our virtual products. We offer services in Metro-Detroit, one of the few places that do not get a lot of offers for virtual private servers. Here is our offer for you guys today:\r\n\r\n_**LowEndTalk Special Offer 1:**_\r\n\r\n&gt; \r\n-728MB Ram\r\n-256MB vSwap\r\n-1 vCPU Core\r\n-200GB Premium Bandwidth \r\n-25GB of Storage\r\n-1 IPv4 Address\r\n-Location: Metro-Detroit\r\n\r\n**$5.00/m Recurring!** - [Order Now](https://www.errantweb.com/client/cart.php?a=add&amp;pid=28)\r\n\r\n\r\n_**LowEndTalk Special Offer 2:**_\r\n\r\n\r\n&gt; \r\n-512MB Ram\r\n-128MB vSwap\r\n-1 vCPU Core\r\n-100GB Premium Bandwidth\r\n-20GB of Storage\r\n-1 IPv4 Address\r\n-Location: Metro-Detroit\r\n\r\n**$4.00/m Recurring!** - [Order Now](https://www.errantweb.com/client/cart.php?a=add&amp;pid=29)\r\n\r\n\r\n\r\nWe provide very good bandwidth. Using Level(3), XO, and Comcast Business Class ( something that most providers don't offer ) we are able to provide low latency to a lot of locations. \r\n**Test IP:** det.errantweb.com\r\n\r\nWant to hear the words of current and past ErrantWeb users go to:\r\nhttp://errantweb.com/testimonials/ or browse these forums and ask around. We provide great support, uptime, and services to many people.\r\n\r\nIf you have any doubts about our services you can leave within your first 3 days and get a full refund over PayPal. We will not make you chase after a ostrich to get a refund. ( I'm pretty sure that it's hard to catch one )\r\n\r\nWe have been around for 4 months now and we love all of our clients. We would love to have you as one and expect to see you soon!\r\n\r\nWe may run out of these deals soon so if it says Out of Stock that's why. We may take up to 72 hours to process your service depending on availability. ( this usually never happens )\r\n\r\n**We also do custom quotes and answer questions so go ahead and contact us at:**\r\n_Ticket:_ http://errantweb.com/client/submitticket.php\r\n_Skype:_ ErrantWeb\r\n_Live Chat:_ http://errantweb.com\r\nor you can even PM here!"}