{"id": 22741, "date": "2014-03-02 19:14:28", "user": "hbjlee17", "post": "&lt;b&gt;Luna Node Dynamic - dynamic virtualization platform (KVM)&lt;/b&gt;\r\n\r\n&lt;a href=\"https://www.lunanode.com/cart.php?gid=8\" target=\"_blank\"&gt;Luna Node Dynamic&lt;/a&gt; is our hourly billing virtualization platform featuring rapid virtual machine deployment, hourly billing, snapshotting capabilities (and imaging existing or new virtual machines from these snapshots), uploading custom ISO files, an API for automation, and more. Servers are currently provisioned out of Scranton (with BurstNET).\r\n\r\n&lt;a href=\"https://www.lunanode.com/\" target=\"_blank\"&gt;Luna Node&lt;/a&gt; has been around for about half a year, offering reliable KVM virtual private servers at affordable prices. We use OpenStack for Luna Node Dynamic backend.\r\n\r\nHere's a more detailed feature explanation:\r\n\r\n* Hourly billing - only need a virtual machine for a few days, or don't know how long you'll want to use it for? Or have dynamic needs that require changing amounts of nodes? Luna Node Dynamic allows you to destroy your virtual machine at any time, and then only pay for the hours (instead of months) that it was used for. The service is prepaid, with Paypal and Bitcoin (via Coinbase) as our current billing options.\r\n* Custom ISO files - you can submit a URL (HTTP, HTTPS, FTP, etc.) and the system will download your ISO file. Once downloaded, you can provision virtual machines from the ISO and do manual installation via VNC.\r\n* Snapshotting - hit a button to snapshot your virtual machine, and the current state of the disk image will be saved. You can then use it to restore your virtual machine to a previous saved state or to provision more machines. Snapshots are currently free but will likely be charged later at around $8/250GB.\r\n* High-availability: if a node goes down it will be \"evacuated\" to another node.\r\n* API - we provide a simple API that you can use to manage your servers without going through the web UI.\r\n* Track billing - a Billing tab is inluded in the Luna Node Dynamic panel that allows you to check your expenses for each month, with expenses sorted by day.\r\n* Custom templates - if you have your own qcow2 template, you can upload this from the panel and start provisioning virtual machines with it.\r\n* Virtual network/router with floating IPs - these features are supported although not currently supported from our panel; we can set these up if you are using five or more virtual machines, if you open a ticket.\r\n* Free SSL certificates: with your Luna Node Dynamic account, you get an unlimited number of free single-domain or wildcard SSL certificates; note that these may only be used on the Luna Node network.\r\n* Redundant cloud storage: VM's are provisioned on top of a distributed, fault-tolerant filesystem to prevent data loss\r\n* IPv6 connectivity available in Scranton (requires manual provisioning currently -- open ticket).\r\n\r\nTo get started, you can &lt;a href=\"https://www.lunanode.com/cart.php?gid=8\" target=\"_blank\"&gt;create an account from our billing panel&lt;/a&gt; for twelve dollars (so you will get $12.00 of credit with the initial account). More credit can be added directly from the Luna Node Dynamic panel (but support is handled through the billing panel).\r\n\r\n&lt;b&gt;Plans&lt;/b&gt;\r\n\r\n* 512 MB - 1 vCPU, 15 GB storage, 1000 GB bandwidth, $0.005 hourly ($3.6 monthly)\r\n* 1024 MB - 2 vCPU, 20 GB storage, 1500 GB bandwidth, $0.0072 hourly ($5.18 monthly)\r\n* Storage 250 GB - 512 MB RAM, 1 vCPU, 250 GB storage, 1500 GB bandwidth, $0.0063 hourly ($4.54 monthly)\r\n\r\nPort speed is 1gbit/s. &lt;a href=\"https://dynamic.lunanode.com/info.php\" target=\"_blank\"&gt;Click here for full plan list&lt;/a&gt;.\r\n\r\n&lt;b&gt;Locations&lt;/b&gt;\r\n\r\nTest IP for Scranton location is here: http://96.9.169.44/100mb.test\r\n\r\nWe also provide services via Luna Node Dynamic in Chicago with SingleHop, but some of the features mentioned above such as virtual router, storage virtual machines, and IPv6 are not available there.\r\n\r\n&lt;b&gt;Links:&lt;/b&gt;\r\n\r\n* &lt;a href=\"https://dynamic.lunanode.com/info.php\" target=\"_blank\"&gt;More information&lt;/a&gt;\r\n* &lt;a href=\"https://www.lunanode.com/cart.php?gid=8\" target=\"_blank\"&gt;Order an account&lt;/a&gt;"}