{"id": 22809, "date": "2014-03-03 22:29:15", "user": "AlexBarakov", "post": "Hello fellow forum members,\r\n\r\nThis time I will begin with the new things. The past couple of weeks, I've spent most of my time tweaking different internal and external monitoring solutions and setting different thresholds. All our nodes are now carefully monitored for abuse both real-time by me and a tech (A new commer in the company, a real life friend of mine) and via different monitoring solutions. I've spent some time, writing a special inhouse monitoring software as well, as there were some fields that were not covered by the popular monitoring solutions, floating around the net. We now run both nodewatch and VPSMON, carefully configured and tweaked for our usage, In addition to our inhouse software and I am glad to report that according to our stats, regular users should benefit from at least 20% increase in performance, if my Math is correct, of course.I am also glad to tell that I've revised all of the companies politics and policys and I can safely say that now we are working much more efficiently and hope that our clients would notice that. After that - we've release our Free backup space (5GB FTP backup space) and free DNS hosting. An account can be aquired by everyone, that has an active service with us. I've also started something that was planned a long ago - a help section (Wiki), which purpose would be to answer pretty much every question that the current or future customer might have. You can visit the Wiki over at: http://help.liquid-solutions.biz/doku.php?id=start . It will be frequently updated with questions and answers, that we receive in our ticket department. A SLA is also something that got recently out, it includes ticket response times and uptime guarantees. It can be found in our Help section (the link is above). As a part of a new, more transperent policy - a public server status page would be released, as well as network status page. The next things on the table to be released are: Automatic rDNS setup from the control panel and pure SSD / SSD Cached servers. Our target is to move all our customers to SSD cached nodes, by the end of April. I am currently discussing work positions with a couple of system administrators (Known in the LEB field), as I am looking for additional tech, to minimise the response times on tickets. IPv6 is also available on our OpenVZ plans (Tunneled for Seattle, Chicago and LA and native for Lenoir).\r\n\r\nAnd now for the offers!\r\nThe next 14 days, we will give an extra free IP to every user that signs with us and has a valid justification. Please make sure you open a ticket, requesting the IP and providing the justification for it.\r\n\r\n**Special DDoS protected server in Chicago:**\r\n &lt;ul&gt;\r\n &lt;li&gt;2GB RAM\r\n &lt;li&gt;512MB vSwap\r\n &lt;li&gt;100GB Disk Space\r\n &lt;li&gt;800GB Bandwidth\r\n &lt;li&gt;1 IPv4 Address (unfiltered) and 1 DDoS protected IPv4\r\n &lt;li&gt;100Mbit connection\r\n &lt;li&gt;OpenVZ/SolusVM\r\n &lt;li&gt;Manual setup within 24 hours\r\n &lt;li&gt;48$ per per year. That's only 4$ per month! &lt;br&gt;\r\nhttps://liquid-solutions.biz/clients/cart.php?a=add&amp;pid=135\r\n&lt;/ul&gt;\r\n\r\n--------------------------------------------------------------------\r\n\r\n**Non protected 2GB VPS deal:**\r\n&lt;ul&gt;\r\n&lt;li&gt;2GB RAM\r\n&lt;li&gt;512MB vSwap\r\n&lt;li&gt;100GB Disk Space\r\n&lt;li&gt;800GB Bandwidth\r\n&lt;li&gt;1 IPv4 Address\r\n&lt;li&gt;100Mbit connection\r\n&lt;li&gt;OpenVZ/SolusVM\r\n&lt;li&gt;7$ per month or 48$ per year:\r\n&lt;br&gt;http://liquid-solutions.biz/clients/cart.php?a=add&amp;pid=102 - Seattle (monthly)\r\n&lt;br&gt;http://liquid-solutions.biz/clients/cart.php?a=add&amp;pid=104 - LA (monthly)\r\n&lt;br&gt;https://liquid-solutions.biz/clients/cart.php?a=add&amp;pid=103 - Lenoir (monthly)\r\n&lt;br&gt;http://liquid-solutions.biz/clients/cart.php?a=add&amp;pid=125 - Seattle (yearly)\r\n&lt;br&gt;http://liquid-solutions.biz/clients/cart.php?a=add&amp;pid=126 - LA (yearly)\r\n&lt;br&gt;https://liquid-solutions.biz/clients/cart.php?a=add&amp;pid=130 - Chicago (yearly)\r\n&lt;/ul&gt;\r\n\r\n--------------------------------------------------------------------\r\n\r\n**A true LEB:**\r\n&lt;ul&gt;\r\n&lt;li&gt;256MB RAM\r\n&lt;li&gt;128MB vSwap\r\n&lt;li&gt;20GB Disk Space\r\n&lt;li&gt;150GB Bandwidth\r\n&lt;li&gt;1xIPv4 Address\r\n&lt;li&gt;OpenVZ/SolusVM\r\n&lt;li&gt;$15/year\r\n&lt;br&gt;https://liquid-solutions.biz/clients/cart.php?a=add&amp;pid=99 - Seattle \r\n&lt;br&gt;https://liquid-solutions.biz/clients/cart.php?a=add&amp;pid=131 - Chicago\r\n&lt;/ul&gt;\r\n\r\n--------------------------------------------------------------------\r\n\r\n**Chicago 3GB**\r\n&lt;ul&gt;\r\n&lt;li&gt;3GB RAM\r\n&lt;li&gt;120GB HDD\r\n&lt;li&gt;800GB BW\r\n&lt;li&gt;1gbps connection\r\n&lt;li&gt;48$ per year or 7$ per month\r\n&lt;br&gt;https://liquid-solutions.biz/clients/cart.php?a=add&amp;pid=132 - Chicago 7$ per month &lt;br&gt;https://liquid-solutions.biz/clients/cart.php?a=add&amp;pid=133 - 48$ per year\r\n&lt;/ul&gt;\r\n\r\n--------------------------------------------------------------------\r\n\r\n**Some network information and test files:**\r\n&lt;br&gt;http://nc.lg.liquid-solutions.biz/ - Lenoir Looking Glass (Located in Dacentec DC in Lenoir, NC)\r\n&lt;br&gt;http://seattle.lg.liquid-solutions.biz/ - Seattle Looking Glass (Located in Netriver DC, via Colocrossing in Seattle, WA)\r\n&lt;br&gt;http://la.lg.liquid-solutions.biz/ - LA looking Glass (Located in QuadraNet DC, cia ColoCrossing in LA, CA)\r\n\r\n--------------------------------------------------------------------\r\n\r\n**IPv6 information:**\r\n&lt;br&gt;Tunneled in LA, Chicago and Seattle, via HE's services. Their tunnel nodes are located between 1 and 2 ms away from our nodes, so the overhead is minimal. We offer native IPv6 in Lenoir.\r\n\r\n--------------------------------------------------------------------\r\n\r\nIf you have any feedback, suggestions, or just want to chat, hit me up at alex @ liquid-solutions.biz or on skype (alex_barakov). I'd be glad to hear from you!\r\n\r\nThank you for reading through all of this. It is more of a news thread, however I think I am not allowed to post such kind of news, as it would be considered advertising."}