{"id": 24330, "date": "2014-03-28 16:04:27", "user": "ModulesGarden", "post": "We are proud to announce the release of long-awaited module that has won 1st ModulesGarden Module Contest with the vast predominance of all votes!\r\n\r\nThe victorious module is called OpenStack VPS For WHMCS and it will let you to automatically provision virtual servers to your customers. The module will allow your clients to manage previously ordered virtual servers directly from your WHMCS client area, while you will have full control over each created virtual server.\r\n\r\nWorth mentioning is fact that you can use configurable options owing to which your customers will be able to order virtual servers tailored to their needs. With OpenStack For WHMCS your clients will be able to e.g. overview server details, reboot or rebuild it, manage backups or even access console. All these and much more within your own WHMCS client area! \r\n\r\nIf you want to integrate and automate the provisioning of OpenStack virtual servers in your WHMCS, then you can not miss our module. Your clients will definitely appreciate this!\r\n\r\n\r\nAdmin Area Features:\r\n\r\n- Create Server \r\n- Suspend/Unsuspend Server \r\n- Terminate Server \r\n- Change Package (Supports Configurable Options) \r\n- View Server Status And Details \r\n- View Interface Details \r\n- View List Of Scheduled Tasks \r\n\r\nClient Area Features:\r\n\r\n- View Server Status And Details \r\n- Start/Stop Server \r\n- Pause/Unpause Server \r\n- Resume Server \r\n- Soft Reboot Server \r\n- Hard Reboot Server \r\n- Reset Network \r\n- Rebuild \r\n- Change Passowrd For Xen (Support For Other Virtualizations - Coming Soon)\r\n- noVNC Console \r\n- Backups \r\n- View List Of Scheduled Tasks \r\n\r\nModule Features:\r\n\r\n- Configuration Of Backups Quantity Limit \r\n- Triggerable Routing Backups (Newest Backup Overwrites The Oldest One If Backup Limit Is Reached) \r\n- Configuration Of Client Area Features \r\n- Configurable Options (Flavor, VM Image, IP Addresses, Backups Files Limit, Disk, RAM and VCPUs) \r\n\r\nAdditionally:\r\n\r\n- Integration With Advanced Billing For WHMCS - Server Resource Usage Billing (coming within 2 weeks) \r\n- Multi-Language Support \r\n- Supports WHMCS V5 Or Later \r\n\r\nRequired Components:\r\n\r\n- Keystone \r\n- Glance \r\n- Nova  \r\n- Neutron \r\n- Ceilometer (Required For Billing)\r\n\r\nFor more information visit our website: **[http://www.modulesgarden.com/products/whmcs/openstack_vps/features](http://www.modulesgarden.com/products/whmcs/openstack_vps/features)**"}