{"id": 26565, "date": "2014-04-30 19:54:36", "user": "bpsRobert", "post": "bpsNode has just added more stock to its Main location at the Telx Datacenter Facility in Miami, FL. We offer all Pure SSD VPS's. No SSD Caching, No spinning disks. While the company itself, is fairly new (opened in 2013), bpsNode owners have been in the hosting industry for over a decade, offering other quality services such as VoIP, Hosted PBX's, Shared Hosting, Colo, and dedicated hosting under other brand names. We've combined those companies together into bpsNode, in an initiative to aggressively compete in the VPS Market while we build-out our CloudStack infrastructure to poise ourselves to offer a full and rich range of hosting solutions, and move into the IaaS markets.\r\n\r\nDuring our CloudStack build-out, we've sectioned off a few new nodes to put into our current legacy VPS offerings and have that stock available again. This will be our last Legacy VPS offerings, while we build-out our cloud infrastructure.\r\n\r\nWe are offering to LET members, a limit of 40 new LET Customers to utilize promo code &lt;b&gt;LET40OFF&lt;/b&gt;, to receive 40% off on ANY of our OpenVZ and KVM Plans. Once the 40 spots are filled, the promotion will end. I personally love this community, so I wanted to offer something in the LET price range. An example plan at 40% off is below:\r\n\r\n\r\n&lt;b&gt;KVM256&lt;/b&gt; - $6.00/mo (40% promo brings it to &lt;b&gt;$3.60/mo&lt;/b&gt;)&lt;br&gt;\r\nKVM Virtualization&lt;br&gt;\r\n256MB RAM&lt;br&gt;\r\n1 CPU Core Access&lt;br&gt;\r\n5GB SSD Space&lt;br&gt;\r\n1Gbps Port&lt;br&gt;\r\n1000GB Bandwidth&lt;br&gt;\r\n1 IPv4 Address&lt;br&gt;\r\n\r\nhttps://www.bpsnode.com/billing/cart.php?gid=5\r\n\r\n&lt;b&gt;OVZ512&lt;/b&gt; - $8.00/mo (40% promo brings it to &lt;b&gt;$4.80/mo&lt;/b&gt;&lt;br&gt;\r\nOpenVZ Virtualization&lt;br&gt;\r\n2 CPU Core Access&lt;br&gt;\r\n40GB SSD RAID-10 HD&lt;br&gt;\r\n512Mb Ram + 512Mb VSwap&lt;br&gt;\r\n1Gbps Port&lt;br&gt;\r\n1000GB Monthly Transfer&lt;br&gt;\r\n1 IPv4 Address&lt;br&gt;\r\n\r\nhttps://www.bpsnode.com/billing/cart.php?gid=4\r\n\r\nThank you all!\r\n\r\n-Robert"}