{"id": 29591, "date": "2014-06-20 17:31:33", "user": "Corey", "post": "In case you guys didn't see our lowendbox post I'll post it here for your convenience.  We've also added our Dallas location since the advertisement was posted.\r\n\r\nCorey, from BitAccel, is back with a new exclusive offer for LowEndBox readers. The offer is 45% off of all packages on all billing terms. BitAccel has been doing business since January 2013 and have been featured on LowEndBox three times since that time. They use E3-1240v2 CPUs and hard drives in RAID10 in their host nodes. In the past BitAccel used to use VirtPanel, but they have recently switched back to SolusVM. According to Corey, BitAccel will role out a backup service for all customers that could help them out in the case of accidental data loss. Reviews of BitAccel have been mostly positive. As always we’re looking for your opinion, so please share that in the comments or at LowEndTalk.com.  \r\n  \r\nOpenVZ VPS1  \r\n\r\n    1 CPU core  \r\n    1024MB RAM  \r\n    60GB disk space  \r\n    1TB bandwidth  \r\n    1Gbps uplink  \r\n    1x IPv4 address  \r\n    OpenVZ/SolusVM  \r\n    $3.85/month  \r\n    Coupon: **45OFF**  \r\n    https://www.bitaccel.com/my/cart.php?a=add&amp;pid=38&amp;promocode=45OFF  \r\n\r\nOpenVZ VPS2  \r\n\r\n    2 CPU cores  \r\n    1536MB RAM  \r\n    80GB disk space  \r\n    1TB bandwidth  \r\n    1Gbps uplink  \r\n    1x IPv4 address  \r\n    OpenVZ/SolusVM  \r\n    $6.05/month  \r\n    Coupon: **45OFF**  \r\n    https://www.bitaccel.com/my/cart.php?a=add&amp;pid=38&amp;promocode=45OFF  \r\n  \r\n  \r\nBitAccel accept payments via 2Checkout and Paypal. If you’re not happy with the service you receive, BitAccel offer a 7 day moneyback guarantee. They also offer a 100% network uptime SLA. IPv6 is not supported by them. We are told that KVM plans are coming soon. Additional IPv4 addresses are priced at $1 each per month. A range of other addons can be selected at checkout. Please take a look at their Terms of Service before signing up.  \r\n  \r\nNetwork Information  \r\n\r\nTest IP for NY: 192.3.178.186  \r\nTest File for NY: https://192.3.178.186:6767/100mb.test  \r\n\r\nTest IP for LA: 162.248.96.131  \r\nTest File for LA: https://162.248.96.131:6767/100mb.test  "}