{"id": 29861, "date": "2014-06-24 13:30:44", "user": "zionvps", "post": "Greetings from Zionvps LLP! our website : http://zionvps.com\r\n----------------------------------------------------\r\n\r\nWe have been around the vps hosting industry since 4 months. We are here to offer openvz servers. All the servers contain fair cpu share, raid 01 hdd, unmetered bandwidth, and awesome  support.\r\n\r\n**Offer info** : For the first time, on an experimental basis, we are handing out free vps management for first month. The management is reactive in nature, and done via skype text.\r\nWe can configure and install your web server, database server, php, vpn, forum scripts/ any script provided that it has a documentation. etc and even harden your vps for security which usually involves tweaking ssh for security, hardening web server and such.\r\n\r\nThis is a fairly new approach by us, thus we are only offering free first month management for first 3 signups. We will see how it goes and depending on it, we might offer again in future.\r\n\r\n\r\nOpenvz plan :\r\n\r\n* 512mb ram\r\n* 30 gb RAID HDD,\r\n* 1 ipv4, 2 ipv6 ddos protected\r\n* Access to 2 cpu cores ( shared )\r\n* openvz/solusvm\r\n* 50mbps unmetered port\r\n* $ 6.50/MO\r\n* [buy now ](https://billing.zionvps.com/cart.php?gid=1)\r\n\r\nCoupon code for free management - AAZX79OYY6\r\n\r\nWant a custom plan? no problem! just pm me here or open a support ticket and we will quote the price and feasibility. \r\n\r\nTOS summary:\r\n\r\nNot allowed:\r\n\r\n* outbound ddos\r\n* cpu miners\r\n* smtp relay/spam mail\r\n* tor exit nodes\r\n* botnet hoarder/controller (irc or http)\r\n* warez linking/ copyright item hosting\r\n* public proxy\r\n\r\nAllowed:\r\n\r\n* tor relay\r\n* private vpn/proxy\r\n* game servers (you might need more cpu for this, please contact us and we will settle this)\r\n* http mirrors (we don't really care how much bandwidth you use)\r\n\r\n\r\nPayment methods accepted - Paypal and Bitcoins\r\n\r\nAfter payment provisioning is instant!\r\n\r\ntest ip - http://192.99.131.144/512MB.zip"}