{"id": 31405, "date": "2014-07-21 00:40:45", "user": "petris", "post": "**About Petris Consulting LLC**\r\n\r\nPetris Consulting LLC is a registered company in the state of Georgia in the United States, incorporated in March 2014 and operated by myself. I am a software engineer based in Atlanta with experience in many languages and other technical subjects such as server administration.\r\n\r\nMy goal is to provide DDoS-protected virtual servers at an affordable price on nodes that are properly maintained and looked after. Various monitoring software is used to ensure servers are operating optimally, many of which are publicly available (see [Observium](https://status.petris.net/) and [uptime reports](https://wiki.petris.net/display/INFO/Uptime+Reports)).\r\n\r\n**Offer**\r\n\r\n* 1GB RAM\r\n* 25GB Storage\r\n* 1 Virtual CPU\r\n* 2TB Data Transfer\r\n* 1 IPv4 Address\r\n* 5 IPv6 Addresses\r\n* **KVM** Virtualization\r\n* SolusVM Control Panel\r\n* $7/month\r\n\r\n[Order Now](https://client.petris.net/cart.php?a=add&amp;pid=17)\r\n\r\n**Node Specifications**\r\n\r\n* Intel Xeon E5-1620v2 (3.7 GHz)\r\n* 64GB DDR3 RAM (1600MHz)\r\n* 2 x 2TB HDD (Software RAID 1)\r\n* 1Gbps port, 500Mbps transfer speed\r\n\r\n**Support Policy**\r\n\r\nTo keep prices low, services are strictly unmanaged. Tickets regarding network, performance, and control panel issues will be addressed in a timely manner; all others will be closed with an explanation of our unmanaged policy. **NOTE**: Enabling/Disabling permanent DDoS mitigation is an exception to this policy.\r\n\r\n**Refund Policy**\r\n\r\nYou may request a full refund for your first service within the first 72 hours of placing your initial order. Refund requests must be made via a ticket.\r\n\r\n**Other Information**\r\n\r\n* Services are instantly provisioned after payment.\r\n* Servers are located at OVH's datacenter in Beauharnois, Canada.\r\n* Permanent DDoS mitigation can be enabled for your IPv4 address upon request.\r\n* Payments can be made via PayPal or Stripe. No card information is stored or transmitted through our servers.\r\n* [Beauharnois Looking Glass](http://lg-bhs.petris.net/)\r\n* [List of KVM Templates/ISOs Available](https://wiki.petris.net/display/INFO/Server+Templates)\r\n* [ServerBear Benchmark](http://serverbear.com/benchmark/2014/07/20/jxr6k40jAGLqqa4k)\r\n\r\nPlease feel free to [open a sales ticket](https://client.petris.net/submitticket.php?step=2&amp;deptid=3) should you have any questions or concerns prior to purchasing."}