{"id": 31863, "date": "2014-07-29 00:16:39", "user": "CVPS_Chris", "post": "Hey guys,\r\n\r\nWe hope that you are having a fantastic evening! We wanted to let you be the first to know about the huge Summer sale that is going on right NOW at ChicagoVPS.\r\n\r\nAs some of you may know, ChicagoVPS has a bargin bin dedicated server inventory, however they are almost always sold out. The bargain bin inventory is where we publish special deals on dedicated servers. For those who are possibly interested in upgrading to a dedicated server solution, or looking to deploy a dedicated server, please feel free to check out the bargain bin section. We have re-stocked our bargain bin inventory, and have added plenty of aggressively priced dedicated servers starting at just $30/month available for ordering right away!\r\n\r\nAt the moment of writing this email, below are the dedicated servers currently up for grabs. At these rates they will not last long - our bargain bin dedicated server inventory is updated live so please view current available servers by clicking here.\r\n\r\nDual Core / 160GB or higher HDD / 4GB RAM / 5TB BW - $30/month (6 available)\r\n\r\nDual Core / 2 x 250GB HDD / 4GB RAM / 5TB BW - $35/month (1 available)\r\n\r\nQuad Core / 250GB HDD / 4GB RAM / 5 TB BW - $35/month (2 available)\r\n\r\nQuad Core / 250GB HDD / 8GB RAM / 10TB BW - $39/month (4 available)\r\n\r\nDual Core / 500GB HDD / 8GB RAM / 10TB BW - $39/month (2 available)\r\n\r\nQuad Core / HDD1: 250GB / HDD2: 250GB / 4GB RAM / 10TB BW - $39/month (2 available)\r\n\r\nQuad Core / HDD1: 500GB / HDD2: 120GB SSD / 8GB RAM / 10TB BW - $45/month (1 available)\r\n\r\nQuad Core / 1TB HDD / 8GB RAM / 10TB BW - $45/month (1 available)\r\n\r\nOrder: https://billing.chicagovps.net/cart.php?gid=30\r\n\r\n\r\nWe also wanted to have a 3GB VPS sale, something we do not do very often! This offer is good for Buffalo, NY or Los Angeles, CA. $6.93/month or only $48/year!\r\n\r\n3072 MB Dedicated Ram\r\n80 GB Diskspace\r\n2TB Bandwidth\r\n100Mbps Port\r\n2xIPv4 Address\r\nOpenVZ\r\n\r\nBuffalo Order: https://billing.chicagovps.net/cart.php?a=add&amp;pid=155\r\n\r\nLos Angeles Order: https://billing.chicagovps.net/cart.php?a=add&amp;pid=156 \r\n\r\n\r\nAdditionally, did you know that ChicagoVPS now offers OpenVZ VPS hosting in 6 locations? We are currently offering our SSD Cached OpenVZ Professional plan at a heavily discounted rate of just $30/year!\r\n\r\n1024MB (1GB) RAM\r\n30GB RAID-10 Protected SSD Cached Disk Space\r\n1.5 TB Monthly Bandwidth\r\n1x IPv4 Address\r\nInstant Setup\r\nOpenVZ\r\n\r\nAvailable in 6 locations: Chicago, Buffalo, Los Angeles, Atlanta, New Jersey, or Dallas!\r\n\r\nOrder: https://billing.chicagovps.net/cart.php?a=add&amp;pid=239 select 12 month billing cycle and use promo code SUMMER to claim your locked in pricing of $30 per year!\r\n\r\nHave any questions? Email sales@chicagovps.net - we have account managers standing by, eager to answer any questions you may have. Thank you for the opportunity you have given us.\r\n\r\nRegards\r\nChicagoVPS Team\r\n"}