{"id": 32171, "date": "2014-08-03 01:47:27", "user": "frixelsolutions", "post": "Hello,\r\nFrixel Solutions LLC. is a registered company in the state of Oregon, though we primarily operate in California. We use private WHOIS, however you can confirm our information [here](http://egov.sos.state.or.us/br/pkg_web_name_srch_inq.show_detl?p_be_rsn=1704921&amp;p_srce=BR_INQ&amp;p_print=FALSE) and we also have contact information on our website [here](https://www.frixelsolutions.com/support.php).\r\n\r\n\r\nWe have an exclusive offer for LowEndTalk readers, for FREE setup on any of our \"Bargain Bin Dedicated Server\" lineup. Usually there is a $5 setup fee on these low end dedicated servers. You can see what we have in stock right now, order soon as we do not have many in stock, though we will periodically add more.\r\n\r\n\r\nPentium 4 CPU, 4GB RAM, 160GB HDD, 10Mbps Unmetered (~3TB) - $15/month\r\n\r\nCore 2 Duo CPU, 4GB RAM, 250GB HDD, 3TB 100Mbps - $30/month\r\n\r\nCore 2 Duo CPU, 4GB RAM, 500GB HDD, 3TB 100Mbps - $35/month\r\n\r\n\r\nhttps://www.frixelsolutions.com/secure/cart.php?gid=5\r\n\r\n\r\nPromo code for Free setup: LET-BBDS-FS\r\n\r\n\r\nCPUs, RAM speed, hard drive model, speed, and age may vary between servers. Everything is thoroughly tested and ready to go. We do not allow configuration of these servers as far as changing the hardware specifications. If you want a different operating system than listed please select Other and say what you want in the order notes. Customers could mail CD or flash drive, as well (won't be returned, but we will keep it as long as the customer's service is active, for future re-installs needed, then it will be destroyed). By default we use Minimal installs. Please put the OS you want in the order notes if it's not listed. If you need many reinstalls we will begin to charge $5 each for the time and effort - this is a low margin service. If you need constant reinstalls get a virtual server where you can do it from your web browser.\r\n\r\n\r\nAll servers include a /29 of IPv4 and a /64 of IPv6. Our network upstream consists of HE right now, and more will be added soon by our upstream provider. As far as I know Level3 is next.\r\n\r\n\r\nOur servers are located in Rohnert Park, California. We own and operate our servers in this unique location; we are not a reseller. Our upstream bandwidth provider has enterprise level fiber internet service. The building has grid power, solar power, a generator, and our core network has another layer of UPS backups, so we won't be having any power or network problems.\r\n\r\n\r\nTest IP: 204.10.167.214\r\n\r\n\r\nWe accept PayPal and Credit Cards. If you need any additional information, please let us know. Thank you and we look forward to serving you. Please be sure to read our terms of service, acceptable use policy, and privacy policy located at the bottom of every page of our website.\r\n\r\nhttps://www.frixelsolutions.com/"}