{"id": 32231, "date": "2014-08-04 00:31:48", "user": "BlastVM", "post": "Looking for the best VPS Solutions? BlastVM.net has you covered! Our sole mission is to provide premium, DDoS Protected VPS hosting to individuals and companies of all sizes.\r\n \r\nHere is another special offer that has been tailored especially for LET. These plans are perfect for all types of usage; Including GRE or any type of proxying!\r\n \r\nEach Additional IPv4 is: $1.50m/o each per DDoS Filtered IP Address and default filtering is up to 10Gbps / 6Mpps. However in total our Los Angeles Location has up to 150Gbps / 66Mpps filtering capability. Psychz Networks Utilizes several NSFocus ADS Devices. Including NSFocus WAF Devices, so we can mitigate up to L7 Application Based Floods.\r\n \r\nOur XEN Platform is powered by XEN 4.3.3 compiled by BlastVM including Kernel 3.1 so that we can offer the best stability, as we found that a majority of other providers who utilize XEN do it incorrectly, and as a result you don't see native performance.\r\n \r\nBlastVM has just launched our Los Angeles Location, and we owe it all thanks to to Psychz who have offered us a fantastic deal. So we are actively deploying clients in this location, and we have a total of 243 DDoS Protected IP Addresses in this location with three 72GB XEN Nodes we hope to be upgrading all our Nodes to Dual x5650 in the future, and Adaptec maxcache to offer better performance.\r\n \r\nWe have also introduced Native IPv6 and Internal Networking through a separate switch for our XEN VPS Plans. The internal capacity of the switch is 48GBps and 35.6Mpps total capacity. In fact were going to upgrade this to 10GE in the future to offer 10GBps Internal Networking for all our VPS Plans.\r\n \r\n&gt; XENPV-768 -\r\n\r\n&gt; vCPUs: 2\r\n\r\n&gt; vRAM: 768MB\r\n\r\n&gt; RAID-10 Storage: 25GB\r\n\r\n&gt; Outbound Traffic: 1TB\r\n\r\n&gt; Free Inbound Traffic\r\n\r\n&gt; 1 (IPv4) + 16 (IPv6)\r\n\r\n&gt; Anti-DDoS\r\n \r\n&gt; Order XenPV: https://billing.blastvm.net/cart.php?a=add&amp;pid=40\r\n\r\n&gt; Order XenHVM: https://billing.blastvm.net/cart.php?a=add&amp;pid=42"}