{"id": 32897, "date": "2014-08-17 21:21:34", "user": "TACServers", "post": "Hello LET!\r\n\r\nAbout Me\r\n\r\nHello there! Name is Steve, I have ran a technology management company since I was 19 years old. Starting out, it was family, and friends that I assisted most. As word spread, I have expanded into businesses, and small family Medical and Dental offices. As part of the services that I provide to my clients, I have worked with virtualization, dedicated, colocation, and more. I would like to expand from my modest group of customers to break into the world at large. Rest assured that I will be doing all that I can to ensure that your service remains exactly as you want it. I formed a small group of like minded individuals to assist with this project and here we are. All of the offers below are hosted on some older hardware, but due to the excessive amount of older hardware we have sitting around, we are managing rather low density, and less VPS's per node. With this, we can manage better with the resources we have available, and this allows us fluidity, as we can move VPS's around node issues. Unless you are interested in transcoding, or other CPU intensive apps, I believe that you will find our stability and support outstanding. \r\n\r\nAbout Us\r\n\r\nTACServers was formed in 2007 to provide quality service at an exceptional price. We have yet to stray from this mission. We strive to provide the highest level of technical service possible, and will work with you to establish a stable online presence. We own all our own hardware, we do not have outstanding debts, and are here for the long term.\r\n\r\nTACServers bases itself on the pride and ethics we believe is needed to run any type of hosting company. We believe that every server should be maintained at an acceptable load level, and we strive to never oversell our resources. Our OpenVZ nodes are under-allocated, leaving 10-14GB of RAM for caching the FS, and thus, VPS files. Our team is based out of the United States and have years of networking and Linux/Windows experience!\r\n\r\nTACServers' goal is to make you, the customer, happy. We are proud to call all our customers business partners. Our mission statement: Anything we can do to make you happy, makes us happy! We grow as you grow, and without YOU: the client, we would have nothing to do! Many people neglect the importance of the customer, but not TACServers.\r\n\r\nHere's our two VPS plans for sale today!\r\n\r\n    OpenVZ Virtualization,\r\n    256 MB Guaranteed RAM\r\n    256 MB vSwap\r\n    2 vCPU Cores\r\n    30 GB RAID Disk Space\r\n    150 GB Bandwidth\r\n    100 Mbps Port Speed\r\n    1 IPv4 Address\r\n    2 IPv6 Addresses\r\n    SolusVM VPS Control Panel\r\n    Location: Denver, CO\r\n    US Based Support\r\n    Templates: CentOS, Debian, Ubuntu 14.04 (32bit + 64bit versions)\r\n    $4.00 per month (Quarterly $10.00) &lt;&lt;&lt; $2.00 / $5.00 With Promo TACGRANDOPENING\r\n    Order Here: [OVZ1](https://manage.tacservers.net/cart.php?a=add&amp;pid=2)\r\n\r\n    OpenVZ Virtualization,\r\n    512 MB Guaranteed RAM\r\n    512 MB vSwap\r\n    2 vCPU Cores\r\n    40 GB RAID Disk Space\r\n    200 GB Bandwidth\r\n    100 Mbps Port Speed\r\n    1 IPv4 Address\r\n    2 IPv6 Addresses\r\n    SolusVM VPS Control Panel\r\n    Location: Denver, CO\r\n    US Based Support\r\n    Templates: CentOS, Debian, Ubuntu 14.04 (32bit + 64bit versions)\r\n    $7.00 per month (Quarterly $17.00) &lt;&lt;&lt; $3.50 / $8.50 With Promo TACGRANDOPENING\r\n    Order Here: [OVZ2](https://manage.tacservers.net/cart.php?a=add&amp;pid=3)\r\n\r\nMain Site:\r\nhttp://www.tacservers.net/\r\n\r\nTest, 100Mbit VPS:\r\nhttp://lg.den.tacservers.net/\r\n\r\nTest IPv6:\r\n2001:470:4b:255:1111:1111:5837:a4a1\r\n\r\nTest IPv4:\r\n64.78.145.92\r\n\r\nASN:\r\nhttp://bgp.he.net/AS13649\r\n\r\nPayment Methods:\r\nPayPal\r\n\r\nNow here's the kicker! Limited availibility on this Promo code! Get it while it lasts! Our stock is limited by IP's and justification, we use them up, we have a justifiable need for more. \r\n\r\nTACGRANDOPENING = 50% Off, Recurring, Lifetime :)\r\n\r\nAll accounts will be provisioned manually post abuse/fraud verification. Please use our support desk if you have any issues. IPv6 is HE.net tunnel until native IPv6 blocks are routed. We have a 10gbit connect to HE, and sub 2ms pings to the tunnel server, but in the interest of transparency...\r\n\r\nCriticism will be appreciated, this is only the beginning! We look forward to being here long term, any questions, please ask. "}