{"id": 33367, "date": "2014-08-26 20:27:40", "user": "noosVPS", "post": "![](http://www.noosvps.com/noos-whmcs.png)\r\n&lt;hr/&gt;\r\nGreetings from noosVPS!\r\n\r\nThis is our offer of two 1GB KVM VPS each month for regular LET users. The VPS will be free for first 2 months. There is absolutely no obligation to continue further but if you are satisfied with the VPS then we expect you to continue with us on a paid plan from the third month.\r\n\r\nIn order to qualify, you should:\r\n\r\n1. be an active member of LET for at least 3 months and have a minimum of 30 posts\r\n2. receive at least 25 \"Thanks\" from other members\r\n3. not be running your own VPS/Dedi hosting service\r\n4. actively use the provided VPS during free period\r\n\r\nInterested members please PM me describing how you plan to use the VPS within the next 8 hours (10AM IST). 2 LET users will be selected for this special offer. We plan to run this offer every month if we get good response from the community.\r\n\r\nThe VPS is under our Starter-KVM plan, and will be free until October 31, 2014.\r\n\r\nStarter-KVM (regular price: $4 /mo)\r\n--\r\n&lt;ul&gt;\r\n&lt;li&gt;1GB RAM&lt;/li&gt;\r\n&lt;li&gt;2GB Swap&lt;/li&gt;\r\n&lt;li&gt;CentOS 6.5 x86_64&lt;/li&gt;\r\n&lt;li&gt;1 vCPU Core&lt;/li&gt;\r\n&lt;li&gt;20GB Disk Space&lt;/li&gt;\r\n&lt;li&gt;500GB Bandwidth&lt;/li&gt;\r\n&lt;li&gt;1 IP Address&lt;/li&gt;\r\n&lt;li&gt;Self-managed&lt;/li&gt;\r\n&lt;/ul&gt;\r\n\r\nDC &amp; Hardware\r\n--\r\nHosted at Lenoir, NC. Our servers are powered by Dual Intel Xeon L5520 processors with 72GB RAM. HDD is on RAID 1, with additional SSD storages included as per requirement with gigabit network connectivity.\r\n\r\nNetwork\r\n--\r\nTest IP: 192.254.69.139  \r\n10 MB: [Download](http://192.254.69.139/10mb.bin)  \r\n100MB: [Download](http://192.254.69.139/100mb.bin)\r\n\r\nWhat we expect from you (customer)\r\n--\r\n1. Do not \"abuse\" our network in any way [ read http://www.noosvps.com/terms-of-service/#aup ]. Keep IPs clean.\r\n2. No disk porn / high io-heavy services. Seriously, we will find out if you do. And we will hunt you down. And we will.. just kidding. But we might restrict your io.\r\n3. Stay inside the allotted monthly bandwidth limit. We will restrict network speed if your data transfer threatens to exceed monthly limit.\r\n4. Use the VPS for something productive. Host a website, or maybe a DNS server etc etc. Just don't keep the VPS idle for 2 months when someone else could have put it to better use.\r\n\r\nWhat you can expect from us (provider)\r\n--\r\n1. Responsible, reliable and sincere service combined with knowledgeable support.\r\n2. Production-ready KVM VPS without any kind of over-selling.\r\n3. Reliable network and uptime. Maintenance schedules notified in advance.\r\n4. Currently all VPS are self-managed but we will offer at least basic management (or perhaps full management) from next month when our new website is launched.\r\n&lt;hr/&gt;\r\nWe are truly excited about this offer. Although new, we are a serious and committed provider. For us, \"cheap\" does not not mean that \"anything goes\". \"Cheap\" will not be an excuse for us to provide you high-school support or frequent downtimes. There are already many great low-end providers in here and we aim to be recognized as one of them in the coming months.\r\n\r\nThank you!"}