{"id": 33733, "date": "2014-09-02 08:00:16", "user": "Rob_T", "post": "Hello LET Members!  \r\n  \r\nUltraVPS has been hard at work re-vamping our VPS plans as we introduce our new KVM-based VPS servers! To get the ball rolling, we're running some great annual specials - grab them while they are available!  \r\n  \r\nNode Specs:  \r\nIntel Xeon E3-1230  \r\n32GB DDR3 ECC RAM  \r\n1TB SATA3 SSD  \r\nGig-E Internet Uplink  \r\nDDoS Protected Network  \r\n  \r\n  \r\n**Value SSD VPS 0.5:**\r\n----------  \r\n* 1 CPU Core\r\n* 512MB RAM Memory\r\n* 10GB SSD Storage\r\n* 1 IP Address\r\n* 1TB Bandwidth\r\n* Most Common Linux OS'es available\r\n* Las Vegas (Fiberhub) or Seattle (Westin) available\r\n  \r\n**Only $19.95 per year!**  \r\n**[Click Here To Order](http://www.ultravps.com/specials.php)**  \r\n  \r\n  \r\n**Value SSD VPS 1:**  \r\n----------  \r\n* 1 CPU Cores\r\n* 1GB RAM Memory\r\n* 20GB SSD Storage\r\n* 1 IP Address\r\n* 1TB Bandwidth\r\n* Most Common Linux OS'es available\r\n* Las Vegas (Fiberhub) or Seattle (Westin) available\r\n  \r\n**Only $29.95 per year!**  \r\n**[Click Here To Order](http://www.ultravps.com/specials.php)**  \r\n  \r\n  \r\n**Value SSD VPS 2:**  \r\n----------  \r\n* 2 CPU Cores\r\n* 2GB RAM Memory\r\n* 40GB SSD Storage\r\n* 1 IP Address\r\n* 2TB Bandwidth\r\n* Most Common Linux OS'es available\r\n* Las Vegas (Fiberhub) or Seattle (Westin) available\r\n  \r\n**Only $47.95 per year!**  \r\n**[Click Here To Order](http://www.ultravps.com/specials.php)**  \r\n  \r\n  \r\n**FAQ:**  \r\n  \r\nQ: Who are you guys?  How long have you been around?  \r\nA: UltraVPS is a division of [Versaweb](http://www.versaweb.com) - the guys who sell awesome, cheap dedicated servers.  We've been providing VPS hosting services for over 5 years, but we're new to the Low End Talk market.  \r\n  \r\nQ: Why are these Promo plans so cheap?  \r\nA: We're currently in the process of rolling out an entirely new KVM-based product line (we used to provide mainly OpenVZ VM's).  We're looking to get the word out on what we have to offer, so we're offering some amazing bargain priced VM's to start building up some word of mouth - we'll hook you up so that you can hook us up!  \r\n  \r\nQ: Is there any kind of guarantee?  \r\nA: Buy it and try it for 15 days.  if it sucks, we'll give you your money back (as long as you didn't do anything stupid, like SPAM).  \r\n  \r\nQ: Are these managed or unmanaged plans?  \r\nA: These VPS plans are unmanaged.  We'll try and help out where we can via our ticket system, but at the end of the day It's all you.  \r\n  \r\nQ: Do these Promo VPS plans include backups?  \r\nA: No, backups are not included, but will be available as an add-on in the next few weeks.  \r\n  \r\nQ: Do you offer Windows on these VPS plans?  \r\nA: Nope - these plans are Linux only.  Windows will be available on our standard VPS plans which will be available in a few weeks.  \r\n  \r\nQ: Do you have a test IP / test file?  \r\nA: Sure!  \r\nLas Vegas - 199.47.210.50 - http://199.47.210.50/100mbtest.bin  \r\nSeattle - 76.164.234.1 - test file coming soon  \r\n  \r\nQ: Who are your network providers?  \r\nA: NTT, Abovenet, HE.net, TW Telecom, and dozens of private peering arrangements.  Check it out - [AS53340](http://bgp.he.net/AS53340)  \r\n  \r\nQ: Can I get IPv6?  \r\nA: Not yet, but soon.  We promise.  Our network is 100% v6 ready, but we're still testing out some of the new v6 features in SolusVM.  Once we're happy, we'll roll it out at no added cost.   \r\n  \r\nQ: How does your DDoS protection work?  \r\nA: Our system automatically detects incoming attacks and null routes the targeted IP, thereby minimizing collateral damage and keeping you online even if you have virtual neighbors who aren't so nice.  We offer enterprise-grade DDoS MITIGATION too - contact our Sales dept. if you are interested.  \r\n  \r\nQ: How can I use my VPS?  Any restrictions?  \r\nA: No TOR, no torrents, nothing illegal, no SPAM, no DDoS attacks, etc.  \r\n  \r\nThanks for reading, and have a good day!  \r\n"}