{"id": 35493, "date": "2014-10-04 21:02:27", "user": "SNetworks1", "post": "Hello Everyone,\r\n\r\nI hope you are all having a pleasant day. Today I bring news of some amazing value VPSs from Superior Networks. All our VPSs are OpenVZ and utilize the SolusVM panel. Our servers are currently only based in France however we are looking into other locations for the future, so do keep an eye on our twitter &amp; blog for news on that!\r\n\r\nSo these are some of the plans you can get, we are also giving away &lt;del&gt;75% off for the first 3 months with the code LET01&lt;/del&gt; or 50% off for life using LET02. These offers are only available to the LowEndTalk Community!\r\n\r\nOur lowest available plan is for 6.00 GBP per month ( &lt;del&gt;£1.50 per month for the first three months or &lt;/del&gt;£3.00 per month for life) and includes:\r\n\r\n - 1 GB of RAM\r\n - 200 GB Storage\r\n - Unlimited Bandwidth Allowance\r\n - 1 IPV4 Address\r\n - 100 IPV6 Addresses\r\n - DDoS Protection\r\n - 4 CPU Cores\r\n\r\n[Buy Here](https://www.superior-networks.com/billing/cart.php?a=add&amp;pid=42): \r\n \r\nThe next plan you could get is just £6.90 (&lt;del&gt;£2.40 per month for the first three months&lt;/del&gt; or £4.80 per month for life) GBP per month:\r\n\r\n - 2GB Of RAM\r\n - 250GB of Disk Space\r\n - Unlimited Bandwidth Allowance\r\n - 2 IPV4 Addresses\r\n - 150 IPV6 Addresses\r\n - DDoS Protection\r\n - 4 CPU Cores\r\n\r\n[Buy Here](https://www.superior-networks.com/billing/cart.php?a=add&amp;pid=38): \r\n\r\nYou can view all our plans here: https://www.superior-networks.com/vps.php and the discount codes listed above will work on any of our VPS range.\r\n \r\nOur Terms of Service is simple - generally as long as it is within UK law you will be allowed to do it. Running anything to do with Tor is one of the few additional restrictions we have to put in place due to the regulations of the Network Provider. There is a link to the full Terms of Service at the bottom of every page on the website. Refunds are only authorised should there have been issues on our end of the service (I.E. downtime that reduced our uptime to below what our SLA allows), in most cases where there are network issues you will have credit applied to your account valid for any services, or your current service extended by the agreed amount between a senior member of staff and yourself. \r\n \r\nFor those wishing to test our servers we have the IP superior-networks.com. If you wish to download some test files or run some ping tests we have a looking glass that you can use at https://www.superior-networks.com/lg/ and is available for our French Location.\r\n \r\nShould you have any questions feel free to open a ticket or reply to this thread and I will be happy to help, any feedback on using our service is also very much appreciated and can be posted here, in a new thread or via email / ticket.\r\n \r\nAll the best,\r\n\r\nRyan\r\n\r\nFounding Director of Superior Networks"}