{"id": 35669, "date": "2014-10-07 23:29:55", "user": "WebtastixIS_Shane", "post": "Sick of yet another WHMCS themed site? well at Webtastix we are different, we have custom built our own Ticket and billing system, making systems as easy to use as possible, also we have our built in manager for rDNS entry's (currently only for NZ servers) thus cutting down support ticket requirements.\r\nBased in Auckland New Zealand, Webtastix provides outstanding customer service. Our company is passionate about hosting and we strive to exceed your expectations.\r\nWe also offer FREE port based monitoring that will send instant email alerts if a specific service is down to your nominated address.\r\n\r\nWe now have VPS's based in LA, US! - Limited numbers apply so check our website for more info\r\n\r\nOur virtual private servers are perfect for clients that require a reliable server at an affordable price.\r\n\r\nMain Features:\r\n— Instant Automated Deployment\r\n\r\n— 99.9% Uptime Guarantee\r\n\r\n— OpenVZ (NZ Only at this time) and Xen Virtualisation (NZ and LA)\r\n\r\n— SolusVM Control Panel\r\n\r\n— Latest Linux Operating Systems\r\n\r\n— Free rebuilds from the control panel\r\n\r\n— FREE IPv6 (NZ only at this time)\r\n\r\n— High-Performance brand name hardware\r\n\r\n— RAID protected data drives\r\n\r\n— SSD Disks (LA Only)\r\n\r\n— Full root access and VNC console access\r\n\r\n— Located in Auckland, New Zealand and Los Angeles, United States\r\n\r\n— FREE monitoring on any ports required, Email alerts sent instantly to your nominated address's - Open ticket to get this configured.\r\n\r\n— Additional IP addresses are available for your server for only $5NZD per IP/per month!\r\n\r\nLimited numbers on our new LA servers are available, please check numbers available on our LA VPS Page. These numbers are to ensure our nodes don't get oversold\r\nBe one of the first few on our brand new nodes!\r\n\r\nDisk space 4GB SSD \r\n\r\nbandwidth/month 300GB \r\n\r\nGuaranteed RAM 512MB \r\n\r\nBurst 512MB \r\n\r\nExtra 128mb memory will be added FREE for any services ordered using this special!\r\n\r\nPlease use the link below to get this special as it is not advertised anywhere else.\r\n\r\nPrice: $5USD\r\n\r\nhttp://www.webtastix.net/?page=purchase&amp;type=vps&amp;iid=32&amp;currency=USD&amp;unique=r34sdf\r\n\r\n\r\n\r\nPlease use the following for ping tests and running trace-routes: \r\n\r\nNZ: 202.89.49.65 or 2401:5c00:3f00:200::10\r\n\r\nLA: 64.185.229.162\r\n\r\nWe strive to exceed expectations in our speed, reliability and customer service.\r\n\r\nFor more information or to contact us please visit http://www.webtastix.net/?page=vps&amp;lid=2"}