{"id": 36471, "date": "2014-10-24 21:02:49", "user": "jar", "post": "(Offer for non VPS product pre-approved by @mpkossen)\r\n\r\nHi everyone! You may or may not have heard of MXroute around these parts. MXroute is a \"bring your own domain\" e-mail host, much like Google Apps without the additional products. The e-mail hosting is the key. Our control panel is a heavily modified version of VestaCP coupled with WHMCS for our billing system. The system operates much like a web hosting product without the web hosting. However, there is more to it than that. Strong, consistent, effective mail delivery is our #1 priority. A phrase often thrown around in this industry is \"Do one thing and do it well.\" That is our goal, but we like to add one more thing to that:\r\n\r\nDo one thing, do it well, and make it affordable.\r\n\r\n&lt;h2&gt;&lt;b&gt;About MXroute:&lt;/b&gt;&lt;/h2&gt;\r\n\r\nTo be clear, I throw around the word \"we\" and \"our\" quite a bit. MXroute is somewhat like a one man show, only it has a backup plan. The MXroute team consists of me, @ryanarp, and Christine. Mostly, you will deal with me. I develop, I maintain, and I troubleshoot. When I cannot be available and there is a major problem, there is always someone with the access and the necessary knowledge available to solve the problem.\r\n\r\nAll too often I see people here struggling with the concept of hosting their own e-mail effectively. LowEnd{Box,Talk} was mostly built on the idea of running your own web server for far less than what was considered normal, both in dollars and resources. The \"normal\" services always included e-mail, but that was never a big focus here. I always encourage people to learn, and I love it when one of my clients outgrows my services and learns to host their own. Empowering others is important, and I love it when people learn how to stand on their own two feet. Until then, why not let me take the burden from you? I can host your e-mail at a fraction of the price that you will pay to any other reliable service, and I guarantee that it comes with a side of humility, and that I will always be open to your ideas and suggestions.\r\n\r\n&lt;h2&gt;&lt;b&gt;Announcement&lt;/b&gt;&lt;/h2&gt;\r\n\r\nI would like to announce that MXroute unbranded reseller services are being provisioned with Delimiter in Atlanta. The service provided by Delimiter has been nothing short of incredible, and they have been extremely friendly and accomodating. I like to support quality providers when I get the opportunity, and I know you guys do as well. I am really proud to provide production service supported by these guys, and you should be too.\r\n\r\n&lt;h2&gt;&lt;b&gt;Features&lt;/b&gt;&lt;/h2&gt;\r\n\r\n- SSL protected IMAP, POP3, SMTP&lt;br&gt;\r\n- Roundcube Webmail&lt;br&gt;\r\n- Mail Control Panel based on VestaCP&lt;br&gt;\r\n- Z-Push for ActiveSync compatible push services (imperfect, but functional)&lt;br&gt;\r\n- Friendly service&lt;br&gt;\r\n- Direct access to the developer to make suggestions\r\n\r\n&lt;h2&gt;&lt;b&gt;Offers&lt;/b&gt;&lt;/h2&gt;\r\n\r\nLet's get down to the offers, shall we?\r\n\r\nI've got two promo codes for you today. The first one only has 5 uses, so grab it fast. I'm not big on offering discounts, but I am big on honoring them.\r\n\r\nMX15 - 15% off recurring for life. This will work for 5 orders.&lt;br&gt;\r\nMX10 - 10% off recurring for life. Unlimited orders, unlimited clients.\r\n\r\nThe monthly plans have an \"unbranded\" option where you will be provisioned on \"mxlogin.com\" which has no obvious connection with any particular branding.\r\n\r\nYearly Plans:\r\n\r\nSmall&lt;br&gt;\r\n10GB Storage&lt;br&gt;\r\n1 Domain&lt;br&gt;\r\n1 Email Account&lt;br&gt;\r\n$5/year&lt;br&gt;\r\nOrder: https://billing.mxroute.com/cart.php?a=add&amp;pid=5\r\n\r\nMedium&lt;br&gt;\r\n15GB Storage&lt;br&gt;\r\n3 Domains&lt;br&gt;\r\n10 Email Accounts per domain&lt;br&gt;\r\n$15/year&lt;br&gt;\r\nOrder: https://billing.mxroute.com/cart.php?a=add&amp;pid=6\r\n\r\nLarge&lt;br&gt;\r\n50GB Storage&lt;br&gt;\r\n10 Domains&lt;br&gt;\r\n30 Email Accounts per domain&lt;br&gt;\r\n$25/year&lt;br&gt;\r\nOrder: https://billing.mxroute.com/cart.php?a=add&amp;pid=3\r\n\r\nMonthly Plans:\r\n\r\nMX350&lt;br&gt;\r\n20GB Storage&lt;br&gt;\r\nUnlimited Domains&lt;br&gt;\r\nUnlimited Accounts&lt;br&gt;\r\n$3.50/m&lt;br&gt;\r\nhttps://billing.mxroute.com/cart.php?a=add&amp;pid=10&lt;br&gt;\r\nUnbranded: https://billing.mxroute.com/cart.php?a=add&amp;pid=15\r\n\r\nMX500&lt;br&gt;\r\n40GB Storage&lt;br&gt;\r\nUnlimited Domains&lt;br&gt;\r\nUnlimited Accounts&lt;br&gt;\r\n$5.00/m&lt;br&gt;\r\nhttps://billing.mxroute.com/cart.php?a=add&amp;pid=11&lt;br&gt;\r\nUnbranded: https://billing.mxroute.com/cart.php?a=add&amp;pid=16\r\n\r\nMX700&lt;br&gt;\r\n75GB Storage&lt;br&gt;\r\nUnlimited Domains&lt;br&gt;\r\nUnlimited Accounts&lt;br&gt;\r\n$7.00/m&lt;br&gt;\r\nhttps://billing.mxroute.com/cart.php?a=add&amp;pid=12&lt;br&gt;\r\nUnbranded: https://billing.mxroute.com/cart.php?a=add&amp;pid=17\r\n"}