{"id": 3779, "date": "2012-07-18 15:54:17", "user": "Breezehost", "post": "**Breezehost.net** is pleased to present our newest promotion, we have special offer with VPS servers located in US Dallas and Netherlands Limited stock so be sure to act fast This will not last long\r\n\r\nSpecials Offer below are available in our USA Dallas, Netherlands facilities. You may choose your desired location in the order form. Instant setup.We guarantee 30 minute response times via ticket and Live Chat support, you will no longer have to wait for Support as we are here 24x7.\r\n\r\n**\"A Class\" Support**\r\n\r\nOur support team is lightning speed to help you at all times if you have a managed service. Our team is fully trained with years of experience to help you along your way to building your perfect website. We have specialized personnel to offer our customers reliable support and service throughout your hosting experience. Enjoy the maximum support to help you site exceed your expectations.\r\n\r\n**Special Offer Is** you will get on ClixDev-1,2 500GB Bandwidth,30GB Disk Space for ClixDev-1 and for ClixDev-2 50GB Disk Space + 1 GB Dedicated RAM + 50%OFF for one Month.Once you will pleaced order, we will upgrade your account.\r\n\r\nPlease use the Promotion Code: **LET50%OFF**\r\n\r\n**BreezeHost's VPS Plans include...**\r\n\r\n• Equal CPU Share\r\n• SolusVM Control Panel\r\n• OpenVZ Technology\r\n• FULL Root Access\r\n• TUN/TAP Enabled by default\r\n• Multiple Linux OS Choices\r\n• Free Website Transfer\r\n• Instant Setup\r\n• 100 mbps Port Speed\r\n\r\n\r\n★**ClixDev-1** $5.95 50% you pay $2.98 \r\n\r\n★10GB Space **Note: After placed order we will increase your Disk Space**\r\n★250 GB Bandwidth **Note: After placed order we will increase your B/W**\r\n★256 MB Guaranteed RAM **Note :After placed order we will increase your RAM to 1GB**\r\n★2 GB Burst RAM\r\n★Linux OS (Centos,Debian,Fedora,Ubuntu,Suse)\r\n★SolusVM\r\n★Root Access\r\n★24x7 Live Support\r\n★Free Setup\r\n★Server Location: Dallas,USA,Amsterdam,Netherlands\r\n\r\n*************************************\r\n★**ClixDev-2** $7.95 50% you pay $3.98 \r\n\r\n★15GB Space **Note: After placed order we will increase your Disk Space**\r\n★350 GB Bandwidth **Note:  After placed order we will increase your B/W**\r\n★1 GB Guaranteed RAM Note: **After placed order we will increase your RAM to 1GB**\r\n★2GB Burst RAM\r\n★Linux OS (Centos,Debian,Fedora,Ubuntu,Suse)\r\n★SolusVM\r\n★Root Access\r\n★24x7 Live Support\r\n★Free Setup\r\n★Server Location: Dallas,USA,Amsterdam,Netherlands\r\n**************************************\r\n\r\n**Features:**\r\n\r\nBreezehost.net we have put in place unique systems and structures that allow us to give you high quality VPS hosting without the high price.\r\n\r\nWhen you sign up for our VPS hosting, we are very proud to offer you the following exciting services:\r\n\r\n• Stable And Reliable Servers Using Newest Technology\r\n\r\n• SolusVM VPS Control Panel In the event you need to reinstall, restart, or console your VPS you may do so at your convenience in the SolusVM VPS Control Panel.\r\n\r\n• 100.100% Uptime Guarantee ( Our servers are always on, everyday, all day, guaranteed.\r\n\r\n• Instant Setup after payment confirmation\r\n\r\n• No Contracts In the very rare instance that you would want to host elsewhere you can cancel your account at any time.\r\n\r\n• RAID Protected Storage Our servers RAID hard drive technology. This technology enables your sites to be stored on two hard drives at the same time. Should one fail, the other hard drive will continue to serve your sites/applications, and there will zero down time just like nothing even happened.\r\n\r\nBreezehost's Download test file :\r\n\r\n**USA Location:**\r\n\r\nDallas\r\n\r\nPing/Traceroute Test IP: 64.31.58.151\r\n\r\nTest File: http://64.31.58.151/100mb.bin\r\n\r\n**Netherland Location:**\r\n\r\nPing/Traceroute Test IP: 94.102.49.94\r\n\r\nTest File: http://94.102.49.94/100mb.bin\r\n\r\nContact US:\r\n\r\nEmail Sales: sales@breezehost.net\r\nContact us via Live Chat: http://breezehost.net/livezilla/chat.php"}