{"id": 38183, "date": "2014-11-27 23:20:12", "user": "SNetworks1", "post": "Hello Everyone,\r\n\r\nBecause its the time of year where every retailer is launching the mad discounts we decided that we would join this trend. So, here are our Black Friday discounts that we hope will grab your attention! These offers will only be available for a very limited amount of time, so do get them while they are hot!\r\n\r\nWe will be launching in a range of fazes and currently only our VPS plans are currently live, including £24 GBP per year for a 512MB VPS. Along with a great offer for a 4 and 8GB VPS. Take a look for yourself, and if you have any questions we would really love to get some feedback on what you think: https://www.superior-networks.com/blackfriday.php\r\n\r\nWe have also recently invested in some better processing power, and you can find out more on our blog page about that, however we do have plenty of space left for all your hosting needs.\r\n\r\nAll of our servers come with the root machine guaranteed 250MBps with the ability to burst to 1GBps. We have included a LookingGlass link at the bottom of the post for you to see some more realistic speeds to your current connection and to ping other servers you may have. The plans listed here are specific to LowEndTalk and wont be seen anywhere else by us, we do also offer \"Build Your Own\" plans where you can custom build your server to the exact specifications you require, and if you cant find your exact match there we can organize it for you.\r\n\r\nPayPal is our payment gateway of choice however should you wish to pay by Bank Transfer or Cheque we can arrange that for you. You just will need to open a support ticket with our accounting team who will direct you where to go!\r\n\r\nFor those wishing to test our servers we have the IP superior-networks.com. If you wish to download some test files or run some ping tests we have a looking glass that you can use at https://www.superior-networks.com/lg/ and is available for our French Location.\r\n\r\nIf you have any questions / comments please do feel free to make a comment here, drop me a PM or open a ticket on our website: www.superior-networks.com\r\n\r\nHave a great day,\r\n\r\nRyan"}