{"id": 3841, "date": "2012-07-22 06:39:09", "user": "Nick_A", "post": "[RamNode](http://www.ramnode.com \"**RamNode**\") - High RAM, Low Price - Unmanaged OpenVZ VPSs on RAID10 SSDs\r\n\r\n\r\n**GET 15% OFF LIFETIME!**\r\nUSE CODE **RN15OFF**\r\n\r\n**About Us**\r\n\r\nRamNode exists for one purpose: to provide affordable VPSs with powerful features. Our years of hosting experience as both clients and providers have inspired us to offer the kind of hosting that clients want at the kind of prices clients want to pay. Though our prices are low, we never sacrifice quality or performance. We know that our best assets are our loyal customers, so we strive to provide hosting they will rave about to their fellow internet users. Our VPSs are perfect for a wide range of applications. With our top quality hardware, we can guarantee that our clients will get the most bang for their buck. \r\n\r\nOur SuperMicro enterprise grade servers are stocked with Intel 320 and Samsung 830 SSDs in lightning fast RAID10 arrays. Our servers provide incredible I/O as well as the safety of drive redundancy. We use powerful Intel Sandy Bridge and Ivy Bridge E3 Quad Core processors on our VPS nodes. These CPUs run at a minimum 3.2GHz per core. CPU is allocated on a fair share basis per VPS, only limited by the number of cores in each plan.\r\n\r\nCurrently, our VPSs are hosted in Dallas, TX. Atlanta, GA offerings should be available in a few weeks.\r\n\r\n=====================================\r\n\r\n**VPS Features**\r\n\r\nIn addition to our great hardware, each VPS comes with the following features:\r\n\r\n**SolusVM control panel**\r\n**1Gbps fair share port speed**\r\n**INSTANT setup**\r\n**Daily remote backups**\r\n**TUN/TAP**\r\n**FUSE**\r\n\r\n=====================================\r\n\r\n**VPS Plans**\r\n\r\nWe have several predefined plans, and we offer custom packages upon request.\r\n\r\n**256MB VPS**\r\n\r\nRAM: 256MB\r\nVSwap: 256MB\r\nCores: 1\r\n4GB RAID10 SSD \r\n500GB Bandwidth\r\n\r\n**Price**: -$12.00/qtr- **$10.20/qtr** |  [Order Now](https://clientarea.ramnode.com/cart.php?gid=1 \"Order Now\")\r\n\r\n**512MB VPS**\r\n\r\nRAM: 512MB\r\nVSwap: 512MB\r\nCores: 2\r\n6GB RAID10 SSD \r\n1000GB Bandwidth\r\n\r\n**Price**: -$6.00/mo- **$5.10/mo** |  [Order Now](https://clientarea.ramnode.com/cart.php?gid=1 \"Order Now\")\r\n\r\n=====================================\r\n\r\n**FAQs**\r\n\r\n**How long does VPS setup take?**\r\nYour VPS will be setup **INSTANTLY** upon receipt of payment (unless we happen to be out of stock). Please note the related section of our AUP regarding Account Verification.\r\n\r\n**How can I pay?**\r\nWe accept PayPal and Google Wallet.\r\n\r\n**How long have you been in business?**\r\nRamNode was founded in June 2012. We have been hosting in other professional capacities since 2006.\r\n\r\n**What's the best way to get help when I need it?**\r\nOur VPSs are unmanaged, but you can open a ticket for acceptable support requests. We are also available on Live Chat, Skype, and IRC. \r\n\r\n**What kind of hardware do you use?**\r\nIntel Sandy and Ivy Bridge E3-1230s (or better). All of our nodes boast RAID10 Intel 320 or Samsung 830 SSDs and DDR3 RAM.\r\n\r\n**How fast is your connection?**\r\nOur VPS nodes are connected to the internet at 1Gbps. Your VPS can use all of that speed on a fair share basis.\r\n\r\n**Do you have any speed tests?**\r\nTest IP - 23.29.117.134\r\n100MB download - ramnode.com/100MB.test\r\n\r\n**Do you have any performance tests?**\r\n\r\n1.  VPSeer.com SSD VPS Performance Test:\r\nUnixBench - 2461.5\r\nDD - 519\r\nIOPS Read - 97243\r\nIOPS Write - 69000\r\n\r\n2.  http://www.webhostingtalk.com/showthread.php?t=1164233 (Intel 320 Node)\r\n\r\n3.  http://www.lowendtalk.com/discussion/3531/ramnode-e3-1230v2s-and-samsung-830s-ssd-benchmark\r\n(Samsung 830 Node)\r\n\r\n4.  http://www.webhostingtalk.com/showthread.php?t=1170574\r\n\r\n**What operating systems are available?**\r\nWe offer a variety of Linux 32 and 64-bit OS templates.\r\n\r\n**What kind of virtualization do you use?**\r\nOur VPSs run on the OpenVZ virtualization platform.\r\n\r\n**What control panel comes with your VPSs?**\r\nOur VPSs come with the SolusVM control panel.\r\n\r\n**Do you provide remote backups?**\r\nYes, we take remote backups of each VPS image on a daily basis. We keep two backups (48 hours worth) in rotation. You can request a VPS restore through a support ticket.\r\n\r\n=====================================\r\n\r\n**Other Info**\r\n\r\n**Affiliate System**\r\nSign up for our affiliate system and you can earn a credit for your account of 8% from each invoice of new clients you refer to us.\r\n\r\n**Reseller**\r\nReseller accounts come with the SolusVM Reseller Panel. Please contact us if you are interested in reselling our VPSs under your own brand.\r\n\r\n=====================================\r\n\r\n**Contact Us**\r\n\r\nThere are a variety of ways you can contact us:\r\n**Sales**: sales[at]ramnode.com\r\n**Support**: support[at]ramnode.com\r\n**Billing**: billing[at]ramnode.com\r\n**Skype**: RamNode\r\n**Twitter**: [RamNode](http://twitter.com/ramnode \"RamNode\")\r\n**Facebook**: [RamNode](http://facebook.com/ramnode \"RamNode\")\r\n**IRC**: #ramnode on irc.esper.net\r\n\r\nYou can also catch us on Live Chat or open up a ticket from the [Client Area](https://clientarea.ramnode.com \"Client Area\")."}