{"id": 38937, "date": "2014-12-11 10:31:00", "user": "Jonchun", "post": "[![](http://www.sharknode.com/images/logo.png)](http://www.sharknode.com)\r\n\r\nHello everyone at LET!  \r\nThis is Jonathan from SharkNode and I'm here to announce the launch of our new Xen VPS line in Dallas, TX. We have multiple servers from Incero and are looking to fill the lack of Xen-based VPS providers around here!  \r\n\r\n**About Us:**  \r\nLet's face it. SharkNode is a smaller provider. We don't have massive funds to provide you with instantaneous 24/7 Live Support. We don't have thousands of dollars to spend on affiliate marketing. We don't have hundreds of servers and millions of customers. However, what we do have is quality. Our philosophy is that quality is always better than quantity. We don't care how many clients we have, each and every one will receive personal support from our team, and if that means hiring another employee simply to ensure each customer has an assigned representative, that's exactly what will happen. \r\n\r\nSharkNode was founded with only quality in mind. It was started in 2013 as a private business based in Malibu that created websites for personal clients and hosted them on a reseller account. However, we feel that it's time to grow and reach out to public markets. We have moved on from reselling and now lease our own top-notch dedicated hardware. We have recently added a VPS line as well, and we are ready to serve you.\r\n\r\n**Our Features:**\r\n\r\n   * No Overselling. Period. We carefully calculated all the available RAM and disk space in order to provision all clients WITHOUT overselling.\r\n   * Quality Support. You don't like BS and neither do we. You don't get the 24/7 instant response times you might expect from a large provider, but you can be sure you will get a REAL answer within a reasonable timeframe.\r\n   * Instant Provisioning. With rare exceptions, your server will be instantly created and details will be emailed to you after payment.\r\n   * SolusVM. Use the powerful and tested panel to manage your VPS. \r\n   * Terms of Service : Please refer to [Incero's ToS](http://incero.com/terms-of-service) for details of our AUP/ToS while we update ours to reflect our new Xen offerings. Incero's ToS only applies to our Xen offerings. If you have any doubts about whether your VPS use will be acceptable or not, please submit a ticket and contact us. That will be the best way to ensure that both parties are satisfied. **SPAM IS ABSOLUTELY NOT TOLERATED. ANY VPS FOUND SENDING SPAM (yes, it's monitored) WILL BE IMMEDIATELY SUSPENDED AND CLIENT INFORMATION WILL BE REPORTED TO PROPER CHANNELS**\r\n\r\n----------\r\n\r\nUse the coupon **LOWENDTALK50** and receive a 50% LIFETIME recurring discount on your Xen virtual server! Please note that there are a very limited number of these coupons available, so it is first-come, first-serve. There is no limit to how many of the coupons you can use per customer. Please note that this coupon only works for a limited time, and only for our new XEN vps line.\r\n\r\nIf you're already sold, visit [our website](http://www.sharknode.com/vps) to order now!\r\n\r\n----------\r\n\r\n**Our Plans:**\r\nUnfortunately, in order to provide a quality hosting experience, most of our plan pricing is much outside the limit of LET's rules. However, with our current 50% coupon promotion, our 512 RAM XEN plans fit the bill.\r\n\r\nAll our VPS are rate-limited at 100mbps. If you need this raised for a legitimate reason, please contact support for a quote.\r\n\r\n&gt; **Xen HDD**  \r\n&gt; 1 core  \r\n&gt; 512 MB RAM  \r\n&gt; 128 MB RAM  \r\n&gt; 25 GB Storage  \r\n&gt; 500 GB Monthly Bandwidth  \r\n&gt; 1 IPv4 IP Address  \r\n&gt; $4.99/month  \r\n\r\n[Order Now](https://clientarea.sharknode.com/cart.php?a=add&amp;pid=98)\r\n\r\n&gt; **Xen SSD-Standard**  \r\n&gt; 1 core  \r\n&gt; 512 MB RAM  \r\n&gt; 128 MB RAM  \r\n&gt; 6 GB Storage  \r\n&gt; 500 GB Monthly Bandwidth  \r\n&gt; 1 IPv4 IP Address  \r\n&gt; $4.99/month\r\n\r\n[Order Now](https://clientarea.sharknode.com/cart.php?a=add&amp;pid=104)\r\n\r\nIf you don't believe the above plans will fit the bill, you can click [here](http://www.sharknode.com/vps) to view the rest of our VPS plans. Please note that although the plans are not listed here due to pricing restraints, the coupon code **LOWENDTALK50** applies to ALL of our Xen line offerings!\r\n\r\n----------\r\n\r\n**Payment:**  \r\nWe currently only accept Paypal. Please contact us if you have any special needs regarding payments.\r\n\r\n**Network:**  \r\nOur new Xen lines are hosted on Incero's amazing network. Please [click here](http://incero.com/network) to view more details of their network!\r\n\r\n**Contact:**  \r\n- Website: [http://www.sharknode.com](http://www.sharknode.com)  \r\n- Please contact sales@sharknode.com or jonathan@sharknode.com [my personal email] if you have any questions.  \r\n- Live chat is often available, but not guaranteed."}