{"id": 3909, "date": "2012-07-25 15:13:23", "user": "Damian", "post": "This offer is our way of saying \"thank you!\" to the LET community for supporting us during our difficult time earlier this month (the entire event is described in detail in http://www.lowendtalk.com/discussion/3473/ipxcore ). \r\n\r\n++++++++++++++++++++++++++++++++\r\n\r\nAdam and I have been doing Internet services since 2003 as Digital Design Core. We moved into the VPS market in May of 2011 as IPXcore. We started this because we were on a BurstNET node that kept getting oversold, and we were unable to get any form of support. We decided that we could do better.\r\n\r\nWe have recently added Harley and Will to our support staff, bringing our total up to 5.\r\n\r\nDue to complications with our prior datacenter, we have moved *all* of our equipment to Buffalo, NY, in Colocrossing's datacenter there. Colocrossing Buffalo is currently using Level 3 exclusively, with other providers being laid down right now.\r\n\r\nWe're running OpenVZ virtualization on our very own Dell, HP, and Supermicro Opteron-powered hardware.\r\n\r\nAll server nodes have 100mbit connection, sharing a 1gbit uplink.\r\n\r\nThis months' support ticket response time median: 0 Day(s) 0 Hour(s) 42 Minute(s) and 53 Second(s)\r\n\r\nTHIS OFFER IS AVAILABLE FOR ONE WEEK ONLY!\r\n\r\nThe Offer:\r\n\r\n**_256mb-LEBSpecial:_**\r\n256mb RAM\r\n320mb burst (64mb vSwap available instead, upon request)\r\n10gb disk space\r\n300gb monthly transfer\r\n4 CPU cores (up to 12 available upon request, with justification)\r\n\r\n$1.75 per month.\r\n\r\n**THIS OFFER IS AVAILABLE FOR ONE WEEK ONLY!**\r\nSign up here: https://ipxcore.com/order/cart.php?a=add&amp;pid=51\r\n**THIS OFFER IS AVAILABLE FOR ONE WEEK ONLY!**\r\n\r\nAll of our other usual plans are available with discount code NEWDATACENTER for recurring 10% off!\r\n\r\nFYI: As outlined in the AUP/TOS, all new registrations MUST be made with verifiable postal address information. Repeating your province/state in the address fields will cause your account to be suspended til you update your account information.\r\n\r\nTest IP: 198.144.190.10\r\n\r\nAdditional IPv4 addresses available for $1.50 per month apiece.\r\nSpecial:16 IPv4 addresses for $20 per month\r\nWe're working on IPv6.\r\n\r\nNeed ram/disk space/bandwidth? We'll work with you; contact us with your requirements.-\r\n\r\nWe also do custom plans. Please contact us with your requirements.\r\n\r\n&lt;a href=\"http://ipxcore.com/china/\"&gt;去浏览我们网站上独立服务器的产品页面&lt;/a&gt;"}