{"id": 39177, "date": "2014-12-15 23:44:24", "user": "SNetworks1", "post": "Hello Everyone,\r\n\r\nToday I wanted to bring you some festive offerings with the additional news that our Canadian servers are not far away now (Just securing IP addresses before they go live!)\r\n\r\nUnlike most of my previous deals I am not able to bring you anything LET specific, but I can give you a sneak peek as to what our two newly available plans for Canada only will be. \r\n\r\n**256MB Plan:**\r\n\r\n256MB Ram&lt;br&gt;\r\n50GB Disk Space&lt;br&gt;\r\n1 IPV4&lt;br&gt;\r\nUnlimited Bandwidth Allowance&lt;br&gt;\r\n\r\n£1.50 per month\r\n\r\n\r\n**512MB Plan:**\r\n\r\n512MB Ram&lt;br&gt;\r\n80GB Disk Space&lt;br&gt;\r\n1 IPV4&lt;br&gt;\r\nUnlimited Bandwidth Allowance&lt;br&gt;\r\n\r\n£3.00 per month\r\n\r\n\r\nThese plans will also be running on some slightly different hardware and a network that is double the speed of what our French location currently provides. As our Canadian server is not fully ready to deploy right now we do not have buying links for these plans, however they will be added to our website ( https://www.superior-networks.com/vps.php ) as soon as we can offer them to you. \r\n\r\nFor all LowEndTalk visitors we are offering you 35% off for life this holiday time using the code MerryLET. Just enter that at the checkout and it will apply to VPS's, Web hosting (Shared and reseller) along with VPN's. We have some more general existing offers (Can not be used in conjunction with this offer) that you can see here: https://www.superior-networks.com/blog.php?id=20\r\n\r\nThese two plans are coming soon, we do also offer a range of existing plans (Can be seen on our website) but we do also offer \"Build Your Own\" plans where you can custom build your server to the exact specifications you require, and if you cant find your exact match there we can organize it for you.\r\n\r\nWe have decided that for now PayPal will be our main payment gateway though we are currently looking into some other options to allow greater flexibility. \r\n\r\nFor those wishing to test our servers we have the IP superior-networks.com. If you wish to download some test files or run some ping tests we have a looking glass that you can use at https://www.superior-networks.com/lg/ and is available for our French Location and we will be adding a Canadian based looking class very soon.\r\n\r\nIf you have any questions or comments I would be happy to help where I can and I do always appreciate feedback if I have missed anything from my post!\r\n\r\n\r\nHave a great day,\r\n\r\nRyan"}