{"id": 3999, "date": "2012-07-30 20:38:40", "user": "imagine", "post": "`....##....#######...#######...######...#######..##.....##\r\n..####...##.....##.##.....##.##....##.##.....##.###...###\r\n....##..........##........##.##.......##.....##.####.####\r\n....##....#######...#######..##.......##.....##.##.###.##\r\n....##...##...............##.##.......##.....##.##.....##\r\n....##...##........##.....##.##....##.##.....##.##.....##\r\n..######.#########..#######...######...#######..##.....## `\r\n\r\n★ OpenVZ Virtual Servers ★ Special Offer - Discounted recurring (Los Angeles only) ★\r\n\r\n**Who are we?**\r\nWe are a UK based company, operating in the hosting industry for the last 6 years. Having opened our initial UK cPanel hosting services in 2007, we have built up a loyal customer base which enables us to provide amazing levels of service at affordable prices.\r\n\r\n123COM, LP is a Limited Partnership, made up of a managerial team who not only have a passion for our company, but a passion for what they do. Each of them loves nothing more than to see 123COM develop every day.\r\nOur clients experience support 24 hours a day, 7 days a week, regardless of seasonal holidays. Telephone support is available within business hours - and we pride ourselves on always being there for you.\r\n\r\nHosting is an ever-developing industry - and our aim is to always offer you the latest technology at the best possible rates.\r\n\r\n**Contact Us.**\r\nWebsite: &lt;a href=\"http://123com.org/\"&gt;www.123com.org&lt;/a&gt;\r\nEmail: &lt;a href=\"mailto:sales@123com.org\"&gt;sales@123com.org&lt;/a&gt;\r\nTelephone: +44 (0) 844 686 9852 (Monday - Friday, 9AM - 5PM GMT)\r\n\r\n**Where are we going.**\r\nWe are going through a lot of exciting changes here at 123COM - our new and improved network infrastructure and use of the Intel Xeon E31320v2 CPU's in all new hardware.\r\n\r\nWe also have a huge re-branding exercise coming along, to help us expand as a company; now is the time to snap up some of our amazing offers, before we renew all the plans!\r\n\r\n**Our Clients.**\r\nIt is important to stress that these are unmanaged services, and therefore we will not perform any administration of your virtual server. Hands-on time is available however. Our role is to maintain VPS performance and keep our network online - while our staff will often go above and beyond to assist, these packages are best suited to knowledgeable server administrators.\r\n\r\n**The legal stuff.**\r\nOur full and detailed Legal Documentation is available online at http://123com.org/legal - however, a summary of network limits is below:\r\n\r\n* IRC / IRCd is not permitted on our networks at this time;\r\n* Denial of Service or similar attacks will result in total service termination, as well as correct legal action being followed with your local Cybercrime enforcement;\r\n* If it's illegal in the UK, and the location of the server, it's not allowed;\r\n* Adult Content is permitted, but there is an application form to ensure local legal compliance;\r\n\r\n**Our Virtual Servers.**\r\nWe always try to utilize the best equipment for each individual product - which is also limited by what hardware is available at each of our locations.\r\n\r\nTest IP: 199.231.214.52\r\nTest File: http://199.231.214.52/100mb.bin (100MB)\r\n\r\n**The OpenVZ plans.** &lt;a href=\"http://123com.org/vps/openvz\"&gt;» VIEW PLAN COMPARISON PAGE «&lt;/a&gt;\r\nAll packages come with a range of Operating System templates - which you can see on the plan comparison page above - as well as the SolusVM control panel to manage your services.\r\n\r\nIf the plans fail to meet your needs, for instance HDD, or bandwidth, we will happily customize the offer if you email us on the address above.\r\n\r\n\r\n&gt; ★ OVZ256 ★\r\n ▪ 256MB of Dedicated RAM / 512MB vSWAP\r\n ▪ 50GB of RAID10 Protected HDD\r\n ▪ Unmetered! Bandwidth\r\nFor only $4 recurring &lt;a href=\"http://secure.123com.org/cart.php?a=add&amp;pid=27\"&gt;» ORDER NOW&lt;/a&gt;\r\n_COUPON: OLYMPIC1LET_\r\n\r\n&gt;  ★ OVZ512 ★\r\n ▪ 512MB of Dedicated RAM / 1024MB vSWAP\r\n ▪ 75GB of RAID10 Protected HDD\r\n ▪ Unmetered! Bandwidth\r\nFor only $7 recurring &lt;a href=\"http://secure.123com.org/cart.php?a=add&amp;pid=33\"&gt;» ORDER NOW&lt;/a&gt;\r\n_COUPON: OLYMPIC2LET_\r\n\r\nDo feel free to ask any questions, and if there is something you're looking for which we don't cover in the plans on our site - we will happily customize a solution for you.\r\n\r\nAs always, have a great day.\r\n\r\nYours,\r\nLeyton @ 123COM\r\n"}