{"id": 40363, "date": "2015-01-07 15:33:13", "user": "OpticServers", "post": "[![](https://opticservers.com/img/logo.png)](https://opticservers.com/)\r\n\r\n**Our Goal**\r\n\r\n\r\nHere at OpticServers, our aim is to provide you, the customer with a high quality virtual private server, useful for anything from websites, to testing development projects. With our 24/7 support on hand in the case of a hardware fault, uptime is a top priority. As a UK host, we provide incredible value for incredibly powerful machines, with a network to match.\r\n\r\n\r\n**Why Choose Us**\r\n\r\n\r\nAuto Setup\r\n\r\nAll Orders that have been Verified by our Automatic Fraud System will be Deployed with in 45 Seconds.\r\n\r\n\r\nDDoS Mitigation\r\n\r\nOur Network is DDoS Protected by our Arbor DDoS Mitigation Hardware up to 40Gbps.\r\n\r\n\r\nOur Network \r\n\r\nWe Utilize our own Managed Network to Guarantee the Network Uptime and Quality.\r\n\r\n\r\nLow Cost\r\n\r\nWe Provide Virtual Private Server Hosting at a Low Cost but still with the Quality.\r\n\r\n\r\nBackup System\r\n\r\nWe have our own UPS Backup System so if there were to be a power cut, you would still stay online.\r\n\r\n\r\nDedicated Support Team\r\n\r\nWe believe that Support is top priority, that is why we have our own Dedicated 24/7 Support Team.\r\n\r\n\r\n**Our Plans**\r\n\r\n\r\nHere at OpticServers we do not have set plans we like to allow the customer to fully tailor there VPS to exactly the specifications required.\r\n\r\n\r\n**Our Datacenter**\r\n\r\n\r\nLocation: United Kingdom, London, Redhill (48 Ormside Way, Redhill, Surrey, RH1 2LW)\r\nName: OpticServers LTD\r\n\r\n\r\nDefault 256MB Plan:\r\nRAM: 256MB\r\nCPU: 2 Cores (Fair Share)\r\nSSD: 10GB\r\nIPv4: 1\r\nDDoS Mitigation: 40Gbps\r\nBandwidth: Unmetered\r\nPrice: £2 ($3.02)\r\n\r\nDefault 512MB Plan:\r\nRAM: 512MB\r\nCPU: 2 Cores (Fair Share)\r\nSSD: 10GB\r\nIPv4: 1\r\nDDoS Mitigation: 40Gbps\r\nBandwidth: Unmetered\r\nPrice: £4 ($6.03)\r\n\r\nUse Promotional Code \"Opening2014\" for 15% off first month!\r\n\r\nhttps://opticservers.com/vps"}