{"id": 4055, "date": "2012-08-02 13:10:23", "user": "mistert", "post": "Dear users of LET,\r\n\r\nat first...sorry and note...our website is only available in german atm...but google translator may help your in most points... :-)\r\n\r\nSo you´re looking for a perfect fitting vps...because f.e. you don´t need 100GB storage, 4GB RAM or something else...\r\n\r\nMost vendors can´t satisfy your requirements because they only have few, limited products - no sign of flexibility!\r\n\r\nWe have provided an almost unique service for this...now available abroad:\r\n\r\ncustomizable VPS!\r\n\r\nThe whole thing already from 3,79 EUR (4,77USD) per month, 1 month duration of contract and no setup costs!\r\n\r\nFrom 128MB RAM to 128GB*, 1 CPU core up to 32 * ... You can manage and customize your own VPS, to your exact needs!\r\n\r\nSo you pay us only what you really need!\r\n\r\nThe following basic features are always included:\r\n\r\n* hardware virtualization via KVM (no pseudo-virtualization via openVZ etc.)\r\n* High-performance and extremely redundant server hardware by Thomas Krenn.AG with at least 128GB of RAM and AMD dual processors 16Core!\r\n* High-availability storage cluster system for storage management\r\n* 99.9% guaranteed availability of host systems!\r\n* Datacenter located in Frankfurt/Main\r\n* Complete flexibility in configuring your VM\r\n* Hardware parameters can be up- or downgraded\r\n* Web interface with a lot of functions like rescue, start / stop and re-install, rDNS etc\r\n* accurate traffic accounting for your VPS (ideal for resellers!)\r\n* TUN / TAP devices possible for PPTP\r\n* 10GiB backup space free\r\n* Private VLANs / Back Nets possible\r\n* a lot of OS available from ArchLinux up to pfSense firewall, or Windows Server\r\n* Test-IP: 109.75.188.1\r\n\r\nJust have a look on our [individual vps configurator](http://www.de-punkt.de/vserver.html?pk_campaign=post-let-020812)\r\n\r\nWe are happy to assist you in designing an individual offer. If you have questions, please contact me via email sven@filoo.de.\r\nNote: payments possible via PayPal\r\n\r\n*on request\r\n"}