{"id": 40596, "date": "2015-01-10 17:38:08", "user": "frixelsolutions", "post": "**About Frixel Solutions**\r\n\r\nFrixel Solutions is a local provider of IT and website services. We also operate a high quality enterprise grade network in Rohnert Park, CA where we lease and manage our own facility, hardware, and network.\r\n\r\nWe have a commitment to providing high quality services with the most affordable prices. Our support is quick, our servers are fast and reliable, and we maintain off site backups of all customer files and databases.\r\n\r\nhttps://www.frixelsolutions.com/\r\n\r\n**About our Cloud Hosting**\r\n\r\nAlso known as Shared Hosting or Web Hosting, you'll get to manage your website with the latest version of the industry standard cPanel control panel. \r\n\r\nWe also include Softaculous for easy one-click installation and script updates at no charge. You can install WordPress, Joomla, and many other applications from the control panel.\r\n\r\nAll of our servers run the purpose-built CloudLinux operating system designed to resolve problems that have plagued shared servers. One compromised or malicious client won't be able to cause your site to run slowly, so your pages will always load quickly.\r\n\r\nhttps://www.frixelsolutions.com/cloudhosting.php\r\n\r\n**Limited Time Offer**\r\n\r\nCloud Hosting: 10GB Storage/100GB Monthly Transfer. Usually $4.99/month. Now just $6/year with promo code LET-CH-JANUARY1\r\n\r\nhttps://www.frixelsolutions.com/secure/cart.php?a=add&amp;pid=1\r\n\r\nCloud Hosting Plus: 20GB Storage/200GB Monthly Transfer. Usually $7.99/month. Now just $9/year with promo code LET-CH-JANUARY2\r\n\r\nhttps://www.frixelsolutions.com/secure/cart.php?a=add&amp;pid=23\r\n\r\nCloud Hosting Ultimate: 30GB Storage/300GB Monthly Transfer. Usually $10.99/month. Now just $12/year with promo code LET-CH-JANUARY3\r\n\r\nhttps://www.frixelsolutions.com/secure/cart.php?a=add&amp;pid=24\r\n\r\n**Win a Free Smartphone**\r\n\r\nWe have one more AT&amp;T Lumia leftover and will give it away to one lucky US customer who orders any of these plans with the above promo codes. This promotion will be active until January 31st, 2015 at which point we'll pick a winner for the phone! Full rules:\r\n\r\nWe'll randomly pick one fortunate customer and send a brand new in box Nokia Lumia 520 smartphone running Windows Phone 8. While it's in AT&amp;T GoPhone retail packaging it'll work just fine with normal AT&amp;T service. Please note that this is NOT an unlocked phone and as such will probably not work with any other provider.\r\n\r\nNow, while it's all fun and games, there are some rules that you'll need to follow if you want to enter to win the phone. Even if you don't win a smartphone you're getting the lowest price we've ever advertised on premium West Coast hosting complete with cPanel and Softaculous:\r\n\r\n-Customers must be in the United States that means no Canada or international.\r\n\r\n-One entry is per hosting plan purchased. There's no limit to how many hosting plans you can purchase however all orders using the giveaway discount code are non-refundable.\r\n\r\n-Must be a valid United States address that USPS can ship to. No PO Boxes, please!\r\n\r\n-Fraud orders or orders cancelled for suspicious details are not eligible for winning the phone.\r\n\r\n-Promotion only applies to new orders, not existing websites hosted with us!\r\n\r\n-Orders must be placed between midnight (Pacific Time) on 1/9/15 and midnight (PST) 1/31/15.\r\n\r\n-The winner customer will be notified via ticket and phone (yes, we need a valid phone number) early in Februrary. We won't ship your phone until you've confirmed your information via the support ticket we open in your account.\r\n\r\n-We won't provide any support for this phone - if you have problems please contact the manufacturer or you service provider. No returns, obviously!\r\n\r\nMore information about the phone:\r\n\r\nhttp://www.microsoft.com/en/mobile/phone/lumia520/\r\n\r\nhttp://www.gsmarena.com/nokia_lumia_520-5322.php\r\n\r\nhttp://www.techradar.com/reviews/phones/mobile-phones/nokia-lumia-520-1133192/review\r\n\r\nIf you've got any questions or concerns please feel free to contact us at sales@frixelsolutions.com and we'll respond shortly! Thank you for your business and here's to a new year filled with lots of visitors to your website hosted on Frixel Solutions!"}