{"id": 40683, "date": "2015-01-11 20:39:23", "user": "SNetworks1", "post": "Hello Everyone,\r\n\r\nIts been a while since I have posted any offers, so I wanted to introduce the new smaller plans that we have been able to now offer at our Canadian Location and also introduce you to some of our offers on yearly plans, with it being January and a great time to buy a VPS for your years projects.\r\n\r\n**256MB Plan:**\r\n\r\n256MB Ram&lt;br&gt;\r\n50GB Disk Space&lt;br&gt;\r\n1 IPV4&lt;br&gt;\r\nUnlimited Bandwidth Allowance&lt;br&gt;\r\n\r\n£18.00 per year \r\n\r\nBuy Here: https://www.superior-networks.com/billing/cart.php?a=add&amp;pid=45\r\n\r\n\r\n**512MB Plan:**\r\n\r\n512MB Ram&lt;br&gt;\r\n80GB Disk Space&lt;br&gt;\r\n1 IPV4&lt;br&gt;\r\nUnlimited Bandwidth Allowance&lt;br&gt;\r\n\r\n£36.00 per year\r\n\r\nBuy Here: https://www.superior-networks.com/billing/cart.php?a=add&amp;pid=43\r\n\r\n\r\nThese new plans are currently only available through our Canadian servers. The hardware and networking setup is a reasonable improvement over our current French setup. Our Canadian location has a shared connection of 500Mbps per node, double what our French setup currently is. You can access all of our VPS plans over at: https://www.superior-networks.com/vps.php \r\n\r\nFor all of the LowEnd visitors, members or anything else that comes across this post, we are offering 20% off our any annual + plans. This is a lifetime offer that expires the first of February. Just use the code LowEndStartup at the checkout. This promotional code will work for any services (Excluding domain registration) including our hosting and VPN plans.\r\n\r\nWe have a range of other plans from our build your own all the way to our 14GB plans available through our website, https://www.superior-networks.com/vps.php . \r\n\r\nWe have decided that for now PayPal will be our main payment gateway though we are currently looking into some other options to allow greater flexibility. \r\n\r\nFor those wishing to test our servers we have the IP superior-networks.com. If you wish to download some test files or run some ping tests we have a looking glass that you can use at https://www.superior-networks.com/lg/ and is available for our French Location and we will be adding a Canadian based looking class very soon.\r\n\r\nIf you have any questions or comments I would be happy to help where I can and I do always appreciate feedback if I have missed anything from my post!\r\n\r\n\r\nHave a great day,\r\n\r\nRyan"}