{"id": 41742, "date": "2015-01-23 21:40:55", "user": "Maounique", "post": "Hello!\r\n\r\nI recently upgraded a few servers and have the old ones for sale within EU.  \r\nThe specifications can be varied, I can BTO up to a max of 2u and 2x E5520 quadcores, 72 GB ram. I also have older servers with xeon 3070, for example, and 8 GB DDR2.  \r\nServers are in pretty good shape except a really old one which is functional but was heavily modded. They can contain a variety of disks too, from SATA HDD and SSD (various sizes and issues) to SAS small size ones (mostly 72 GB). RAID cards can be provided, but they are old and a SW raid would be better, except a couple of servers which have integrated controllers with 512 MB cache. DELL and HP only. All servers have IPMI iLO or BMC.  \r\nI can offer invoice with VAT registered company and send within EU only. Remote tests and inspections can be provided (I install and give you access to the server over IPMI to test it and look at components including disks wear and other things you may wish to see).  \r\nPrices are from 100 to 400 Eur depending on configuration (only chasis, CPU(s), RAM, PSU (single or dual/redundant), rails, but disks separately).  \r\nThis has nothing to do with Prometeus, it is my company from Romania which will issue  any invoices if required.   \r\nI have 5 chasis with MBs at this time and components to make at least 3 completely full servers. Colocation can be provided if needed (racking, setup, IPMI access setup), I am not interested to rent them to you with colo, if you opt for this, you pay for the server/components and you will make your own contract with the DC, I will only set them up according to your instructions, I might be able to get a discount for you, though.  \r\nIf you need only some components, that can be discussed as well. I am clearing a lot of inventory, just ask, apart from raid cards which are old and not really suitable for modern usage. You may ship your own parts if you cannot find something suitable in my inventory."}