{"id": 41772, "date": "2015-01-24 13:01:27", "user": "VPS4Cheap", "post": "**VPS4Cheap** We currently provide High Performance KVM VPS hosting. We are dedicated to providing good service and premium quality at an affordable price.\r\n\r\nFeatures :-\r\n\r\nFully Scalable : You can change your VPS plan any time without any data loss or downtime. Many customer first buy small vps and gradually upgrade as per their needs.\r\n\r\nVirtualizor Control Panel : Virtualizor control panel allows customer to start ,stop and reboot there VPS any time , reinstall OS , reset there root passwords and also provide basic monitoring such as RAM usage etc.\r\n\r\nRAID 10 Disk: All our Nodes are powered by RAID 10 HDD to provide superior read/write performance and result is in a balanced increase in both redundancy and performance.\r\n\r\n7 Days refund policy : If you are not satisfied with our servers then you can get 100% refund within seven days.\r\n\r\nNo Overselling\r\n\r\nOur KVM VPS Plans :\r\n\r\n    KVM Plan 1\r\n    \r\n    1 Core CPU\r\n    15GB HW RAID-10 Disk\r\n    512MB Ram\r\n    500GB Bandwidth\r\n    1 IPv4\r\n    Virtualizor Conrtol Panel\r\n    \r\n    Original Price: 3.5$ \r\n    \r\n    Now only at 2.45$ using coupon LET30OFF\r\n   \r\n   [Order Now](https://clients.vps4cheap.com/cart.php?a=add&amp;pid=45)\r\n    \r\n    \r\n    KVM Plan 2\r\n    \r\n    2 Core CPU\r\n    35GB HW RAID-10 Disk\r\n    1024MB Ram\r\n    1TB Bandwidth\r\n    1 IPv4\r\n    Virtualizor Conrtol Panel\r\n    \r\n    Original Price: 7$ \r\n    \r\n    Now only at 4.9$ using coupon LET30OFF\r\n\r\n   [Order Now](https://clients.vps4cheap.com/cart.php?a=add&amp;pid=46)\r\n\r\nNote : Sending of bulk unsolicited commercial email (spam), is not allowed and will not be tolerated. Customers using the VPS4Cheap network may not send, or allow to be sent, via open relay or other means, unsolicited commercial email. Running a legitimate opt-in mailing list, or emailing existing customers, is of course, allowed.\r\n\r\nIf you have any questions please send an mail to support@vps4cheap.com .\r\n\r\nThanks for reading.\r\n\r\nVivek Murai"}