{"id": 41805, "date": "2015-01-25 00:13:59", "user": "briehost", "post": "Brie Host is now offering IPv6 only VPS with a competitive pricing point, the Brie Host team wants to empower all kinds of developers, from students to masters, to work on IPv6 servers on testing stages of development. IPv6 are virtually free, and can be just as versatile if you IPv6 access. To check if your ISP provides IPv6, visit [ip6.me](http://ip6.me)&lt;br&gt;&lt;br&gt;\r\n\r\n**LE OpenVZ 64 - IPv6**&lt;br&gt;\r\nUptime - 99.9% Guaranteed&lt;br&gt;\r\nPremium Bandwidth - 50 GB @ 100mbps&lt;br&gt;\r\nType - Template&lt;br&gt;\r\nCores - 1&lt;br&gt;\r\nRAM - 64 MB&lt;br&gt;\r\nBurstable to - 96 MB&lt;br&gt;\r\nHDD - 1 GB&lt;br&gt;\r\nIPv4 - 0 included&lt;br&gt;\r\nIPv6 - 10 included&lt;br&gt;\r\n**$1.99/year [ORDER NOW](https://www.briehost.com/cart.php?gid=18&amp;ref=lowendtalk)**&lt;br&gt;&lt;br&gt;\r\n\r\n**LE OpenVZ 128 - IPv6**&lt;br&gt;\r\n**Uptime** - 99.9% Guaranteed&lt;br&gt;\r\n**Premium Bandwidth** - 100 GB @ 100mbps&lt;br&gt;\r\n**Type** - Template&lt;br&gt;\r\n**Cores** - 1&lt;br&gt;\r\n**RAM** - 128 MB&lt;br&gt;\r\n**Burstable to** - 192 MB&lt;br&gt;\r\n**HDD** - 2 GB&lt;br&gt;\r\n**IPv4** - 0 included&lt;br&gt;\r\n**IPv6** - 10 included&lt;br&gt;\r\n**$2.99/year [ORDER NOW](https://www.briehost.com/cart.php?gid=18&amp;ref=lowendtalk)**&lt;br&gt;&lt;br&gt;\r\n\r\n**LE OpenVZ 256 - IPv6**&lt;br&gt;\r\n**Uptime** - 99.9% Guaranteed&lt;br&gt;\r\n**Premium Bandwidth** - 250 GB @ 100mbps&lt;br&gt;\r\n**Type** - Template&lt;br&gt;\r\nCores** - 1&lt;br&gt;\r\n**RAM** - 256 MB&lt;br&gt;\r\n**Burstable to** - 384 MB&lt;br&gt;\r\n**HDD** - 5 GB&lt;br&gt;\r\n**IPv4** - 0 included&lt;br&gt;\r\n**IPv6** - 10 included&lt;br&gt;\r\n**$4.99/year [ORDER NOW](https://www.briehost.com/cart.php?gid=18&amp;ref=lowendtalk)**&lt;br&gt;&lt;br&gt;\r\n\r\n\r\n**What is IPv6?**&lt;br&gt;\r\nIPv6 is a new version of the Internet address protocol that has been developed to supplement (and eventually replace) IPv4, the version that underpins the Internet today. There is a current theoretical maximum of 4.3 billion unique IPv4 addresses, whereas IPv6 has a ludicrous maximum of 340 trillion, trillion, trillion unique IPv6 addresses… enough to never run out.&lt;br&gt;&lt;br&gt;\r\n\r\n**How to make your IPv6 web server accessible to all IPv4 visitors:**&lt;br&gt;\r\nBy using CloudFlare's free Automatic IPv4 to IPv6 gateway, your website can be made accessible to any visitor online. Best part is, it can be turned on with a few clicks from your CloudFlare panel. Check their website for more information on how to set it up: https://www.cloudflare.com/ipv6 &lt;br&gt;&lt;br&gt;\r\n\r\n**Some more reasons to start learning how to use IPv6:**&lt;br&gt;&lt;br&gt;\r\n\r\n“When networking gurus and researchers developed IPv4 security hadn't really crossed their minds. IPv4 was never meant to be secure.&lt;br&gt;&lt;br&gt;\r\n\r\nIPv6 has been built from the ground up with security in mind. Many of the security features that have been duct-taped after the fact onto IPv4 as optional features are integrated into IPv6 as default requirements. IPv6 encrypts traffic and checks packet integrity to provide VPN-like protection for standard Internet traffic.”&lt;br&gt;&lt;br&gt;\r\n\r\n-Tony Bradley, PCWorld&lt;br&gt;&lt;br&gt;\r\n\r\n“IPv6's simplified packet header makes packet processing more efficient. Compared with IPv4, IPv6 contains no IP-level checksum, so the checksum does not need to be recalculated at every router hop. Getting rid of the IP-level checksum was possible because most link-layer technologies already contain checksum and error-control capabilities. In addition, most transport layers, which handle end-to-end connectivity, have a checksum that enables error detection.”&lt;br&gt;&lt;br&gt;\r\n\r\n-NetworkComputing.com&lt;br&gt;&lt;br&gt;\r\n\r\n“IPv6 supports multicast rather than broadcast. Multicast allows bandwidth-intensive packet flows (like multimedia streams) to be sent to multiple destinations simultaneously, saving network bandwidth. Disinterested hosts no longer must process broadcast packets. In addition, the IPv6 header has a new field, named Flow Label, that can identify packets belonging to the same flow.”&lt;br&gt;&lt;br&gt;\r\n\r\n-The Activo Team"}