{"id": 42978, "date": "2015-02-05 14:21:19", "user": "Jonchun", "post": "![](http://www.hostsumo.com/images/logo.png)  \r\n\r\nHello! A lot of people have been waiting for the release of our new brand, and with great pleasure, I announce [HostSumo.com](http://www.hostsumo.com/)!\r\n\r\n**General Information and Notes:** Although HostSumo does its best to ensure a high quality experience for all of our customers, there are some MAJOR changes in the launch of this brand, and we may have some hiccups along the way! If you are affected by any issues as a result of our billing system change, website change, or VPS control panel change, please submit a ticket immediately and we'll get that fixed up as soon as possible!\r\n\r\nWe Offer\r\n=====\r\n\r\n* Cheapest Xen Prices around\r\n* Incero Network (Clean IPs, Quality Bandwidth)\r\n* NO SPAM\r\n* No contracts! Pay monthly\r\n* Virtualizor! Tired of SolusVM? Check this out!\r\n* Dallas, TX\r\n\r\n-----\r\nXEN-1\r\n-----\r\n* 1 CPU\r\n* 1 GB RAM\r\n* 50 GB HDD\r\n* 1 TB BANDWIDTH\r\n* 1 IPv4 ADDRESS  \r\nPrice: $4/monthly using LETXEN1  \r\n[ORDER NOW](https://billing.hostsumo.com/order/config/index/xen/?group_id=1&amp;pricing_id=1)\r\n\r\n-----\r\nXEN-2\r\n-----\r\n* 2 CPUs\r\n* 2 GB RAM\r\n* 100 GB HDD\r\n* 2 TB BANDWIDTH\r\n* 2 IPv4 ADDRESSES  \r\nPrice: $7/monthly using LETXEN2  \r\n[ORDER NOW](https://billing.hostsumo.com/order/config/index/xen/?group_id=1&amp;pricing_id=2)\r\n\r\n\r\n[View More Plans](http://www.hostsumo.com/xen)  \r\n\r\nWe are open to new plan requests, but we currently do not offer custom VPS plans. We offer a straightforward, 1GB RAM linear scaling system for our customers.\r\n\r\nSMTP is DISABLED on all of these nodes. They can be opened and rate limited, but require prepayment of 1 year, and is only available for XEN-2 plans or higher. This is NOT for anyone looking to use as a mail server! Sorry!\r\n\r\n** Although web servers are fine, please note that mail will NOT work, so unless you are granted SMTP opened IPs, or you plan to use an external SMTP service such as mandrill, please do not expect to be able to setup a shared hosting environment to sell to customers.\r\n\r\nPort Speed is capped at 100Mbps, and scales up with our plans. We are currently tweaking this number to get optimal performance for everyone!\r\n\r\nIf you have any questions, please feel free to ask!\r\n\r\nRegards,  \r\nJonchun"}