{"id": 4518, "date": "2012-08-29 22:56:25", "user": "BigScoots", "post": "BigScoots is known in the WHT and LEB community as a premium VPS provider. We specialize in industry leading fully managed services that we offer for a fraction of what the the big boys charge!\r\n\r\nFor a limited time while supplies last, BigScoots is looking to offload remaining room on our premium machines to the LEB and LET community. We invite you to take a gander at our unmanaged offerings, be sure to see what the community has to say about us first ;) I think you will be pleasantly surprised that you will find nothing but 100% positive and glowing reviews, across the web as well as in all of our LEB featured postings.\r\n\r\nLets cut to the chase...\r\n\r\nAt MINIMUM you will be hosted on:\r\n\r\nDual Intel Xeon Quad-Core E5620 2.4GHz processors\r\n32GB of DDR3-1333 RAM\r\nRaid-10 Protected 15,000K RPM SAS Storage\r\n\r\nCheck out your ping and download speed while you're at it:\r\nTest IP: 50.31.98.47\r\nTest Download: http://testfile.chi.steadfast.net\r\n\r\nAll of our hardware is owned and operated entirely by the BigScoots crew and has been since day 1, ~3 years ago. We boast 100% network uptime as our premium Chicago, IL based Steadfast data center has one of the best uptime records in the industry. Read more about our network here: www.bigscoots.com/network\r\n\r\nDon't forget about our 24/7/365 ~5 minute meaningful response time support. Our management is second to none, if you feel you need additional assistance at some point down the line, a fully managed upgrade is just a click away. In fact, our unmanaged services we have been told provides better support than fully managed packages offered by our competitors. The only real way is to see for yourself, we've got some of those money back guarantees (which are never actually used ;)) if you still have any doubts!\r\n\r\nOnto the packages! :D -- all of which can be viewed nice and neatly on our LEB dedicated page: www.bigscoots.com/leb\r\n\r\n- All packages have access to infinity^infinity IPv6 addresses which are available upon request Note: (real number requests only) ;)\r\n- IRC related activities are acceptable on a case-by-case basis, please drop by our live chat or open a support ticket and ask before signing up.\r\n- Additional discounts are available for longer term pricing.\r\n- Instant setup.\r\n\r\nLEB128\r\n1 CPU Core\r\n10 GB Disk Space\r\n128MB Dedicated Ram\r\n192MB Burst Ram\r\n300 GB Bandwidth\r\n1x IPv4 Address\r\nSolusVM/OpenVZ\r\n$20.00/Year\r\nhttp://www.bigscoots.com/leb\r\n\r\nLEB256\r\n1 CPU Core\r\n20 GB Disk Space\r\n256MB Dedicated Ram\r\n384MB Burst Ram\r\n500 GB Bandwidth\r\n1x IPv4 Address\r\nSolusVM/OpenVZ\r\n$4.00/Month\r\nhttp://www.bigscoots.com/leb\r\n\r\nLEB512\r\n2 CPU Cores\r\n35 GB Disk Space\r\n512MB Dedicated Ram\r\n640MB Burst Ram\r\n750 GB Bandwidth\r\n1x IPv4 Address\r\nSolusVM/OpenVZ\r\n$6.50/Month\r\nhttp://www.bigscoots.com/leb\r\n\r\nIt is our pleasure to stand guard and be ready to serve your every need! Hosting is our passion and we hope that it shows. We are forever thankful that our clients appreciate the services we provide to them and have continued to support us because of it. Please take your time when selecting a host as a poor one can certainly be detrimental to your online presence. Speak to our clients, check our reviews, take a peak at our site, we welcome criticism with open arms and truly believe BigScoots is the right choice for you -- remember, we guarantee it! We look forward to changing your opinion of hosting for the better, just as we have already changed hundreds of others. Experience the difference BigScoots can make for you!\r\n\r\nIf you are in the market for a managed solution or perhaps a solution with a bit more power, please feel free to check out our brand new and recently upgraded shared, reseller, VPS, hybrid and dedicated hosting solutions at www.BigScoots.com – Chat with us! Call us! E-mail us! or submit a support ticket! In fact, do them all, as well as like us on FaceBook (www.facebook.com/bigscoots) and follow our Twitter (www.twitter.com/bigscoots)! We want to hear from you!\r\n\r\nKindest regards,\r\n\r\nBigScoots Crew"}