{"id": 45678, "date": "2015-03-03 15:25:33", "user": "MarkTurner", "post": "I know LET likes free!\r\n\r\nA free R1Soft offer that has been posted on a few places. The wording is a bit confusing but the deal is that you get $4 saving on first month so if you just order the 100GB service you will get it for free including the R1Soft license.\r\n\r\n&gt; Delimiter is pleased to expand its services with the addition of hosted R1Soft Backup.&lt;BR&gt;\r\n&gt; &lt;BR&gt;\r\n&gt; To get you started, use the coupon R1FIRSTMONTHFREE for 100GB for free on your first month. This gives you a full month to test our service and see whether its suited for your needs. &lt;BR&gt;\r\n&gt; &lt;BR&gt;\r\n&gt; With Delimiter's service you just install the agent on your Server, VPS or even desktop; and Delimiter's R1Soft service will keep your computers backed up with R1Soft's CDP (constant data protection). We provide installers for Redhat, Centos, Fedora, Debian, Ubuntu and Windows.&lt;BR&gt;\r\n&gt; &lt;BR&gt;\r\n&gt; &lt;BR&gt;\r\n&gt; Delimiter's R1Soft Backup Service includes:&lt;BR&gt;\r\n&gt; &lt;BR&gt;\r\n&gt; - R1Soft Enterprise edition included for free - Full CDP, cPanel/hosting panel plugins, MySQL/SQL Server backup&lt;BR&gt;\r\n&gt; - Backups held on Enterprise grade NetApp storage with NetApp RAID and all Fibre Channel disks&lt;BR&gt;\r\n&gt; - Backup space scaleable from 100GB to 40TB&lt;BR&gt;\r\n&gt; - Unmetered data transfer&lt;BR&gt;\r\n&gt; - 100% of the backup space you order is yours to use, no reserved space&lt;BR&gt;\r\n&gt; - Additional R1Soft Agent licenses available - Backup all your servers to a single hosted backup service&lt;BR&gt;\r\n&gt; - Optional concierge service - our support team will install and setup the backup software for you (one-time $5), just open a ticket once you have ordered&lt;BR&gt;\r\n&gt; &lt;BR&gt;\r\n&gt; $4/month (paid month-to-month)&lt;BR&gt;\r\n&gt; $12/quarter&lt;BR&gt;\r\n&gt; $48/year&lt;BR&gt;\r\n&gt; &lt;BR&gt;\r\n&gt; Additional backup space is $4/100GB/month&lt;BR&gt;\r\n&gt; Additional R1Soft agents are $4/month&lt;BR&gt;\r\n&gt; &lt;BR&gt;\r\n&gt; [Order Here](http://www.delimitervps.com/landingpage/r1backup/?utm_source=LET&amp;utm_campaign=BACKUP03032015)&lt;BR&gt;\r\n&gt; &lt;BR&gt;\r\n&gt; Questions? Email us at sales@delimiter.com&lt;BR&gt;\r\n&gt; &lt;BR&gt;\r\n&gt; - Steve"}