{"id": 46389, "date": "2015-03-10 00:04:34", "user": "ElixantTechnology", "post": "Elixant Technology offers business grade Managed Website Hosting, Servers and Domain Registration Services. Our affordable and reliable Website Hosting makes Elixant Technology the best place to host your website whether you are a small, medium, large or enterprise-level business. At Elixant Technology, we guarantee that your website will be availible 100% of the time. In fact, we're so confident that our claims are backed by an SLA!\r\n\r\nElixant Technology offers a wide range of DDoS Protected Virtual Servers utilizing advanced and reliable technologies. All of our Virtual Servers come with around the clock DDoS Protection on powerful systems utilizing only the latest technology architectures. Unlike some providers, we pride ourselves on our strict policies that prohibit us from overselling our equipment. Following the same guidelines that we set forth for our Shared Hosting customers, we follow a 70% rule, which states we will never utilize more than 70% of any given piece of hardware. What this means for you is a faster and more reliable service that you can count on.\r\n\r\nWe guarantee 10Gbps Mitigation / 2000K PPS, though infrastructure in place is capable of mitigating upwards to 160Gbps.\r\n\r\n**Save 50% FOR LIFE on ANY package for ANY term using coupon 'LETVPS'**\r\n\r\nFor a list of the packages we have availible, visit [instavm.com](http://www.instavm.com)\r\n\r\n**VPS-128** :: 128MB RAM :: 25GB Raid-10 :: 500GB BW :: &lt;del&gt;$27/Year&lt;/del&gt; **$13.5/Year**\r\n\r\n**VPS-256** :: 256MB RAM :: 50GB Raid-10 :: 1000GB BW :: &lt;del&gt;$5/Month&lt;/del&gt; **$2.5/Month**\r\n\r\n**VPS-512** :: 512MB RAM :: 75GB Raid-10 :: 1000GB BW :: &lt;del&gt;$7.5/Month&lt;/del&gt; **$3.75/Month**\r\n\r\n**VPS-1024** :: 1GB RAM :: 100GB Raid-10 :: 2000GB BW :: &lt;del&gt;$10/Month&lt;/del&gt; **$5/Month**\r\n\r\n\r\nThis offer is only available for a limited time - Expires **March 16, 2015**\r\n\r\nTo bypass the landing page and view our website directly, please visit [elixant-tech.com](http://www.elixant-tech.com)\r\n\r\nAll of our VPS customers are currently housed out of our Montreal Datacenter. Each VPS includes 1 IPv4 address, however with proper justification you can request more via. Ticket."}