{"id": 46683, "date": "2015-03-12 20:58:03", "user": "MHS_Marc", "post": "About [MyBB Hosting Services](http://www.mybbse.net):\r\n\r\nBased in Southwestern Pennsylvania with our office located in Pittsburgh PA. MyBB Hosting Services provides high quality hosting that allows you to expand as your hosting needs changed. From small personal blogs to large corporate website. MyBB Hosting Services has a solution for you!\r\n\r\nWe are an honest independent alternative to the big-name hosting companies. MyBB Hosting Services owner has experience with the hosting industry going back to 2002 and strives to provide the best customer service in a timely manner.\r\n\r\n_**Offer #1**_\r\n\r\n**OpenVZ 2GB Deal**\r\n2GB RAM,  \r\n200GB RAID Diskspace, \r\n400GB Bandwidth, \r\n2 Cores, \r\n1 IP, \r\nOpenVZ/Virtualizor, \r\nLocation: Berkeley Springs, West Virgina, \r\n$5.50 / Month, \r\n[Order Now](http://support.mybbse.net/order/main/packages/lowend-talk-deals/?group_id=5)\r\n\r\nAll VPS plans are ran on our own VPS Nodes. All plans come with Virtualizor to manage your VPS plan. \r\n\r\nTest IP: 192.82.109.218\r\n\r\nBelow are our shared hosting offers\r\n\r\n/edit - removed, should be posted in the correct category. - mikho\r\n\r\n**Price Match    ** \r\n\r\n\r\nNew in 2015 is our Price Match &amp; Beat incentive program. Are you looking to change providers? MyBB Hosting Services will match your current providers price and in most cases we'll even be able to offer your the same web space and bandwidth amount for less then you are currently paying! Email us at sales@mybbse.net with your current amount of web space and bandwidth amount and copy of your Paid Feb invoice.\r\n\r\nQ: What payment options are available?\r\n\r\nA: Currently we support PayPal.\r\n\r\nQ: How long does it take my account to be setup?\r\n\r\nA: All new signups are verified by our sales department to prevent abuse and fraud. On average you'll get your account details within 30 minutes.\r\n\r\nQ: I have a sales question, how can I contact you?\r\n\r\nA: We can be contacted through sales@mybbse.net\r\n\r\nQ: Do you offer any other services?\r\n\r\nA: Yes we do! We offer VPS Hosting.\r\n\r\nQ: What kind of support do you offer?\r\n\r\nA: We offer support via our Client Portal."}