{"id": 47025, "date": "2015-03-16 14:17:27", "user": "VPSus", "post": "**General info**\r\n\r\nA great value VPS hosting plan that is available exclusively to LowEndBox and LowEndTalk community members. We've already been [featured on LEB](http://lowendbox.com/blog/vps-us-5-99month-512mb-xen-vps-in-atlanta-usa-rotterdam-netherlands/) earlier, and the community seems really happy with the service we provide.\r\n\r\nSo we decided to come back with this great offer once again.\r\nIf you want to see and try the VPS now, press the button below. If you're interested in more details, read on.\r\n\r\n[![](http://i.imgur.com/egz1g8d.png)](https://vps.us/lowendbox/exclusive/?utm_source=lowendtalk.com&amp;utm_medium=sponsored&amp;utm_content=top_button&amp;utm_campaign=LET_offer_march_2015\r\n)\r\n\r\n**Plan specs**\r\n\r\nHere are the specs of the VPS package:\r\n\r\n    Dedicated RAM: 512 MB\r\n    SWAP: 512 MB\r\n    Disk Space: 40 GB\r\n    Traffic: Unlimited\r\n    Dedicated IP: 1 IP\r\n    Price: $5.99/mo or less\r\n    \r\n    DC Options: Atlanta, US and Rotterdam, Netherlands\r\n    OS Options: CentOS, Debian, Fedora, Ubuntu, Slackware and Scientific Linux.\r\n    Control Panel Options: cPanel, DirectAdmin, Webuzo, ISPmanager Lite/Pro.\r\n\r\n**Endorsements and feedback**\r\n\r\nWe're proud of the service we provide and have a big list of satisfied client testimonials at ShopperApproved. _The average satisfaction rate is 4.8 out of 5_. You can **[read the actual client reviews here](http://www.shopperapproved.com/reviews/vps.us/)**. Very good feedback was also given by some of the LowEndBox community members:\r\n\r\n[![](http://i.imgur.com/PAi5nGo.png)](http://lowendbox.com/blog/vps-us-5-99month-512mb-xen-vps-in-atlanta-usa-rotterdam-netherlands/#comment-112473)\r\n\r\n\r\n**Getting it even cheaper**\r\n\r\nIn the headline we mentioned that lower price is possible. Yes, it's absolutely true and there's no catch here whatsoever. In order to get lower monthly price, all you have to do is to select a billing cycle other than monthly on the order form. Like this: \r\n\r\n![](http://i.imgur.com/0jrdsvh.png)\r\n\r\nWe do hope that you'll find our service satisfying and fit for your needs. Please feel free to ask your questions in Live Chat at our website (available 24×7) or in ticket (also 24×7). Press the button below to proceed to the special offer on our website.\r\n\r\n[![](http://i.imgur.com/egz1g8d.png)](https://vps.us/lowendbox/exclusive/?utm_source=lowendtalk.com&amp;utm_medium=sponsored&amp;utm_content=bottom_button&amp;utm_campaign=LET_offer_march_2015\r\n)\r\n\r\n"}