{"id": 4826, "date": "2012-09-14 13:17:58", "user": "serverian", "post": "We are proud to announce our new service, **Cloudive Virtual Datacenter.**\r\n\r\nPlease visit our website and chat with our operators: [cloudive.com](http://www.cloudive.com)\r\n\r\n**Promotion**\r\nFor you Low End Talk members, we have a wonderful promotion. With **ILOVELET** coupon you will get 1 vCPU, 512MB RAM, 10GB SSD, 10GB HDD, 1TB Traffic for only $6.5 for life.\r\n\r\n**How to Use?**\r\nSimply visit http://my.cloudive.com/cart.php?a=add&amp;pid=2 and add yourself 10GB SSD and 10GB HDD by using the slider, then click Checkout and enter the promotion code. You are all set!\r\n\r\n**Service Definition**\r\nCloudive Virtual Datacenter is a service where you can buy resources such as CPU Cores, RAM, SSD Space, Harddisk Space, IP Addresses and create virtual servers with them immediately. You can scale your virtual servers at any time.\r\n\r\n**Advantages**\r\nWe have developed our own infrastructure and management software to offer you the best prices!\r\n\r\nWe are giving you the opportunity to choose your own partition scheme and even ability to install your operating system manually by our VNC console.\r\n\r\n**Cloudive in Action**\r\nYou can watch our video to see how easy things are in Cloudive: [https://vimeo.com/49266524](https://vimeo.com/49266524)\r\n\r\n**Virtualization Technology**\r\nKVM with VirtIO drivers\r\n\r\n**Location / Test IP**\r\nOur Datacenter is located in Lombard, IL, United States. You can test our connection by tracerouting 64.79.111.3 or downloading our test file http://64.79.111.3/128mbfile.dat\r\n\r\n**Some of the features of our service:**\r\n\r\n- Industry Leading Virtualization\r\nCloudive uses KVM virtualization with VirtIO drivers to achieve the best performance.\r\n\r\n- Total Control On Your Infrastructure\r\nWith Cloudive Panel, you can create/edit/delete your virtual servers.\r\n\r\n- Only Pay for What You Need\r\nAre you tired of paying for what you won't use at all? With Cloudive, you just pay for what you need.\r\n\r\n- Unlimited Virtual Servers\r\nYou can create unlimited number of virtual servers in your virtual datacenter.\r\n\r\n- High Availability\r\nWhen the hardware node fails, your server spawns the backup node automatically.\r\n\r\n- Instant Setup\r\nYou'll never have to wait, just a few clicks and your server is online.\r\n\r\n- Full Root Access\r\nJust like a real dedicated server you will get full root access to your servers.\r\n\r\n- Manage Third-party Licenses\r\nDo you need Windows, cPanel/WHM, Plesk licenses? You are covered.\r\n\r\n- Scale Within Seconds\r\nNeed more cpu power or memory, just a few clicks and you are done.\r\n\r\n- 24x7x365 Support\r\nOur support engineers and technicians are here to help you around the clock.\r\n\r\n- 99.99% Network Uptime Guarantee\r\nUptime is important, you get 99.99% uptime guarantee with us.\r\n\r\n- Free Migration Assistance\r\nHosting somewhere else now? No problem, we will migrate your accounts for free.\r\n\r\n**Pre-Sales Questions**\r\n[cloudive.com/presales.php](http://www.cloudive.com/presales.php)\r\n\r\n**Contact Us**\r\n[my.cloudive.com/submitticket.php](http://my.cloudive.com/submitticket.php)"}