{"id": 48744, "date": "2015-04-02 18:47:51", "user": "NickM", "post": "Welcome to Stablebox!\r\n=======\r\n\r\nStablebox is a division of Hypernia Corporation, which has been in business for well over a decade. We pride ourselves on providing the best level of service and support possible.\r\n\r\nHave questions? Send an email to [sales@stablebox.com](mailto:sales@stablebox.com) or call us at 1 (800) 284-6978 -or- 1 (305) 390-2116.\r\n\r\nDUE TO POPULAR DEMAND, WE ARE EXTENDING OUR 99¢ PER MONTH SPECIAL!\r\n=======\r\n\r\nThis promotion is valid for the life of your hosting package - including upgrades &amp; downgrades!\r\n\r\n&lt;table&gt;\r\n&lt;tr&gt;\r\n&lt;td&gt;\r\n&lt;center&gt;&lt;img src=\"https://www.stablebox.com/wp-content/uploads/2015/03/let-shared-99-promo.png\" /&gt;&lt;br /&gt;&lt;br /&gt;&lt;a href=\"https://portal.stablebox.com/cart.php?a=add&amp;pid=46&amp;billingcycle=monthly&amp;promocode=LET-O6M28TLZ6P\"&gt;&lt;img src=\"https://www.stablebox.com/wp-content/uploads/2015/03/order-now-promo.png\" /&gt;&lt;/a&gt;&lt;/center&gt;\r\n&lt;/td&gt;&lt;/tr&gt;\r\n&lt;/table&gt;\r\n&lt;br /&gt;\r\n\r\n* Save over $35 a year!\r\n* Monthly billing cycle, cancel anytime!\r\n* Promotional code is added automatically during checkout and will be reflected on the final checkout page.\r\n* Promotional code is only valid on monthly billing cycle\r\n&lt;br /&gt;&lt;br /&gt;\r\n\r\nALL PACKAGES INCLUDE\r\n=======\r\n\r\n* **480 Gbps DDOS Protection**\r\n* MySQL 5 &amp; PostgreSQL\r\n* PHP 5.4, 5.5 &amp; 5.6\r\n* Plesk 12 Web Control Panel\r\n* Ubuntu Operating System\r\n* Plesk Script Auto-Installer\r\n* **Web Presence Builder (Website Builder)**\r\n* FTP Access/Web Mail/File Manager/More!\r\n* **Hardware RAID + SSD Storage**\r\n* Automatic **Daily Backups** &amp; Self Serve Recovery!\r\n* **TRUE 24/7/365 Support (Ticket System &amp; Phone)**\r\n* Instant Upgrades &amp; Downgrades\r\n* **INSTANT** &amp; **FREE** Setup\r\n* Enterprise Grade Hardware, Network &amp; Datacenters with 1Gbit/s connectivity per server\r\n\r\n\r\nFREQUENTLY ASKED QUESTIONS\r\n=======\r\n\r\n*\"Say that I would host a speedtest file and then download that 24/7 from a dozen different locations. Would that be ok? Since you offered \"unlimited\" bandwidth.\" - mikho*\r\n\r\nWe understand that there may be some confusion about our \"unlimited\" bandwidth policy. Obviously, we cannot offer \"truly\" unlimited bandwidth (or anything else, really!) - no one can. Our policy is simple: your shared hosting account is intended for hosting websites, not for hosting file sharing services, mirroring the Ubuntu package repositories, backing up your movie collection (legally obtained, of course... ;), or anything else that's designed specifically to consume large amounts of bandwidth (or other resources like CPU or RAM). In practice, this means that as long as you're using the resources for hosting websites, your account will never be suspended for using too much bandwidth, though in exceptional circumstances, we may want to work with you to reduce your resource consumption so that everyone (including you) benefits.\r\n\r\n\r\nCONTACT US\r\n=======\r\n\r\n* **Sales**: [sales@stablebox.com](mailto:sales@stablebox.com)\r\n* **Support**: [support@stablebox.com](mailto:support@stablebox.com)\r\n* **Ticket System**: [https://portal.stablebox.com](https://portal.stablebox.com) (You must login to open a ticket with Support.)\r\n* **Billing System**: [https://portal.stablebox.com](https://portal.stablebox.com)\r\n* **Toll-Free Phone**: 1.800.284.6978\r\n* **Further Contact Details**: [https://www.stablebox.com/contact-us/](https://www.stablebox.com/contact-us/)\r\n&lt;br /&gt;&lt;br /&gt;\r\n\r\nLEARN MORE ABOUT US\r\n=======\r\n\r\n* **About Us**: [https://www.stablebox.com/about/](https://www.stablebox.com/about/)\r\n* **Acceptable Use Policy**: [https://www.stablebox.com/acceptable-use-policy/](https://www.stablebox.com/acceptable-use-policy/)\r\n* **Privacy Policy**: [https://www.stablebox.com/privacy-policy/](https://www.stablebox.com/privacy-policy/)\r\n* **Terms of Service**: [https://www.stablebox.com/terms-of-service/](https://www.stablebox.com/terms-of-service/)\r\n&lt;br /&gt;&lt;br /&gt;\r\n\r\nABOUT US\r\n=======\r\n\r\nAbout the Stablebox Division\r\n-------\r\nHypernia Corporation ([https://www.hypernia.com](https://www.hypernia.com)) launched the Stablebox brand in early 2012 to specialize in providing enterprise class web hosting, cloud servers and dedicated servers to meet the ever growing needs of both individuals and businesses alike.\r\n\r\nStablebox has grown tremendously since its inception and has quickly become a leader in the web hosting industry. Today StableBox has been chosen by thousands of web site owners, designers and small businesses as their service provider of choice when it comes their web hosting needs.\r\n\r\nAll Stablebox services are backed by our technical support; 100% available, 24 hours a day, 7 days a week and 365 days a year. The Stablebox network operations center (NOC) is staffed at all times with talented, professional engineers to assist with all of your needs.\r\n\r\nIn addition to Plesk powered web hosting and KVM-based VPS hosting, Stablebox offers 100% managed cloud servers and dedicated servers to alleviate the requirement for our clients to have costly in house system admins or the burden of locating a reliable system admin contractor.\r\n\r\nAbout Hypernia Corporation\r\n-------\r\nFounded in 2001, Hypernia Corporation pioneered the Internet data center market with innovative service offerings that would help businesses and individuals take advantage of the speed and global reach of technology and the Internet.\r\n\r\nHypernia believes that for organizations to be successful, they need a partner that provides flexible and affordable solutions that spark independence and confidence in their online business.\r\n\r\nHypernia established its high volume network for intense application hosting such as online gaming in 2002, and continues to be a leading provider of complex Internet hosting for enterprises with mission-critical Internet operations."}