{"id": 49725, "date": "2015-04-12 18:02:29", "user": "Steven_F", "post": "&lt;a href=\"https://DediCube.com\"&gt;DediCube LLC&lt;/a&gt; is a premier provider of affordable dedicated servers. Founded in April of 2014, DediCube made the leap from reseller to owning its own hardware in 2015 after seeing rapid growth. Built with the belief of providing high quality customer services, DediCube is customer-centric. We have always prided ourselves in the quickness and efficiency of our support department. Join the DediCube family today!\r\n\r\n&lt;b&gt;Intel Xeon x3470&lt;/b&gt;&lt;br /&gt;\r\n8 GB of DDR3 ECC RAM&lt;br /&gt;\r\n1 x 2 TB Enterprise Hard Drive&lt;br /&gt;\r\n10 TB on a 100 Mbps Port with a /29 IPv4&lt;br /&gt;\r\n&lt;b&gt;&lt;a href=\"https://dedicube.com/billing/order/config/index/dedicated-servers/?group_id=1&amp;pricing_id=12\"&gt;$30 a month&lt;/a&gt;&lt;/b&gt;!\r\n\r\n&lt;b&gt;Dual Intel Xeon L5520&lt;/b&gt; - Out of Stock&lt;br /&gt;\r\n8 GB of DDR3 ECC RAM&lt;br /&gt;\r\n1 x 2 TB Enterprise Hard Drive&lt;br /&gt;\r\n10 TB on a 100 Mbps Port with a /29 IPv4&lt;br /&gt;\r\n&lt;b&gt;&lt;a href=\"https://dedicube.com/billing/order/config/index/dedicated-servers/?group_id=1&amp;pricing_id=4\"&gt;$40 a month&lt;/a&gt;&lt;/b&gt;!\r\n\r\n&lt;b&gt;What is the DediCube Difference?&lt;/b&gt;\r\n&lt;ul&gt;\r\n&lt;li&gt;24x7 Technical Support by Experienced and Trained Professionals&lt;/li&gt;\r\n&lt;li&gt;Automated OS re-installations, bandwidth graphs, and server management from our billing panel!&lt;/li&gt;\r\n&lt;li&gt;We only use enterprise/server grade hardware in our servers!&lt;/li&gt;\r\n&lt;li&gt;All of our hardware is fully owned by DediCube LLC. No leases, no rentals, no reselling!&lt;/li&gt;\r\n&lt;li&gt;Chinese language sales and technical support translation assistance! (&lt;b&gt;我们已有中文销售代表为您服务! 中文技术支持将在不久后推出!&lt;/b&gt;)&lt;/li&gt;\r\n&lt;/ul&gt;\r\n&lt;b&gt;FAQ&lt;/b&gt;&lt;br /&gt;\r\n&lt;i&gt;What payment methods do you support?&lt;/i&gt;&lt;br /&gt;\r\nCurrently, we are able to accept payments via PayPal, AliPay, credit card, Bitcoin, and wire transfer. To pay via a non-PayPal method, please open a support ticket.\r\n\r\n&lt;i&gt;Where are your dedicated servers located?&lt;/i&gt;&lt;br /&gt;\r\nAll of our dedicated servers are located in Los Angeles, California at the premium 530 W 6th Street data center. You can ping our website to test out our network. We are in the process of looking into the launch of an east coast facility.\r\n\r\n&lt;i&gt;Are you a reseller?&lt;/i&gt;&lt;br /&gt;\r\n&lt;b&gt;No! &lt;/b&gt;We own all of our hardware! We do not lease, rent, or resell.\r\n\r\n&lt;i&gt;Do you offer DDoS mitigation?&lt;/i&gt;&lt;br /&gt;\r\nAt this point in time, we do not offer DDoS mitigation. If a DDoS attack is detected which affects the network, we will be forced to temporarily null route your server. Additional DDoS protection may be available as an add-on in the near future. Let us know if you would be interested in it!\r\n\r\n&lt;i&gt;Where are your support technicians located?&lt;/i&gt;&lt;br /&gt;\r\nAll members of the DediCube technical support team have at least a high school diploma and 2+ years of experience in the hosting industry. We have technicians in the United States of America and Australia, to provide true 24x7 coverage.\r\n\r\n&lt;i&gt;Can you provide support in any other language?&lt;/i&gt;&lt;br /&gt;\r\nDediCube only provides technical support in English. Sales assistance can be provided via native Chinese (Mandarin) speakers.\r\n\r\n&lt;i&gt;What is enterprise/server grade hardware?&lt;/i&gt;&lt;br /&gt;\r\nEnterprise/server grade hardware is hardware which is designed to run under consistent, 24x7 heavy loads. Desktop grade hardware is designed to be used eight hours a day, five days a week (8x5). Many budget dedicated server providers use desktop grade hardware to save money. Not DediCube! All hardware we use is designed for tough usage.\r\n\r\n&lt;i&gt;Do you provide any management for these servers?&lt;/i&gt;&lt;br /&gt;\r\nAll of these servers are self-managed. That means you, the client, are responsible for managing and maintaining all of the software on the server. We are responsible for making sure the network is up and available and that your hardware is replaced, should it begin to fail."}