{"id": 50484, "date": "2015-04-20 18:46:57", "user": "VNKen", "post": "**Since 2006**, Virpus.com has been on the customers side providing VPS services at a fraction of the cost of our competitors. Virpus.com, a Wow Technology, Inc. company, owns and operates its own 18k sq. foot data center in Seattle, WA with customers of the likes of Microsoft, Moz, Rosetta Stone, Vulcan, Cheezburger and more, trusting our parent company to deliver services.\r\n\r\n**15% OFF plus FREE DirectAdmin for LET/LEB Customers**\r\n\r\nPlease use Promo Code: **LET-2015-2** which will lower our website advertised price down by 15% to match the prices below prices. By using the promo code it will make the customer eligible to get DirectAdmin free of charge as well.\r\n\r\nJust contact the sales department and mention the URL to this thread if you want DirectAdmin. Pricing is lifetime, as is the license, so long as the service remains active and in good standing.\r\n\r\n**Promo Expires May 4, 2015**\r\n\r\n**What is SSD-Caching?**\r\n\r\nWith our SSD-Cache VPS plans, you get benefits such as RAID 10 arrays, with the added bonus of SSD-Caching. What this means is that when a heavy disk I/O work load comes along, that activity will be moved to the SSD arrays to be processed there. This ensures that the overall HDD array will have consistent speeds even under heavy work loads.\r\n\r\n**All NEW VPS's include**\r\n\r\n- SolusVM VPS Panel\r\n- Unmanaged (Add full management for only $20/mo)\r\n- XEN PV\r\n- 99.9% Uptime SLA\r\n- Instant Activation!\r\n- Choice of OS including most Linux Distributions\r\n- Control Panel Choices: Interworx, DirectAdmin or cPanel\r\n- Seattle Data Center (West Coast)\r\n- Dual Xeon Processors\r\n\r\n**Our SSD-CACHE XEN VPS Line consists of...**\r\n\r\n**SVMCACHE-512M**\r\n\r\nCPU: 2 Cores &lt;br&gt;\r\n25 GB SSD-Cached Disk &lt;br&gt;\r\n512 MB RAM / 1024 MB SWAP &lt;br&gt;\r\n1500 GB Transfer on 1Gbps &lt;br&gt;\r\n1 IP Address&lt;br&gt;\r\n**Monthly: $1.77/mo ($21.25/year)&lt;br&gt;**\r\n[CLICK FOR MORE INFORMATION!&lt;br&gt;&lt;br&gt;](http://virpus.com/ssd-cache-vps.php)\r\n\r\n**SVMCACHE-1G**\r\n\r\nCPU: 4 Cores &lt;br&gt;\r\n50 GB SSD-Cached Disk &lt;br&gt;\r\n1024 MB RAM / 2048 MB SWAP &lt;br&gt;\r\n3000 GB Transfer on 1Gbps &lt;br&gt;\r\n1 IP Address &lt;br&gt;\r\n**Monthly: $4.25/mo &lt;br&gt;**\r\n[CLICK FOR MORE INFORMATION!&lt;br&gt;&lt;br&gt;](http://virpus.com/ssd-cache-vps.php)\r\n\r\nPayment Methods: PayPal, Bitcoin and Credit Card&lt;br&gt;&lt;br&gt;\r\n\r\nQuestions? E-mail sales@virpus.com or chat with us on our website."}