{"id": 50637, "date": "2015-04-22 17:20:20", "user": "MikePT", "post": "Hello LET members!\r\n\r\nLet me start by introducing ourselves. We're a group of three folks:\r\nMiguel Ângelo (me, owner, the system administrator, and also who takes care of the website, WHMCS and monitoring), David Schmauch (the second investor and advisor) and Rui Viana, Webdesigner for local clients, who recently registered in LET and I've been training him to provide you top notch support (he's my long-time personal friend).\r\n\r\nOur business/domain name used to be WHPlace.com, started in 2008, and our clients are all local (from Portugal). We've done many website designs and that's how we got all our clients.\r\n\r\nWe recently decided to expand our offers to the international market and we're extremelly excited to bring this to LET and start offering here, hence, we registered SavvyReady.com a year ago as we thought it'd be a great opportunity to create a new sub brand (WHPlace.com used to provide WebHosting services only, shared/reseller offers).\r\n\r\nWe couldn't be more excited to present you our offers, it took us a lot of time to considerate our options and if we'd go ahead. We're open to receive your feedback and improve our services. We actually need YOUR help to do so! If you detect a bug, simply report it and we'll get to it right in the moment.\r\n\r\nPlease read the **FAQ **to know a little more about us! :-)\r\n\r\n**Note: All orders must be manually approved since we need to control fraud and keep our nodes clean.**\r\n\r\nNode Specifications:\r\n\r\n- Dual E5 2620;\r\n- 64GB RAM;\r\n- 4x2TB HDD RAID 10, BBU + SSD Cached;\r\n- 1Gbps connection @ Buffalo, ColoCrossing.\r\n\r\nKVM Plan:\r\n\r\n- 1GB RAM\r\n- 2 CPU Cores\r\n- 40GB HDD\r\n- 1TB Bandwidth\r\n\r\nFirst month: **FREE!** / Recurring price: $7 per month\r\n\r\nOrder Link: https://savvyready.com/manage/cart.php?a=add&amp;pid=5\r\nCoupon: **LETHAPPINESS**\r\n\r\nAvailable OS templates:\r\n\r\n&lt;pre&gt;CentOS 6.5 x86_64 Minimal\r\nCentOS 7.0 x86_64 Minimal\r\nClearOS 6.3 x86_64\r\nDebian 7.3.0 x86_64 Minimal\r\nFedora 20 x86_64 Minimal\r\nopenSUSE x86_64 Minimal\r\nScientific Linux 6.3 x86_64 Minimal\r\nUbuntu 13.10 Server x86_64 Minimal\r\nUbuntu 14.04 x86_64 Server Minimal\r\nWindows 2008 Server R2 Trial\r\nWindows 2012 Server Trial\r\n&lt;/pre&gt;\r\n\r\nISO's:\r\n&lt;pre&gt;\r\nCoreOS 633.1.0 x86_64\r\nFreeBSD 10.1 x86_64\r\nOpenBSD 5.7 64bit\r\n&lt;/pre&gt;\r\n\r\n\r\n**F.A.Q**\r\n\r\n**- What makes you different from the other KVM providers?**\r\n\r\nSince the 2004's, I have tried dozens, if not hundreds of VPS providers. I cancelled a lot of those not only to reduce costs, but to look for a superior service, with decent IO, stable network and reasonably oversold (while done correctly). We're friends with several providers and we do not like to think about them as \"competitors\". We can all do business and grow, we try to provide a stable service, production ready, with a decent support.\r\n\r\n**- Support? How's your support like? Is it 24x7?**\r\n\r\nNo. It is NOT 24x7, but from 9am GMT to 11pm GMT. The reason is that we're starting to expand our business, therefore, we cannot yet afford techs to work during the night. We'll get to it as we grow :-). We'd rather hire qualified people than hiring outsource workers who do it for a cheap price but with no quality.\r\n\r\n**- Do you oversell?**\r\n\r\nWho doesn't? Yes, we do oversell. We oversell the CPU, while the RAM and HDD diskspace is fully guaranteed. We monitor the nodes closely to ensure a stable service. Abuse won't be tolerated, at all.\r\n\r\n\r\n**- Will you provide Windows licenses? Could you please load a custom ISO?**\r\n\r\nNo. We do not have any SPLA agreement. We can certainly upload any ISO you'd like!\r\n\r\n**- Why do you guys use a template in your Website?**\r\n\r\nWe definitely do. The reason is that I'm the only guy here who works in the website, and I really do not like design that much, therefore, I purchased this template, but also purchased a SolusVM integration which looks pretty good. As soon as we grow, we plan to purchase a unique design :-). \r\nThe current design is not even finish! I promise I'll finish it before the trial ends :-).\r\n\r\n**- Are there any guarantees that you won't simply disappear?**\r\n\r\nThere can always be guarantees, although only a few keep the promises. We begun in 2008 and it took us a few years to even considerate to start offering KVM services to the international market. Our investor (David) and myself, have more than enough funds to keep the nodes online.\r\n\r\n**- Do you host everything in your network?**\r\n\r\nNo. Dediserve hosts our Website/billing panel and SolusVM in an European location. We truly love Dediserve.\r\nEdit: We're actually moving our webserver to BuyVM with a DDoS Protected IP.\r\n\r\n**- What about the TOS/AUP? Do you have any?**\r\n\r\nWe have not wrote a TOS/AUP yet, we'll not copy paste and modify other provider's TOS/AUP. David has the responsability to write those and he will take care of it this month.\r\nCurrently, the TOS ARE:\r\n\r\n1 - We're not responsible for anything illegal hosted in our servers. 2 - Minecraft is NOT allowed. 3 - CPU/ IO intensive applications are NOT allowed. 4 - SPAM is not tolerated and you'll be suspended if you do so, until further investigation. 5 - DDoS is completely forbidden.\r\n\r\n**- Why this trial?**\r\n\r\nThis trial will be ran in LET, exclusively, and we're doing it to see the nodes performance, also to improve what needs to be improved. We'll actually run a trial for every new node we launch. That's the way we do it. You have the right to test it before paying for it.\r\n\r\n**- Are the VPS Managed? Do you provide any Managed Services?**\r\n\r\nNo. The VPS are NOT managed. We're going to provide Managed Services in the future, you can read more about it [HERE](https://www.savvyready.com/managedservices.php).\r\nNote that support will be given only for hardware/network related issues. \r\n\r\n**- Why did you even consider to host with ColoCrossing?**\r\n\r\nI've previously worked for companies who have servers with ColoCrossing and I think their network is fine. The support is pretty fast as well, I haven't had a single bad experience with CC.\r\n\r\n**Ok. But still, your website isn't finished.**\r\n\r\nI know. I promise I'll take care of it before the trial is over. It's a promise! :P\r\n\r\n**Cool. What if I decide to trial it for a month then cancel it?**\r\n\r\nFeel free to. We want you to feel fully satisfied with our services. :-)\r\n\r\n**Got any contact email?**\r\n\r\nAbsolutely. Simply email us to support@savvyready.com\r\n\r\n\r\nDo let us know if there's anything else we can clarify for you. We're an open book and do love absolute transparency."}