{"id": 5095, "date": "2012-09-27 15:13:13", "user": "vdnet", "post": "Cloud3K is a new subsidiary under RockMyWeb &amp; Subsidiaries. We have designed a platform that makes it easy to buy servers for cheap and upgrade them as needed. Cloud3K maintains servers in four datacenters across the USA.\r\n\r\nRockMyWeb is celebrating our six year anniversary and offering incredible discounts on our already low-priced cloud servers.\r\n\r\n\r\nWhat are cloud servers?\r\n============================================================\r\n\r\n&gt;Cloud servers feel just like a VPS or dedicated, but provide extra features such as high availability and load balancing.  Our cloud servers run VPSGrid, a custom platform for Virtuozzo-based systems. From your end, you will not notice a difference except for better uptime and performance. On the backend, however, VPSGrid does the following:\r\n1. Creates a live backup of your server ensuring data will not be lost in the event of hardware failures.\r\n2. Monitors servers for downtime and uses the live backup in case of failure, protecting your server from long periods of downtime.\r\n3. Balances load between physical servers making sure you have the available CPU and RAM your server demands!\r\n\r\nUpgrades\r\n===========================================================\r\n\r\n&gt;First you must order a package, below, to create your virtual server. Then you can instantly add or remove upgrades using our control panel. Upgrades are charged daily but prorated hourly so you only pay for what you need at the time. If you expect lots of traffic, you can go to the control panel and instantly boost your server.\r\n\r\n&gt;RAM/CPU Upgrade: 512MB RAM + 500MHz Guaranteed CPU\r\n$3.50/month (11.7 cents per day)\r\n\r\n&gt;Disk Upgrade: 25GB Disk + 30 IOPS\r\n$3.50/month (11.7 cents per day)\r\n\r\nBase Packages\r\n============================================================\r\n\r\n&gt;We offer two base packages. Our Private Cloud Server is our low end box service starting at just $5.95 with our special! If you need more, you can always upgrade to our vDedicated package or add RAM or Disk space on the fly through our control panel.\r\n\r\n&gt;Private Cloud Server\r\n1GB RAM\r\n50GB Disk Space\r\n4-CPUs Burstable\r\n$7.95 / mo ($5.95 with SIXYEAR coupon)\r\n\r\n&gt;We offer packages in our four datacenters including the Chicago, New York, and Las Vegas areas.\r\n\r\n&gt;http://www.cloud3k.com/servers.php\r\n\r\nSpecial\r\n============================================================\r\n\r\n&gt;Using the SIXYEAR coupon on the order form will save you $2.00/month on any of our packages on http://www.cloud3k.com\r\n\r\nHigh Performance\r\n============================================================\r\n\r\n&gt;Dedicated CPU: We give more dedicated and burstable CPU than any provider with similar pricing.\r\n\r\n&gt;SSD Powered: Our servers use a RAID10 cached with SSD for high performance reads and writes. Our servers are geared to handle 1000s of IOPS as compared to a single hard drive which can only handle 100.\r\n\r\n&gt;Try us out:  I guarantee our servers will outperform any host in the same price range.\r\n\r\n\r\nTest our Network\r\n============================================================\r\n\r\n&gt;You can find test IPs and files on our web site under each location details at http://cloud3k.com/locations.php\r\n\r\n&gt;Use our speed test tool to test your home connections to see which datacenter is the best for you: http://cloud3k.com/speedtest.php\r\n\r\nContact us today using our contact form if you have any questions!  Feel free to PM me."}