{"id": 51078, "date": "2015-04-26 23:18:10", "user": "Felipe", "post": "Hey guys, I'm Felipe from Chile and I introduce you to WeVPN, a project I've been working on for the last 6 months together with @mycloud that I meet here in LET. WeVPN is part of 'Llave SpA' a registered company in Chile (where the first law supporting net neutrality was made). This service was created and aimed for english, spanish and chinese speaker users even though we haven't promoted our service neither in english or chinese communities because we haven't felt very confident and also in the past months we have been making alot of changes in the website, business strategy and the backend part (nodes, companies that we work with, etc.). Now we feel that is time for this to grow a little more and here I am showing you WeVPN.\r\n\r\nAs of today almost 100% of our clients are chileans, and we really want feedback from foreign users.\r\n\r\nWeVPN aims to help net neutrality, protect your privacy and also help secure the data you send and receive through the internet. We try to be clear, you can read our Terms and Conditions as well as our Privacy Policy here https://wevpn.net/terms/\r\n\r\nOk so after that introduction (sorry for the long intro) what do we offer!?\r\n\r\nFor 3USD a month you get:\r\n\r\n- Many VPN protocols such as: OpenVPN, PPTP, L2TP, IPSec and IKEv2\r\n- Unmetered data transfer\r\n- Up to 3 devices connected with only one account\r\n- Privacy, again you should read our privacy policy here https://wevpn.net/terms/\r\n- 7 locations (there will be more in the future, we hope!): United States, Canada, Italy, France, Russia, Brazil and Japan\r\n\r\nYou can buy or read about the project here: https://wevpn.net/\r\n\r\nBeside we're still in Beta, we're fully functional but it also means we're still working on some things and you should expect some small things missing, even though we will make sure to add them as soon as possible. The 3USD per month price is a special price while we are in Beta, after beta the price will increase to 5USD (no more than that, we promise!) and we expect beta to last one more month even though this could be a little less or more.\r\n\r\nI almost forgot! We accept Bitcoin and Paypal for foreign users (outisde of Chile)\r\n\r\nIf you have any questions please comment below, or you can engage with us in Facebook (https://www.facebook.com/pages/WeVPN/850362811653612) or in Twitter (https://twitter.com/we_vpn)\r\n\r\n-This offer post was approved by @Spirit\r\n\r\nP.S.: Sorry for my english, I always try my best! "}