{"id": 51432, "date": "2015-04-30 22:32:59", "user": "Rob_T", "post": "Hello LET!  \r\n   \r\nVersaweb recently made a special purchase on some off-lease servers that we are now offering at BLOWOUT pricing! These exclusive deals aren't available to the general public on our website, so you MUST use the links below to order! These deals will end on May 31 or while supplies last!  \r\n   \r\n   \r\n**Intel Xeon E3-1230 Dedicated Server**  \r\n--------------------  \r\nXeon E3-1230 CPU - 4 Cores, 8 Threads  \r\n8GB DDR3 ECC RAM Memory  \r\n500GB SATA HDD  \r\n10TB Premium Bandwidth - 100Mbps Port  \r\nFREE Basic DDoS Protection - 10Gbps / 2Mpps, Best-Effort SLA  \r\n4 IP Addresses / Private VLAN  \r\nHosted in our Las Vegas Datacenter  \r\n  \r\n**Monthly Pricing**   \r\n$49 per month + FREE setup  \r\n[CLICK HERE TO ORDER NOW!](https://www.versaweb.com/promo.php) \r\n  \r\n  \r\n**Intel Xeon X3470 Dedicated Server**  \r\n--------------------  \r\nXeon X3470 CPU - 4 Cores, 8 Threads  \r\n16GB DDR3 ECC RAM Memory  \r\n500GB SATA HDD  \r\n25TB Premium Bandwidth - 1000Mbps Port  \r\nFREE Basic DDoS Protection - 10Gbps / 2Mpps, Best-Effort SLA  \r\n4 IP Addresses / Private VLAN  \r\nHosted in our Las Vegas Datacenter  \r\n  \r\n**Monthly Pricing**   \r\n$49 per month + FREE setup  \r\n[CLICK HERE TO ORDER NOW!](https://www.versaweb.com/clearance-dedicated-servers.php) \r\n  \r\n**New DoS Protection System!**  \r\n  \r\nAll Versaweb dedicated servers now include basic DDoS protection! This new system, developed exclusively for Versaweb, actively monitors our entire network for DoS attacks. When an attack is detected, our system will automatically re-route your server's incoming traffic to our filtering system, stopping the attack in it’s tracks (up to 10Gbps / 2Mpps).  \r\n   \r\nFor users that need a greater level of protection, we also offer Enterprise DoS Protection + Mitigation starting at only $50 per month. Our Enterprise DoS Protection + Mitigation service offers permanent advanced mitigation including Layer-7 protection for attacks up to 20Gbps peak / 4Mpps, keeping your site or application running even during an attack. Higher protection levels available; inquire for details.  \r\n   \r\nAdd Enterprise DDoS Protection to any server - Starting at only $50 per month!  \r\n(protects up to 20Gbps / 4Mpps, permanent advanced mitigation, 1 protected IP address)  \r\n   \r\n   \r\nFrequently Asked Questions:  \r\n   \r\nQ: Do you have a test IP?  \r\nLas Vegas - 199.47.210.50  \r\nSeattle - 76.164.234.1  \r\n   \r\nQ: Do you have a download test file?  \r\nLas Vegas - http://199.47.210.50/100mbtest.bin  \r\nSeattle - Coming Soon  \r\n   \r\nQ: What forms of payment do you accept?  \r\nA: We accept most major credit cards (Visa, MC, Discover, Amex) as well as Paypal payments. We also accept wire transfer payments for amounts over $500.  \r\n   \r\nQ: How soon will my server be online after my order is placed?  \r\nA: Once your order is verified by our billing department, your server will normally be online within 1-2 business days - in many cases, we will even have your server up the same day. Please note that if your server is ordered with upgrades, like additional disks, memory, RAID controllers, or other special configuration options, it can take a little longer.  \r\n   \r\nQ: Can I upgrade my server?  \r\nA: Yes! Please see our order form for available options and pricing. If you do not see what you need on our order form, please contact our sales dept. and we'll do our best to come up with a custom configuration for you. We also offer discounted licensing for many popular control panels such as cPanel, Plesk, Interworx, and DirectAdmin.  \r\n   \r\nQ: Can I get more IP addresses with my server?  \r\nA: All of our servers are deployed with either 4 or 5 usable IP addresses, depending on the particular configuration. If you need more IP addresses, you can order them via our website once your initial order has been completed and your server is online. We do require justification per ARIN guidelines for all IP allocations. We typically allow a maximum of a /25 per server (125 IP's) - if you need more, please contact us for more information.  \r\n   \r\n8 IP Addresses (5 usable) - $2 per month, $10 one-time setup  \r\n16 IP Addresses (13 usable) - $4 per month, $10 one-time setup  \r\n32 IP Addresses (29 usable) - $8 per month, $10 one-time setup  \r\n64 IP Addresses (61 usable) - $16 per month, $10 one-time setup  \r\n128 IP Addresses (125 usable) - $32 per month, $10 one-time setup  \r\n   \r\nPlease feel free to contact our sales dept via email at sales [at] versaweb (dot) com with any questions you might have.  \r\n   \r\nThanks, and have a great day!  "}