{"id": 51789, "date": "2015-05-05 09:24:43", "user": "The_creator", "post": "Hello LET Members,  \r\n\r\nSo since past few days we have been crunching some numbers regarding\r\nour new dedicated server offering on LET. So here we are doing a survey &amp; commitment thread.  \r\n\r\nSo we have very certain configuration in mind for our dedicated users from LET:  \r\n\r\n**Server 1:**  \r\n\r\nProcessor: Intel Quad Xeon X34xx (4x2.xGhz)   \r\nRAM: 4GB  \r\nHDD: 4x1TB SATA  \r\nPort Speed: 1Gbps  \r\nLocation: Netherlands  \r\nBandwidth: 5TB  \r\n45Euro/Month \r\n**[Commit Here](https://www.aheadcloud.com/billing/cart.php?gid=27)**  \r\n\r\n**Server 2:**  \r\n\r\nProcessor: Intel Quad Xeon X32xx (4x2.xGhz)   \r\nRAM: 4GB  \r\nHDD: 2x2TB SATA  \r\nPort Speed: 1Gbps  \r\nLocation: Netherlands  \r\nBandwidth: 5TB  \r\n37Euro/Month \r\n**[Commit Here](https://www.aheadcloud.com/billing/cart.php?gid=27)**  \r\n\r\n**Server 3:**  \r\n\r\nProcessor: Intel Quad Xeon X34xx (4x2.xGhz)   \r\nRAM: 16GB  \r\nHDD: 2x1TB SATA  \r\nPort Speed: 1Gbps  \r\nLocation: Netherlands  \r\nBandwidth: 5TB  \r\n42Euro/Month \r\n**[Commit Here](https://www.aheadcloud.com/billing/cart.php?gid=27)**  \r\n\r\n**Server 4:**  \r\n\r\nProcessor: Intel Quad Core Xeon E3-1230  \r\nRAM: 16GB  \r\nHDD: 2x1TB SATA  \r\nPort Speed: 1Gbps  \r\nLocation: Netherlands  \r\nBandwidth: 5TB  \r\n47Euro/Month \r\n**[Commit Here](https://www.aheadcloud.com/billing/cart.php?gid=27)**  \r\n\r\n**Both server include free incoming bandwidth.**  \r\n\r\nWe would like to see interest of LET community in this plan and hence\r\nwe are creating a committer poll.\r\n\r\n**Timeline of release of this special offer:**  \r\n\r\n1. 7 days for this survey i.e. till 11th May.\r\n2. If we get enough committer more than 15 pre booking buyers than we will launch\r\nthis offer and delivery will start from 25th May.  \r\n\r\n**So you may ask why should we commit?**\r\n\r\nWell it is simple you help us we help you :)  \r\n\r\nEvery LET member who commit to our offer will get a lifetime discount of 10%\r\non normal pricing.  \r\n\r\n**How can I commit for this offer?**  \r\n\r\n1.In order to commit to this offer you will have to order this offer from here.     \r\n\r\n**[Commit Here](https://www.aheadcloud.com/billing/cart.php?gid=27)**  \r\n\r\n\r\n2.If we received at least 15 commit order we will launch these server for LET community.  \r\n\r\n3.If we failed to get 15 commits we will refund all the commits by 15th and this plan will never be launched.  \r\n\r\n4.If we get 15 commits we will launch the server and every committer will receive their servers by 25th and the 10% cashback for initial payment and their further price will be adjusted to discounted price.    \r\n\r\n**How can I trust you?**  \r\n\r\nThough started being active on LET recently but our brand \"AheadCloud NetWorks\"has been providing services since Jan 2013 and all the commits are made via paypal so that you can be sure we will not take your money and runaway. Commits via bitcoins are also possible if you trust us for bitcoins you will have to contact support.\r\n\r\n**You may ask why not just launch this offer?**    \r\n\r\nWell since we have little idea whether their will be any takers for this offer on LET. Therefore we would like to get the community view and if people are willing to have such offer they will definitely support us :)  \r\n\r\nAlso to do such kind of offer we will have to do heavy commitment with our datacenter\r\nso before that we would like to make sure their are enough taker :)\r\n\r\nRegards\r\nBJ\r\nAheadCloud NetWorks "}