{"id": 52671, "date": "2015-05-14 16:57:41", "user": "joepie91", "post": "The original information is [here](http://cryto.net/~joepie91/code-review.html), but I've copypasted it below for reading convenience. Posted with permission of forum staff.\r\n\r\n---\r\n\r\n# Code review\r\n\r\nI will review your codebase, and make suggestions on how to improve the readability, maintainability, reliability and security. I will refactor small parts of your code to explain and demonstrate techniques. The code review is in stages - I start out with formatting issues, move on to modularization, specific security issues, and so on.\r\n\r\nNote that I'm a perfectionist - I'll keep suggesting and explaining improvements until there's nothing left to improve. By the time the code review has completed, you will have a noticeably cleaner and more reliable codebase.\r\n\r\nI do not strictly enforce any style guides - I value actual real-world readability over \"following a list of rules\". I will also always provide rationale for any suggestions, no \"just because\". That being said, I am very direct - no sugarcoating, just getting things done as efficiently as possible. My main goal is to teach you how to write better code, not to just change things around.\r\n\r\n_(Code review is available on both an hourly basis, and on a fixed-price basis (depending on lines of code and complexity). More information about payment is below.)_\r\n\r\n# Tutoring\r\n\r\nPerhaps you just want to learn Node.js, or a specific technology or specialization - promises, scraping, and so on. That's possible too! I will help you learn Node.js in whatever way works best for you. Whether that is pointing you in the right direction for self-directed learning, or explaining things step-by-step. I will adjust my teaching style (and language use) to whatever works for you.\r\n\r\nIt doesn't matter whether you have prior experience. Whether you're coming from another language or just have no experience with programming at all, I'll be able to teach you. That being said, you must be motivated to learn.\r\n\r\n_(Due to the wide variety of different teaching styles, tutoring is only available on an hourly basis. More information about payment is below.)_\r\n\r\n# Advice\r\n\r\nMaybe you just need the odd bit of advice every now and then - troubleshooting, explaining small things, or even just rewording documentation of a third-party library so you can understand it better. That's possible - you can keep me on a retainer/deposit for when you get stuck, and I'll help you out with any topic I know about :)\r\n\r\nI have experience with a wide array of usecases - especially unusual edge cases with little or no documentation - and can generally adapt to whatever's needed. Some examples of this are writing an adaptive bruteforce/spidering script for a search engine, extensive experience with Tahoe-LAFS, and so on. See also my specializations below.\r\n\r\n_(Advice on retainer/deposit is only available on an hourly basis. Note that for this, 'rounding up to an hour' and the minimum deposit still apply, but refunds of remaining hours are not possible. More information about payment is below.)_\r\n\r\n# Method\r\n\r\nI generally do code review and tutoring over XMPP or IRC - providing snippets of code where needed using a [Gist](http://gist.github.com/). I *can* do screensharing (via TeamViewer or an open-source screensharing tool of choice), but I've found that text-based explanations generally work better.\r\n\r\nI suggest trying text-based explanations first - we can always switch to screensharing later if text doesn't work out for you.\r\n\r\n# Specializations\r\n\r\n* Application security\r\n* Code maintainability and modularization\r\n* Web-based applications\r\n* Promises, map/reduce/filter, data processing\r\n* Scraping - if it's accessible, I can scrape it\r\n* Unusual architectures and experimental technologies, with little to no third-party documentation\r\n* Distributed architectures\r\n\r\n# Experience\r\n\r\n* 10 years of (backend) software development; primarily PHP, Python, Node.js\r\n* 13 years of frontend development; HTML, CSS, JS (and third-party libraries like jQuery)\r\n* A wide array of [open-source projects](http://cryto.net/~joepie91/projectlist/)\r\n* A number of [published Node.js modules](https://www.npmjs.com/~joepie91) on npm\r\n\r\n# Payment\r\n\r\nAvailable payment methods include PayPal, Bitcoin, SEPA, and potentially others. My hourly rate generally ranges from 25 to 50 EUR/hr, depending on factors like project complexity, ease of communication and so on.\r\n\r\n* __Fixed price:__ 50% deposit paid up front, other 50% after completion. Price is based on LOC and expected complexity, and will be set in stone after initial agreement - no later changes.\r\n* __Hourly rate:__ upfront deposit in 10 hour increments - after 10 hours, a deposit for the next 10 hours, and so on. Remaining hours after completion are refunded. Note that time is rounded up per hour, regardless of the actual amount of work performed during that hour.\r\n\r\nMy rates are affordable, so don't hesitate to ask!\r\n\r\nFor hourly-rate payment, the deposit increments can be decreased if you're on a particularly tight budget. For example, you could pay a deposit for 5 hours at a time. Note that an upfront deposit is still required.\r\n\r\n# Contact\r\n\r\n* E-mail: admin@cryto.net\r\n* XMPP: joepie91@neko.im\r\n* IRC: joepie91 on Freenode (other methods preferred though - it's easy to lose track of PM windows)\r\n* ... or send me a PM here! Questions in the thread are also welcome, of course."}