{"id": 53076, "date": "2015-05-19 10:47:33", "user": "rethinkvps", "post": "Hello all!\r\n\r\nAs the last thread gave a huge 350% boom in sales in the first 48 hours of the thread/promotion going live I think it would be a huge waste to not post it for the last time.\r\n\r\nWe have ran out of our initial IP range that was set aside for this promotion but we have just added an extra /25 which is put in place for this promotion.  This is the last of the stock for this promotion and anything as soon as we have run out the promotion will end (At the current rate that won't be long).\r\n\r\nSince the last thread 2 weeks ago we had comments regarding our AUP which can be found at http://rethinkvps.com/Tos.  There was talks with our AUP being quite low for the unmetered provider that we are, well after talks within the company we have doubled our bandwidth to our provider which has in turn allowed us to double the AUP.  If you have any questions regarding our upgrade please send me a PM or an email to sam (AT) rethinkvps.com and I will answer them as soon as possible.\r\n\r\n\r\n**About ReThinkVPS**\r\n\r\nReThinkVPS was registered in late 2010 and has been providing reliable unmetered virtual servers since the very start. Recently we have introduced IPv6 and Xen-HVM into our network infrastructure. We have got into the position where our network is now growing very steadily and we would like you all to be able to try out our network and services without having to break the bank.\r\n\r\n**Features**\r\n\r\n* SolusVM Controlled \r\n* Native IPv6 \r\n* RAID10 \r\n* Unmetered Bandwidth (Fair Usage in ToS) \r\n* OpenVZ &amp; Xen-HVM \r\n* 1Gbps (Shared)\r\n\r\n**OpenVZ Offers**\r\n\r\nOpenVZ 1.0\r\n\r\n* Storage: 30GB\r\n* Bandwidth: UNMETERED\r\n* Guaranteed RAM: 512MB\r\n* vSwap: 1GB\r\n* IPv4: 4\r\n* IPv6: On Request\r\n* Price: $7.95 $3.98\r\n* ORDER LINK: https://billing.rethinkvps.com/cart.php?a=add&amp;pid=6 (PROMO CODE: FOREVER)\r\n\r\n\r\nOpenVZ 2.0\r\n\r\n* Storage: 50GB\r\n* Bandwidth: UNMETERED\r\n* Guaranteed RAM: 1GB\r\n* vSwap: 2GB\r\n* IPv4: 4\r\n* IPv6: On Request\r\n* Price: $11.95 $5.98\r\n* ORDER LINK: https://billing.rethinkvps.com/cart.php?a=add&amp;pid=7 (PROMO CODE: FOREVER)\r\n\r\nALL ORDERS ARE PRORATED TO 1st OF EVERY MONTH"}