{"id": 53997, "date": "2015-05-29 17:54:22", "user": "SNetworks1", "post": "Hello Everyone,\r\n\r\nWith summer being just around the corner and this normally being the time that a lot of people finally get the spare time they need to start to properly work on those projects that are sitting there desperate to be started, I thought I would share with you some offers that we have been working on specially for LowEndTalk.\r\n\r\nThese two offers are the only two that fall under the LET rules on pricing however we do have some other great LowEnd offers for you on our website (Link further down).\r\n\r\n**LET-SUM-01:**\r\n\r\n1GB Ram&lt;br&gt;\r\n30GB Disk Space&lt;br&gt;\r\n1 IPV4&lt;br&gt;\r\nUnlimited Bandwidth Allowance&lt;br&gt;\r\nOpenVZ Virtulization &lt;br&gt;\r\n\r\n£2.00 per month (Approx $3.00USD)&lt;br&gt;\r\nOrder Here: https://www.superior-networks.com/billing/cart.php?a=add&amp;pid=75\r\n\r\n\r\n**LET-SUM-02:**\r\n\r\n2GB Ram&lt;br&gt;\r\n50GB Disk Space&lt;br&gt;\r\n1 IPV4&lt;br&gt;\r\nUnlimited Bandwidth Allowance&lt;br&gt;\r\nOpenVZ Virtulization &lt;br&gt;\r\n\r\n£4.00 per month (Approx $6.00 USD)&lt;br&gt;\r\nOrder Here: https://www.superior-networks.com/billing/cart.php?a=add&amp;pid=76\r\n\r\nIf you are looking for a slightly bigger plan (Going all the way up to 5GB of RAM) at these LowEnd Prices then please click the following link where you will be taken to our billing panel that lists out the specifications for the different plans we have to offer: https://www.superior-networks.com/billing/cart.php?gid=28 It is important to note that there is limited stock on all of these plans, and when they have sold out they will not be replenished. This is a one time deal so please do make the most of it!\r\n\r\nAs a company we have been operating since March 2013 and have full public WHOIS Records that will confirm this. We have also posted here and on LowEndBox before, so we are not a summer host, we are here to stay. \r\n\r\nAs per usual we also have our standard pricing plans and our standard build your own VPS Configuration setup, the build your own VPS configuration allows you to get the perfect configuration of RAM, Disk Space and IPV4's for your needs, often saving you money instead of having idling resources. This is fully upgradable as and when you need it. \r\n\r\nWe run on OVH currently meaning that you get the full protection of their DDoS protection and to date we have had no outages as a result of DDoS attacks on any of our servers. To make it easier for everyone we currently offer both Stripe (Credit &amp; Debit card processing) and PayPal for you to process your payments. Stripe handles any credit / debit card data on their end, and the connection is completely secure between our end where you input the data and their end for the processing. \r\n\r\nFor those wishing to test our servers we have the IP 178.33.27.52 (Or you can use superior-networks.com for a FQDN). If you wish to download some test files or run some ping tests we have a looking glass that you can use at https://www.superior-networks.com/lg/ and is available for our French Location and we will be adding a Canadian based testing site up and running in the near future. \r\n\r\nI think I have managed to include everything that you may need to know or want to know, but if I did overlook something or you have any other questions please feel free to drop me a PM here, reply or open a ticket on our support desk."}