{"id": 55428, "date": "2015-06-17 13:26:25", "user": "joepie91", "post": "I've been doing [Node.js code review and tutoring](http://cryto.net/~joepie91/code-review.html) for a while now, and I figured I'd try my hand at running a promo.\r\n\r\nSo, for the coming week, I'm offering five hours of Node.js tutoring for __only €100__ (about $113 at current exchange rates).\r\n\r\nThat's €20 per hour, a __20%-60% discount__ over my usual rates of €25-€50! :)\r\n\r\nIn these five hours, I'll be getting you up to speed with Node.js - you'll learn all the basics you need to get started with it, and find your way around. The tutoring is one-on-one, so you get 100% of the attention and time, and you can ask any questions you have in the process.\r\n\r\nThis offer is valid __until June 24, 2015__.\r\n\r\n### What you will be doing and learning\r\n\r\nWe'll go through the basics of Node.js, Express, and Jade. You'll build a very simple 'real-world web application' - for example, a to-do list, a shoutbox, a blog, or anything similarly basic that you might feel like building.\r\n\r\nBy the time we're done, you will have a basic working application, and a good foundation to start building more complex projects.\r\n\r\nThe different topics we'll address:\r\n\r\n* Setting things up (installing Node.js, creating a new project, searching for and installing modules)\r\n* Javascript and Node.js mechanics (callbacks/async, error handling, promises, creating modules, prototypical inheritance)\r\n* Express.js (Express.js itself, Jade, common Express.js middleware)\r\n* Databases (PostgreSQL, Knex)\r\n* Anything else that might come up while building your small project.\r\n\r\n### Requirements\r\n\r\n* Motivation to learn.\r\n* A code editor (some good options are [Brackets](http://brackets.io/), [Geany](http://geany.org/), [Notepad++](https://notepad-plus-plus.org/), etc.)\r\n* The ability to access [GitHub Gist](https://gist.github.com/); if you are in China, you may need a proxy.\r\n* A basic understanding of [HTML](https://developer.mozilla.org/en-US/docs/Web/Guide/HTML/Introduction) and [Javascript syntax](http://learnxinyminutes.com/docs/javascript/) (not strictly required, but without this prior knowledge, we probably won't be able to finish in 5 hours).\r\n* A basic understanding of how to operate a terminal/commandline.\r\n\r\nYou can use any operating system, but keep in mind that Windows can cause problems with Node.js sometimes - you will need to install Visual Studio, not all Node.js modules might work out of the box, and Windows has some issues with long paths. If you have the ability to work/test on a Linux or OS X system, that's preferable.\r\n\r\n__You don't need to have experience with programming, this is for both beginners and more experienced developers!__ As long as you understand the basics of HTML and JS syntax, you should be fine.\r\n\r\nA database will be provided, you won't have to set up PostgreSQL yourself (although it's advisable to learn this at a later point, of course).\r\n\r\n### Price\r\n\r\n€100 for 5 hours. If you meet the requirements listed above, it shouldn't take longer than that. Note that this must be paid __upfront__. You can pay through Bitcoin, PayPal, or SEPA transfer.\r\n\r\nIf you already know the basics of Node.js, you may also use the 5 hours for other Node.js-related tutoring - however, keep in mind that I can't guarantee we'll be entirely finished within those 5 hours. I'm also still available for [other work](http://cryto.net/~joepie91/code-review.html) at my usual rate :)\r\n\r\n### Alright, where do I sign up?!\r\n\r\nSimply send me a PM on here, e-mail me at admin@cryto.net, or talk to me on XMPP (joepie91@neko.im) or IRC (joepie91 on Freenode)!\r\n\r\nWe'll discuss availability, and try to find a time slot that suits you."}