{"id": 56283, "date": "2015-06-27 16:24:47", "user": "frixelsolutions", "post": "Hello!\r\n\r\nFrixel Solutions LLC. is a registered company in the state of Oregon, though we primarily operate in California. We use private WHOIS, however you can see our contact information on our website [here](https://www.frixelsolutions.com/contact.php).\r\n\r\nWe have an exclusive offer for LowEndTalk readers, for a fantastic price on a Core i5-based dedicated server in Rohnert Park, California.\r\n\r\nCore i5 Quad Core CPU/Processor, 8GB DDR3 RAM/Memory, 1TB HDD/Hard Drive, 4TB Monthly Bandwidth @ 100Mbps, /29 IPv4 Included, Free Setup!\r\n\r\nAll servers are ready to go with **CentOS 6 64-bit** (minimal) for fastest deployment. We do not offer other operating systems at this time. Setup is guaranteed within 48 hours but it should be much sooner since the servers are pre-installed and ready.\r\n\r\nDirect Order Link: https://www.frixelsolutions.com/secure/cart.php?a=add&amp;pid=18\r\n\r\nPromo code for $49/month recurring: LET-DS-i5-49\r\n\r\nMore details on all hosting/server plans and pricing: https://www.frixelsolutions.com/hosting-servers.php\r\n\r\nExact CPU model may vary. We do not allow configuration/customization of these servers.\r\n\r\nAll servers include a /29 of IPv4 address. Our network upstream consists of HE right now, and more IP transit providers and peering will be added soon by our upstream provider.\r\n\r\nOur servers are located in Rohnert Park, California. We own and operate our servers in this unique location; we are not a reseller. Our upstream bandwidth provider has enterprise level fiber internet service. The building has grid power, solar power, a generator, and our core network has another layer of UPS backups, so we won't be having any power or network problems.\r\n\r\nTest IP: 204(dot)10(dot)167(dot)221\r\n\r\nWe accept PayPal only at this time. If you need any additional information, please let us know.\r\n\r\nThank you and we look forward to serving you. Please be sure to read our terms of service, acceptable use policy, and privacy policy located at the bottom of every page of our website.\r\n\r\nhttps://www.frixelsolutions.com/\r\n"}