{"id": 57679, "date": "2015-07-13 14:20:56", "user": "Ree", "post": "I have a Delimiter dual X5150 that I upgraded to a dual L5420 when they offered the one-time $100 upgrade.  It just renewed on June 29 and will next renew on September 29, so there's about 2.5 months remaining.  I couldn't pass up the upgrade deal, but still don't know what to do with it, so I'm hoping to transfer it and recoup some (or all) of the $100 one-time fee that I paid.\r\n\r\n**Server details:**\r\n\r\n- HP ProLiant BL460c G1\r\n- 1 IPv4\r\n- 2 x 500GB w/ HW RAID (E200i)\r\n- 16GB RAM\r\n- 5TB transfer\r\n- Recurring amount: $90 per quarter (at next billing cycle the second HD can be removed to drop this to $60 per quarter)\r\n\r\n**Auction details:**\r\n\r\n- Start price: $1 USD\r\n- Bid increments: Minimum $1 USD\r\n- Reserve price: $49 USD (may be waived at my discretion)\r\n- Buy-it-now price: $100 USD\r\n- End date: Wed July 15 @ 10am EDT (UTC-4) (approximately 48 hours from now)\r\n\r\n**NOTE 1: You MUST have a VERIFIED PayPal account to bid.**\r\n\r\n**NOTE 2: You MUST be an existing Delimiter customer to bid.**\r\n\r\n**NOTE 3: If you DO NOT have a VERIFIED PayPal account, or if Delimiter denies the transfer (you are not a customer, or you are not in good standing, etc), you will be refunded and I will offer the transfer to the next highest bidder (if any others pass the reserve)**\r\n\r\n**NOTE 4: I have no idea how long Delimiter will take to make the transfer -- I will submit the request after receiving payment, but if for example they take a week after that no partial refund will be given**\r\n\r\nThe high reserve price is because if I can't get at least that much, then I'll have to fall back to Plan B :)  Don't forget for somewhere between $49 and $100 you're getting the $100 X5150 to L5420 upgrade as well as approximately $75 in unused service.\r\n\r\nFor those concerned, I did get permission for a non-domain auction, and I hope I've followed all the rules correctly.\r\n\r\n@Spirit can I please have 24 hours of unsink?  Thanks!"}