{"id": 58843, "date": "2015-07-24 11:52:37", "user": "Verelox", "post": "Hello LET!\r\n\r\nA few days ago, we were very excited to announce that most of the work on our new control panel was finished, and that it was ready to be used to deploy servers. Today, we have done some changes to the website as well as the plans we used to offer previously, and we believe that you will be loving the new plans and pricing we have for you!\r\n\r\nHere are some plans we offer for the SATA service - all of our virtual services run under KVM virtualization:\r\n\r\n**€0.0055/hr.** (€3.7/mo)\r\n&lt;pre&gt;\r\nRAM: 512 MB\r\nProcessor: 1 Core, 3+ GHz\r\nStorage: 15 GB, RAID protected\r\nBandwidth: 1024 GB\r\nAvailable in: Canada and France\r\n&lt;/pre&gt;\r\n\r\n**€0.0069/hr.** (€4.64/mo)\r\n&lt;pre&gt;\r\nRAM: 768 MB\r\nProcessor: 1 Core, 3+ GHz\r\nStorage: 20 GB, RAID protected\r\nBandwidth: 1024 GB\r\nAvailable in: Canada and France\r\n&lt;/pre&gt;\r\n\r\n**€0.0083/hr.** (€5.58/mo)\r\n&lt;pre&gt;\r\nRAM: 1024 MB\r\nProcessor: 1 Core, 3+ GHz\r\nStorage: 25 GB, RAID protected\r\nBandwidth: 2048 GB\r\nAvailable in: Canada and France\r\n&lt;/pre&gt;\r\n\r\nWe offer SSD services as well, but as they are about to run out of stock, we feel it's not a good idea to post these here. In fact, you can see all of our plans and locations [here](http://verelox.com/cloud.php) alongside test files.\r\n\r\nFrom the control panel, you decide whether you would prefer to suspend or pay for additional bandwidth when the limit is exceeded. The monthly bandwidth allocation resets by the start of every new month automatically, and the additional unused bandwidth is carried to the next month. We currently charge €0.01 per GB, but this is subject to change.\r\n\r\nThe new control panel allows you to attach a custom ISO from a URL to your instance, monitors your server for downtimes and sends you notifications, grants you console access and other features which you can find [here](http://verelox.com/features.php)\r\n\r\nWe would love if you try our service, and so we have added a 3 hours equivalent credit to new users for the 512 MB SATA plan which will be added automatically when you validate your email address (while signing up); but you can use the credit to spin up other plans as well. To sign up, please click [here](http://cloud.verelox.com/register.php)\r\n\r\nAdditionally, you can read about our terms of service at http://verelox.com/tos.php\r\n\r\nFor any support requests, questions or inquiries, please don't hesitate to open a [ticket](http://cloud.verelox.com/support.php?a=open) or [contact sales](http://verelox.com/contact.php?t=sales) if you aren't a registered user yet - you can also visit our [FAQ page](https://verelox.com/faq.php) for the most common questions.\r\n\r\nP.S we utilize VirtIO on all of our instances, so if you decide to install Windows, please make sure that the VirtIO drivers are loaded first. We also have ready ISO files which you can choose from, including Windows Server 2008 x86 with VirtIO support.\r\n\r\nThank you for reading!"}