{"id": 59170, "date": "2015-07-28 14:05:09", "user": "HostMyBytes", "post": "![](http://hostmybytes.com/images/logo-white.png)\r\n\r\nThank you for checking out our LowEndTalk exclusive offer. This offer is limited stock and will sell out.\r\n\r\nWe are HostMyBytes and we have offered VPS hosting since 2014. With over 1,000 active customers we are growing fast. We are grateful to the LET community for supporting us.\r\nServices being offered today are available in Phoenix, Arizona (PhoenixNAP) and Montreal, Canada (OVH). We are offering DDoS Protection for FREE within the promo price below.\r\n\r\nWe offer a 30-day refund guarantee to all new customers.\r\n\r\nNow for something different...\r\n\r\nThis a pooled resource VPS offer featuring up to 3 VPS containers in either location for one low price.  You can mix and match your resources how you want.  Put two in Canada and one in Arizona, or the reverse. You can put three in either location or just use all the resources for a single VPS. \r\n\r\n** You choose and control your resources on demand.**\r\n\r\nVirtualization on this offer is KVM or OpenVZ, your choice on a per container basis when you create your virtual machines.\r\n\r\n**VPSR-P (15 Available)**&lt;br /&gt;\r\nKVM or OpenVZ virtualization &lt;br /&gt;\r\n3 GB RAM&lt;br /&gt;\r\n\u2028\u202875 GB Disk Space&lt;br /&gt;\r\n\u2028\u20285,000GB Bandwidth&lt;br /&gt;\r\n\u2028\u20283 IPv4 Addresses&lt;br /&gt;\r\n\u2028FREE DDoS Protection&lt;br /&gt;\r\n\u2028Deploy up to 3 virtual machines on demand!\u2028&lt;br /&gt;\r\n[ORDER NOW](https://clients.hostmybytes.com/cart.php?a=add&amp;pid=96) ← $7.00 /m OR $45/yr\r\n\r\n_Need a bigger allocation? You can order more than one and get the resources combined!_\r\n\r\n**BONUS**: If you order 2 or more, you'll get a free DDoS-Protected IPv4 address.\r\n\r\nWhy to Choose HostMyBytes\u2028\r\n&lt;ul&gt;\r\n&lt;li&gt;Undersold high performance servers (Xeon E5 CPUs)&lt;/li&gt;\r\n&lt;li&gt;RAID-10 drives for redundancy&lt;/li&gt;\r\n&lt;li&gt; Daily, automatic off-site backups&lt;/li&gt;\r\n&lt;li&gt;Two locations to choose between (Phoenix and Montreal)&lt;/li&gt;\r\n&lt;li&gt;\tHigh quality networks with DDoS Protection included for FREE&lt;/li&gt;\r\n&lt;li&gt;Fast support with 24x7 coverage (Live Chat Support available)&lt;/li&gt;\r\n&lt;li&gt;30-Day refund guarantee for new customers&lt;/li&gt;\r\n&lt;/ul&gt;\r\n\r\nNeed something special? We can arrange custom packages to meet your needs. Let's talk about how HostMyBytes can serve you. [Contact Us](http://clients.hostmybytes.com/submitticket.php)"}