{"id": 6129, "date": "2012-11-21 15:44:25", "user": "natcoweb", "post": "**NatcoWeb, a KVM based virtual private server provider, has launched its solid state drive (SSD) VPS offerings in its New Jersey area hosting facilities. Our servers have also been upgraded for high performance utilization of KVM and SSD for satisfaction of new and current clients.\r\n\r\nOur VPS node servers run dual core Intel Xeon L5640 6-Core 2.26Ghz processors with 48GB of RAM. Our RAID controller for the SSD VPS node configuration is 42R-LSI00328 RAID 9271-4i 1-pt SAS2 1Gb DDR3 PCIe 3.0 SGL and we use Intel SSD 520 Series SATA3 6G 25nm MLC Cherryville hard drives. These SSD VPS nodes are ready to handle whatever demanding project you have and will increase the performance of MySQL.\r\n\r\nThe servers are located in TelX facility in Clifton, NJ. The dc is SAS 70 type II certified environment where we weathered Sandy Hurricane without downtime for our clietnts' servers due to the on-site power generator. **\r\n\r\nWe have created our [SSD Mini offer](http://www.natcoweb.com/SSDmini.html#) specially for Lowendtalk.com. The deal includes: \r\n\r\nHDD: 5 Gb \r\nRAM: 128 Mb \r\nTraffic: 200 Gb \r\nCPU: 1 VCPU \r\nIPv4: 1 \r\nIPv6: 64 \r\n**Price: $6.95/mo **\r\n\r\n[Order Now! ](http://www.natcoweb.com/SSDmini.html#)\r\n\r\n\r\n\r\n**Each account includes:**\r\n\r\n99,999% uptime guarantee\r\n**Instant setup* **\r\nFree migration from your current host\r\n**Full Root Access**\r\nDomains unlimited\r\n**1 IP address for free**\r\nPayment Options- PayPal, Credit Card, wire transfer\r\n**Additional IP addresses can be bought at the price $2.00/IP**\r\n30-day moneyback guarantee\r\n**Secure datacenter environment**\r\nPremium connectivity providers:Level3, AboveNet, Highwinds\r\n\r\n\r\n* Instant setup is available for clients with verified Paypal accounts, the rest of clients receive access data after a call verification in 1-2 hours.\r\n\r\n**\r\nWhat OS can be used inside virtual machines? **\r\n\r\nDebian and Centos Linux OS\r\n\r\n**What's the average ticket response time?**\r\n\r\nAbout 10-15 minutes.\r\n**\r\nWhat’s included into Natcoweb virtual private hosting support services?**\r\n\r\nInitial server setup, free server monitoring, and site bandwidth statistics\r\n\r\n\r\n\r\nhttp://www.natcoweb.com/online_support.html\r\n\r\nTo order or ask your questions:\r\n\r\n **email** sales@natcoweb.com \r\n **phone** 1.6462333035\r\n **skype** natcoweb\r\n\r\n\r\n\r\n\r\n\r\n"}