{"id": 65111, "date": "2015-10-06 20:31:25", "user": "HostMyBytes", "post": "![](http://hostmybytes.com/images/logo-white.png)\r\n\r\nSummer is over, but our VPS Pools are still open and warm.  Haven't tried one of our VPS Pools out yet, what are you waiting for? Christmas?  We'll have special coupon offers then too.\r\n\r\nWe just launched a new VPS Pool location in Strasbourg, France, and brought additional servers online in other locations.  Capacity is waiting to be filled by you!\r\n\r\n![](http://hostmybytes.com/images/worldMap.png)\r\n\r\n**Buy today and save.  All new customers are covered by our 30-day refund guarantee.**\r\n\r\n**What are VPS Pools?**\r\nVPS Pools are bundles of server resources you buy and can allocate how so you see fit, when you see fit and where you see fit. The Pools include multiple IPs, a good amount of RAM, large disk allocation and a large amount of bandwidth.  VPS Pools also include multiple IPv6 address (yes we have support for IPv6 [see this for info](http://clients.hostmybytes.com/knowledgebase/21/What-kind-of-IPv6-support-do-you-have.html))\r\n\r\nWith a VPS Pool you can have one big VPS or break the resources up into multiple VPS instances and do so across our locations (Montreal, Canada, Jacksonville, Florida, Phoenix, Arizona, and Strasbourg, France).\r\n\r\nDDoS Protection is included for FREE in three of our locations.\r\n\r\n![](http://hostmybytes.com/images/controlPanel.png)&lt;br /&gt;\r\nUsing our control panel, you can build and delete virtual servers instantly\r\n\r\n**Wading Pool**&lt;br /&gt;\r\nWAS: $8.49 **NOW: $4.49 / month** - COUPON CODE: POOL1&lt;br /&gt;\r\n\t2GB RAM / 1 CPU per VPS / 100GB Disk / 3TB Bandwidth / 3 IPv4 Addresses&lt;br /&gt;\r\n\t[[ORDER NOW]](https://clients.hostmybytes.com/cart.php?a=add&amp;pid=119)\r\n\r\n**Olympic Pool**&lt;br /&gt;\r\nWAS: $12.49 **NOW: $6.09 / month** - COUPON CODE: POOL2&lt;br /&gt;\r\n\t4GB RAM / 1 CPU per VPS / 200GB Disk / 5TB Bandwidth / 5 IPv4 Addresses&lt;br /&gt;\r\n\t[[ORDER NOW]](https://clients.hostmybytes.com/cart.php?a=add&amp;pid=120)\r\n\r\nIf you want a regular OpenVZ server for VPS or other #lowend use, we have a 256MB good for VPN, IRC, and many other things.  This is available in all of our locations:\r\n\r\n**\tOpenVZ VPS Annual 256MB (Limit 2 per customer)**&lt;br /&gt;\r\n\r\n\t256MB RAM / 2 CPUs / 30GB Disk / 1TB BW /1 IPv4 Address / /64 IPv6 Subnet\r\n[\tORDER NOW - $2/m or $12/yr\r\n](https://clients.hostmybytes.com/cart.php?a=add&amp;pid=111)\r\n\r\n\r\n**Here are Five Reasons to Choose HostMyBytes**&lt;br /&gt;\r\n\r\n1.\tCare: We work hard to satisfy our valued customers\r\n2.\tGuarantee: 30-Day money back satisfaction guarantee for new customers\r\n3.\tPower: Xeon many core powered servers with RAID drive arrays\r\n4.\tChoice: Four locations to choose from\r\n5.\tAvailable: Fast support with 24x7 coverage \r\n\r\n**About HostMyBytes**\r\n[HostMyBytes](http://hostmybytes.com/) has been offering web and VPS hosting since 2014.  We are a rapid growth company. We just added Strasbourg, France, as a new VPS location, bringing our location count up to four. \r\n\r\nNeed something different?   We can arrange custom packages to meet your needs.  [Let's talk about how HostMyBytes can serve you](http://clients.hostmybytes.com/submitticket.php). "}