{"id": 65540, "date": "2015-10-11 19:44:43", "user": "Steven_F", "post": "BoltVM is proud to announce the official release of its DDoS protected KVM VPS offerings! Offering 10 Gbps of **native** DDoS mitigation on its KVM VPS in four amazing locations, BoltVM has offerings to meet everyone's needs! BoltVM was founded over a year and a half ago and has been providing high quality, consistent services. BoltVM has had over 1,000 happy customers! Why not join those numbers?!\r\n\r\n**Hurricane 512**\r\n&lt;pre&gt;\r\n512 MB of RAM\r\n20 GB of RAID 10 Storage\r\n500 GB of Bandwidth\r\n1 Core (E3-1230 v2 or Better)\r\n10 Gbps of Native DDoS Mitigation\r\n1 IPv4 and a /64 IPv6\r\n&lt;/pre&gt;\r\nNormally $6.00 a month, now $4.20 a month with coupon **DDosFree**!&lt;br&gt;\r\n([New Jersey](https://boltvm.com/billing/thunderclap/configproducts.php?action=edit&amp;id=27)) ([Miami](https://boltvm.com/billing/thunderclap/configproducts.php?action=edit&amp;id=22)) ([Los Angeles](https://boltvm.com/billing/thunderclap/configproducts.php?action=edit&amp;id=19)) ([Dallas](https://boltvm.com/billing/thunderclap/configproducts.php?action=edit&amp;id=18))\r\n\r\n**Hurricane 1024**\r\n&lt;pre&gt;\r\n1,024 MB of RAM\r\n40 GB of RAID 10 Storage\r\n1,000 GB of Bandwidth\r\n1 Core (E3-1230 v2 or Better)\r\n10 Gbps of Native DDoS Mitigation\r\n1 IPv4 and a /64 IPv6\r\n&lt;/pre&gt;\r\nNormally $10.00 a month, now $7.00 a month with coupon **DDosFree**!&lt;br&gt;\r\n([New Jersey](https://boltvm.com/billing/thunderclap/configproducts.php?action=edit&amp;id=28)) ([Miami](https://boltvm.com/billing/thunderclap/configproducts.php?action=edit&amp;id=25)) ([Los Angeles](https://boltvm.com/billing/thunderclap/configproducts.php?action=edit&amp;id=20)) ([Dallas](https://boltvm.com/billing/thunderclap/configproducts.php?action=edit&amp;id=16))\r\n\r\n**What is native DDoS protection?**&lt;br&gt;\r\nNative DDoS protection is filtering/scrubbing done in the datacenter, as opposed to doing the filtering in another datacenter and backhauling the traffic to the datacenter.\r\n\r\n**Why is native DDoS protection better?**&lt;br&gt;\r\nNative DDoS protection offers lower latency, which is a huge advantage for game servers, which often attract DDoS attacks. In addition, the network is designed to better cope with the stress of DDoS attacks. Sometimes, leaks occur, and in facilities with native protection, you'll see higher end gear that is able to cope with these leaks better. This results in less null routing and higher uptime!\r\n\r\n**Who is the Los Angeles and Dallas mitigation from?**&lt;br&gt;\r\nPsychz provides our top-notch Los Angeles and Dallas DDoS mitigation and scrubbing. They utilize a mixture of NSFOCUS and internal filtering to provide highly efficient and effective scrubbing. On top of their amazing filtering, they boast a massive network in each location utilizing some of the highest quality carriers around.\r\n\r\n**Who is the New Jersey and Miami mitigation from?**&lt;br&gt;\r\nChoopa provides the mitigation in New Jersey and Miami. They use a completely in-house system that has proven highly effective and extremely accurate. Choopa is also regarded as having one of the best networks on the east coast, out performing all others!\r\n\r\n**How much mitigation does each VPS get?**&lt;br&gt;\r\nEach node has 10 Gbps of DDoS mitigation shared between all of the VPS. Usually, DDoS attacks are short (&lt;30 minutes) and just a few Gbps, allowing multiple clients access to the scrubbing, with additional capacity in-case of some of those larger attacks. The amount of packets per second varies between our mitigation vendors between 2 Mpps and as high as 10 Mpps!\r\n\r\n**Do your OVZ VPS now include DDoS mitigation?**&lt;br&gt;\r\nNo! Only our KVM VPS include DDoS mitigation!\r\n\r\n**Do you have any test IPs? (Mitigation is not be active on these IPs, they will be nulled.)**&lt;br&gt;\r\nLos Angeles Test IPv4: 104.149.18.203&lt;br&gt;\r\nDallas Test IPv4: 45.34.12.147&lt;br&gt;\r\nPiscataway Test IPv4: 206.221.176.194&lt;br&gt;\r\nMiami Test IPv4: 104.243.47.102\r\n\r\n**When will my VPS be setup?**&lt;br&gt;\r\nOur Miami and New Jersey nodes are already up and running! Once your order is approved, your VPS will be deployed. Our Dallas and Los Angeles nodes should be online tomorrow (October 12th)."}