{"id": 66056, "date": "2015-10-16 20:44:01", "user": "MikeA", "post": "[ExtraVM](https://extravm.com) has started offering OpenVZ SSD VPS running on i7-4790K (4.0-4.4Ghz) processors starting at only $6 per month or $9 per quarter. We also offer KVM SSD VPS which run on E3-1230v3 processors. We provide only self-managed services. Both our OpenVZ and KVM plans are DDoS protected. Interested? Look at our new plans below.\r\n\r\n**Use the coupon \"LETi7\" for 10% off any OpenVZ plan for life**\r\n\r\n&gt; **512MB RAM** - $9.00 / quarterly&lt;br /&gt;\r\n&gt; 1 CPU Core (i7-4790K)&lt;br /&gt;\r\n&gt; 6GB Solid State Space&lt;br /&gt;\r\n&gt; 1,000GB Bandwidth&lt;br /&gt;\r\n&gt; 100Mbps Port&lt;br /&gt;\r\n&gt; 1 IPv4 Address &lt;br /&gt;\r\n\r\n&gt;**1GB RAM** - $6.00 / monthly&lt;br /&gt;\r\n&gt; 2 CPU Cores (i7-4790K)&lt;br /&gt;\r\n&gt; 15GB Solid State Space&lt;br /&gt;\r\n&gt; 2,000GB Bandwidth&lt;br /&gt;\r\n&gt; 100Mbps Port&lt;br /&gt;\r\n&gt; 1 IPv4 Address&lt;br /&gt;\r\n\r\nGo here to order: https://extravm.com/billing/cart.php?gid=11\r\n\r\n_Our OpenVZ plans go up to 100GB SSD space!_\r\n\r\nYou can also check out our KVM SSD VPS plans in our billing area. Our OpenVZ servers are hosted in Montreal, CA (OVH) and our KVM servers are hosted in Dallas, TX (Psychz). Have a question? Open a pre-sale ticket in the client area - https://extravm.com/billing/contact.php\r\n\r\n**FAQ**&lt;br /&gt;\r\n**Q:** Do you offer a money back period? **A:** We provide refunds within 72 hours of you purchasing the service if you're not happy&lt;br /&gt;\r\n**Q:** I don't know anything about linux, can you hold my hand? **A:** No! We provide self-managed services, but we can help with common problems or questions.&lt;br /&gt;\r\n**Q:** Why do you use OVH? I hate OVH. **A:** We use OVH for our OpenVZ plans ONLY as they provide a few very fast processors which some people prefer. We use Psychz in Dallas for our other services.&lt;br /&gt;\r\n**Q:** How long does setup take? **A:** Setup is usually within 2 minutes of receiving payment, if not, we will provide a refund if requested.&lt;br /&gt;\r\n**Q:** Can I buy more IPs? What about IPv6? **A:** Extra IPv4 are $1.50/m, IPv6 is free with our KVM VPS however IPv6 does not come with our OpenVZ VPS at this time.&lt;br /&gt;\r\n**Q:** What operating systems can I use for my OpenVZ server? **A:** We provide almost 30 different linux distributions for you to choose from.&lt;br /&gt;\r\n\r\nSounds good? Try us out.&lt;br /&gt;"}