{"id": 6769, "date": "2012-12-19 02:22:16", "user": "UGVPS", "post": "Dear LEB/LET,\r\n\r\n\r\nUGVPS has decided to start a sponsorship program to give back to the community! Everyone here has just been terrific and this is how we can show our gratitude to everyone. We will have 10 Sponsorships available to start, the bigger we get the more ill offer in the future :). \r\n\r\nRules:\r\n----------------------------------------------------------------------------------------------------------\r\n1. We will have an absolute zero tolerance for anything on our TOS/AUP page located here: www.ugvps.com/terms.php\r\nAnyone who violates those terms would result in instant termination. I think i've been pretty reasonable with them to begin with I've given a lot of people second chances.\r\n\r\n2. No Gameservers\r\n\r\n3. No IRC Servers\r\n\r\n4. IF you're going to put a website up on the Sponsored VPS a small linkback on the bottom of the page would be greatly appreciated but not required to keep your VPS.\r\n\r\n5. No TOR\r\n\r\n6. No Torrents\r\n\r\nNow that we got those out of way. Lets tell you how to get sponsored!\r\n----------------------------------------------------------------------------------------------------------\r\nAnyone may apply for this sponsorship there isn't any minimal requirements.\r\n\r\nTo apply for the sponsorship please email us: Sponsorship @ ugvps.com\r\n\r\nIn the email please include the following:\r\n\r\nYour Name:\r\nCountry of residence:\r\nLocation of the VPS if you are selected: Currently we are limiting them to our US locations only. Lenoir, Chicago, Los Angeles\r\nMost importantly, Why you need it and why we should pick you:\r\n\r\n\r\nVPS Specs:\r\n----------------------------------------------------------------------------------------------------------\r\nOpenVZ/SolusVM\r\nRam: 128MB\r\nBurst: 256MB\r\nDisk: 10GB\r\nBandwidth: 250GB\r\nIPv4: 1\r\n\r\nI wish everyone the best of luck! We will announce the winners of the sponsorship in this thread as it progresses. Currently, we are going to take as many apps as we can get by December 25th 2012. We will announce all the winners by January 1st 2013!\r\n\r\nThank you,\r\n\r\nCrystal"}