{"id": 68069, "date": "2015-11-10 05:26:17", "user": "joepie91", "post": "*(Somewhat delayed in posting this here, as I had to get posting access to the Offers section first.)*\r\n\r\nI've been doing [code review and tutoring for Node.js](http://cryto.net/~joepie91/code-review.html) for some time now, and it's been a while since the last promo - so here's a new one! It doesn't really get any cheaper than this anywhere :)\r\n\r\nI'll keep it short; this is what's on offer:\r\n\r\n* __5 hours__ of private tutoring, for __€150__ (ie. €30/hour), or\r\n* __10 hours__ of private tutoring, for __€250__ (ie. €25/hour)\r\n\r\nDuring these hours, I will help you out with whatever Node.js-related topics you want to learn about, no matter what it is or how complex it is - whether it's basic Javascript syntax, building a web application, working with asynchronous code, building distributed systems, writing command-line tools, deploying applications in production, or anything else. There's also not a single teaching method - I will adapt to whatever approach works best for you personally.\r\n\r\nThis offer is __valid until November 13__, but purchased hours __don't expire__, so you can schedule sessions whenever you want. This offer will also only last __for 40 hours in total__, across all buyers - after that, the normal price of €40 per hour applies. You can purchase any combination of hours within those limits, of course.\r\n\r\nThe practical bits:\r\n\r\n* Your timezone doesn't matter, as I can accommodate most schedules - just make sure to schedule two or three days in advance. Weekdays preferred, but weekends also possible.\r\n* The communication method used during tutoring is IRC or XMPP, whichever you prefer. I can help you setting up either of them, if needed.\r\n* GitHub Gist is used for code sharing, and where necessary, TeamViewer is also an option.\r\n\r\nPayment terms: You can pay through Bitcoin, PayPal, or SEPA. All payment is upfront (pre-paid), and to be eligible for this offer, you must complete your purchase __before November 13__. Payments made for this offer are __not__ refundable, whether in full or in part.\r\n\r\nAs my automated booking system isn't done yet, you can book through e-mail (admin@cryto.net), XMPP (joepie91@neko.im), IRC (joepie91 on Freenode), or through a PM here on LowEndTalk. Keep in mind that my IRC client doesn't always notify me of PMs, so the other methods are usually faster.\r\n\r\nIf you have any questions about the offer, you're always welcome to ask them - whether in this thread, or privately!\r\n\r\n---\r\n\r\nSome honest, unedited reviews from customers (as was requested in a previous offer thread):\r\n\r\n&gt; __[Josh Reeter](https://www.linkedin.com/profile/view?id=AAIAAADrdZoBirszLH4mrGjfn29MrnzeE1DWtPE):__ I reached out to joepie91 through IRC for help on reviewing my code, his confidence, open source contributions and experience within the language I was targetting was a great match for me. His mentorship has really helped improve the quality of my code through consistency and just a better understanding of concepts.\r\n\r\n&gt; __[Tejas Manohar](https://twitter.com/tejasmanohar):__ Sven is an incredibly talented developer that works with utmost diligence. He has thorough knowledge of Node.js platform along with the tools built on it and is really passionate about crafting the right implementation to solve most any problem at hand.\r\n\r\n&gt; __[Daniel Sauerbrun](https://github.com/dsauerbrun):__ I hired Sven (joepie91) to help me beat the learning curve for Node.js; I needed quick tutoring as I was building out a codebase from scratch for a startup. Not only was he an excellent tutor in helping me understand concepts instead of just giving me the answer, but he was also available for me pretty much whenever I needed him. I expected to need ~25 hours of his services; however, I have made so much progress with him that I can't seem to get past 10.\r\n\r\n&gt; __[Kaveh Khorram](https://www.linkedin.com/pub/kaveh-khorram/a9/354/b79):__ In about only 8 hours, Sven (joepie91) taught me about modularization, callbacks, working with third-party modules, correct variable use, express routes and promises just to name a few. Sven often went into overtime just to make sure I understood a topic, and always made sure I had a thorough understanding of the material before ending a session. Sven is one of the most, if not the most experienced NodeJS developers I've ever worked with."}