{"id": 6835, "date": "2012-12-21 14:35:19", "user": "Damian", "post": "Tired of poor quality of service from The Other Guys? Come to IPXcore! We have great service and great true 24/7 support; you'll love us!\r\n\r\nAs of this writing, we're currently in **6th place** out of 58 providers in the 2012 Q4 Top Provider poll! Thank you for the votes, LET! We're going to keep offering you awesome serivice!\r\n\r\nBe sure to check out our new and improved website! https://ipxcore.com/\r\n\r\nSome company info:\r\nWe've been up and running since May of 2011. We're running OpenVZ virtualization on our very own Dell, HP, and Supermicro -powered hardware.\r\nEach server node has it's own 100mbit connection. \r\nPast-30-days support ticket mean response time:  0 Day(s) 0 Hour(s) 23 Minute(s) and 56 Second(s)\r\n\r\nThis is an extremely limited offer! Act now!\r\n\r\n_**The offer:**_\r\n\r\nSpecial-256mb-Dec2012\r\n256mb of RAM\r\n32mb of vSwap\r\n10gb of disk space\r\n400gb of transfer\r\n1 IPv4 Address\r\nOpenVZ\r\nin Colocrossing @ Buffalo, NY, USA\r\n\r\n$2.27/month\r\n\r\nLink for order: &lt;a href=\"https://ipxcore.com/order/cart.php?a=add&amp;pid=66&amp;carttpl=modern3&amp;systpl=ipx3\"&gt;Click here!&lt;/a&gt;\r\n\r\nThis is a **_stock limited offer_**! Be sure to act quickly to ensure you get one!\r\n\r\nFYI: As outlined in the AUP/TOS ( http://ipxcore.com/aup-tos/ ), all new registrations MUST be made with verifiable postal address information. Repeating your province/state in the address fields will cause your account to be suspended til you update your account information. These plans are auto-verified with Maxmind; if you get auto-tagged for fraud, open a support ticket for resolution. All plans are also subject to manual verifications.\r\n\r\nYou are encouraged to exercise the trial period (utlined in http://ipxcore.com/aup-tos/, in the Billing section, and determine if this service will be right for you.\r\n\r\nTest IP: 198.144.190.10\r\nLooking glass with test files: http://carbon.ipxcore.com/lg/\r\n\r\nWe also do custom plans. Please contact us with your requirements."}