{"id": 68756, "date": "2015-11-18 21:50:14", "user": "HostMyBytes", "post": "![](http://hostmybytes.com/images/logo-white.png)\r\n\r\nStill buying your web hosting from humanized alligators and turkeys? Stop wasting your money this holiday season, and get a whole lot more for your hard earned dollars.\r\n\r\nThis holiday, treat yourself to something special from HostMyBytes. With our holiday bundles you can buy something for yourself and get a free gift to give to others! Go ahead you deserve a treat, and your friends deserve better hosting. \r\n\r\nWe won't tell if you keep it all for yourself.\r\n\r\n**HOLIDAY BUNDLE A - $4.49/month\r\n.... .- .--. .--. -.-- -....- .... --- .-.. .. -.. .- -.--\r\n1GB Cloud VPS Resource Pool + FREE GIFT 1GB Shared cPanel**\r\nDeploy up to 2 VPS instances anytime and anywhere across our four locations.\r\n1GB RAM / 1GB vSwap / 2 CPUs / 50GB Disk / 2TB Bandwidth / 2 IPv4\r\nFREE DDOS PROTECTION (in Phoenix, Montreal and Strasbourg)\r\nORDER NOW $4.49\r\n[link to: https://clients.hostmybytes.com/cart.php?a=add&amp;pid=131].\r\n\r\n**HOLIDAY BUNDLE B - $5.49/month\r\n-- . .-. .-. -.-- -....- -.-. .... .-. .. ... - -- .- \r\n2GB Cloud VPS Resource Pool + FREE GIFT 5GB Shared cPanel**\r\nDeploy up to 3 VPS instances anytime and anywhere across our four locations.\r\n2GB RAM / 2GB vSwap / 3 CPUs / 75GB Disk / 5TB Bandwidth / 3 IPv4\r\nFREE DDOS PROTECTION (in Phoenix, Montreal and Strasbourg)\r\nORDER NOW $5.49\r\n[link to: https://clients.hostmybytes.com/cart.php?a=add&amp;pid=132].\r\n\r\n**HOLIDAY BUNDLE C - $7/month\r\n.... .- .--. .--. -.-- -....- -. . .-- -....- -.-- . .- .-.\r\n3GB Cloud VPS Resource Pool + FREE GIFT 10GB Shared cPanel**\r\nDeploy up to 4 VPS instances anytime and anywhere across our four locations.\r\n3GB RAM / 3GB vSwap / 4 CPUs / 125GB Disk / 4TB Bandwidth / 4 IPv4\r\nFREE DDOS PROTECTION (in Phoenix, Montreal and Strasbourg)\r\nORDER NOW $7\r\n[link to: https://clients.hostmybytes.com/cart.php?a=add&amp;pid=134].\r\n\r\n**WHAT ARE CLOUD VPS RESOURCE POOLS** – Our OpenVZ Cloud Resource Pools are what\r\nothers call cloud. We give you a hefty allocation of resources that you can dice up into different VPSes on demand across our four locations. Unfamiliar with VPS Resource Pools? We have a page that explains them more:\r\nhttp://hostmybytes.com/resource-pools.php \r\n(Available in: 1. Phoenix, Arizona, USA 2. Jacksonville, Florida 3. Quebec, Canada 4. Strasbourg, France)\r\n\r\n![](http://hostmybytes.com/images/worldMap.png)\r\n\r\n**SHARED CPANEL **– Includes everything you need to get started today with web hosting + DNS + email + many more features. Yes, we will migrate your accounts for free from any other host that uses cPanel.\r\n(Available in: 1. Los Angeles, California, USA 2. Nuremberg, Germany 3. Maidenhead, United\r\nKingdon 4. Brisbane, Australia)\r\n\r\n**About HostMyBytes**\r\n\r\nHostMyBytes started selling hosting in 2014. We offer cheap web hosting from data centers around the planet. No matter where you are with your needs we have something for you; from entry level cPanel shared hosting all the way up to large resource KVM servers. We have dedicated servers available too! Contact us for pricing [link to: https://clients.hostmybytes.com/submitticket.php?step=2&amp;deptid=3].\r\n\r\n**Here are Five Reasons to Choose HostMyBytes**\r\n\r\n1. Care: We work hard to satisfy our valued customers\r\n2. Guarantee: 30-Day money back satisfaction guarantee for new customers\r\n3. Power: Xeon many core powered servers with RAID drive arrays\r\n4. Choice: Many locations to choose from\r\n5. Available: Customer Support with 24x7 coverage\r\n\r\nNeed something different? We can arrange custom packages to meet your needs. Let's talk about how HostMyBytes can serve you. \r\n[link to: https://clients.hostmybytes.com/submitticket.php]."}