{"id": 69302, "date": "2015-11-25 22:43:27", "user": "jar", "post": "&lt;img src=\"http://billing.mxroute.com/logo.jpg\"&gt;\r\n\r\n#Black Friday Sale  \r\n--  \r\n\r\nKicking this off a little early. For those of us celebrating Thanksgiving this week I hope you all have a great time with family :)\r\n\r\nFor those of you not familiar with MXroute, we provide email hosting for your domain at a reasonable cost, without stupid limitations.\r\n\r\nLet's face it, running your own mail server is a headache. Sure it's fun, and you should be interested in knowing how to do it. However, there are so often things outside of your control such as IP reputation. This has led people to spend a lot of money with solutions like Google Apps just for basic email hosting. I'm here to offer you an alternative.\r\n\r\nThis year we're doing something special for Black Friday. It may not be much, but my hope is that it encourages others to join in and give back as we near the holiday season. For each sale of the $10, $15, and $25 packages we will be donating $1 to the &lt;a href=\"http://wfp.org\"&gt;World Food Program&lt;/a&gt;. For sales of the $5 package, we will donate $0.50 per sale.\r\n\r\n(Note: This is not a tax deductible donation. You are paying us for the service and I will be making the donation in my name. If the packages are still available after the new year, donations on purchases will halt.)\r\n\r\nHere are our offers:\r\n\r\n**BlackFriday2GB**  \r\n2GB Storage  \r\nUnlimited Email Accounts  \r\nUnlimited Domains  \r\n$5/year  \r\nhttps://billing.mxroute.com/cart.php?a=add&amp;pid=41\r\n\r\n**BlackFriday20GB**  \r\n20GB Storage  \r\nUnlimited Email Accounts  \r\nUnlimited Domains  \r\n$15/year  \r\nhttps://billing.mxroute.com/cart.php?a=add&amp;pid=42\r\n\r\n**BlackFriday30GB**  \r\n30GB Storage  \r\nUnlimited Email Accounts  \r\nUnlimited Domains  \r\n$25/year  \r\nhttps://billing.mxroute.com/cart.php?a=add&amp;pid=43\r\n\r\nFinally, last year's Cyber Monday special is available to fill the gap:\r\n\r\n**CyberMonday**  \r\n10GB Storage  \r\nUnlimited Email Accounts  \r\nUnlimited Domains  \r\n$10/year  \r\nhttps://billing.mxroute.com/cart.php?a=add&amp;pid=29\r\n\r\nNOTE: There will be no upgrade or migration from existing plans. You will not be able to choose one of these and upgrade to another promotion at a later date. If you purchase this in replacement of an existing package, you must configure it as a new service."}