{"id": 74540, "date": "2016-01-30 18:05:20", "user": "ratherbak3d", "post": "&lt;img src=\"https://virtual6.net/images/logo2.png\"&lt;/img&gt;\r\n\r\n[EU/FR] Virtual6.net - 2GB KVM w/ 5TB on 1Gbps - Proxmox VE - Guaranteed vCPU - $5\r\n\r\nWelcome viewers to what is officially our lowest ever priced offer. It's valid for two weeks and if you've been considering giving us a go this is certainly the best time to make it happen.\r\n\r\n**What is KVM VPS hosting by Virtual6.net?**\r\n\r\nA KVM Virtual Server is a completely isolated environment capable of running its own kernel and file system. It's as close as you can get to a dedicated server, without the cost. You're guaranteed a share of the RAM, HDD and CPU on the physical machine, these resources are entirely reserved your usage. Powered by Linux, KVM and Proxmox VE 3.x.\r\n\r\nThe definition of hosting is to store (a website or other data) on a server or other computer so that it can be accessed over the Internet. At Virtual6 we offer three levels of hosting, each offers different features and different levels of isolation depending on your needs. If you're unsure on what you need, please contact us.\r\n\r\n&lt;ul&gt;\r\n&lt;li&gt;2GB Guaranteed RAM&lt;/li&gt;\r\n&lt;li&gt;100GB RAID-1 HDD&lt;/li&gt;\r\n&lt;li&gt;6.25% Guaranteed vCPU (4x2.66GHz Xeon)&lt;/li&gt;\r\n&lt;li&gt;5TB Monthly data transfer on 1000Mbps shared port&lt;/li&gt;\r\n&lt;li&gt;1x Dedicated IPV4 address included&lt;/li&gt;\r\n&lt;li&gt;Dedicated KVM over IP via VNC console and virtual media support&lt;/li&gt;\r\n&lt;li&gt;Cheap upgrades available; IP addresses, additional data transfer etc&lt;/li&gt;\r\n&lt;li&gt;Best effort availability (No SLA, but 100% uptime in 2015)&lt;/li&gt;\r\n&lt;li&gt;Proxmox VE 3.x control panel&lt;/li&gt;\r\n&lt;li&gt;Automatic DDOS detection and mitigation (No SLA)&lt;/li&gt;\r\n&lt;li&gt;Deployed and online within one business day subject to stock!&lt;/li&gt;\r\n&lt;li&gt;Datacenter location: France, Roubaix&lt;/li&gt;\r\n&lt;li&gt;Management: Self managed (Default)&lt;/li&gt;\r\n&lt;/ul&gt;\r\n\r\nRRP: £6.15 PCM\r\nLET Limited 2 week special: £3.51 PCM (Equivalent to $5 PCM at time of posting)\r\n\r\nSimply use promotion code LET!\r\n\r\n**Available Operating Systems**\r\n\r\nCentOS 6.7&lt;br&gt;\r\nCentOS 7.0&lt;br&gt;\r\nCentOS 7.0 with Webmin&lt;br&gt;\r\nDebian 8.1&lt;br&gt;\r\nownCloud in a box&lt;br&gt;\r\nUbuntu 15.04 Desktop&lt;br&gt;\r\nUbuntu 15.04 Server&lt;br&gt;\r\nWindows Server 2008 R2 (180 Day free license)&lt;br&gt;\r\nCustom ISO File&lt;br&gt;\r\n\r\n**Payment Methods**\r\n\r\nCurrently we accept BTC (Bitcoin) payments via Bitpay and visa debit or credit card via PayPal. You're order will be subject to our acceptance based on a number of factors. Please order using genuine details and avoid using a proxy or VPN, a residential connection at your billing address and a verified PayPal account payment is best.\r\n\r\n**Questions &amp; Customer Services**\r\n\r\nIf you have any questions at all please do not hesitate to contact us via &lt;a href=\"https://virtual6.net/whmcs/contact.php\"&gt;this page&lt;/a&gt;, for your convenience you can &lt;a href=\"http://virtual6.net/whmcs/knowledgebase.php?action=displayarticle&amp;id=1\"&gt;view our terms of services here&lt;/a&gt; too."}