{"id": 7827, "date": "2013-02-07 07:23:07", "user": "RFZack", "post": "\r\n\r\nRackFlux Internet Services has been around since 2006 (Started as TheUpstream Hosting Solutions) and offers a large range of hosting services. We offer shared/reseller hosting, VPS servers, game servers, voice servers and much more. Through the rest of 2012 and January 2013, enjoy 13% off per month on our already low prices.\r\n\r\nOur OpenVZ nodes use enterprise SATA drives in RAID 10 configurations, Dual Intel Xeon L5420 series processors, 16GB of RAM and gigabit uplinks.\r\n\r\nWe utilize SolusVM for our VPS nodes for management which allows customers full and easy web-based control over their server.\r\n\r\nWe currently accept PayPal, Google Checkout (Wallet), AlertPay (Payza), MoneyBookers (Skrill), Visa, MasterCard, American Express and Discover.\r\n\r\n--- 13% Off VPS Sale ---\r\n\r\nCoupon Code: vps13\r\n\r\nThis offer is recurring month-to-month for the life of your account.\r\n\r\n============ OpenVZ VPS Special Plans (Self-Managed) ============\r\n\r\n:-: OVZ-256 :-:\r\n* 1 vCPU\r\n* Dedicated RAM: 256MB\r\n* vSwap: 128MB\r\n* Disk Space: 25GB\r\n* Bandwidth: 250GB/mo\r\n* 100Mbit Uplink\r\n* IPv4 Addresses: 1\r\n\r\nRegular Monthly Cost: $4.50/month -- Order HERE!\r\nDiscounted Monthly Cost: $3.91/month!\r\n\r\n:-: OVZ-512 :-:\r\n* 2 vCPU\r\n* Dedicated RAM: 512MB\r\n* vSwap: 256MB\r\n* Disk Space: 50GB\r\n* Bandwidth: 550GB/mo\r\n* 100Mbit Uplink\r\n* IPv4 Addresses: 1\r\n\r\nRegular Monthly Cost: $8/month -- Order HERE!\r\nDiscounted Monthly Cost: $6.96/month!\r\n\r\n---- VPS Management Information ----\r\nAll VPS packages are self-managed, however, OS is installed automatically &amp; control panel we install free of charge by request. We do offer management service for VPS servers for a low monthly rate of $15/mo. Our Platinum Management service comes with basic ping/service port monitoring, OS/control panel configuration, server migrations, software firewall install &amp; configuration, basic security hardening, OS updates, software installations, Apache recompilations, and most other management tasks except for script/development work/debugging. We require you to have a support control panel in order to receive most of our management services, otherwise we reserve the right to limit the scope of work to certain areas of management.\r\n\r\n    24/7/365 Support +\r\n    Ticket/email based support is available 24/7/365.\r\n\r\n    Sales / Billing Support +\r\n    Feel free to email sales@rackflux.com at any time or use the live chat available on our website with any questions/concerns you might have with regards to our services.\r\n\r\n    Frequently Asked Questions +\r\n\r\nQ. Where are your servers located?\r\nA. Our servers are co-located inside Continuum Data Centers in Lombard, IL (outside of Chicago).\r\n\r\nQ. Can you provide test IP and file?\r\nA. You can ping or traceroute to our test IP: 64.79.109.254 Please contact us and we will provide you with one.\r\n\r\nQ. Are there any backups in place?\r\nA. We use RAID 10 on all of our VPS nodes, this protects your VPS in case of a hard drive failure on our nodes. Please remember that this does not protect against data loss due to user error (such as deleting files by accident). We strongly encourage our customers to keep offsite backups of their VPS servers, we cannot be held responsible for any data loss due to user error.\r\n\r\nQ. Which OSes are available?\r\n\r\nA. As we use OpenVZ for our virtualization technology, you can install the most common flavors of Linux. The list below, on our website page, and our order form is not complete and is just some of the popular OSes that our customers choose. Once inside of our VPS control panel, you have many more options and can rreinstall your VPS at your command. If you have a OpenVZ template of your own and would like us to add it to our list, just contact us.\r\n\r\nHere are some popular Linux distros available:\r\n\r\n    CentOS 5/6 (32 &amp; 64 Bit)\r\n    Debian 5/6 (32 &amp; 64 Bit)\r\n    Ubuntu 10.104/11.10/12.10 (32 &amp; 64 Bit)\r\n    Fedora 16/17 (32 &amp; 64 Bit)\r\n    OpenSUSE 12.2 (32 &amp; 64 Bit)\r\n\r\nQ. Are there any control panels available?\r\n\r\nA. Yes, we offer several control panel options such as cPanel (separate license required), DirectAdmin ($6/mo), ISPConfig (Free), Kloxo (Free) and we can usually install any other control panel desired (Best effort basis).\r\n"}