{"id": 8015, "date": "2013-02-14 21:36:47", "user": "HostVPS", "post": "[HostVPS](http://www.HostVPS.Net) is proud to offer to our first exclusive offer for the LET &amp; LEB community.\r\n\r\nThese new nodes were custom built with no expense spared for enterprise grade hosting services and use the latest Intel Xeon CPUs and Intel server main boards. Our nodes are all running 3Ware/LSI hardware RAID cards with BBU's installed with WD server grade / RAID spec hard drives.\r\n\r\n**HostVPS KVM 1024**\r\n\r\n• 2 CPU Cores\r\n• 1024MB RAM\r\n• 1024MB SWAP\r\n• 20GB RAID10 (HW+BBU)\r\n• 500GB Bandwidth (100Mbit Port)\r\n• 1 IPv4 Address\r\n• Optional VPS Management and Daily Backups\r\n• KVM/Proxmox VE\r\n• Free OS install and setup the same business day\r\n• £4.40 /Month \r\n• [Direct Signup](https://www.HostVPS.Net/cart.php?a=add&amp;pid=85)\r\n\r\n**HostVPS OpenVZ 1024**\r\n\r\n• 2 CPU Cores\r\n• 1024MB RAM\r\n• 1024MB V.Swap\r\n• 20GB RAID10 (HW+BBU)\r\n• 500GB Bandwidth (100Mbit Port)\r\n• 1 IPv4 Address\r\n• Optional VPS Management and Daily Backups\r\n• OpenVZ/Proxmox VE\r\n• Free OS install and setup the same business day\r\n• £4.40 /Month \r\n• [Direct Signup](https://www.HostVPS.Net/cart.php?a=add&amp;pid=84)\r\n\r\n\r\nHostVPS have been running Proxmox VE based nodes for years for both our company clients and our own web hosting services. For KVM &amp; OpenVZ VPS we find Proxmox VE is the best choice for data management (snapshot backups &amp; quick restores when needed) and offers full control over OpenVZ's and KVM's shared resources. \r\n\r\nHostVPS offer an enterprise grade VPS service at affordable prices. We offer a competitively priced VPS hosting service with a fast network and undersold servers that our clients can enjoy with the least amount of usage restrictions possible. \r\n\r\nAll HostVPS staff have a minimum of 10 years plus experience in hosting services, computer hardware and network engineering and focus on providing our clients with the best VPS hosting services possible.\r\n\r\nHostVPS have been providing high performance VPS hosting services since 2005 and web hosting, computer/server hardware repair, network engineering and I.T. consulting services since the nineties.\u2028\u2028We offer a 99.9% uptime guarantee on our services and accept payment by all major credit cards via PayPal, we offer 7 day money back guarantee on all our hosting services.\r\n\r\nOur network terms allow any legal usage that does not adversely affect other users on our nodes or network. For more information, please read [Our Terms](http://www.hostvps.net/terms-of-service.php) and [Usage Policy](http://www.hostvps.net/acceptable-usage-policy.php) or [Contact Us](https://www.hostvps.net/contact.php) for more information.\r\n\r\nHostVPS Network &amp; DC Information:\u2028\r\nWe have been operating our self-owned servers and network equipment from the BlueSquare data centre in Maidenhead, UK for several years now, since moving from our previous location in London Docklands.\r\n\r\nTest IP: 91.186.8.2\u2028\r\n[Speed Test [10MB]](http://www.HostVPS.Net/HostVPS-10MB.dat)\u2028\r\n[Speed Test [100MB]](http://www.HostVPS.Net/HostVPS-100MB.dat)"}