{"id": 81770, "date": "2016-04-22 00:32:53", "user": "Rob_T", "post": "Hello LET!  \r\n  \r\nVPS Hosting shouldn't be complicated. That's why we created [VP Easy](https://www.vpeasy.com). We offer 4 unmanaged VPS plans with simple yearly billing. All of our plans feature KVM virtualization (no RAM/Disk overselling), and are hosted on **enterprise grade** hypervisors featuring **dual Intel Xeon E5 CPU’s** and **pure SSD-powered  storage**.  \r\n  \r\nThis month, we’re celebrating our all new upgraded VPS Plans! We've increased storage across the board and have upgraded our hypervisor hardware, making our VPS plans more powerful than ever! Plus, through April 30, 2016, take an additional **50% off** our already low pricing for your first year of VPS hosting by using coupon code **April16** at checkout.\r\n  \r\n  \r\nStarter VPS:  \r\n---------------  \r\n1024MB RAM  \r\n25GB Pure SSD Storage  \r\n1 Xeon E5 CPU Core  \r\n1TB Bandwidth (monthly)  \r\n1 IP Address  \r\n  \r\n**Only $14 for your first year**  \r\nBilled at $28/yr after your first year  \r\n[Order Now!](https://www.vpeasy.com/billing/order/main/packages/VPS/?group_id=1&amp;package_id=5)  \r\n   \r\n   \r\nBusiness VPS:  \r\n---------------  \r\n2048MB RAM  \r\n50GB Pure SSD Storage  \r\n2 Xeon E5 CPU Cores\r\n2TB Bandwidth (monthly)  \r\n1 IP Address  \r\n  \r\n**Only $24 for your first year**  \r\nBilled at $48/yr after your first year  \r\n[Order Now!](https://www.vpeasy.com/billing/order/main/packages/VPS/?group_id=1&amp;package_id=6)   \r\n  \r\n   \r\n**FAQ:**  \r\n   \r\nQ: Who are you guys? How long have you been around?  \r\nA: VP Easy is a division of Versaweb - the guys who sell awesome, cheap dedicated servers. We've been around since 2004, and we've providing VPS hosting services through our other brands since 2008. We just recently launched VP Easy as our budget VPS brand.  \r\n   \r\nQ: What locations are available?  \r\nA: We are currently providing services from our West Coast datacenter in Las Vegas, Nevada. We'll be looking for an East Coast datacenter for expansion soon.  \r\n   \r\nQ: Do you have a test IP / File?  \r\nA: Sure! See our looking glass at http://104.143.15.254  \r\n   \r\nQ: Is there any kind of guarantee?  \r\nA: Buy it and try it for 7 days. if it sucks, we'll give you your money back (as long as you didn't do anything stupid, like SPAM).  \r\n   \r\nQ: How fast will you have my VPS online?  \r\nA: Most orders are provisioned within a few minutes of your payment being received. In some cases, however, we do perform a manual review of some orders to keep fraud to a minimum, which can delay provisioning. To avoid delays, we suggest that you do not use a proxy while ordering, and that the information for your billing method should match the information provided for your order.  \r\n   \r\nQ: Are these managed or unmanaged plans?  \r\nA: These VPS plans are unmanaged / self-managed. We'll try and help out where we can via our ticket system, but at the end of the day It's all you.  \r\n   \r\nQ: Do you offer Windows on these VPS plans?  \r\nA: We offer images for Windows Server 2008 Trial and Windows 2012 Trial.  We do not offer Windows licensing, so if you want to use the OS after the trial period expires, you would need to obtain your own license.  \r\n  \r\nQ: Who are your network providers?  \r\nA: Zayo, HE.net, and dozens of private peering arrangements. Check it out - [AS53340](http://bgp.he.net/AS53340)  \r\n   \r\nQ: Can I get IPv6?  \r\nA: Not yet, but soon. We promise. Our network is 100% v6 ready, but we're still testing out some of the new v6 features in SolusVM. Once we're happy, we'll roll it out at no added cost.  \r\n  \r\nQ: How does your DDoS protection work?  \r\nA: Our system automatically detects incoming attacks and null routes the targeted IP, thereby minimizing collateral damage and keeping you online even if you have virtual neighbors who aren't so nice.  \r\n   \r\nQ: How can I use my VPS? Any restrictions?  \r\nA: No TOR, no IRC, no torrents, nothing illegal, no SPAM, no DDoS attacks, etc. Basically, don't do anything stupid, and we'll all get along just fine.  \r\n   \r\nThanks for reading, and have a good day!"}