{"id": 8326, "date": "2013-02-26 08:27:22", "user": "rds100", "post": "This is an offer for small dedicated servers based on Atom N2800 (2 cores, 4 threads, 1.86GHz). There are many options to choose from, the lowest plan is $25 / month. 5 IPs available for free, read below. There is no long term contract.\r\n\r\nServers location: &lt;a href=\"http://maps.google.com/maps?q=varna,+bulgaria&amp;hl=en&amp;ll=42.682435,26.235352&amp;spn=16.337599,28.256836&amp;sll=37.0625,-95.677068&amp;sspn=35.219929,56.513672&amp;t=h&amp;hnear=Varna,+Varna+Province,+Bulgaria&amp;z=5\"&gt;Varna, Bulgaria&lt;/a&gt;\r\n\r\nSome background: Company name Telecoms Ltd., registered in it's current form since 1998. Operating own network - AS16154. RIPE LIR since 2000. Our main business is ISP.\r\n\r\nWe also own the &lt;a href=\"https://www.fitvps.com/\"&gt;FitVPS brand&lt;/a&gt;, the current offer for dedicated server will be handled under the same brand, in the future we will decide whether to create a separate brand or a separate company for the dedicated servers offers.\r\n\r\nThis is the initial offer for this plan, the stock is very very limited (only several available).\r\nHere is the link to the plan: https://www.fitvps.com/members/cart.php?a=add&amp;pid=19\r\n\r\nI will also throw in a little teaser / promotion for this offer - &lt;b&gt;order with 2GB RAM, get upgraded to 4GB RAM for free&lt;/b&gt;.\r\n\r\nFor this initial offer i will handle personally all orders. You should not order directly on the website, instead you PM me if you are interested.\r\nNormally we should do ID verification for the dedicated servers and i don't like this at all. So i am going to take personal responsibility for the few persons who will get this from the initial offer, however i also get to choose who can get it and who can't.\r\n\r\nRespected LET community members get preference.\r\nCurrent or past customers with account in good standing get preference.\r\nRegistered companies get preference.\r\n\r\nNow about the servers:\r\nUnfortunately not all HDD options are available for now, namely the 120GB SSD are not available due to stock shortages.\r\n\r\nHere is what the different HDD options currently means (not guaranteed to be the same in the future):\r\n\r\n&lt;table border=\"1\"&gt;\r\n&lt;tr&gt;&lt;td&gt;SSD 30GB&lt;/td&gt;&lt;td&gt;&amp;nbsp;A-DATA S396 30GB&lt;/td&gt;&lt;/tr&gt;\r\n&lt;tr&gt;&lt;td&gt;250GB 2.5\" 5400RPM HDD&lt;/td&gt;&lt;td&gt;&amp;nbsp;Seagate ST9250315AS&lt;/td&gt;&lt;/tr&gt;\r\n&lt;tr&gt;&lt;td&gt;750GB 2.5\" 7200RPM HDD&lt;/td&gt;&lt;td&gt;&amp;nbsp;Seagate ST9750420AS&lt;/td&gt;&lt;/tr&gt;\r\n&lt;tr&gt;&lt;td&gt;1TB Enterprise 3.5\" HDD&lt;/td&gt;&lt;td&gt;&amp;nbsp;Seagate constellantion ES ST1000NM011&lt;/td&gt;&lt;/tr&gt;\r\n&lt;tr&gt;&lt;td&gt;2TB 3.5\" HDD&lt;/td&gt;&lt;td&gt;&amp;nbsp;Seagate SV35 ST2000VX000&lt;/td&gt;&lt;/tr&gt;\r\n&lt;tr&gt;&lt;td&gt;3TB 3.5\" HDD&lt;/td&gt;&lt;td&gt;&amp;nbsp;Seagate SV35 ST3000VX000&lt;/td&gt;&lt;/tr&gt;\r\n&lt;tr&gt;&lt;td&gt;120GB SSD&lt;/td&gt;&lt;td&gt;&amp;nbsp;Intel 520 series (currently not available)&lt;/td&gt;&lt;/tr&gt;\r\n&lt;/table&gt;\r\n\r\nRemote power management is included (power OFF / power ON / power cycle).\r\nInstalls are automatic, via the NOC-PS system. We can help with the initial installation in case it is something not handled by NOC-PS.\r\nWindows is not available.\r\n\r\nThis plan comes with either 1 IP address or 5 IP addresses for free. However if you want more than 1 IP address a subnet will be assigned to you according to the RIPE rules, which means your name and other details will be publicly visible in the RIPE database. There is no privacy option for the RIPE database.\r\n\r\nI am sure there are many questions that i haven't thought of, so ask and i will try to answer.\r\n\r\nThis initial offer is exclusive to LET, it will not be posted anywhere else.\r\n"}