{"id": 84162, "date": "2016-05-24 18:32:21", "user": "ratherbak3d", "post": "![](http://i1.wp.com/virtual6.net/wp-content/uploads/2016/04/logo2.png?w=629)\r\n\r\n[EU/FR] Virtual6.net - KVM 2GB RAM &amp; 100GB HDD w/ 5TB BW @ 1Gbps = £3.63 PCM\r\n\r\nOffering real value for money our virtual machines in France are stacked high with dedicated resources, perfect for testing and development purposes or hobby projects, they’re stripped of support and everything is DIY via the VPS Management Interface, allowing us to offer excellent pricing on what we consider to be a very good service for the money paid. If you need support or a production ready environment, please kindly consider another option.\r\n\r\n**DDoS Protection – Included free of charge:**\r\n\r\nOur KVM VPS are protected by the OVH anti-DDoS infrastructure in order to protect your IP Addresses and domain(s) 24/7 against any type of DDoS attack, regardless of duration or size. A DDoS attack aims to render a server, service or an infrastructure unavailable by sending a multitude of simultaneous requests from multiple points across the internet. The intensity of this “crossfire” renders the service unstable, or even worse, unavailable.\r\n\r\n&lt;strong&gt;Support:&lt;/strong&gt;\r\n\r\nAll of our KVM VPS accounts include quality UK based support available during working hours to assist you with any billing, network or general service assistance, what we won't do is install the Operating System, configure the network or manage anything at an Operating System level. The services listed here are unmanaged.\r\n\r\n&lt;strong&gt;V6VS01&lt;/strong&gt;&lt;br&gt;\r\n2048MB RAM&lt;br&gt;\r\n100GB SATA RAID1 HDD&lt;br&gt;\r\n5TB Data Transfer PCM (1000Mbps)&lt;br&gt;\r\n4x Xeon 2.66GHz vCPU Core(s)&lt;br&gt;\r\n1x Dedicated IPv4 Address&lt;br&gt;\r\nProxmox VPS Management Interface&lt;br&gt;\r\nDatacenter: Roubaix, France&lt;br&gt;\r\nFree DDoS Protection&lt;br&gt;\r\nNo Service Level Agreement, Sorry!&lt;br&gt;\r\nUnmanaged Support c/w Root Access &amp; BIOS Level NoVNC&lt;br&gt;\r\nSetup Within 1x Business Day (Subject to manual approval)&lt;br&gt;\r\n£4.83 PCM (Includes any fees and charges)&lt;br&gt;\r\nUse promotion code \"H3PW435TJQ\" to get £1.20 OFF PCM for life!&lt;br&gt;\r\nhttp://virtual6.net/kvm-vps/&lt;br&gt;\r\nhttps://virtual6.net/whmcs/cart.php?a=add&amp;pid=1"}