{"id": 85590, "date": "2016-06-14 20:58:01", "user": "Rob_T", "post": "**Hello LET!**  \r\n  \r\nAt **[UltraVPS.com](https://www.ultravps.com)**, we have been providing high-quality VPS hosting services since 2008! Don't settle for less - buy from the best! Offer valid while supplies last or until August 30, 2015. Limit 1 discount VPS per customer. Discounted rate will be maintained for as long as the service is active.  \r\n  \r\nUltraVPS is excited to announce that ALL of our new SSD VPS plans feature fully dedicated CPU, RAM, Storage, and Network resources!  No more noisy neighbors, no more moving from node to node to get better performance!\r\n  \r\nDon't settle for having your VPS hosted on older, inferior hardware - check out our KVM node specs!  \r\n  \r\n**KVM Node Specs:**  \r\n   \r\nXeon E5-1660v3 CPU (8 x 3Ghz Cores + HT)  \r\nDDR4-2133 ECC Reg Memory  \r\nIntel NVMe PCIe SSD Storage  \r\n1Gbps Network Uplink  \r\n   \r\n[Click Here to view all of our new SSD VPS plans!](http://www.ultravps.com/ssd-vps.php)\r\n   \r\n   \r\n**UVPS-0.5**  \r\n----------  \r\n0.5 vCPU  \r\n2GB DDR4 RAM  \r\n25GB NVMe SSD Storage  \r\n1000GB Bandwidth  \r\nMonthly Billing: $7 per month with promotion code **LET30SUMMER16**    \r\n[Order Now!](http://www.ultravps.com/ssd-vps.php)  \r\n  \r\nLARGER PLANS ALSO AVAILABLE - VISIT HTTP://WWW.ULTRAVPS.COM FOR DETAILS!  \r\n   \r\nAdd a 40Gbps / 8Mpps DDoS Protected IP to any VPS for only $5/m! Learn more at http://www.ultravps.com/ddos.php  \r\n   \r\n   \r\n**FAQ:**\r\n   \r\nQ: Who are you guys? How long have you been around?  \r\nA: UltraVPS is a division of Versaweb - the guys who sell awesome, cheap dedicated servers. We've been providing VPS hosting services since 2008.  \r\n  \r\nQ: What locations are available?  \r\nA: We currently have capacity available in our Las Vegas, NV and Seattle, WA datacenters.  \r\n   \r\nQ: Is there any kind of guarantee?  \r\nA: Buy it and try it for 7 days. if it sucks, we'll give you your money back (as long as you didn't do anything stupid, like SPAM).  \r\n   \r\nQ: How fast will you have my VPS online?  \r\nA: Most orders are activated instantly. However, we do manually review some orders from new customers to keep fraud to a minimum, which allows us to keep our pricing low. In that case, usually we'll have you up within just a couple of hours. Once your account has been approved, subsequent orders are provisioned instantly.  \r\n   \r\nQ: Are these managed or unmanaged plans?  \r\nA: These VPS plans are unmanaged. We'll try and help out where we can via our ticket system, but at the end of the day It's all you.  \r\n \r\nQ: Do you offer Windows on these VPS plans?  \r\nA: We offer ISO images for Windows Server 2008 and 2012 180-day trial edition. We do not offer Windows licensing at this time.\r\n   \r\nQ: Do you have a test IP / test file?  \r\nA: Sure!  \r\n   \r\nLas Vegas Looking Glass: http://lg.las1.ultravps.net  \r\nSeattle Looking Glass: http://lg.sea1.ultravps.net  \r\n   \r\nQ: Can I get IPv6?  \r\nA: Not yet, but soon. We promise. Our network is 100% v6 ready, but we're still testing out some of the new v6 features in SolusVM. Once we're happy, we'll roll it out at no added cost.  \r\n   \r\nQ: How does your DDoS protection work?  \r\nA: Our system automatically detects incoming attacks and null routes the targeted IP, thereby minimizing collateral damage and keeping you online even if you have virtual neighbors who aren't so nice. We offer enterprise-grade DDoS MITIGATION too, for only $5/m per protected IP.  \r\n   \r\nQ: How can I use my VPS? Any restrictions?  \r\nA: No TOR, no torrents, nothing illegal, no SPAM, no DDoS attacks, etc. Basically, don't do anything stupid, and we'll all get along just fine.  \r\n   \r\nThanks for reading, and have a good day!\r\n"}