{"id": 86805, "date": "2016-07-02 03:17:26", "user": "timnboys", "post": "![](https://cubedata.net/img/cd-logo.svg)\r\n\r\nFirst we would like to thank Ishaq for approving us to post offers for our modules and jarland for being supportive of us/allowing us and giving us the chance to start with to post our Module Offers\r\n\r\nCubeData's opennebula provisioning module for blesta(and soon to come whmcs as well) now comes with opennebula v5 support!\r\n\r\nAs they say Difference Yourself out from the crowd and use a panel unheard of mainly since it isn't the copy/paste solusvm/whmcs virtualizor/whmcs template\r\n\r\nWe offer a monthly license for $7/month available here: https://www.cubedata.net/order/config/index/cart/?group_id=1&amp;pricing_id=5\r\n\r\nAnd we also offer a 5 day trial here: https://www.cubedata.net/order/config/index/cart/?group_id=1&amp;pricing_id=6\r\n\r\nowned licenses are 50% off until 07-03-2016 at 12am edt timezone(countdown clock indicating time left is on both pages indicating that.) for both our fraudrecord anti-fraud native fraud modules &amp; our opennebula provisioning module.(which hints that there are owned licenses for both modules but it is unable to posted here because it doesn't meet the pricing limits in the rules for offers though)\r\n\r\nNote our modules/plugins are ioncube encoded and require the latest non-beta ioncube loader(which as right now 07-01-2016) is v5 loaders.\r\n\r\nSorry but due to protecting our intellectual property there is no unencoded version available/and no version will be available that is unencoded or comes with source code we are sorry for the inconvenience.\r\n\r\nIf you wanted to brand yourself as a \"cloud\" provider opennebula is the definite open-source and free panel to do it with!\r\n\r\nAs opennebula is completely free &amp; open source making those licensing costs of solusvm/virtualizor disappear completely the only cost to you is the cost of the module itself!\r\n\r\nDifference yourself today! and become a non-cookie-cutter vps host today! And also cut the cord on all licensing costs besides the cost of the module itself today!\r\n\r\nas OpenNebula has no per-node license costs/and no cost at all! Free yourself from the burden of licensing costs for your vps panel today! Turn that saved money into money that stays in your pocket as a provider! \r\n\r\nExtended demo licenses are possible(no 30 day or bigger demo extended licenses though.)\r\nas up to 15 day demo extended licenses are possible any other's aren't."}