{"id": 87206, "date": "2016-07-08 00:31:22", "user": "perennate", "post": "&lt;a href=\"https://www.lunanode.com\"&gt;&lt;b&gt;Luna Node&lt;/b&gt;&lt;/a&gt; is a simple, reliable, and feature-packed cloud virtualization platform. We're based in Canada, and have locations in Toronto, Montreal, and northern France. With a powerful array of cloud features, from snapshots to tenant networks, our platform allows you to manage your servers with minimal effort. &lt;a href=\"https://dynamic.lunanode.com/signup\"&gt;&lt;b&gt;Sign up now!&lt;/b&gt;&lt;/a&gt;\r\n\r\n&lt;b&gt;Snapshots&lt;/b&gt;\r\n\r\nWith just a couple of clicks, you can snapshot your virtual machine. A snapshot is an image containing a consistent state of your VM's disk. Our snapshot system is built on qemu and libvirt live snapshotting technology, so no downtime is required to take a snapshot. Snapshots have two primary purposes:\r\n\r\n* Backup: in case something goes wrong (like a botched upgrade), you can restore an earlier version of your VM.\r\n* Cloning and Templates: you can create additional VMs that have the same software and perform the same function as an existing VM. We use cloud-init to perform any system reconfiguration when deploying from a snapshot, such as setting the hostname and resizing partitions.\r\n\r\nYou can download snapshots from the panel. Snapshots can also be replicated from one region to another.\r\n\r\n&lt;b&gt;Custom Images&lt;/b&gt;\r\n\r\nRight from our control panel, you can upload your own ISO images and qcow2 templates, and immediately begin provisioning VM instances from them. Use the browser-based noVNC client or your own desktop VNC client to complete installation from ISOs.\r\n\r\n&lt;b&gt;Tenant Networks and Load Balancers&lt;/b&gt;\r\n\r\nTenant networks are isolated virtual networks. Virtual machines provisioned on tenant networks can acquire any IP address in the assigned private subnet, enabling more complex network architectures.\r\n\r\nScalable load balancers can be created in tenant networks to balance TCP connections or HTTP requests between several VMs. You can define health monitors to periodically check on your VMs so that VMs are automatically disabled on the load balancer if a VM goes offline. Currently each load balancer will listen on one port.\r\n\r\n&lt;b&gt;Volumes&lt;/b&gt;\r\n\r\nVolumes are detachable block storage devices that are stored on our high availability Ceph RBD cluster. Volumes can be attached to and detached from virtual machines on demand; this means that, if you store application data on a volume, you can test a new version of the application on a new virtual machine, and commit the upgrade simply by detaching the volume from the old VM and attaching it to the new VM.\r\n\r\nThe &lt;a href=\"https://wiki.lunanode.com/index.php/Volume-backed_instance\"&gt;root partition can also be stored on a volume&lt;/a&gt; so that your instance does not depend on local storage; this way, if a host node fails, your VM will be quickly rebooted on another host node via an automatic evacuation process, avoiding downtime for hardware replacement.\r\n\r\nLike VMs, volumes can also be snapshotted, regardless of whether they are attached to a virtual machine. New volumes can be created from the volume snapshots. Volumes can also be converted to images, which can be downloaded, used to provision a VM with local stoarge, or replicated to another region.\r\n\r\n&lt;b&gt;Security Groups&lt;/b&gt;\r\n\r\nSecurity groups allow you to define ingress and egress traffic restrictions on groups of virtual machines. Unlike iptables and similar firewalls that run inside your VM, security groups are enforced at the infrastructure level and can be applied to multiple VMs; this removes the possibility of accidental firewall deactivation and simplifies firewall management.\r\n\r\n&lt;b&gt;Floating IPs&lt;/b&gt;\r\n\r\nWe use floating IPs, where external IP addresses are associated with internal IP addresses via 1:1 destination NAT. Using the control panel or the API, you can move floating IP addresses between virtual machines on the fly. So, if you want to failover from one VM to another in the same region, then you can perform an API call to move the external (floating) IP from the failed VM to the backup VM.\r\n\r\n&lt;b&gt;Other Features&lt;/b&gt;\r\n\r\nWe offer several more useful features:\r\n\r\n* &lt;b&gt;Uptime Monitoring&lt;/b&gt;: we developed an &lt;a href=\"https://github.com/lunanode/gobearmon\"&gt;open-source, fault-tolerant uptime monitoring application&lt;/a&gt; and provide it as a free service (excluding SMS and phone call notifications) that is configurable directly from our panel. Add HTTP, TCP, ICMP, and SSL certificate expiration checks so that you know when your application is down.\r\n* &lt;b&gt;API&lt;/b&gt;: our &lt;a href=\"https://wiki.lunanode.com/index.php/API\"&gt;powerful API&lt;/a&gt; allows you to write software to automate VM management.\r\n* &lt;b&gt;Bandwidth&lt;/b&gt;: although VM plans come with a fixed bandwidth allocation, we have a pay-as-you-go system for additional bandwidth, where additional traffic is $0.003/GB ($3/TB). You don't need to reserve bandwidth in advance, so you end up only paying for what you use. Additionally, the bandwidth allocation is accounted on a per-region basis, so extra bandwidth from some of your VMs can be used on other VMs.\r\n* &lt;b&gt;Startup Scripts&lt;/b&gt;: create shell or cloud-init scripts that are executed when newly provisioned VMs boot for the first time. When creating a new VM, you can select any number of startup scripts that you have defined on your account. Use startup scripts to automatically configure VMs for your application.\r\n* &lt;b&gt;Advanced DNS Hosting&lt;/b&gt;: our DNS service, which is free for up to one million queries per month, includes advanced monitoring and geo-targeting functionality. Couple records with our uptime monitoring system to failover from a failed primary server to a backup server, or to disable specific records in a round-robin group when a subset of servers go down.\r\n\r\n&lt;b&gt;VM Pricing&lt;/b&gt;\r\n\r\nAll VMs come with 1gbps external network connectivity with unmetered traffic on our internal network, and are billed hourly. We accept payments via credit card, Paypal, Bitcoin, or Interac e-Transfer.\r\n\r\nSSD plans are only available in Toronto, and SSD-cached plans are only available in Montreal and Roubaix.\r\n\r\n* &lt;b&gt;SSD 512&lt;/b&gt; - 512 MB RAM, 1 vCPU, 15 GB SSD RAID10 storage, 1000 GB bandwidth, $0.0063 hourly ($4.5 monthly)\r\n* &lt;b&gt;SSD 1024&lt;/b&gt; - 1024 MB RAM, 2 vCPU, 20 GB SSD RAID10 storage, 2000 GB bandwidth, $0.0097 hourly ($7 monthly)\r\n* &lt;b&gt;SSD 1024 (high-memory)&lt;/b&gt; - 1024 MB RAM, 1 vCPU, 15 GB SSD RAID10 storage, 1000 GB bandwidth, $0.0069 hourly ($5 monthly)\r\n* &lt;b&gt;SSD 1536 (high-memory)&lt;/b&gt; - 1536 MB RAM, 1 vCPU, 15 GB SSD RAID10 storage, 1500 GB bandwidth, $0.0083 hourly ($6 monthly)\r\n* &lt;b&gt;SSD 2048 (high-memory)&lt;/b&gt; - 2048 MB RAM, 1 vCPU, 20 GB SSD RAID10 storage, 2000 GB bandwidth, $0.0097 hourly ($7 monthly)\r\n* &lt;b&gt;HDD 512 MB&lt;/b&gt; - 512 MB RAM, 1 vCPU, 15 GB SSD-cached storage, 1000 GB bandwidth, $0.005 hourly ($3.6 monthly)\r\n* &lt;b&gt;HDD 1024 MB&lt;/b&gt; - 1024 MB RAM, 2 vCPU, 20 GB SSD-cached storage, 1500 GB bandwidth, $0.0072 hourly ($5.18 monthly)\r\n* &lt;b&gt;HDD 1024 MB (high-memory)&lt;/b&gt; - 1024 MB RAM, 1 vCPU, 15 GB SSD-cached storage, 1000 GB bandwidth, $0.0057 hourly ($4.1 monthly)\r\n* &lt;b&gt;HDD 1536 MB (high-memory)&lt;/b&gt; - 1536 MB RAM, 1 vCPU, 15 GB SSD-cached storage, 1500 GB bandwidth, $0.0072 hourly ($5.18 monthly)\r\n* &lt;b&gt;HDD 2048 MB (high-memory)&lt;/b&gt; - 2048 MB RAM, 1 vCPU, 20 GB SSD-cached storage, 2000 GB bandwidth, $0.0083 hourly ($6 monthly)\r\n\r\n&lt;a href=\"https://www.lunanode.com/pricing\"&gt;&lt;b&gt;See full plan list here.&lt;/b&gt;&lt;/a&gt;\r\n\r\n&lt;b&gt;Locations&lt;/b&gt;\r\n\r\n* Toronto (245 Consumers Rd 300 Toronto; Cogent DC): 38.110.117.201 / http://toronto-test.lunanode.com/100MB.test\r\n* Montreal (OVH BHS): 167.114.196.211 / http://montreal-test.lunanode.com/100MB.test\r\n* Roubaix, France (OVH RBX): 51.254.227.19 / http://rbx-test.lunanode.com/100MB.test\r\n\r\n&lt;b&gt;About&lt;/b&gt;\r\n\r\nBased in British Columbia, Canada, LunaNode Hosting Inc. first launched in August 2013, focusing on low-cost, reliable KVM virtual private server hosting. We use OpenStack for our back-end and an in-house billing / VM management panel called lndynamic on the front-end. We are committed to security and &lt;a href=\"https://www.lunanode.com/privacy\"&gt;privacy&lt;/a&gt; and believe in the necessity of free software (&lt;a href=\"https://github.com/LunaNode/\"&gt;see our GitHub profile&lt;/a&gt;). Our staff consists of experienced developers, system administrators, and network engineers; we are constantly monitoring and improving our infrastructure to ensure maximal uptime, and developing new tools to help you better manage your virtual machines.\r\n\r\nUpload your PGP key to https://lunanode.com/gpgmw to receive encrypted email from our mail server.\r\n\r\n&lt;b&gt;Links&lt;/b&gt;\r\n\r\n* &lt;a href=\"https://dynamic.lunanode.com/info\"&gt;More Information&lt;/a&gt;\r\n* &lt;a href=\"https://www.lunanode.com/terms\"&gt;Terms of Service&lt;/a&gt;\r\n* &lt;a href=\"https://www.lunanode.com/privacy\"&gt;Privacy Policy&lt;/a&gt;\r\n* &lt;a href=\"https://wiki.lunanode.com/\"&gt;Wiki&lt;/a&gt;\r\n* Contact us: sales@lunanode.com\r\n* &lt;a href=\"https://dynamic.lunanode.com/signup\"&gt;Sign Up&lt;/a&gt;"}