{"id": 8750, "date": "2013-03-12 21:04:55", "user": "AlexBarakov", "post": "Hey guys,\r\n\r\nHaven't posted an offer for a while, so I thought I could post one up and ley you know about some of the upcomings and new things the past month.\r\n\r\nFirst, the usual 2GB offer in Seattle, LA and Lenoir (which is nearly out of stock)\r\n\r\n&gt;2GB – Special\r\n2GB RAM\r\n512MB vSwap\r\n60GB Disk Space\r\n800GB Bandwidth\r\n1 IPv4 Address\r\nOpenVZ/SolusVM\r\n$7/Month\r\nhttps://liquid-solutions.biz/clients/cart.php?a=add&amp;pid=104 - LA\r\nhttps://liquid-solutions.biz/clients/cart.php?a=add&amp;pid=102 - Seattle\r\nhttps://liquid-solutions.biz/clients/cart.php?a=add&amp;pid=103 - Lenoir\r\n\r\nNow, the lowend plans starting from 10.50 per year, Seattle only:\r\n\r\n&gt;L0\r\n64MB RAM\r\n64MB vSWAP\r\n5GB HDD\r\n80GB Bandwidth\r\n1 Ipv4\r\n100mbps port\r\nOpenVZ\r\n10.50$ per year\r\nhttps://liquid-solutions.biz/clients/cart.php?a=add&amp;pid=106\r\n\r\n&gt;L1\r\n96MB RAM\r\n96MB vSWAP\r\n8GB HDD\r\n130GB Bandwidth\r\n1Ipv4\r\n100mbps port\r\nOpenVZ\r\n12.00$ per year\r\nhttps://liquid-solutions.biz/clients/cart.php?a=add&amp;pid=107\r\n\r\n&gt;L2\r\n128MB RAM\r\n128MB vSWAP\r\n12GB HDD\r\n180GB Bandwidth\r\n1Ipv4\r\n100mbps port\r\nOpenVZ\r\n13.50$ per year\r\nhttps://liquid-solutions.biz/clients/cart.php?a=add&amp;pid=108\r\n\r\n&gt;L3\r\n256MB RAM\r\n128MB vSwap\r\n20GB Disk Space\r\n150GB Bandwidth\r\n1xIPv4 Address\r\nOpenVZ/SolusVM\r\n$15/year\r\nhttps://liquid-solutions.biz/clients/cart.php?a=add&amp;pid=99\r\n\r\nNow about the new features and upcommings this month:\r\n\r\nI've finished testing and I'm finally ready to release the filtered IPs for Seattle, the pricing is 5$ per month or 36$ per year. Currently, requests for additional resources (Including the filtered IPs) are handled manually, through opening a ticket, as I am not yet used to WHMCS's automatic upgrades option and TBH, not absolutely sure how to get it to automatically asign IPs from different IP block. The protection is remote (GRE tunneled to our nodes) and would filter up to 10gbps of incomming DDoS, however no guarantees or SLA is provided for this at this point, once the attack exceeds the protection we can offer, the IP will get automatically nullrouted, untill the attack is stoped. It consists of network-level protection, some custom rules requested by me and a bit of software-level protection, tweaked by me. We have a long way to walk, however even at this point - it successfully passed my tests and would be enough to protect yourself from script-kiddies :)\r\n\r\nI'm in the final stages of testing out the free FTP space that we are about to provide to our clients and the free DNS services, hopefully I will finally be ready to roll them out this workweek. Of course - for free for our users.\r\n\r\nThird - the new website is finally online with some minor resource upgrades for our normal plans. Any feedback is welcome on that! A special page for LEB/LET offer is also live on our website now: http://liquid-solutions.biz/leb.html\r\n\r\nFourth - I've started preparing a small wiki for our clients, which will include some of the most common questions and topycs for setting up different software, however got no ETA on finishing this.\r\n\r\n**Some Test IPs:**\r\nLenoir, North Carolina: 199.241.190.99 @ DaCentec\r\nSeattle, Washington: 198.23.149.3 @ ColoCrossing\r\nLos Angeles, California: 198.23.250.135 @ ColoCrossing\r\n\r\nAlexander"}