{"id": 92549, "date": "2016-09-26 03:54:12", "user": "vpsnine", "post": "[VPSNINE](https://www.vpsnine.com) is a virtualization company\r\nspecializing in linux VPS Hosting. Offering high quality VPS's with\r\nprofessional support.\r\n\r\nCurrently offering 30% off with promo code LET0516A for the following\r\nlocations: Singapore, Hong Kong, Auckland New Zealand, Cape Town South\r\nAfrica, New York City USA , Germany and Zurich Switzerland.\r\n\r\nHost your Singapore VPS with us and enjoy the best possible\r\nreliability, speeds and peering in the Asian region. We host our\r\nservices at Internap, one of the best connected data centeres in\r\nSingapore. Internap provides optimized routes to Southeast Asia,\r\nAustralia and China and have preferred interconnection options with\r\nEquinix, Keppel Digihub, KDDI and GlobalSwitch.\r\n\r\nFor NYC we are located in the same data center building as Google New York.\r\n\r\nIn New Zealand we are located at \"The Data Center\", one of the best\r\nand most connected data centers in Auckland.\r\n\r\nUse our locations tool to check out our great connectivity world wide.\r\n\r\nCustom OpenVZ VPS from $7 with our 30% discount code LET0516A\r\n256MB RAM, 30GB Disk, 400GB Bandwidth, 1 Core\r\n[Order Now](https://www.vpsnine.com/forms/form0.php?pid=46)\r\n\r\nFor more details on our locations see\r\n[https://www.vpsnine.com/hosting/locations.php](https://www.vpsnine.com/hosting/locations.php)\r\n\r\nPay via Paypal, BitCoin, Skrill, Perfect Money, OKPay or Payza\r\n\r\n**14 Day Moneyback Guarantee**\r\nIf your unhappy with our service for any reason at all within 14 days\r\nwe'll refund your money! No questions asked. Just log a billing ticket\r\nrequesting a refund with a breif reason just so we know what we did\r\nwrog.\r\n\r\n**TESTS:**\r\nSee our location pages https://www.vpsnine.com/hosting/locations.php\r\n\r\n\r\n**Contact us :**\r\n* E-mail address: **sales@vpsnine.com**\r\n* VPSNine Website [https://www.vpsnine.com Linux VPS\r\nHosting](https://www.vpsnine.com)"}