{"id": 99528, "date": "2016-12-12 14:46:54", "user": "launchvps", "post": "&gt; Happy Holidays from LAUNCH VPS! We are very happy to extend new offers to the LET community for the first time!\r\n\r\n\r\n*LAUNCH VPS offers high-end, performance optimized SSD virtual servers.*\r\n\r\n\r\nFounded in 2014 and based in the Philadelphia suburbs, we strive to build and support high quality, cost-effective hosting solutions for our customers. We have over a decade’s experience in the hosting industry in the field of virtualization, cloud, and application hosting.\r\n\r\n\r\nIn addition to high-quality infrastructure, we have a distinct passion for assisting and enabling our customers. Our main objective is to offer a solid foundation, very flexible options and customizations, and incredibly helpful support. We feel this combines to offer our customers a superior experience which benefits their relationship to their end-users and clients.\r\n\r\n\r\nWe want to make it easy to try our robust hardware platform, reliable network, and easy to use management features by offering exclusive yearly and monthly plans for the LET community below! \r\n\r\n\r\nThere is nothing to lose with our 45-day no questions asked refund!\r\n\r\n\r\n# Infrastructure\r\n\r\n\r\nWe own our hardware running in a Philadelphia datacenter consisting of:\r\n\r\n\r\n* Supermicro Pro servers\r\n* Fast DDR4 RAM\r\n* SSDs in RAID 10 w/ BBU for ~1Gbps I/O\r\n* Hexa-Core E5-2620 v3 CPUs\r\n* A+B Power\r\n* BGP Blended redundant network. \r\n\r\n\r\n# Features\r\n\r\n\r\nAdditionally, our single inclusive control panel is fully functional including:\r\n\r\n\r\n* HTML5 Console\r\n* Power Options\r\n* Boot Options\r\n* Snapshots\r\n* Backups\r\n* ISO Library\r\n* Usage Graphs\r\n* Upgrades/Downgrades\r\n\r\n\r\nFinally, we also offer free DNS management services with DNSSEC support backed by PowerDNS!\r\n\r\n\r\n# Plans\r\n\r\n\r\n## 256 MB KVM (Promocode: LEB256MBKVMYR)\r\n\r\n\r\n* 256 MB RAM\r\n* 1 CPU Core\r\n* 15 GB SSD Disk\r\n* 500 GB Bandwidth\r\n* 100 Mbps Uplink\r\n* 1 IPv4 &amp; 1 IPv6\r\n* rDNS Available\r\n\r\n\r\nPrice: $18.95 per year with promo! $37.80 per year regularly.\r\n\r\n\r\n[Order Now!](https://cp.launchvps.com/cart.php?a=add&amp;pid=35&amp;promocode=LEB256MBKVMYR&amp;billingcycle=annually)\r\n\r\n\r\n`Promotional discount will be shown after the \"Continue\" button is clicked.`\r\n\r\n\r\n## 2 GB KVM (Promocode: LEB2GBKVM65)\r\n\r\n\r\n* 2 GB RAM\r\n* 4 CPU Core\r\n* 75 GB SSD Disk\r\n* 3 TB Bandwidth\r\n* 100 Mbps Uplink\r\n* 1 IPv4 &amp; 1 IPv6\r\n* rDNS Available\r\n\r\n\r\nPrice: $6.95 per month with promo! $20.00 per month regularly.\r\n\r\n\r\n[Order Now!](https://cp.launchvps.com/cart.php?a=add&amp;pid=28&amp;promocode=LEB2GBKVM65)\r\n\r\n\r\n`Promotional discount will be shown after the \"Continue\" button is clicked.`\r\n\r\n\r\n# Guarantees\r\n\r\n\r\n* *45-Day Money Back*: No questions asked! Ever. If for any reason you are not satisfied with your service, just let us know and we will issue you a refund. No hassles!\r\n* *99.99% Uptime*: If for any reason we do not meet this level of service, you will receive a credit for the amount of downtime incurred!\r\n* *Optimal Performance*: Brand new purpose built systems with host customizations to provide the fastest, most robust performance possible. \r\n* *12-Hour Ticket Response*: We hold a 100% satisfaction rating with our customers! We generally respond within minutes, but you can always count on receiving a personalized response within 12 hours or sooner!\r\n\r\n\r\n# Test IP\r\n\r\n\r\nPhiladelphia, PA (PHL1): http://76.8.63.151/100-mb-test-file\r\n\r\n\r\n# Payment\r\n\r\n\r\nWe accept all major credit cards, Paypal, and Bitcoin for payment.\r\n\r\n\r\n# Additional Information\r\n\r\n\r\n* [FAQ](https://cp.launchvps.com/knowledgebase/9/FAQ.html)\r\n* [Terms of Service](https://launchvps.com/tos.html)\r\n* [Ask a Question](https://cp.launchvps.com/submitticket.php?step=2&amp;deptid=1)\r\n\r\n\r\n&gt;Thank you for your interest and please reach out to us if there are any questions!!"}