{"id": 100311, "date": "2016-12-19 16:42:42", "user": "ArubaCloud", "post": "If you need a more flexible and customisable service in terms of hosting solutions, on Cloud.it you can create a Cloud server in a matter of seconds, on a high-reliability structure with guaranteed uptime (https://www.cloud.it/termini-condizioni.aspx)\r\n\r\nTo create a Cloud Server from the Control Panel, once registered, select one of the 6 data centers available in Europe (DC1 in Italy is the default) and then click on the button \"Create New Cloud Server\"\r\n\r\nDuring the Cloud Server creation phase you can choose between a PRO Cloud and a Smart Cloud server:\r\nPRO Cloud : recommended for production systems, based on highly redundant infrastructure and with guaranteed performance, charged at an hourly rate and enabling you to choose and modify the resources (vCPU, RAM and disk) autonomously at any time via the control panel.\r\n\r\nSmart Cloud : replacing the old-style Virtuozzo-based VPS, suitable for developers and with monthly tariffs, they offer extremely good value for money. Available in 4 standard sizes, from S to XL (from 1 vCPU, 1Gb RAM, 20GB disk to 4 vCPU, 8Gb RAM and 160 disk, all SSD). \r\n\r\nFor details of sizes available:\r\nhttps://www.cloud.it/vps/vps-hosting.aspx\r\n\r\nand the differences between PRO Cloud and Smart Cloud:\r\nhttps://www.cloud.it/cloud-computing/caratteristiche.aspx\r\n\r\nThe details required for activation are:\r\n\r\n- Name of server\r\n- Administrator password (root or administrator depending on the operating system)\r\n- Amount of vCPU, RAM and disk in the case of PRO, or Size in the case of Smart)\r\n- Template \r\n\r\nThe Template is the image from which the server will be created and includes the operating system (Linux or Windows) and in many cases also preinstalled applications or services. These can include web servers (also with Plesk panel), mail servers, databases, Firewalls and also an environment with Wordpress ready to use.\r\n\r\nhttp://kb.cloud.it/computing/schede-template/template.aspx\r\n\r\nWithin minutes the server will be active and accessible via your public IP for exclusive use\r\n\r\nYou can request a free voucher worth 10 Euros to try out the service:\r\n\r\nhttps://www.cloud.it/prova-cloud-aruba.aspx\r\n\r\nFor further information, visit our Knowledge Base: you can find the full procedure at http://kb.cloud.it/computing/creare-e-configurare-un-cloud-server.aspx. Alternatively, our Customer Care team will be happy to help."}