{"id": 10257, "date": "2013-05-06 19:38:00", "user": "Eased", "post": "**Visit our website:** http://www.zap5.net\r\n\r\nZap5 Networks is a recognized premier provider of strategic IT services designed specifically for small and mid-tier organizations.\r\n\r\nZap5 Networks solution-based services allow our clients and partners the opportunity to achieve their goals contiguously in web design, web development, IT infrastructure, network solutions, and project management. Zap5 Networks sets itself apart in the marketplace through service excellence, flexibility, business value, and passion for our customer’s success.\r\n\r\n**All VPS's include:**\r\n- VMware Powered\r\n- Basic Management (Add full management for only $35/mo)\r\n- 99.9% Uptime SLA\r\n- 24 Hour Setup Time!\r\n- Choice of OS including most Linux Distributions or Windows!\r\n- Control Panel Choices: cPanel, DirectAdmin, or Plesk\r\n- Located in New York, NY (USA)\r\n\r\n*** Prices below do not reflect discounts *** What you see below is default pricing without any promotions.\r\n\r\n**512MB VPS**\r\nvCPU: **1 Core @ 3.40GHz**\r\n**20GB** Disk Space\r\n**512MB** vRAM (Dedicated)\r\n**500GB** Transfer @ 1000Mbps\r\n1 IPv4 IP Address\r\nMonthly: **$7/mo**\r\n[CLICK FOR MORE INFORMATION!](http://www.zap5.net/2/services/vmware-vps-servers/)\r\n\r\n\r\n\r\n**More Information:**\r\n\r\nPayment Methods: PayPal and Credit Card (Visa, MasterCard and AMEX)\r\n\r\nQ: What operating systems do you offer?\r\nA: Our systems allow almost any operating system to be installed. However, on hand we are capable of pre-installing your server with: CentOS, Ubuntu, Oracle Solaris, CloudLinux*, Windows 7, Windows 8, Windows Server 2008 R2, and Windows Server 2012.\r\n\r\nQ: Do you have a refund policy?\r\nA: If you are unhappy with your hosting account with us for any reason or just wish to close the account at anytime during the first 7 days, you will get a refund of all hosting fees paid, less any setup fees.\r\n\r\nQ:Are there any contracts?\r\nA:There is no contract to keep you hosted at Zap5 Networks. You have the option to pay month to month and cancel at any time. We offer discounts if you pay for more than a year at a time, even if you pay in advance there is no contract to keep hosted with Zap5 Networks. The only contract you are obligated to follow is our AUP and TOS.\r\n\r\n**Questions?** Please contact us!\r\n**Visit our website:** http://www.zap5.net"}