{"id": 113499, "date": "2017-05-08 03:28:02", "user": "SplitIce", "post": "[![](https://www.x4b.net/img/marketing/red-1.png)](https://www.x4b.net)\r\n\r\n[X4B DDoS Protection](https://www.x4b.net/) is proud to announce that we are almost ready to launch our next generation Anycast DDoS Protection product. We are seeking your help and feedback.\r\n\r\n## The terms, how do I enrol?\r\n\r\nShoot me a PM or Reply here and I'll add you to the list. Once there is a slot available. I will create you a service expiring in 14-days. Provide some feedback and this will be extended by an additional 46-days free of charge (2 months FREE).\r\n\r\nFeedback can be as simple as \"I setup X, no problems\" but we would prefer as much information as you can offer :) Please be honest in your report, we need to fine tune our product.\r\n\r\nThe beta service setup will be a 50GB clean bandwidth service unless you request more. \r\nDuring the Beta period we are limiting mitigation to 100Gbps, however upon renewal outside of the Beta window you will receive an upgrade.\r\n\r\n\r\n## AS136165: The network\r\n\r\nCurrent PoPs:\r\n\r\n - Amsterdam, Netherlands\r\n - London, United Kingdom\r\n - Dallas, TX, USA\r\n - Los Angeles, CA, USA\r\n - Asburn, VA, USA\r\n\r\n \r\nTest IP / Looking Glass: https://lg.x4b.net/ (103.77.224.2)\r\n\r\n\r\n## The 20 Questions:\r\n\r\n**Why Anycast?**\r\n\r\nAn anycast network is more redundant, and fault resilient than a regular single PoP network. By announcing in multiple distinct locations we gain redundancy against network and server failure. In the events of most interruptions the PoP can fall offline without any interrupting existing connection by way of failover to the next closest PoP (until the failing PoP is restored).\r\n\r\nAnycast also allows for an increase in Mitigation capacity (particularly Layer 7) and overall throughput per service.\r\n\r\n**Is this more complicated than a regular filtered service?**\r\n\r\nThere are a few more knobs available, however we hope to make this as easy to use as our regular services. We will keep working based on feedback and planned features to make this so throught the beta period.\r\n\r\nAnycast Documentation is currently being written and will be rolled out after the beta period.\r\n\r\n**Can I point one or more Anycast PoP at a single server?**\r\n\r\nYes you can select which Anycast PoP should be forwarding to each defined backend. \r\n\r\n**Can each PoP communicate with my server direct?**\r\n\r\nYep.\r\n\r\nOptionally with GRE Tunnelling you can also choose to have all PoPs pointed at a single backend, and for that backend to communicate with the appropriate PoP all via a single internal IP address; or you can define only a single tunnel (the choice is yours!)\r\n\r\n**This is an Anycast IP, can I connect out?**\r\n\r\nWe have worked hard to build a solution that is able to function in every way like a regular Remote Protection service. With a GRE tunnel you can make outgoing connections. There may be a small delay for the first few packets while we create an optimized route through the network.\r\n\r\n**How can I continue after the beta period?**\r\n\r\nWe are after feedback and bug reports, send me a PM with your username and some feedback and you will be able to continue using the Anycast service for a special offer of $7/month (including the protected IPv4, and all backend IPs). Additional bandwidth at a reasonable cost, I'll try and work something out for you. Any special offers made are non-transferable unless otherwise stated (sorry).\r\n\r\n**What about Support?**\r\n\r\nDuring the beta period support is best effort, paying customers will be prioritized over Anycast beta services. You may be able to get quicker support from the community by asking in this thread for certain types of questions.\r\n\r\n## The Technical Stuff\r\n\r\nFeaturing:\r\n\r\n - Redundant internal backhaul, resilient against communication failures\r\n - Internal Mesh network, ingress traffic at one PoP and egress it at another (no complex configuration required!) \r\n - Direct Server Return (DSR) from the first filtering hop wherever possible for minimal latency\r\n - Able to handle all kinds of PoP switches, rejoins and splits without interruption\r\n - Support for tunnels to one or more filtering PoPs (with or without BGP) for redundancy\r\n - China Telecom optimized routes in L.A\r\n - Multihomed w/ Telia and Tinet and Peering"}