{"id": 114448, "date": "2017-05-18 06:41:39", "user": "rectified", "post": "**We are back with a LET Special 50% Discount - Coupon code \"RO3QNI7KAP\" on annual payments and FLAT 20% recurring discount on monthly and other payment cycles - Coupon code \"8X52VE1DXC\"**\r\n\r\nThese coupons are for limited orders only, so hurry and order now &lt;br&gt;\r\n\r\nWe are accepting limited orders for FLAT 50% coupon so if it does not works it means we that coupon is not available anymore but you can still avail the 20% coupon it is valid on all billing cycles Coupon code \"8X52VE1DXC\"&lt;br&gt;\r\n\r\nThanks to all our loyal customers, we have now added a 7th VPS Node, it is also setup in our LA facility with Asia/China Optimized Network.\r\n\r\nVPS Starting at just $2/month in LA, USA using KVM with SolusVM Control Panel Virtualisation and ASIA/CHINA Optimised IP and we use RAID 10 based SSD Drives no HDD, only pure SSD and even includes Free DDOS Protection of upto 20Gbps.&lt;br&gt;\r\n\r\nAll our VPS Nodes are on Dedicated Gigabit Port and all VPS are capped at 100Mbit unmetered data transfer, you may notice in control panel that it shows 30TB as Bandwidth limit, but 30TB is the max anybody can use on a 100Mbit Port hence it shows 30TB.&lt;br&gt;\r\n\r\nTest IP for checking latency - 104.160.176.227&lt;br&gt;\r\n\r\n\r\n**$24.99/year or $3.99/month**   - VPS Features (1 GB RAM) USE COUPON - 8X52VE1DXC for monthly payment and Coupon RO3QNI7KAP for annual payments to get 50% discount&lt;br&gt;\r\n\r\nCPU Core: 1&lt;br&gt;\r\nRAM: 1 GB&lt;br&gt;\r\nDisk Space: 10 GB SSD&lt;br&gt;\r\nBandwidth: Unmetered&lt;br&gt;\r\nOS: Linux / FreeBSD*&lt;br&gt;\r\nIPv4: 1 (Additional IPV4 available for $1 per IP per month)&lt;br&gt;\r\nIPv6: 1 (Free additional ipv6 available on request)&lt;br&gt;\r\nRDNS: Yes&lt;br&gt;\r\nControl Panel: Yes&lt;br&gt;\r\n\r\n[Order Now](https://secure.rectified.net/cart.php?a=add&amp;pid=137)&lt;br&gt;\r\n\r\n**$32.5/year or $5.6 per month** - VPS Features (1.5 GB RAM) USE COUPON - 8X52VE1DXC for monthly payment and Coupon RO3QNI7KAP for annual payments to get 50% discount&lt;br&gt;\r\n\r\nCPU Core: 1&lt;br&gt;\r\nRAM: 1.5 GB&lt;br&gt;\r\nDisk Space: 15 GB SSD&lt;br&gt;\r\nBandwidth: Unmetered&lt;br&gt;\r\nOS: Linux / FreeBSD*&lt;br&gt;\r\nIPv4: 1 (Additional IPV4 available for $1 per IP per month)&lt;br&gt;\r\nIPv6: 1 (Free additional ipv6 available on request)&lt;br&gt;\r\nRDNS: Yes&lt;br&gt;\r\nControl Panel: Yes&lt;br&gt;\r\n\r\n[Order Now](https://secure.rectified.net/cart.php?a=add&amp;pid=138)&lt;br&gt;\r\n\r\n\r\nAll ports are open, just make sure you are not using it for spamming or any kind of abuse else your VPS will be suspended and/or terminated.&lt;br&gt;\r\n\r\nVPS upto 8 GB RAM and 4 CPU Core also available for more details and ordering please check [https://rectified.net/ddos-protected-vps.php](https://rectified.net/ddos-protected-vps.php) or [https://secure.rectified.net/cart.php?gid=4](https://secure.rectified.net/cart.php?gid=4)&lt;br&gt;\r\n\r\n**Use Promo Code “8X52VE1DXC” to get flat RECURRING 20% discount and Promo Code “RO3QNI7KAP\" to get flat 50% One time discount on all our VPS Packages listed above . Please note if you order cPanel License we will send you a separate invoice for that as we cannot offer discounts on cPanel License or you can even use your own external cPanel License.\r\n**\r\n\r\n&lt;br&gt;All popular modes of payments accepted like:&lt;br&gt;\r\n1) Credit Card&lt;br&gt;\r\n2) PayPal&lt;br&gt;\r\n3) BitCoin&lt;br&gt;\r\n4) Perfect Money&lt;br&gt;\r\n5) WebMoney&lt;br&gt;\r\n6) Bank Transfer/ACH Transfer&lt;br&gt;\r\n\r\nFor FreeBSD, we have mounted it's ISO, you can install it from your VPS control Panel or you can contact us we will install it for you. We can even mount custom ISO for you, just submit a ticket from our website after placing order from our website&lt;br&gt;\r\n\r\nFor all other OS there is no need for manual installation as they are automatically installed via templates. You can even change your OS anytime from your VPS Control Panel\r\nVPN are allowed on our VPS and no special configuration is needed from our end like enabling Tun/tap etc...&lt;br&gt;\r\n\r\n[AFFILIATE](https://rectified.net/affiliate.php): we even have affiliate program, so if you have a blog or website etc... you can become our affiliate and make some decent cash by just referring clients to us, you may message me if you have any queries&lt;br&gt;"}