{"id": 11725, "date": "2013-07-07 17:23:04", "user": "jmginer", "post": "Dear LowEndTalk users,\r\n\r\nfrom GinerNet we bring here a last time offer for LEB &amp; LET users, not announced on our website.\r\n\r\nAs always, we offer our VPS on SSDs, so we guarantee the best possible performance for your VPS server, you can finally compress or make a backup and to keep working on your VPS as if nothing was happening, and of course ensuring the best possible price.\r\n\r\n**OFFER SPECS**\r\n\r\n&gt; **DataCenter:** Barcelona (España)&lt;br /&gt;\r\n&gt; **Virtualization:** OpenVZ&lt;br /&gt;\r\n&gt; **Control panel:** SolusVM&lt;br /&gt;\r\n&gt; **CPU:** Xeon E5620 - 2 vCore x 2 Ghz &lt;br /&gt;\r\n&gt; **Memory:** 5 GB (4 GB RAM DDR3 and 1 GB vSwap SSD)&lt;br /&gt;\r\n&gt; **Disk:** 10 GB SSD (If you need more space, send me a PM to make you a custom quote)&lt;br /&gt;\r\n&gt; **Switchport:** 100 Mbps - **DDos protected**&lt;br /&gt;\r\n&gt; **Transfer:** 500 GB/month&lt;br /&gt;\r\n&gt; **Backup-1:** 2 snapshots from SolusVM (The client can run a full VPS backup and restore when you want) - Pending SolusVM centralbackup.php bugfix&lt;br /&gt;\r\n&gt; **Backup-2:** Remote automated backups&lt;br /&gt;\r\n&gt; **TUN/TAP/PPP** modules actives for VPN services.&lt;br /&gt;\r\n\r\n\r\n**PRICE:** 4.99 €/month\r\n\r\n-&gt;&gt;**[ORDER NOW](https://ginernet.com/cart.php?a=add&amp;pid=102)** &lt;&lt;-\r\n\r\n\r\n**About:**\r\n\r\nIn GinerNet we are a accredited RIPE LIR member, thanks to this accreditation, we have a direct support class for network traffic control and IP addressing so that does not rely on third parties to provide services. Our Autonomous System is AS59432.\r\n\r\nWe have our own network and server architecture that stayed in our private racks with restricted access in our CPD of Barcelona (iDataGreen), where we have taken out a transit with a **Huawei USG5550 DDos protected service**, with direct connection to major ISPs in \"Espanix\" (Telefónica, ONO, Jazztel, Vodafone, Orange, Easynet, etc ...) and international (Cogent, NTT, Level3, Tinet, Colt, Init7, Savvis, etc ...) which gives us excellent worldwide visibility.\r\n\r\nWe provide our service using the most modern hardware technology using 3 servers in cluster ([running OpenVZ inside KVM](http://lowendtalk.com/discussion/7977/openvz-inside-kvm)) + 1 server for backups + 1 server reserved as spare in case of HW crash.\r\n\r\nI remain at your disposal to answer your questions in this thread or you can contact the support service to clear any questions you have. Do not forget that we are at your disposal every day of the year 24.\r\n\r\nYou can follow us on [Twitter](https://twitter.com/ginernet) and [Facebook](https://www.facebook.com/GinerNet) to keep up with the latest news\r\n\r\nBest regards!!"}