{"id": 12466, "date": "2013-08-06 15:00:34", "user": "Damian", "post": "Tired of poor quality of service from The Other Guys? Come to IPXcore! We have great service and great true 24/7 support; you'll love us!\r\n\r\nOur service for Buffalo is out of Colocrossing Buffalo. \r\n\r\nSome company info: We've been up and running since May of 2011. We're running OpenVZ virtualization on our very own Dell, HP, and Supermicro -powered hardware. Each server node has its own gigabit connection. Past-30-days support ticket mean response time:  0 Day(s) 0 Hour(s) 16 Minute(s) and 21 Second(s)\r\n\r\n_The offer:_  \r\n**128mb-3IPv4:**  \r\n128mb of RAM  \r\n32mb vSwap  \r\n10gb of disk space  \r\n400gb of monthly transfer @ 100mbit/sec  \r\n3 IPv4 addresses*  \r\nBuffalo, NY location  \r\n\r\n**$2.35/month**\r\n\r\nClick https://billingcp.us/cart.php?a=add&amp;pid=108&amp;carttpl=modern3&amp;systpl=ipx3 to order! \r\n\r\n(* Specific IP blocks are not guaranteed. Contiguous addresses are not guaranteed. Having all of your addresses within the same block is not guaranteed. IP addresses are assigned on a \"luck of the draw\" basis; IP addresses will not be arbitrarily changed without providing a good, solid reason.)\r\n\r\n**_FYI: As outlined in the AUP/TOS ( http://ipxcore.com/auptos/ ), all new account registrations MUST be made with verifiable postal address information._** Repeating your province/state in the address fields will cause your account to be suspended til you update your account information. \r\n\r\nThese plans are auto-verified with Maxmind with strict settings; _if you get auto-tagged for fraud, please open a support ticket for resolution._  All plans are also subject to manual verifications.\r\n\r\nYou are encouraged to exercise the 3-day trial period (outlined in http://ipxcore.com/auptos/ in the Billing section ) and determine if this service will be right for you.\r\n\r\nBuffalo test IP: 198.144.190.2\r\n\r\nWe also do custom plans. Please contact us with your requirements."}