{"id": 12562, "date": "2013-08-09 08:32:19", "user": "terafire", "post": "![](http://terafire.net/clients/templates/slick-host-v3-4/images/logo.png)\r\n\r\n\r\n\r\nTeraFire started in 2012, originally to have solely European servers. We decided to migrate our servers to the US, and have since rebuilt our business model. Our location is in LA, and we get great peering to Asia, and are fully IPv6 native.\r\n\r\nWe offer KVM and OpenVZ plans at competitive rates.\r\n\r\nWhat sets apart from other hosting companies? For starters, we don't use SolusVM, or CPanel. We have a solid belief in  open source, and believe in the stability and capability of using opensource applications. For virtualization we use ProxMox 3.0 VE which is a bare-metal virtualization platform based on the tried and true Debian linux system. With billing integration, you can manage your VPS directly inside the client system. For our shared web hosting plan we use an actively-developed opensource control panel, Kloxo-MR, which is easy to use and offers a plethora of features. \r\n\r\nTo toast to our official relaunch we have offered many options for you to get started with your VPS.  \r\n\r\nAll Nodes Are On 1Gbit lines.\r\n\r\n15-day money back guarantee on all plans. 99.9% SLA we'll credit you for any service interruption.\r\n\r\n\r\n**OpenVZ Special**\r\n\r\n1 Core  \r\n128 RAM/128 Swap  \r\n1 IP Address   \r\n200GB Bandwidth   \r\n 20GB RAID HD Space  \r\n(**5** available and manually approved)   \r\nUse Coupon Code: SUMMER30  for $15/yr   \r\n\r\n[ Order Link ](https://terafire.net/clients/cart.php?a=confproduct&amp;i=16)   \r\n\r\n\r\n\r\n**KVM Deal**\r\n\r\nInstant setup  \r\n\r\n1 CPU Cores  \r\n512 MB RAM  \r\n600 GB Bandwidth  \r\n20 GB RAID HD Space  \r\n1 IP Address  \r\n$6.90/mo with Coupon: SUMMER30  \r\n\r\n[ Order Link ](https://terafire.net/clients/cart.php?a=confproduct&amp;i=17)\r\n\r\n\r\n\r\n\r\n**OpenVZ 512**\r\n\r\nInstant Setup  \r\n1 Core  \r\n512 MB RAM // 512 Swap  \r\n1 IP Address  \r\n45GB RAID HD Space  \r\n600GB Bandwidth  \r\n$4.90/mo with Coupon: SUMMER30  \r\n\r\n[ Order Link ](https://terafire.net/clients/cart.php?a=confproduct&amp;i=18)\r\n\r\n\r\n**NEW DEAL:**\r\n\r\n**Coupon code: P1UQLQ633C** for EXTRA 50% off first month on all OpenVZ. (except the special)\r\n\r\n\r\n\r\n\r\n\r\nSpecify template in VPS Control Panel\r\n\r\nWe are hosted in Los Angeles at the Quadranet datacenter.\r\n\r\n\r\nLocation: Los Angeles, CA\r\n\r\nTest IP 162.216.226.132\r\n\r\nIPv6 Test IP: 2607:fcd0:ff01:4::3\r\n\r\n(Test IPv6 is also our main website)\r\n\r\nTest File: http://terafire.net/100MB.zip\r\n\r\nAUP Quick and Dirty: IRC OK, Private Proxies and VPN okay. No public proxies. No spamming/mass mailing/SEOing with our servers. RDNS Available, IPv6 Available (up to 10 per plan) Domain Registration, DNS Management. Bandwidth overages won't get you suspended, but you will be throttled until the next billing cycle."}