{"id": 13327, "date": "2013-09-10 22:18:02", "user": "MonsteR", "post": "#### RaptorNode - 25% Off Using the code ddosprotectme  \r\n\r\n###About Us\r\nRaptorNode is miles above the rest as an exceptional hosting company. We have many years   of leading experience with global businesses of all sizes and have built up an affluence of   hosting expertise that put down us a scratch above other hosting companies in this time.  RaptorNode is a company that you can rely on for all of your Hosting needs. With 24 hour   support there is no reason not to sign up today!  \r\n\r\n###Why us?\r\nThis are a few of the many reasons why you should choose us\r\n  \r\n###Equipment/Hardware:\r\nRaptorNode operates privately owned servers and racks with most our Networking equipment,   All of our services are delivered with guaranteed service levels and around-the-clock   support. Our data centers are staffed with our on-site expert engineers and support   technicians 24 hours a day, every day of the year. Using the latest equipment and technology   we proudly deliver exceptional service, support, and allround hosting solutions.  \r\n  \r\n###Technologies:  \r\nCustomers choose RaptorNode because we provide incredible services at amazing prices.  This usually mean less powerful services and features but not with RaptorNode. Our VPS  Services are feature packed offering you way more than the competition. Don’t take our word  for it, check out our VPS hosting plans and see for yourself!  \r\n  \r\n#### Features  \r\n*7 Day Money Back Guarantee  \r\n*High bandwidth Servers  \r\n*Incoming DDoS Mitigation/Filtering  \r\n*Raid 10  \r\n*Primary Location Los Angeles  \r\n*24 Hour Support  \r\n\r\n  \r\n#### Raptor EGG  \r\n$ 21.00/year  \r\nDISK 10GB  \r\n1Gbps Uplink  \r\nTransfer 250GB  \r\nRAM 128MB/256MB   \r\nCores 1  \r\nIPs 1  \r\n[Order Now!](http://www.raptornode.com/client/cart.php?a=add&amp;pid=21)  \r\n\r\n#### RAPTOR 1  \r\n\r\n$6.75 USD/month with discount code applied  \r\nDISK 25GB  \r\n1Gbps Uplink  \r\nTransfer 1TB  \r\nRAM 256MB/512MB    \r\nCores 1  \r\nIPs 1  \r\n[Order Now!](http://www.raptornode.com/client/cart.php?a=add&amp;pid=22)\r\n  \r\n[Check out the rest of our plans here](http://raptornode.com/vps-hosting.html)  \r\n[DDoS Protected Cpanel Hosting](http://raptornode.com/webhosting.html)\r\n  \r\nNetwork Information  \r\nBlack Lotus Los Angeles\r\nPeering: http://bgp.he.net/AS174#_peers\r\nTest IP: 192.196.216.14  \r\nPeering: http://bgp.he.net/AS32421#_peers  \r\n"}