{"id": 146786, "date": "2018-06-16 23:46:05", "user": "KuJoe", "post": "Hello LET family, we've noticed a lot of requests for backup solutions over the past few months so we decided to dust off the first domain we ever purchased and put it to good use. Now I know we're not the cheapest on the block, but our goal was to offer another option out there and hopefully we fit the needs of some of you looking for some quick and reliable storage. We basically looked at our own requirements for our personal backups and this is what we came up with: [https://BackupDragon.com/](https://BackupDragon.com/)\r\n\r\nWe offer backup services in all shapes and sizes from FTP/rsync accounts to KVM VPSs which are all hosted in our Tampa, Florida data center (100% owned hardware and network). All services come with a 99.9% Uptime SLA and a 30 Day Money Back Guarantee.\r\n\r\nFTP/rsync Accounts Starting @ $7.50/Year  \r\n+ 50GB to 1000GB of RAID5 protected storage  \r\n+ Unmetered 1Gbps Port (Shared)  \r\n+ FTP, SFTP, SCP, and rsync are all enabled for each account  \r\n+ Your storage is enclosed in it's own jailed container for added security  \r\n\r\nBudget Backup VPSs Starting @ $9/Year  \r\n+ 256MB RAM+vSwap  \r\n+ 1 vCPU Core  \r\n+ 50GB of RAID5 protected storage  \r\n+ 500GB of Bandwidth @ 1Gbps  \r\n+ NAT IPv4 + /64 IPv6 Block  \r\n+ OpenVZ Powered By Wyvern\r\n\r\nAdvanced Backup VPSs Starting @ $2.99/Month\r\n+ 256MB RAM+vSwap  \r\n+ 2 vCPU Cores  \r\n+ 25GB of RAID5 protected storage  \r\n+ 500GB of Bandwidth @ 1Gbps  \r\n+ 1 Dedicated IPv4 + /64 IPv6 Block  \r\n+ OpenVZ Powered By Wyvern\r\n\r\nPremium Storage VPSs Starting @ $5.99/Month\r\n+ 512MB RAM\r\n+ 2 vCPU Cores  \r\n+ 250GB of RAID50 protected storage  \r\n+ 10TB of Bandwidth @ 1Gbps  \r\n+ 1 Dedicated IPv4 + /64 IPv6 Block  \r\n+ KVM Powered By Wyvern\r\n\r\nSee something you like? [Head on over and place an order!](https://BackupDragon.com/)\r\n\r\nFor those of you who don't know us or forgot about us, Secure Dragon LLC. was formed in October of 2010 and has been offering quality services since 2011. We are a fully registered Limited Liability Company with the Florida Department of State Division of Corporations and we obtain our IPs directly from ARIN (AS54561). We own all of our hardware and IP addresses while also providing our own custom VPS control panel named Wyvern.\r\n\r\n**Want to test out our networks?** Check out our looking glass here: [Drgn.biz](http://drgn.biz)\r\n\r\n**Have a question?** We have a vast Knowledge Base where we try to answer all of your questions so feel free to check it out and search around: [KB](https://securedragon.net/clients/knowledgebase.php)\r\n\r\n**Do you offer 24x7 support?** We're not staffed 24x7, but to get an idea of our average response times on tickets we have it listed on our front page to see the average of our last 10 tickets.\r\n\r\n**How can I pay you?** We accept payments via Paypal, Credit Card (Stripe), and Bitcoin (BitPay payments are non-refundable and can take up to 2 hours to process).\r\n\r\n**Do you offer any other discounts or coupons?** There are some floating around, enjoy the hunt!\r\n\r\n**Can I run _____?** Check our AUP for more details: [AUP](https://backupdragon.com/aup.php)"}