{"id": 152246, "date": "2018-09-20 14:51:40", "user": "combahton_it", "post": "fastpipe.io (former kms-hosting.com) is a brand of combahton IT Services, offering Cloud Servers within various data centers in Frankfurt am Main, Germany.\r\n\r\nIn order to provide a reliable and outstanding service, combahton operates own hardware, network infrastructure and heavily uses self developed applications. Thousand lines of C, PHP and Python code has been written since our early days back in 2012.\r\n\r\nOur Cloud Servers are operated on latest hardware of well known vendors like HP Enterprise and Supermicro. In terms of network equipment, we trust on Juniper Networks, which provide us with professional switching and routing gear for 10Gbit/40Gbit operation.\r\n\r\nWant to learn more about our technical infrastructure and how we take care of their operation? - See our [infrastructure details](https://www.fastpipe.io/infrastructure).\r\n\r\n\r\n**Some key features of our Cloud Servers**\r\n\r\n* **Excellent connectivity:** By default, every cloud server node is connected with 2x 10Gbit to our network. This provides network-level resilience, fast data transfers, and best performance even at peak times. Network-intensive applications are excellently stored with us.\r\n\r\n* **DDoS-Protection:**  Our cloud servers includes our exclusive DDoS protection. Once your instance gets attacked, within seconds our protection infrastructure activates and filters out bad traffic. Even DDoS attacks on web applications are filtered out by our DDoS protection.\r\n\r\n* **Additional IP-Addresses:** You can add additional IP addresses (from 1.49€) and subnets (from 6.95€) to your instance. The setup takes place immediately, the reserved address ranges are routed to an instance of your choice, you can set the reverse DNS entries yourself. If you want to use your own IP networks, we offer BGP sessions and BGP announcements.\r\n\r\n* **Daily Backup:** Data loss is annoying. Accordingly, our cloud server nodes are equipped with several hard drives (hardware raid) as standard. You can avoid the risk of self-generated data loss with minimal effort through our automated snapshot backups. For this purpose we make a complete backup of your server daily between 02:00 to 10:00 am.\r\n\r\n* **Scale at any time:** Do you need more CPU power, memory or disk space instant? Scale your server automatically to the next higher level, fully automated and without changing the existing configuration or data. We only charge you the difference in connection with the current remaining term.\r\n\r\n* **Virtual Private Lan:** Create your own, isolated networks with our Virtual Private Lan (VPL). VPLs behave like V-Lans and provide an internal network between different instances where you can freely use your own IP addresses. Choose between 1Gbit, 2Gbit or 5Gbit interfaces.\r\n\r\n* **Free BGP (BETA) - Limited time deal:** Already own an AS and IP-Space? For new customers, we provide a limited time deal. Get a free BGP Session within the next 14 days and announce your own ip-space. Just open a ticket after your server has been provisioned and tell us your ASN and Prefixes. We will configure the session within two business days.  \r\n\r\n  \r\n**Small entry offerings**\r\n\r\nWith a small budget, you get a lot of power and possibilities with our Cloud Servers. Starting at 3,49€  ($4,10) per 30 days, we offer:\r\n\r\n* **Cloud HE-1**\r\n* One CPU Core (Intel Xeon E5)\r\n* 1024MB ECC Memory\r\n* 10GB Raid 10 Hard Drive Storage\r\n* Debian, Ubuntu, CentOS and FreeBSD available as one-click installation\r\n* Additional details and [order link available on our website](https://www.fastpipe.io/cloudserver)\r\n\r\nMore power needed? [Choose a higher package](https://www.fastpipe.io/cloudserver) or upgrade with just a few clicks, without moving configuration or data.\r\n\r\nNot satisfied yet? Challenge accepted. Just order the desired instance, open a ticket including the link to this post and we will happily provide a free Cloud HE-1 instance with 14 days lifetime, without any binding contract :-)  \r\n  \r\n  \r\n**Other features we are working on**\r\n\r\nJust to mention a few things, we are currently working on:\r\n\r\n* **Free 1Gbit VPL Interfaces:** Get a free 1Gbit VPL Interface with every instance\r\n* **Reinstallation Scripting:** Run your own scripts automatically up on the installation of your instance\r\n* **Mass deployment:** Configure and create up to 10 new instances with only one click\r\n\r\nWant to learn more about our current progress? Check out our [blog](https://www.fastpipe.io/blog/)."}