{"id": 152911, "date": "2018-10-18 05:21:35", "user": "jar", "post": "Hey friends!\r\n\r\nWe're gearing up for a strong Black Friday for 2018 at MXroute. During that preparation, I'd like to fill up a couple of servers, and I was wondering if you'd help me out. Most of you already know what I'm offering, so for you I'm going to jump straight into the offer details:\r\n\r\n20GB Storage\r\nUnlimited Domains\r\nUnlimited Email Accounts\r\n$10/year\r\n[Click here to order](https://billing.mxroute.com/cart.php?a=add&amp;pid=80)\r\n\r\nFor those of you who may be new to MXroute, let me tell you a bit about who we are today. Today MXroute consists of it's founder Jarland (me), the alternate identity I would have if I were a better person that goes by Louis (seriously he's awesome). Of course, the wife plays a role in helping with financials, Ryan is the co-founder and would take my place if I kicked the bucket tomorrow.\r\n\r\nSo what is MXroute? MXroute is an email hosting provider with the stretch goal of taking on the status quo in the email industry and turning it upside down. No per user cost, pay for the storage you use, and a commitment to high quality inbox delivery (sometimes variables stack in a way that prevent us from providing it, but we still continually work toward the service not being one of those variables).\r\n\r\nWe provide:\r\n- SMTP / POP3 / IMAP\r\n- Roundcube, Horde (webmail only), squirrelmail\r\n- cPanel interface ([Why cPanel?](https://mxroute.helpscoutdocs.com/article/32-why-cpanel-how-are-you-unique))\r\n- iOS Push\r\n- Server side filters\r\n- In-house outbound filtering / rotating delivery system\r\n- IP reputation issues rarely a problem (and usually mitigated transparently in the case that they do appear, emails are then delivered from another IP)\r\n- MailCheap fallback (if delivery fails from our system, final delivery attempt goes through MailCheap)\r\n- 300 outbound emails per hour\r\n\r\nWe want to keep growing and challenging the industry. Your support is what will put us there. Thank you for taking the time to read this offer, and I hope that it meets your needs &lt;3\r\n\r\nJarland"}