{"id": 154600, "date": "2018-12-24 18:01:39", "user": "bigpowerhost", "post": "Bigpowerhosting is a leading provider in VPS and Dedicated Servers in New York,Miami,And Los Angeles . We strive to provide great quality virtual servers and other products for a fair price, and giving you the peace of mind that your server will be online 24/7/365. All of our services are self managed but include basic support and technical troubleshooting on a best-effort basis. Our network provides complete DDoS mitigation against malicious network attacks, and is located perfectly for good latency throughout America and Europe.\r\n\r\n All Dedicated Servers benefit from dedicated network ports, a wide selection of global locations and 20Gbit free Ddos protection is included. All our dedicated server include 1gbps ports and 10TB bandwidth and have free 20Gbit Ddos Protection included with the option to upgrade up to 100 GbitGbit, as well as enterprise DDoS protection on all your ip addresses for free. If you need more bandwidth, We;ve got you covered. Up to 10gbps unmetered BW is available as an upgrade option. All dedicated servers are setup within 12 hours after payment and include 5 ipv4 and /64ipv6. Locations include Miami Florida,Los Angeles California and New York City New York All dedicated servers include free ipmi/kvm and a control panel where you can set your anti ddos specs,Null ip addresses,reload the os,power off and reboot the server.\r\n\r\n Intel Atom D510 4 GB New York Metro\r\n\r\n4 GB DDR2 RAM\r\n\r\n64 GB SSD\r\n\r\n500 GB HDD\r\n Starting at $35 per month\r\nhttps://www.bigpowerhosting.com/cart.php?a=confproduct&amp;i=6\r\n\r\nIntel Atom D525 New York Metro\r\n\r\n8 GB DDR3 RAM\r\n\r\n64 GB SSD\r\n\r\n1 TB HDD\r\n Starting at $40 per month\r\nhttps://www.bigpowerhosting.com/cart.php?a=confproduct&amp;i=12\r\n Intel Xeon E3 1270\r\n32 GB DDR3 ECC RAM\r\n\r\n512 GB SSD\r\n\r\n Starting at$70 per month for life\r\nhttps://www.bigpowerhosting.com/cart.php?a=confproduct&amp;i=13\r\n\r\nIp to ping\r\n172.96.142.125 (Los Angeles)\r\n104.243.45.227 (New York)\r\n103.195.102.211(Miami)\r\n\r\nDownload speed test\r\nhttp://172.96.142.125/1000mb.test.zip\r\nhttp://104.243.45.227/1000mb.test.zip\r\nhttp://103.195.102.211/1000mb.test.zip\r\n\r\nOffer good until 1/2/19 or while supplies last."}