{"id": 155833, "date": "2019-02-20 05:36:09", "user": "OVH_APAC", "post": "#OVH Public Cloud, Now also available in Singapore and Australia!\r\n\r\nWe are thrilled to announce the expansion of the OVH Public Cloud solution to our Sydney and Singapore datacenters.\r\n\r\nWant to save on your infrastructure costs? Discover a Cloud alternative powered by OpenStack and available worldwide:\r\n\r\n* Affordable Sandboxes from **US$ 3.50**\r\n* Powerful Instances with guaranteed resources (RAM, CPU, Bandwidth..)  Linux &amp; Windows available.\r\n* Cloud storage (object storage, cloud archive..)\r\n* 8 Cloud regions - including Australia and Singapore - spanning 4 continents. \r\n* Highly scalable and flexible virtual servers to fit all sort of projects and any budget.\r\n* Simple and predictable billing\r\n\r\n&gt; https://www.ovh.com/public-cloud/ \r\n\r\n \r\n##Public Cloud SANDBOXES: (from US$ 3.50 /month)\r\n**Linux only, shared resources, adapted to testing and development environments.**\r\n\r\n&gt;Example: *S1-2* hosted in Sydney or Singapore:\r\n&gt;* 2GB RAM \r\n&gt;* 1vCore \r\n&gt;* Local 10GB SSD (you can purchase additional volumes)  \r\n&gt;* Outgoing public traffic: **1024 GB/month offered** (per Cloud Project) then US$ 0.08/GB\r\n&gt;* Incoming public traffic: Unmetered\r\n&gt;* Private network: unmetered\r\n&gt;* 100Mbps public bandwidth.\r\n&gt;* US$ 0.009 /hour or **SAVE 50% on monthly usage**: US$ 3.50 /month  \r\n&gt; https://www.ovh.com/public-cloud/instances/prices \r\n\r\n##Public Cloud Instances \r\n**Dedicated Resources with Linux &amp; Windows available**\r\n\r\n* General Purpose Instances: Multi-purpose servers offering a balance of CPU/RAM for your web or business applications.\r\n* CPU Instance: Ideal for applications that require high-frequency computing, or for processing parallel workloads.\r\n* RAM Instance:  They are designed for data analytics and data science usage with optimized CPU/RAM ratios, and accelerated IOPS.\r\n\r\n&gt;Example: General purpose *B2-7* hosted in Sydney or Singapore:\r\n&gt;* 7GB RAM \r\n&gt;* 2vCore 2.3GHz\r\n&gt;* Local 50GB SSD (you can purchase additional volumes)  \r\n&gt;* Outgoing public traffic: **1024 GB/month offered**  (per Cloud Project) then US$ 0.08/GB\r\n&gt;* Incoming public traffic: Unmetered\r\n&gt;* Private network (vRack): unmetered, 300Mbps. \r\n&gt;* 250Mbps Guaranteed Public bandwidth.\r\n&gt;* Price for Linux: US$ 0.074 /hour or **SAVE 50% on monthly usage**: US$ 26.40 /month\r\n&gt;* Price for Windows: US$ 0.174 /hour or **SAVE 50% on monthly usage**: US$ 62.40 /month (price is inclusive of the windows licence)\r\n&gt; https://www.ovh.com/public-cloud/instances/prices \r\n\r\n##OVH Public Cloud Features:\r\n\r\n* **Pay-as-you-Go**: Hourly and monthly billing options, to suit your requirements. Monthly usage is 50% cheaper than paying by the hour.\r\n* **Additional Disk**: With Additional Disks, you can add more disk space to your instances. By attaching disks to your instances and moving them between instances in the same datacentre, you can tailor your storage to your needs.\r\n* **Additional IPs**: Up to 256 IPs per General Purpose instance, RAM and CPU; 16 on Sandbox instances. (one off set up fee per IP, then no recurring monthly fees!)\r\n* **Flexibility**: Adapt your instances to your needs by upgrading or downgrading them at any time. Add disks and IPs and move them between instances\r\n* **Dedicated Resources**: With OVH you get Guaranteed resources unlike other providers.In under a minute, you get CPU, RAM and storage with no resource over-allocation\r\n* **Traffic included**: In Sydney and Singapore, OVH offers 1024GB (1TB) of monthly traffic per Public Cloud project and per datacenter (then US$ 0.08/GB). Only the outgoing public traffic is metered. **The traffic remains unlimited in our European and North American datacenters.**\r\n\r\n\r\n\r\n##How to activate additional Public Cloud regions?\r\n\r\nYou may not see all the 8 available regions while creating an instance or cloud storage. Simply add a new region from the menu: \"Technical management\"  -&gt;  \"The regions\" (within a new or existing Public Cloud Project). It may take few minutes to reflect on your account.\r\n\r\n\r\n\r\n##Test the OVH network performance\r\n\r\nSYDNEY Datacenter:\r\n\r\n* Test IPv4: speedtest-syd.apac-tools.ovh\r\n* Test IPv6: speedtest-syd.apac-tools.ovh\r\n* Test files: http://speedtest-syd.apac-tools.ovh/files\r\n* Test latency: http://syd.smokeping.ovh.net/smokeping?target=APAC\r\n* Looking Glass: https://lg.ovh.net\r\n* Network status: http://weathermap.ovh.net/#apac\r\n\r\nSINGAPORE Datacenter:\r\n\r\n* Test IPv4: speedtest-sgp.apac-tools.ovh\r\n* Test IPv6: speedtest-sgp.apac-tools.ovh\r\n* Test files: http://speedtest-sgp.apac-tools.ovh/files\r\n* Test latency: http://sgp.smokeping.ovh.net/smokeping?target=APAC\r\n* Looking Glass: https://lg.ovh.net\r\n* Network status: http://weathermap.ovh.net/#apac\r\n\r\n\r\nWant to see improvements on the OVH network? Send us your traceroute request at http://traceroute.apac-tools.ovh\r\n\r\n\r\n\r\n##About OVH\r\n\r\nOVH is a global Cloud provider, offering innovative products and services with a focus on private, public and hybrid cloud, and bare metal (dedicated servers).\r\nFounded in 1999, the OVH group manages and maintains 28 datacentres across 4 continents, deploys its own global fiber optic network, and has a full control over the supply chain (from server manufacturing and in-house maintenance of its infrastructure, right down to customer support). OVH offers businesses a benchmark for value and performance in the sector.\r\n\r\n"}