{"id": 157814, "date": "2019-05-25 07:22:10", "user": "MKHosting", "post": "Hey Guys! Hereby I would like to introduce you the VPS of MK-Hosting!\r\n\r\n**Who we are**\r\nMK-Hosting was founded in early summer 2018. However, as a shareholder of a 2-man GbR, the business model has been managed since 2015.\r\nWe always strive to optimize and expand our products and portfolio. We make sure to provide an attractive price-performance model.\r\nOur servers are located in the data center in Frankfurt am Main and have an excellent latency due to the direct connection to the DE-CIX.\r\n\r\n&lt;br&gt;\r\n\r\n**About this offer**\r\n- No expulsion of VAT in accordance with the VAT Act\r\n- No contract - all prepaid\r\n- Each LXC has an 3 Slots for Backups\r\n- Each LXC has an Layer7 DDoS-Protection up to 850Gbps\r\n- Each LXC has an 1 Gbit/s uplink (fair use)\r\n- Each LXC has **configurable Server performance** \r\n- Each LXC could configure with HDD or SSD (RAID available as standard)\r\n- Currently the currency is: 1€ = 1,12$\r\n- Currently, terms of one month and three months are possible\r\n- root privileges of course\r\n- For the LET community there is a 10% coupon on all root servers for the entire duration, extensions and every upgrade of the server. Please use this coupon code to receive the issued price. The voucher will be deducted from the cart. Code: LET2019\r\n- \r\n\r\n&lt;br&gt;\r\n\r\n**Configurable Server performance**\r\nWhy should you use predefined packages? choose for yourself which performance you need and adapt it easily in the customer center with just a mouse click. Immediately after upgrade, the performance is available. And this all the time - fully automated.\r\n\r\n&lt;br&gt;\r\n\r\n**The offer itself**\r\nOur offer can be ordered by the order process. During the ordering process, all relevant information can be provided. However, a change is not a problem in hindsight.\r\n**_Please use the voucher from above to get the correct price or just click on the link that leads to the order_**\r\n\r\nThe configurable servers start with the following basic configuration at a price of **6,76$ for HDD** each month:\r\n- 2 vCores with 3,5Ghz\r\n- 3 GB ECC RAM\r\n- 50 GB HDD\r\n- 1Gbit/s uplink\r\n- 1 IPv4\r\n- 3 Backup Slots\r\n\r\n_[Link: MK-Hosting HDD](https://www.mk-hosting.net/whmcs/cart.php?a=add&amp;pid=7&amp;promocode=LET2019)_\r\n\r\n&lt;br&gt;\r\n\r\nThe configurable servers start with the following basic configuration at a price of **6,86$ for SDD** each month:\r\n- 2 vCores with 3,5Ghz\r\n- 3 GB ECC RAM\r\n- 10 GB SDD\r\n- 1Gbit/s uplink\r\n- 1 IPv4\r\n- 3 Backup Slots\r\n\r\n_[Link: MK-Hosting SSD](https://www.mk-hosting.net/whmcs/cart.php?a=add&amp;pid=17&amp;promocode=LET2019)_\r\n\r\n&lt;br&gt;\r\n\r\nAn overview and the link to the order can be seen here:\r\nhttps://www.mk-hosting.net/vps/\r\n\r\n&lt;br&gt;\r\n\r\n**conclusion**\r\nIf there are questions, feel free to contact us. If there are questions about products, support should be provided through our website for more efficient support.\r\nOf course we also support here :)\r\n\r\nWe hope you enjoy our offer and look forward to welcoming you soon as a customer."}