{"id": 160841, "date": "2019-10-17 15:50:31", "user": "CConner", "post": "GameDash is an all-in-one (support, billing, faq &amp; game server) management suite for GSP's and communities alike. We aim to make great game server hosting available to anyone by offering the best features from all the other control panels and incorporating them all in one platform. Unlike other solutions, GameDash will keep being updated indefinitely, constantly making improvements to keep it at the top of its game.\r\n\r\nThis beta test will allow you to test GameDash in the same environment you'll be eventually using it in: Production. This beta will be hosted by our sister company on it's global network with its own customers, and you have the opportunity to test it for yourself too, for free!\r\n\r\n**In order to register, fill out the registration form at [https://forms.gle/YRZFC3JC3Bszuzr36](https://forms.gle/YRZFC3JC3Bszuzr36)**\r\n\r\nIf you wish to keep track of the development, **join our Discord server with over 250 other members at https://discord.gg/k6JwEu7**\r\n\r\nIf you have any questions, please let me know!\r\n\r\n**Screenshots**\r\n\r\nFull album @ [https://imgur.com/a/6nUt4F8](https://imgur.com/a/6nUt4F8)\r\n\r\n![](https://i.imgur.com/ZXZ1QYY.jpg)\r\n\r\n![](https://i.imgur.com/aJFUibf.png)\r\n\r\n![](https://i.imgur.com/oxef84D.png)\r\n\r\n**Game server management**\r\n\r\n- Process management ( starting / stopping / restarting )\r\n- Fully integrated file manager, uploader, viewer and editor\r\n- Real-time process statistics (CPU, RAM, disk, players, network)\r\n- An integrated FTP server. Implements the same file type upload/download restrictions as the file manager. It also includes file transfer speed limiting.\r\n- Mod/Plugin installer. Access thousands of mods and plugins and install them with a single click all via the interface of the control panel. Works for any game. Includes a Spigot/Bukkit plugins.\r\n- Automatic mod/plugin and base server software updater\r\n- View historic statistics including CPU, RAM, disk, and players of up to a year in the past.\r\n- Live console. Stream console logs straight to the user's browser and send commands directly to the server process. Works with process input/output and RCON.\r\n- Automatically disect configuration files for easy configuration of the instance without having to dig in to difficult to understand configuration files with the config editor.\r\n- Steam Workshop Downloader\r\n- A plethora of applications supported by default, including, but not limited to:\r\n\t- 7 Days to Die\r\n\t- Counter-Strike: Global Offensive\r\n\t- Counter-Strike: Source\r\n\t- Factorio\r\n\t- Garry's Mod\r\n\t- Holdfast: Nations at War\r\n\t- Minecraft\r\n\t- Minecraft Bedrock Edition\r\n\t- Minecraft Pocket Edition (Nukkit)\r\n\t- Mordhau\r\n\t- Mount &amp; Blade: Warband\r\n\t- Rust\r\n\t- Squad\r\n\t- Starbound\r\n\t- Terraria\r\n\t- TeamSpeak 3\r\n\t- Mumble\r\n- Windows, macOS and Linux support\r\n- Custom DNS hostnames\r\n- Dedicated IP's &amp; ports\r\n- Sub users - grant access to other users to manage an instance. Fine-grained control allowing you to specify what permissions each user has.\r\n- MySQL databases\r\n- Backups\r\n- Powerful shell command-line allowing the host to specify specialised commands that aren't normally available through the GUI and might be specific to a certain service. Think of a Steam Workshop downloader for Garry's Mod\r\n- Scheduled and recurring tasks\r\n- See which players are currently playing on your server and perform simple actions such as kicking and banning\r\n- Define resource limits and over-usage thresholds that will stop an instance if it exceeds the defined limits\r\n- Transfer instances between machines and locations\r\n- Automatic re-install/resetting\r\n\r\n**UI**\r\n\r\n- Modern and sleek material based design\r\n- Themeing system includes default dark and white theme\r\n- Translation system, supporting English, French, German, Danish, Spanish and Russian by default\r\n- Built using the latest technologies primarily based on React.js for a lightning-fast experience, only having to load the application once and fetching everything else on the go\r\n\r\n**Mobile App** for Android and iOS(soon):\r\n\r\n- Included for free with every GameDash license, allowing users to manage their instances on the go efficiently ( https://play.google.com/store/apps/details?id=com.gamedashconsole ). Works out of the box.\r\n\r\n**Billing**\r\n\r\n- Easy up and downgrading of services\r\n- Recurring payments\r\n- Automatically send professional looking PDF invoices via e-mail\r\n- Discount codes\r\n- Customizable rental periods, ranging from a second to months or years\r\n- Export a list of payments in the defined time period to lighten your administrative tasks\r\n- Donation system that allows community members to contribute to an instance's monthly costs\r\n- Full cart system\r\n- PayPal, Credit Card, Sofort, Bancontact, Giropay, iDeal, Przelewy24 and account balance payment methods supported\r\n- Automated follow-up inviting a user to leave a review on Trustpilot after a randomized amount of days\r\n\r\n\r\n**Support**\r\n\r\n- Ticket system that also acts as a live-chat system if a support operator is offline, allowing you to decrease the time a customer has to wait to have his issue resolved.\r\n- Suggest relevant FAQ articles before the user submits a ticket based on the title and body, decreasing the number of tickets\r\n- Automatic locking of tickets after a customizable time of inactivity\r\n- Show when a staff member was last seen to a customer\r\n- Customers can see when a staff member is typing a message and staff members can see what the customer is typing before it has even been submitted\r\n\r\n**FAQ**\r\n\r\n- Articles supporting markdown to allow for styling\r\n- Intelligent searching to get the most relevant results\r\n\r\n**Client**\r\n\r\n- Profile pictures\r\n- Preferences\r\n- Settings such as email, name, and address\r\n- Generate an API token\r\n- Sign-in using two-factor authentication via Google Authenticator and e-mail\r\n- Password resets\r\n- Forgot password\r\n- Billing credit balance\r\n- Session management. Includes which IP last used each session and from which physical location\r\n\r\n**Infrastructure**\r\n\r\n- Public node status page, detailing which are online/offline and their CPU and RAM usage\r\n- Define which services can run on which nodes. Handy if you wish to reserve a certain node for a certain service\r\n- Automated service dependency updater and installer. For example, if a node is set to allow Minecraft ran on it, it will automatically install and keep Java updated\r\n- Get push notifications via the GameDash Go app and Slack when a node goes offline/online\r\n\r\n**Administrative**\r\n\r\n- Listing and creation of clients\r\n- Newsletter e-mailing\r\n- Listing and creation of instances\r\n- Fully customizable theming system, allowing you to customize the logo and colors of the panel. Includes a white and dark theme by default\r\n- Create new services\r\n- Full infrastructure overview\r\n- Restart infrastructure nodes"}