{"id": 161765, "date": "2019-11-29 19:46:04", "user": "VirMach", "post": "![](https://virmach.com/images/logo.png)\r\n\r\nThis year we're back with some more flash deals, our new E3-HDL line of dedicated servers, and restocking of some highly anticipated locations such as San Jose. We're starting a little later than usual after our kind robot companion did some regular deals but everything is now ready to go.\r\n\r\n&lt;h1&gt;Special Flash Sale&lt;/h1&gt;\r\n_______\r\n[VIEW BLACK FRIDAY &amp; CYBER MONDAY FLASH DEALS](https://virmach.com/black-friday-cyber-monday/)\r\n\r\n&lt;h1&gt;More Offers&lt;/h1&gt;\r\n______\r\nDon't want to find the perfect flash sale? We'll try to occasionally update our normal specials page with some deals. [VIEW MORE DEALS.](https://virmach.com/special-offers)\r\n\r\n&lt;h1&gt;Learn More&lt;/h1&gt;\r\n__________\r\n&lt;ul&gt;&lt;li&gt;&lt;strong&gt;Flash Deals:&lt;/strong&gt; This will consist of manually scheduled &amp; automatically generated deals by our system. The default timers are &lt;del&gt;10&lt;/del&gt; 4 minutes for each offer and &lt;del&gt;5&lt;/del&gt; 3 minute grace period for anyone who clicked the button to complete their order. This may be increased or decreased. Please try to stay calm &amp; orderly when completing your order or you may be rate-limited.&lt;/li&gt;\r\n&lt;li&gt;&lt;strong&gt;Special Offers:&lt;/strong&gt; These are similar to our usual \"special offers\" page with higher quantity specials in specific locations &amp; standard resource levels. Throughout the day we will try to manually post additional specials on the special offers page for LET users.&lt;/li&gt;\r\n&lt;li&gt;&lt;strong&gt;LET Exclusives:&lt;/strong&gt; Sometimes our offers get posted elsewhere so deals sell out quicker. On this thread, some deals may be posted exclusively for LET members. We encourage requests, but be watchful -- we might have a few easter eggs.&lt;/li&gt;\r\n&lt;/ul&gt;\r\n\r\nPlease note, due to time constraints this year, special offers and LET exclusives may be more scarce. \r\n\r\n**Terms of Service:** http://virmach.com/terms-conditions\r\n**Looking Glass:** http://lg.virmach.com/\r\n\r\n**Refund Policy:** We will not offer any refunds or guarantees for this special offer.\r\n\r\nPlease do not contact our live chat or sales department with questions in regards to this sale. We may rate limit or block special-related requests. Please anticipate your service to potentially not be functional for a few days before you can contact us for a resolution. If you have any questions, please post them on this thread. We apologize for any errors/typos within this offer. If your service is not properly generated and is broken, we will attempt to regenerate this offer for you as soon as possible, but it may be cancelled &amp; refunded. We hope you understand. If you do not check out within 5 minutes our system may charge you for the next special in the queue and provide you with completely different server specifications and pricing. This is rare, and we've improved everything to avoid this further, but we may not cancel the service if this happens and it's purchased."}