{"id": 16501, "date": "2013-11-13 03:27:28", "user": "Prohostingserver", "post": "Currently offering exclusive 20% off Use coupon code: LET20OFF at order page\r\n\r\nOur Mission Prohostingserver is a fairly new company that is hosted here in the US. Our goal is to offer high-quality, fast, and reliable VPS's for a fair and cheap price. We also strive in giving you the best service possible while using our products. Using OpenVZ Virtualization, you're guaranteed the hardware you pay for, without it being oversold or overused. Here at Prohostingserver , we do our best to keep your VPS working properly and make sure it works the way you want it to. To us, you aren't just some number on a list, you're one of our valued customers.\r\n\r\nAll of our servers can be fully managed for a cheap monthly price, or unmanaged! It's up to you, and even if you go with unmanaged, we'll still offer support and help walk you through the steps needed to get your VPS running the way you want it to. Still stuck? Not a problem, our trained staff will help assist you in configuring software you install on your VPS if you need to. We're always here to help!\r\n\r\nNot only do we guarantee 99.9% uptime (excluding planned maintenance), we also have our highly trained Level-3 Technicians at your disposal to help configure software or even install it! Including Apache, MySQL, PHP, MSSQL, Windows and Linux OS's and many more! We can even handle backing up your data and help secure your system to help prevent intrusions!\r\n\r\n    VPS PLAN 1\r\n    $12.99/Year (Get 20% OFF By Applying Coupon LET20OFF)\r\n    128MB RAM\r\n    256M Burst RAM\r\n    10GB Disk\r\n    500 GB Bandwidth \r\n    1 IP Address \r\n    1 E5520 2.26Ghz CPU\r\n    \r\n    VPS PLAN 3 (Get 20% OFF By Applying Coupon LET20OFF)\r\n    $3.99/ Monthly\r\n    512MB RAM\r\n    1024M Burst RAM\r\n    40GB Disk\r\n    1000 GB Bandwidth \r\n    1 IP Address \r\n    2 E5520 2.26Ghz CPU\r\n    \r\n    VPS Plan 4 (Get 20% OFF By Applying Coupon LET20OFF)\r\n    4.99$ Monthly\r\n    1024MB RAM\r\n    2048M Burst RAM\r\n    80GB Disk\r\n    2000 GB Bandwidth \r\n    2 IP Address \r\n    2 E5520 2.26Ghz Monthly\r\n    \r\n    VPS Plan 5 (Get 20% OFF By Applying Coupon LET20OFF)\r\n    7.99$ Monthly\r\n    1536MB RAM\r\n    3072MB Burst RAM\r\n    100GB Disk\r\n    3500 GB Bandwidth \r\n    2 IP Address \r\n    3 E5520 2.26Ghz CPU\r\n\r\nMore Plans At Prohostingserver.com\r\n\r\nNeed VPS reseller contact us or reply with your offers ,Reliable Offer will be accepted.\r\n\r\nCheckout Our Plans at Prohostingserver.com/vps.html\r\n"}