{"id": 167847, "date": "2020-11-09 09:40:44", "user": "JustVPS", "post": "Founded by software engineers and cloud professionals in 2018, [**JustVPS**](http://justvps.com/?utm_source=forums&amp;utm_medium=cpc&amp;utm_campaign=LET&amp;utm_content=%7Bcreative%7D&amp;utm_term=%7Bkeyword%7D \"JustVPS\") understands hosting pains like no one else. Our mission is simple: help people achieve more by securing their online presence with hassle-free hosting. We want to be all times best web host. We love what we do and it’s the idea that drives us.\r\n\r\nWe value people more than anything. We are devoted to helping anyone accomplish great things. For that, we ensure VPS and VDS services of a new level. We act according to our high standards and honest business practices.\r\n\r\nWe host our equipment at one of the market leaders in DPC (Data Processing Centers) LeaseWeb. To accommodate equipment for our main Singapore location, we rent racks in a Tier III SIN-10 class data center, this data center is certified ISO 27001, PCI DSS, SOC 1 Type II, SOC 2 Type II and SS 564. The data center has two independent inputs power supplies, as well as 8 x 1,375 kVA uninterruptible power supplies (UPS) and 3 x 2,000 kVA diesel generators.\r\n\r\nEach of our racks has two power connections and two 10GB uplinks connected to different data center switches. In each rack, we installed a Cisco Nexus 9000 with 48 ports, 10Gb each.\r\n\r\nTo accommodate client VPSs, we use high-performance servers based on Quanta QuantaGrid D52B-1U platforms, which are equipped with two modern 12-core Intel Xeon Gold 5118 processors, 768GB DDR4 ECC Registered RAM and 12 Datacenter class SSD disks. Each server is equipped with 4 network ports of 10Gb each.\r\n\r\nOur VPS combines speed, stability, and time-proven reliability\r\n**Advantages of VPS from JustVPS:\r\n- Best price\r\n- 15 Locations\r\n- Xeon Core\r\n- Simple and fast start\r\n- Technical support 24/7\r\n- Settings in one click\r\n- We use Only SSD\r\n- Settings for professionals\r\n- Payment: Visa, MasterCard, PayPal, Bitcoin**\r\n\r\nGo to our **[website](http://justvps.com/?utm_source=forums&amp;utm_medium=cpc&amp;utm_campaign=LET&amp;utm_content=%7Bcreative%7D&amp;utm_term=%7Bkeyword%7D \"website\")** and choose the best tariff for your needs. **[Register](https://account.justvps.com/auth/login/?utm_source=forums&amp;utm_medium=cpc&amp;utm_campaign=LET&amp;utm_content=%7Bcreative%7D&amp;utm_term=%7Bkeyword%7D \"Register\")** your personal account and buy a server in 2 clicks. \r\nWith a unique promo code \"**JustSG**\" you will get additional months of use to your tariff!\r\n\r\n3 months + 1 month for free\r\n6 months + 3 months for free\r\n12 months + 6 months as a gift\r\n\r\n## Current tariff for Singapore location:\r\n**Just VPS Micro $6.99/mo**\r\nCPU Cores - 1\r\nMemory Size - 1gb\r\nSSD Disk Size - 20gb\r\nFull Root Access - yes\r\nBandwidth - Unmetered\r\nIPs Included - 1 ipv4 &amp; 1 ipv6\r\nOS CentOS, Debian, Ubuntu\r\nOptional control panel - Plesk or cPanel (additional cost)\r\n\r\nYou can find the rest of the tariffs on our website.\r\n\r\nWe also have a large selection of servers in other locations, powerful dedicated servers or cloud hosting. Servers on Windows. We give additional discounts for bulk purchases!\r\n\r\nOur technical support works around the clock. If you have any questions, write to us by mail info@justvps.com, live chat on [site](http://justvps.com/?utm_source=forums&amp;utm_medium=cpc&amp;utm_campaign=LET&amp;utm_content=%7Bcreative%7D&amp;utm_term=%7Bkeyword%7D \"site\"), [Facebook page](https://www.facebook.com/justVPS \"Facebook page\") or here.\r\n\r\nHaving used our services once, you will not want to leave us! If something does not suit you, we will refund your money! "}