{"id": 2098, "date": "2012-04-01 23:47:03", "user": "Damian", "post": "...and other exciting adjectives! It's a double RAM offer! \r\n\r\n&lt;B&gt;PLEASE NOTE:&lt;/B&gt; We are moving datacenters the first week of May. We are anticipating a 4 hour downtime window, and your IP address will change when this occurs. If this is not acceptable to you, please refrain from ordering til our next sale.\r\n\r\nAdam and I have been doing Internet services since 2003 as Digital Design Core. We moved into the VPS market in May of 2011 as IPXcore. We started this because we were on a BurstNET node that kept getting oversold, and we were unable to get any form of support. We decided that we could do better.\r\n\r\nAll of our nodes are located at Phoenix Internet in Phoenix, AZ, and transited through a mix of twtelecom and Qwest/Centurylink. Many of our Asian customers tell us they get great connectivity on this mix.\r\n\r\nWe're running OpenVZ virtualization on our very own Dell and HP Opteron-powered hardware.\r\n\r\n&lt;B&gt;PLEASE NOTE&lt;/B&gt; At this time, each connection is limited to 20 mbit/sec. Your VPS will be able to pull multiple 20 mbit/sec connections. When we move, this restriction will be lifted. Additionally, we will be unlocking CPU limits.\r\n\r\nThe Offers:\r\n\r\nTinyVPS\r\n1/2 CPU core\r\n&lt;s&gt;96mb&lt;/s&gt;&lt;b&gt;192mb&lt;/b&gt; RAM \r\n2gb Disk Space\r\n30gb bandwidth\r\n\r\n$1.99 per month: https://ipxcore.com/order/cart.php?a=add&amp;pid=7\r\n\r\nIronVPS\r\n2 CPU cores\r\n&lt;s&gt;128mb&lt;/s&gt;&lt;b&gt;256mb&lt;/b&gt; RAM\r\n&lt;s&gt;192mb&lt;/s&gt;&lt;b&gt;320mb&lt;/b&gt; burst RAM (vswap available on request)\r\n10gb Disk Space\r\n200gb bandwidth\r\n\r\n$4.49 per month: https://ipxcore.com/order/cart.php?a=add&amp;pid=5\r\n\r\nBronzeVPS\r\n4 CPU cores\r\n&lt;s&gt;256mb&lt;/s&gt;&lt;b&gt;512mb&lt;/b&gt; RAM\r\n&lt;s&gt;320mb&lt;/s&gt;&lt;b&gt;640mb&lt;/b&gt; burst RAM (vswap available on request)\r\n20gb Disk Space\r\n300gb bandwidth\r\n\r\n$6.99 per month: https://ipxcore.com/order/cart.php?a=add&amp;pid=6\r\n\r\nThe remaining plans have double RAM too, however, they are outside the price limit of LET.\r\n\r\nTest IP: 216.224.230.133\r\nTraceroute: http://onyx.ipxcore.com/traceroute.php\r\n\r\nAdditional IPv4 addresses available for $3.00 per month apiece, with justification.\r\nWe're working on IPv6; we hope to be able to participate in World IPv6 Launch Day, if not sooner.\r\n\r\nNeed ram/disk space/bandwidth? We'll work with you; contact us with your requirements.\r\n\r\nWe also do custom plans. Please contact us with your requirements.\r\n\r\n&lt;a href=\"http://ipxcore.com/china/\"&gt;去浏览我们网站上独立服务器的产品页面&lt;/a&gt;\r\n\r\nThis sale is in effect until April 14th, 2012, or we run out of stock, whichever occurs first."}