{"id": 22478, "date": "2014-02-25 16:45:13", "user": "jnguyen", "post": "----------------------------------------------------------------------------\r\n**BREAKING NEWS**: GreenValueHost now employs a full team of in-house, non outsourced, dedicated, and experienced Native English speaking staff members around the clock! Our customers deserve better, and our job is to give them the best available.\r\n\r\n**BREAKING NEWS**: Our infrastructure has been stabilized! NO MORE abrupt downtime, node CPU load hikes, periods of slowness, or I/O variations!\r\n\r\nFor a full update on changes that have been made to our company, please see our latest announcement: https://secure.greenvaluehost.com/announcements.php?id=16\r\n\r\n----------------------------------------------------------------------------\r\n\r\nNow on to the offers! Now that GreenValueHost has finally reached the point of stability inside and out, our crazy high-allocation offers are BACK, but for a **LIMITED TIME ONLY!!**\r\n\r\nThese offers are available in **ALL FOUR** of our locations, including our PREMIUM Chicago location! In addition, **ALL ORDERS ARE NOW INSTANTLY ACTIVATED UPON PASSING AUTOMATED FRAUD CHECKS!!** We guarantee you'll be satisfied with the new GVH, or your money back! GreenValueHost is one of LowEndTalk's largest and most popular providers, and we feel that it is our responsibility to treat our customers and the LowEndTalk community right.\r\n\r\nFrom now until March 11th, we have the following plans to offer you:\r\n\r\n**LET-Exclusive March Special-1** - Perfect for ALL purpose use!&lt;br&gt;\r\n250GB RAID-10 SSD Accelerated Disk Space&lt;br&gt;\r\n75TB Bandwidth, 1Gbps Port&lt;br&gt;\r\n2 IPv4 Addresses&lt;br&gt;\r\n4096MB Guaranteed RAM&lt;br&gt;\r\n6144MB vSwap RAM&lt;br&gt;\r\n32 IPv6 Addresses (Inquire for location availability)&lt;br&gt;\r\n**Price: $5.95/month OR $48.00/year**&lt;br&gt;\r\n_Order Link:_ https://secure.greenvaluehost.com/cart.php?a=add&amp;pid=217\r\n\r\n**LET-Exclusive March Special-2** - Perfect for average use!&lt;br&gt;\r\n55GB RAID-10 SSD Accelerated Disk Space&lt;br&gt;\r\n35TB Bandwidth, 1Gbps Port&lt;br&gt;\r\n1 IPv4 Address&lt;br&gt;\r\n2048MB Guaranteed RAM&lt;br&gt;\r\n32 IPv6 Addresses (Inquire for location availability)&lt;br&gt;\r\n**Price: $3.95/month OR $35.95/year**&lt;br&gt;\r\n_Order Link:_ https://secure.greenvaluehost.com/cart.php?a=add&amp;pid=218\r\n\r\n**LET-Exclusive March Special-3** - Bandwidth lovers galore!&lt;br&gt;\r\n10GB RAID-10 SSD Accelerated Disk Space&lt;br&gt;\r\n25TB Bandwidth, 1Gbps Port&lt;br&gt;\r\n1 IPv4 Address&lt;br&gt;\r\n768MB Guaranteed RAM&lt;br&gt;\r\n32 IPv6 Addresses (Inquire for location availability)&lt;br&gt;\r\n**Price: $8.00/year**&lt;br&gt;\r\n_Order Link:_  https://secure.greenvaluehost.com/cart.php?a=add&amp;pid=219\r\n\r\nFeatures:&lt;br&gt;\r\n- SolusVM Control Panel&lt;br&gt;\r\n- FREE rDNS/PTR&lt;br&gt;\r\n- 99.99% UPTIME GUARANTEE&lt;br&gt;\r\n- NO QUESTIONS ASKED 45 DAY MONEY BACK GUARANTEE&lt;br&gt;\r\n- Priority Support via 5 channels: Ticket Helpdesk, Email, Phone, Community Forums, Skype&lt;br&gt;\r\n\r\n**If you're skeptical or hesitant to try our services, don't be! You have nothing to worry about. Our money back guarantee extends to a whopping 45 days!**\r\n\r\nADDITIONAL IPv4 ADDRESSES MAY BE PURCHASED FOR 30 CENTS PER MONTH EACH (WITH JUSTIFICATION) IN THE FOLLOWING LOCATIONS: Los Angeles, California and Chicago, Illinois\r\n\r\n**BONUS DEAL 1:  FIRST 20 YEARLY ORDERS GET 2 EXTRA IPv4 ADDRESSES FOR FREE!!**&lt;br&gt;\r\n**BONUS DEAL 2: FIRST 10 YEARLY ORDERS WILL BE ENTERED IN A RAFFLE FOR A $100 VISA GIFT CARD**&lt;br&gt;\r\n\r\n**BONUS DEAL 3: FIRST 20 MONTHLY ORDERS GET 1 EXTRA IPv4 ADDRESS FOR FREE!!**&lt;br&gt;\r\n**BONUS DEAL 4: FIRST 10 MONTHLY ORDERS WILL BE ENTERED IN A RAFFLE FOR A $50 VISA GIFT CARD**&lt;br&gt;\r\n\r\n**_BONUS DEAL FOR EVERYONE_** !! Amsterdam, NL expansion planning is underway! Expansion is expected to be finalized near the beginning of MARCH 2014! EXISTING CUSTOMERS WILL BE GIVEN PRE-RELEASE EXCLUSIVE DISCOUNTS. What a better time to become a GVH customer?\r\n\r\nIf you have any questions, please feel free to contact us by submitting a ticket or by replying to this thread.\r\n\r\nThank You for taking the time out of your valuable day to take a look at our advertising thread, we really appreciate it and we most definitely look forward to serving you as a greatly valued client!"}