{"id": 24785, "date": "2014-04-04 06:29:31", "user": "jh", "post": "&lt;a href=\"http://www.loadingdeck.com\"&gt;&lt;img src=\"http://c9ee.http.cdn.softlayer.net/80C9EE/www.loadingdeck.com/bundles/apphome/assets/img/logo.png\" /&gt;&lt;/a&gt;\r\n\r\nWe've just rolled out a massive update that is particularly relevant to the hosting market. Screenshots &lt;a href=\"http://www.loadingdeck.com/billing\"&gt;here&lt;/a&gt;.\r\n\r\n**This iteration includes the following major features:**\r\n\r\n&lt;ul&gt;&lt;li&gt;Orders, products, product groups, servers and server groups&lt;/li&gt;\r\n&lt;li&gt;A client-facing portal which you can easily integrate into your website to allow your clients to keep track of their invoices and products&lt;/li&gt;\r\n&lt;li&gt;A client-facing order form which you can also easily integrate into your website&lt;/li&gt;\r\n&lt;li&gt;cPanel and SolusVM integration - including full controls inside the client area - no need to issue separate logins (unless you want to)&lt;/li&gt;\r\n&lt;li&gt;Income by product displayed&lt;/li&gt;\r\n&lt;li&gt;Automatic creations / suspensions / terminations&lt;/li&gt;\r\n&lt;li&gt;Replace our logo with your own logo on the login page&lt;/li&gt;\r\n&lt;li&gt;Bring your own domain and SSL certificate&lt;/li&gt;\r\n&lt;li&gt;An \"addon store\" wherein you can purchase some of the new features - don't worry the core functionality will remain FREE.&lt;/li&gt;&lt;/ul&gt;\r\n\r\nWe have also recently partnered with Softlayer, an IBM company and a global leader in web hosting to provide our infrastructure. This means that we have the infrastructure we need to really scale our business. You'll notice that Loading Deck will be a lot faster, and it will also be a lot more secure.\r\n\r\n&lt;strong&gt;What's the deal?&lt;/strong&gt;\r\n\r\nThe core of Loading Deck is FREE - as in free beer. The hosting automation is normally at a cost of £7.50/month. \r\n\r\nIf you'd like to try it out, it's yours for £4.50/month. Just sign up for an account on the website and open a ticket quoting this offer :)\r\n\r\nI'm also happy to take any thoughts and suggestions :)"}