{"id": 27121, "date": "2014-05-10 05:17:11", "user": "zionvps", "post": "Greetings from ZionVPS - http://zionvps.com\r\n\r\n\r\n\r\nCompany info: We are a relatively new company. We have been providing openvz and kvm offers since 2 months. The registration as a LLP is already under process and should take no more than one month.  We specialize in providing affordable servers. We are dedicated to run the business, and prepared for financial liabilities in upcoming months. At first, we plan to rent dedicated servers, until all the legal obligations are cleared, then we will start co locating at different locations with our own hardware.\r\n\r\nOffer info: Today we are  here to offer openvz servers. The nodes are located in Montreal, Canada. Node specs are AMD Operaton CPU, 32 or 64 GB ram, 4x2tb hard disks raided 0+1, bandwidth upgraded to 1.5Gbps. All the following plans are unmanaged, however management and cpanel are offered as an addon. Management is reactive, and done via skype. The node is hosted in OVH datacenter. Offshore backups are taken everyday on each node via FTP, and we will soon implement features allowing clients to backup their system on their own.\r\n\r\nPlans : \r\n \r\n* Plan 1:\r\n* &lt;del&gt;$6.50 /Mo&lt;/del&gt; $4.50./Mo recurring coupon  - LEBZION512\r\n* 30 GB Raid protected SAS HDD\r\n* 512 mb ram\r\n* unmetered bandwidth\r\n* 1 IPv4, 2 IPv6 with DDoS protection\r\n* Access to 2 cpu cores\r\n* [buy now](https://billing.zionvps.com/cart.php?a=add&amp;pid=2)\r\n* total 5 in stock!\r\n\r\n\r\n* Plan 2:\r\n* &lt;del&gt;$9.50$ /Mo&lt;/del&gt; $7/Mo  recurring discount - LEBZION1024\r\n* 50 GB Raid protected SAS HDD\r\n* 1024 mb ram\r\n* unmetered bandwidth\r\n* 1 IPv4, 3 IPv6 with DDoS protection\r\n* Access to 3 cpu cores\r\n* [buy now](https://billing.zionvps.com/cart.php?a=add&amp;pid=3)\r\n* total 5 in stock!\r\n\r\n* You may not use unmetered bandwidth for denial - of service attacks. Hosting legal mirrors are allowed, for example - a debian http mirror. To prevent abuse, unmetered bandwidth is limited with port speed. Plan 1 comes with 50Mbps, Plan 2 with 100Mbps.\r\n \r\n \r\nPayment is accepted via Paypal and after payment, provisioning is instant."}