{"id": 30917, "date": "2014-07-11 22:28:55", "user": "Rob_T", "post": "**[Versaweb](http://www.versaweb.com)** is celebrating our 10th year in business this month! We've come a long way in 10 years, and to celebrate the occasion, we are offering some fantastic deals on dedicated servers!\r\n\r\nThis week, we're blowing out a fresh shipment of Dual Xeon L5630 servers at the amazing price of only $49 per month! Due to the amazing pricing offered here, there are a couple of restrictions on these servers:\r\n\r\n- Limit 5 servers per customer\r\n- Current customers may add these servers, but may not replace existing\r\n- Due to expected heavy demand, please allow 2-3 business days for setup\r\n- Pricing valid through July 17, or while supplies last!\r\n\r\n\r\n\r\n**Dual Intel Xeon L5630 Dedicated Server**\r\n--------------------\r\n- Dual Xeon L5630 CPU's - 8 Cores, 16 Threads\r\n- 24GB DDR3 ECC RAM Memory\r\n- 120G SSD or 1TB HDD\r\n- 50TB Premium Bandwidth - Gig-E Port\r\n- IPMI / IP KVM Console Included\r\n- FREE Basic DDoS Protection\r\n- 4 IP Addresses / Private VLAN\r\n- Las Vegas, NV Datacenter\r\n    \r\n\r\n**Monthly - $49/m + FREE setup** (reg $79 per month)\r\n**[CLICK HERE TO ORDER NOW!](http://www.versaweb.com/dedicated.php)**\r\n\r\n\r\n**New DoS Protection System!**\r\n\r\nAll Versaweb dedicated servers now include basic DDoS protection! This new system, developed exclusively for Versaweb, actively monitors our entire network for DoS attacks. When an attack is detected, our system will automatically export a null route to our upstream bandwidth providers, stopping the attack in it’s tracks. Only traffic destined for the IP being attacked is dropped, thereby protecting the rest of our network.\r\n\r\nFor users that need a greater level of protection, we also offer Enterprise DoS Protection + Mitigation. Powered by BlackLotus, our Enterprise DoS Protection + Mitigation service offers full mitigation of attacks up to 10Gbps peak / 2Gbps sustained, keeping your site or application running even during an attack.\r\n\r\nAdd Enterprise DDoS Protection Powered By BlackLotus to any server - Only $39 per month!\r\n(protects up to 10Gbps burst, 2Gbps sustained attacks)\r\n\r\n\r\n**Frequently Asked Questions:**\r\n\r\nQ: Do you have a test IP?\r\nLas Vegas - 199.47.210.50\r\nSeattle - 76.164.234.2\r\n\r\nQ: Do you have a download test file?\r\nLas Vegas - http://199.47.210.50/100mbtest.bin\r\nSeattle - Coming Soon\r\n\r\nQ: What forms of payment do you accept?\r\nA: We accept most major credit cards (Visa, MC, Discover, Amex) as well as Paypal payments. We also accept wire transfer payments for amounts over $500.\r\n\r\nQ: How soon will my server be online after my order is placed?\r\nA: Once your order is verified by our billing department, your server will normally be online within 1-2 business days - in many cases, we will even have your server up the same day. Please note that if your server is ordered with upgrades, like additional disks, memory, RAID controllers, or other special configuration options, it can take a little longer.\r\n\r\nQ: Can I upgrade my server?\r\nA: Yes! Please see our order form for available options and pricing. If you do not see what you need on our order form, please contact our sales dept. and we'll do our best to come up with a custom configuration for you. We also offer discounted licensing for many popular control panels such as cPanel, Plesk, Interworx, and DirectAdmin.\r\n\r\nQ: Can I get more IP addresses with my server?\r\nA: All of our servers are deployed with either 4 or 5 usable IP addresses, depending on the particular configuration. If you need more IP addresses, you can order them via our website once your initial order has been completed and your server is online. We do require justification per ARIN guidelines for all IP allocations. We allow a maximum of a /25 per server (125 IP's). DDoS Protected IP's extra - contact sales for pricing.\r\n\r\n8 IP Addresses (5 usable) - $2 per month, $20 one-time setup\r\n16 IP Addresses (13 usable) - $4 per month, $20 one-time setup\r\n32 IP Addresses (29 usable) - $6 per month, $20 one-time setup\r\n64 IP Addresses (61 usable) - $8 per month, $20 one-time setup\r\n128 IP Addresses (125 usable) - $12 per month, $20 one-time setup\r\n\r\nPlease feel free to contact our sales dept via email at sales [at] versaweb (dot) com with any questions you might have.\r\n\r\nThanks, and have a great day!"}