{"id": 33335, "date": "2014-08-26 10:43:09", "user": "sirmbhe", "post": "Hello, \r\n\r\nHow are you guys today?\r\n\r\n**_Sharing is caring_**, and community is - in my opinion - a place where we can share and care about each others. So that's why I decide to do this giveaway things. All of this VPS are on yearly plan, so it has a few months left to be used by the new owner. \r\n\r\nHere are the VPS list that I will give to three of you :\r\n\r\n**VPS # 1**\r\n\r\nProvider / Plan / Price : Crissic / 512MB Special / US$ 15/Year\r\n\r\nSpecification : 3vCore / 512MB RAM / 512MB Swap / 100GB HDD / 2TB Bandwidth / 2 IPv4 / IPv6 by request / Florida, US \r\n\r\nRenewal date : Jan 25th, 2015\r\n\r\n\r\n**VPS # 2**\r\n\r\nProvider / Plan / Price : Bandwagon Host / Micro-128  / US$ 5.99/Year\r\n\r\nSpecification : 1vCore / 148MB RAM / 36MB Swap / 4GB HDD / 300GB Bandwidth / 1 IPv4 / Florida, US \r\n\r\nRenewal date : Mar 1st, 2015\r\n\r\n**VPS # 3**\r\n\r\nProvider / Plan / Price : Bandwagon Host / 5G PROMO V2  / US$ 9.99/Year\r\n\r\nSpecification : 1vCore / 512MB RAM / 64MB Swap / 5GB SSD / 500GB Bandwidth / 1 IPv4 / Arizona, US \r\n\r\nRenewal date : Apr 4th, 2015\r\n\r\n\r\nTo enter this giveaway, you should meet the requirement:\r\n\r\n1. An active member of Low End Talk for at least 3 month and have at least 30 post\r\n\r\n2. Have a real project need to be done or something else that would be useful for the community\r\n\r\n3. Will not break any rules / ToS / AUP the provider or not doing something illegal with the VPS. If you do, they will terminate your VPS asap.\r\n\r\n4. Not having any idle VPS around you\r\n\r\n**If you meet all the requirement kindly please PM me with your plan / project on how you will use the VPS.**\r\n\r\nThis giveaway has been discussed to each provider, so it is good to go. The reason why I give the VPS are to help others that maybe want to have VPS but unable to have one, particularly with financial issue. Maybe it will do some good, in other people's hand rather than sitting idle.\r\n\r\nI hope this will inspire others to do the same, because i know there are a lot of people that just buying VPS just because they want, not because they need. Just sitting idle for many month maybe until they forget it :-P\r\n\r\nThe giveaway are good until Wednesday - Aug 27th, 2014 at 06:00 AM GMT.  After the due date, I will choose 3 person for the giveaway.\r\n\r\nKindly forgive me if I am not around to monitor the thread all the time, because.. well, I have a real life to live on :)\r\n\r\nThank you and best regards,\r\n\r\nDhavid\r\n\r\n"}