{"id": 36709, "date": "2014-10-29 15:54:43", "user": "SNetworks1", "post": "Hello Low End Talk,\r\n\r\nToday I thought I would bring some great value offers that are a bit more festive. I have posted here the offers that come under the LET guidelines, however we do have some larger plans under our Halloween selection that are a little bit more than the LET budget!\r\n\r\n**HALOWEEN-1 Plan:**\r\n\r\n - OpenVZ\r\n - 1 GB of RAM\r\n - 30 GB Storage\r\n - Unlimited Bandwidth Allowance\r\n - 1 IPV4 Address\r\n - DDoS Protection\r\n - £2.50 GBP Per Month\r\n\r\n \r\n Buy: https://www.superior-networks.com/billing/cart.php?a=add&amp;pid=57\r\n\r\n**HALLOWEEN-2 Plan:**\r\n\r\n - OpenVZ\r\n - 2 GB of RAM\r\n - 50 GB Storage\r\n - Unlimited Bandwidth Allowance\r\n - 1 IPV4 Address\r\n - DDoS Protection\r\n - £3.50 GBP Per Month\r\n \r\n Buy: https://www.superior-networks.com/billing/cart.php?a=add&amp;pid=58\r\n\r\nFor all our Halloween offers please see: https://www.superior-networks.com/billing/cart.php?gid=21 \r\n\r\nWe also are offering 50% off all of our services for the first month using the coupon code \"**BOO14**\". This makes all our plans even better value however does not apply to our Halloween range. \r\n \r\nThese are just some of the plans we have to offer and have been built specificity for the Low End Community, we do offer \"Build Your Own\" plans where you can custom build your server to the exact specifications you require, and if you cant find your exact match there we can organize it for you. \r\n\r\nWe accept Paypal as our main payment gateway though Bank Transfers are also accepted. Please note that Bank Transfers are not often instant. \r\n\r\nFor those wishing to test our servers we have the IP superior-networks.com. If you wish to download some test files or run some ping tests we have a looking glass that you can use at https://www.superior-networks.com/lg/ and is available for our French Location.\r\n\r\nAs these plans are seasonal plans they will probably be removed within the next 7-10 days. The coupon will run for as long as it is displayed at the top of our website, https://www.superior-networks.com \r\n\r\nHave a great day,\r\n\r\nRyan\r\n"}