{"id": 37379, "date": "2014-11-11 16:22:50", "user": "fileMEDIA", "post": "### What is DedifyStack?\r\n\r\nWe can proudly announce our full featured Private Cloud with hourly payment and pay-as-you-use model for all public customers. We call our Private Cloud DedifyStack which is a combination of our band dedify.com and the Apache CloudStack Cloud Orachestration Panel which we use in our Private Cloud. DedifyStack is completely flexible, all of your resources are billied hourly and only billed what you use. This is the next step of our CloudVM brand and is now available as DedifyStack in version 3. CloudVM has a long research and development phase. It starts as a virtual private server with local storage and no many features. After that we started the version 2 with partial Private Cloud functions but with monthly billing and local storage. Now CloudVM as DedifyStack is version 3 and offers are fully Private Cloud. \r\nYou mean a true Private Cloud is expensive, no! DedifyStack starting at 0.005€/h for an compute instance with 512 MB RAM, 1 vCore, 10GB SSD and 2 GB/h bandwidth. Additional primary storage with SSDs costs 0.000125€/GB/h and secondary storage 0.0001€/GB/h. This is in the same price range as Fake Clouds or virtual private servers but with shared storage, enterprise hypervisor XenServer and many more featues. \r\n\r\nDedifyStack started with the research and deployment two years ago and offered this service for our enterprise customers. Now, the time startes to offer our CloudStack Private Cloud for all of our customers with a really decent price and start the detachment for virtual private servers. It is time to replace your old, static and slow virtual private servers with a fully featured Private Cloud consistency billing. The time is over for Fake Cloud instances or virtual private servers, pay what you use and deploy instances when you want and use all features a Private Cloud offers. Also all instances includes SSD SAN disk space to provide fast I/O and low latency at any time.\r\n \r\nDedifyStack is based on enterprise components Apache CloudStack and XenServer 6.2 SP 1 for the hypervisor. Hypervisors are connected with multiple 10 Gbit/s Ethernet. The compute nodes using enterprise SSDs in a SAN environment which is connected with Infiniband QDR to provide multiple 40 Gbit/s links and very low latency to the storage. This is required to offer the best performance for all of our customers in the storage network. \r\n\r\nBut this is not all, DedifyStack with CloudStack offers a plethora of features you not have in Fake Clouds or with virtual private servers. DedifyStack offers live migration, own isolated networks, own redundant routers, configurable firewall, port forwarding, VPN access, uploading own templates and isos, downloading templates and snapshots und many many more. \r\n\r\nSo, try it out and change to DedifyStack, not later, now. DedifyStack is the future!\r\n\r\n### PLANS\r\n\r\nPublished plans are in lowend prices ranges, but DedifyStack scales up to one instance per server node and several TB of SSD space.\r\n\r\n# Compute Instances:\r\n\r\nAll instances get 10GB SSD storage for free to use it as root disk. 30€ initial credit is required to activate your Private Cloud and launch instances in it. This fee will completely added to your credit balance to use it for compute and storage resources.\r\n\r\n## CloudVM 512\r\n* RAM: 512MB RAM\r\n* CPU Count: 1 vCPU @ 500 MHz (Dedicated CPU resources)\r\n* Storage: 10GB SSD SAN (Root Disk)\r\n* Outgoing Traffic: 2GB/h Traffic (1440GB/mo)\r\n* Incoming Traffic: Free\r\n* Price: 0.005€/h (3.60€/mo)\r\n\r\n## CloudVM 512 XL\r\n* RAM: 512MB RAM\r\n* CPU Count: 1 vCPU @ 1000 MHz (Dedicated CPU resources)\r\n* Storage: 10GB SSD SAN (Root Disk)\r\n* Outgoing Traffic: 2GB/h Traffic (1440GB/mo)\r\n* Incoming Traffic: Free\r\n* Price: 0.008€/h (5.76€/mo)\r\n\r\nand many more compute plans up to 64GB RAM!\r\n\r\n## Price List:\r\n* **Primary Storage SSD SAN (Root and Data Disks):** 0.000125€/GB/h\r\n* **Secondary Storage (Templates, Backups and Images):** 0.0001€/GB/h\r\n* **Additional Traffic (Outgoing):** 0.0039€/GB\r\n\r\n####\r\n### Order now: https://www.dedify.com\r\n####\r\n\r\n## Price Calculator\r\n-&gt; Calculate your Private Cloud: https://www.dedify.com/calculator.php\r\n\r\n## Management:\r\n* Access to CloudStack and CloudStack API.\r\n* Full redundant management system over load balancer and several management nodes.\r\n* All tasks and issues are published in detail in our system status (https://www.dedify.com/status.php) like our enterprise customers have.\r\n\r\n## Private Cloud\r\n* Based on XenServer and shared SSD storage.\r\n* Storage is based on ZFS with 10GBe and Infiniband.\r\n* High Availability.\r\n* Live Migration.\r\n* One or more own private isolated network supported.\r\n* Load Balancer.\r\n* IPSec VPN into your private cloud.\r\n* Firewall.\r\n* Public IPv6 address over shared direct accessed network.\r\n\r\n## Looking Glass\r\n-&gt; http://lg.nue.de.filemedia.net (Running on a DedifyStack instances)\r\n\r\n\r\nAll prices include 19% german VAT."}