{"id": 39075, "date": "2014-12-14 10:07:44", "user": "0xdragon", "post": "**Advertising Narrator:** Has this ever happened to you?\r\n\r\n&gt; It all started one cold, winter night. All the SysOps team snored in their warm beds and the NetOps team slept on their keyboards. DevOps was on a long vacation to Switzerland and wouldn't be back for a while.\r\n&gt; \r\n&gt; All seemed peaceful, all seemed quiet. The quiet hum of the server room (basement) lulled even the security guard to sleep. Suddenly, all was quiet for one moment.\r\n&gt; \r\n&gt; Wait. All was quiet? That can't be right. The silence was broken less than a second later when over a thousand hard drives, fans spun down simultaneously, and the server room was plunged into darkness.\r\n&gt; \r\n&gt; Guess everyone in IT is getting coal this year.\r\n\r\n**Advertising Narrator:** Well, this could easily have been avoided if this IT team was using CloudCommando, the best service available to any Sys/Dev/NetOps member and their team. It puts you ahead of the game, better than all the rest. \r\n\r\n\r\n**Advertising Narrator:** And now.... You can get it!\r\n\r\nYes, that's right guys. You can order the $4/yr Small Plan right now! But it's limited stock, with only 10 available.\r\n\r\n&lt;h1&gt;&lt;a href=\"http://cloudcommando.com/small_plan/\"&gt;Click here to grab yours for only $4 a year!&lt;/a&gt;&lt;/h1&gt;\r\n\r\n---\r\nWait, what do I get? \r\n\r\nYou get your own Observium install on your own isolated machine. This means that you control your data, and rule over your monitoring! No more paying per device! \r\n\r\nStorage? What's this? \r\n\r\nYou get rsync access to Enterprise level NetApp storage, that will allow you to store critical files and ensure that your data is always safe.  \r\n\r\nWhere? \r\n\r\nOur first location is Scranton, PA for Observium. Sydney, Australia and France are coming soon! \r\n\r\nStorage is located in Atlanta, US. \r\n\r\n---\r\n\r\nThanks,\r\n\r\n0xdragon.\r\n\r\n_Yes, I have permission from the mods to post this offer._"}