{"id": 46917, "date": "2015-03-15 12:04:34", "user": "rsk", "post": "Hello,\r\n\r\nI would like to share a module that we have developed in house, but has the ability to be used by many providers to help weed out fraudsters and verify your client base. The module has rapidly attracted interest, and many of the clients' requested features were added to it.\r\n\r\nWe needed a module to help verify phone numbers after maxmind decided to stop this service and the other service providers requiring a minimum of $100 per month just to verify phone numbers. This was just not possible for a small/budget hosting company.\r\n\r\nThere were a lot of solutions out there, that were literally stuck with tape. Any WHMCS update to the template files, would mean your whole solution would stop working or even to the point where everything is lost. **Hence, there are 'zero template changes' required in the module - not a single file is dependent on the templates you use**.\r\n\r\nThe module it self costs a mere $10 as a one time fee, and you get unlimited support and free upgrades and updates forever. **You require to top up your API provider account on Twilio or Nexmo as they are the ones that will process/send your SMS or Phone Calls to verify your clients!**\r\n\r\n[Read More | Order](http://myrsk.com/software.php)&lt;br&gt;\r\n\r\n**Features**&lt;br&gt;\r\n\r\n-Multiple API providers (read comparison [here](http://myrsk.com/wiki/doku.php?id=pvs:home))&lt;br&gt;\r\n-Flat fee of 0.1 Eur for a fully verified account (using Nexmo), if the customer does not actually verify their account, you pay nothing!&lt;br&gt;\r\n-Ability to choose a verification strategy (either PreCheckout or OnPageChange, read more [here](http://myrsk.com/wiki/doku.php?id=pvs:home))&lt;br&gt;\r\n-Choose a verification method (either SMS, or Call, or Hybrid using Nexmo)&lt;br&gt;\r\n\r\n**Admin Side**&lt;br&gt;\r\nView current unverified accounts&lt;br&gt;\r\nView current verified accounts&lt;br&gt;\r\nSearch for accounts in the system&lt;br&gt;\r\nVerify accounts manually from admin panel&lt;br&gt;\r\nUnverify accounts manually from admin panel&lt;br&gt;\r\nReset amount of verification attempts&lt;br&gt;\r\nCustomize the SMS greeting/beginning message&lt;br&gt;\r\nCustomize the SMS thankyou/ending message&lt;br&gt;\r\n&amp; more!&lt;br&gt;\r\n\r\n**Client Side**&lt;br&gt;\r\nSimple self service verification process&lt;br&gt;\r\nTwo verification attempts per customer&lt;br&gt;\r\nAbility to self place the verification code&lt;br&gt;\r\nProper error messages that guide and not mislead&lt;br&gt;\r\n\r\n[For Screenshots and more information click here](http://myrsk.com/software.php)\r\n&lt;br&gt;\r\n[For the Wiki click here](http://myrsk.com/wiki/doku.php?id=pvs:home)"}