{"id": 4713, "date": "2012-09-09 23:17:10", "user": "jar", "post": "Before I begin, I notice the excessive use of the word \"we\" in my post. Catalyst is not a large company or pretending to be. Me &amp; Ryan are more easily referred to as \"we.\"\r\n\r\nA few weeks ago we launched our Denver, CO offering that was designed to appeal to people who want large quantities of bandwidth on quality hardware. It comes with a side effect that we are honest about. It isn't the best network. That trade off clearly appeals to many, and it has been quite a success. However, that is not the service that I want to offer those who want to host mission critical content. We desire to appeal to both needs and that is why we have been working on our second offering.\r\n\r\nToday I would like to introduce the launch of our Lenoir, NC services. We have worked hard on preparing an offering that we could be proud of from every angle. Between you and me, this is the quality that I want as a customer. To match that as a provider pleases me greatly.\r\n\r\nHere are the offers:\r\n\r\nNC1\r\n2 cores\r\n256 / 256 vSwap\r\n20gb storage\r\n300GB on 1Gbps port\r\n$4.50/m\r\nhttp://catalysthost.com/clientarea/cart.php?a=add&amp;pid=21\r\n\r\nNC2\r\n2 cores\r\n512 / 512 vSwap\r\n30gb storage\r\n400gb on 1Gbps port\r\n$6.00/m\r\nhttp://catalysthost.com/clientarea/cart.php?a=add&amp;pid=22\r\n\r\nNC3\r\n4 cores\r\n1024 / 1024 vSwap\r\n40gb storage\r\n500GB on 1Gbps port\r\n$7.00/m\r\nhttp://catalysthost.com/clientarea/cart.php?a=add&amp;pid=23\r\n\r\nThis node is running 2x Xeon L5420 and a hardware RAID10.\r\n\r\nTest IP: 199.241.191.195\r\nTest file: http://199.241.191.195/100mb.test\r\n\r\nFeel free to ask any questions here or via our website's contact form. Keep in mind that a ticket alerts us both, a message here only alerts me. We do offer custom plans tailored to your needs, just let me know.\r\n\r\nNo benchmarks provided, it's an empty node. It runs about like a dual L5420 with a 512mb flash write cache on a 1Gbit line, with nobody else on it. I'll encourage benchmarks when it gets broken in ;)"}