{"id": 48861, "date": "2015-04-03 21:53:09", "user": "SNetworks1", "post": "Hello Everyone,\r\n\r\nIt has been quite some time since I have gotten around to posting an offer here, we've been a bit busy getting some new projects into a planning stage and always having just one more thing we wanted to do before posting here! We have however gotten to a stage where we are happy with what we can offer you, and have a couple of different offers that might take your interest.\r\n\r\nToday I have 2 of our \"standard\" plans that will include a discount when you apply the code included, along with a possible Build Your Own Configuration that you could spin up with our discount code!\r\n\r\n**Beginner Plan:**\r\n\r\n256MB Ram&lt;br&gt;\r\n50GB Disk Space&lt;br&gt;\r\n1 IPV4&lt;br&gt;\r\nUnlimited Bandwidth Allowance&lt;br&gt;\r\n\r\n£3.38 Quarterly &lt;br&gt;\r\nOrder [Here](https://www.superior-networks.com/billing/cart.php?a=add&amp;pid=45)\r\n\r\n\r\n**Super Starter Plan:**\r\n\r\n512MB Ram&lt;br&gt;\r\n80GB Disk Space&lt;br&gt;\r\n1 IPV4&lt;br&gt;\r\nUnlimited Bandwidth Allowance&lt;br&gt;\r\n\r\n£2.25 per month&lt;br&gt;\r\nOrder [Here](https://www.superior-networks.com/billing/cart.php?a=add&amp;pid=43)\r\n\r\n**Build Your Own Configuration**\r\n1GB Ram&lt;br&gt;\r\n40GB Disk Space &lt;br&gt;\r\n2 IPV4&lt;br&gt;\r\nUnlimited Bandwidth Allowance&lt;br&gt;\r\n\r\n£4.58 per month (Or £45.80 per year)&lt;br&gt;\r\nConfigure [Here](https://www.superior-networks.com/billing/cart.php?a=add&amp;pid=48)\r\n\r\nYou are able to tweak the settings on our Build Your Own Configuration offer if you want something a bit more powerful, and the 25% discount will still apply. We have drafted this plan up for you as a rough idea for what you could get, and so that it falls within the LowEndTalk price restrictions. All of these plans are now available at both the French and Canadian locations that we offer and will continue to be available at both locations. \r\n\r\nWe run on OVH currently meaning that you get the full protection of their DDoS protection and to date we have had no outages as a result of DDoS attacks on any of our servers. EASTERLET is the code you need to enter at the checkout to utilize this discount and you can use it as many or few times as you wish, and there are no limits on how many people can use it. \r\n\r\nTo make it easier for everyone we currently offer both Stripe (Credit &amp; Debit card processing) and PayPal for you to process your payments. Stripe handles any credit / debit card data on their end, and the connection is completely secure between our end where you input the data and their end for the processing. \r\n\r\nFor those wishing to test our servers we have the IP 178.33.27.52 (Or you can use superior-networks.com for a FQDN). If you wish to download some test files or run some ping tests we have a looking glass that you can use at https://www.superior-networks.com/lg/ and is available for our French Location and we will be adding a Canadian based looking class very soon.\r\n\r\nI think I have managed to include everything that you may need to know or want to know, but if I did overlook something or you have any other questions please feel free to drop me a PM here, reply or open a ticket on our support desk.\r\n\r\nHave a great day and enjoy the Easter weekend!\r\n\r\nRyan"}