{"id": 5055, "date": "2012-09-25 09:32:54", "user": "klikli", "post": "TheSSLStore.com, or Rapid Web Services LLC, is one of the largest SSL retailers in the world.\r\nThey offer one of the most amazing SSL reseller platforms - that would allows you to compete with any SSL retailers in the world. For example, I could get the entry-level certificate of Verisign, Verisign Secure Site, for $279.00, saving me $70 when compared with going with NameCheap.\r\n\r\nThey also got a best price guarantee, which ensures your buying price is cheapest even after your purchase. You also get deep discounts when buy in bulk, 30-day money back guarantee, and your very own turnkey SSL store within minutes. You will also get loyalty discounts - if you're switching from another competitor, you will got your previous purchases credited towards your loyalty balance as well.\r\n\r\nIf you are using WHMCS, ClientExec, you could got start selling their SSL certificates within minutes thanks to their in-house plugins! Or, if you have your own billing solution, you are welcomed to make use of their API. What's more is that their logo or website will not be shown throughout the process - the purchase is completed in your website and issuing of certificate is done in CA's website.\r\n\r\nBut what makes them different is that they offer a completely FREE EV Certificate to its resellers, and if that makes you more interested, it's a GeoTrust® TrueBusinessID with EV. This is a time-limited offer and will only be available to its resellers.\r\n\r\n&lt;b&gt;To get started, click on &lt;a href=\"https://www.thesslstore.com/partner/resellersignup.aspx?RefId=82931629\"&gt;here&lt;/a&gt;.&lt;/b&gt; Please note that as you click on my referral link, both of us will be upgraded to the GOLD slab, which means we both got 25% off retail prices instead of 20%. However, there is no other incentive (such is money rebate) other than that for me.\r\n\r\nNo deposit or credit card is required.\r\n\r\nSSL CA's includes: Verisign (Thawte, GeoTrust, RapidSSL) and Comodo as well as Trustwave.\r\n&lt;hr&gt;\r\nDisclaimer: I am not an employee of the company mentioned below but when you click on registration links in this post I will be incentived. Read above."}