{"id": 52152, "date": "2015-05-08 18:42:22", "user": "jar", "post": "(Non-VPS related offer approved by @mpkossen)\r\n\r\nHi everyone!\r\n\r\nI would like to re-introduce you to MXroute, a company that revolves around the idea of managed e-mail hosting for people like you. Developers, admins, I'm talking to you. You don't need anything fancy, you just want e-mail hosting that works, that isn't parsed for advertisements, and that gives you reasonable package restrictions instead of annoying plans like \"$X per user.\" You could do it yourself, but why? The complications can be overwhelming at times, and sometimes you'd rather be focusing on your other projects.\r\n\r\nMXroute has been growing a lot, and the result has been a dramatic change in it's platform that ultimately provides a more stable environment. It is and will always be a work in progress, there are always improvements to be made. We recently switched our platform to cPanel, but I assure you that one cannot simply install cPanel on any old VPS and match the quality of our managed e-mail service (Customized configurations, powerful spam filtering, mail forwarding without being rate limited by Google every hour).\r\n\r\nHere are some features:&lt;br&gt;\r\n- Mail hosting for your domain&lt;br&gt;\r\n- cPanel based control panel&lt;br&gt;\r\n- DNS hosting&lt;br&gt;\r\n- DKIM&lt;br&gt;\r\n- OwnCloud&lt;br&gt;\r\n- Roundcube and SquirrelMail\r\n\r\n&lt;b&gt;I'm offering 15% off all plans with the promo code LET15&lt;/b&gt;\r\n\r\n&lt;b&gt;Small&lt;/b&gt;&lt;br&gt;\r\n- 5GB Storage&lt;br&gt;\r\n- Unlimited Domains&lt;br&gt;\r\n- Unlimited E-mail Accounts&lt;br&gt;\r\n$15/year&lt;br&gt;\r\nhttps://billing.mxroute.com/cart.php?a=add&amp;pid=26\r\n\r\n&lt;b&gt;Medium&lt;/b&gt;&lt;br&gt;\r\n- 10GB Storage&lt;br&gt;\r\n- Unlimited Domains&lt;br&gt;\r\n- Unlimited E-mail Accounts&lt;br&gt;\r\n$20/year&lt;br&gt;\r\nhttps://billing.mxroute.com/cart.php?a=add&amp;pid=27\r\n\r\n&lt;b&gt;Large&lt;/b&gt;&lt;br&gt;\r\n- 15GB Storage&lt;br&gt;\r\n- Unlimited Domains&lt;br&gt;\r\n- Unlimited E-mail Accounts&lt;br&gt;\r\n$25/year&lt;br&gt;\r\nhttps://billing.mxroute.com/cart.php?a=add&amp;pid=28\r\n\r\nGive us a try! I know we're not perfect, I know we've had problems, but I also know we're committed to improving the service at all costs."}