{"id": 53778, "date": "2015-05-27 07:18:58", "user": "XYZHosting", "post": "**Hello LET!**\r\n\r\n&gt; [XYZHosting](http://xyzhosting.me) is a offshore hosting company that is focused on our customers first. We are located in Amsterdam, NL and are proud to say that we do not oversell our dedicated servers. We manage 15 NL nodes for our VPS customers including 2 shared hosting nodes. \r\n&gt; \r\n&gt; We use the best and newest equipment to host your website and never oversell which translates into better performance and no downtime. In fact, we guarantee 99.9% uptime on our entire network with a Service Level Agreement (SLA) in place. All plans feature our premium blend of IP Transit provided from Tiscali, GBLX, Level3, WVfiber.\r\n&gt; \r\n&gt; Unlike some of the \"mega-brands\" that have thousands of employees, XYZHosting is a team of roughly 10 people who deeply care about your website and your needs. We treat each customer with the utmost respect as they were our mother. You're not just a number to us, you're part of the XYZHosting family.\r\n\r\n\r\n**LET PROMO VPS**\r\n\r\n&gt; _OVZ1_\r\n&gt; 75GB HDD \r\n&gt; 2GB RAM\r\n&gt; 1TB Bandwidth @ 250mbit\r\n&gt; 4 Cores @ 3.30GHz\r\n&gt; $6.99/month \r\n&gt; [ORDER HERE](http://www.xyzhosting.me/panel/cart.php?a=add&amp;pid=19)\r\n\r\n\r\n\r\n**Current Promotions**\r\n&gt; Take 10% off all your invoices with Promotional Code:_ xyznew_. This promotion is applicable for the life of your service.\r\n&gt; Applicable to new orders only, no limit.\r\n\r\n\r\n**Our Hardware**\r\n&gt; Each Node Consists of the following:\r\n&gt; - Intel Xeon E3-1230v2 @ 3.30GHz\r\n&gt; -32GB DDR3 Registered ECC RAM\r\n&gt; -UNSHARED 1000mbit \r\n&gt; -2x1TB SATA\r\n \r\n\r\n**Why choose XYZHosting?**\r\n\r\n&gt; Our datacenter is located in Amsterdam, NL. DMCA Ignored and premium bandwidth for all of our customers.\r\n&gt; Latest cPanel to easily manage your website\r\n&gt; 24/7 email support\r\n&gt; 99.9% uptime guarenteed \r\n&gt; Fast and powerful servers\r\n&gt; Friendly support with fast response times.\r\n"}