{"id": 5451, "date": "2012-10-18 18:12:32", "user": "vdnet", "post": "Due to our recent posting on LEB and talking with various clients who needed less than 1GB, we have decided to offer 512MB servers for as low as $3 per month!\r\n\r\n**512MB Server**\r\n512MB Dedicated RAM\r\n25GB Disk Space\r\n\r\n500GB of bandwidth for $10/quarter or $36/year\r\n1500GB of bandwidth for $12/quarter or $44/year\r\nUse this page for the LEB exclusive special: http://cloud3k.com/servers_leb.php\r\n\r\n**1GB Server**\r\n1GB Dedicated RAM\r\n50GB Disk Space\r\n2TB Bandwidth\r\n$5.95/month with SIXYEAR coupon, order from http://www.cloud3k.com and select the location you want.\r\n\r\n**1GB Server High Traffic**\r\n1GB Dedicated RAM\r\n50GB Disk Space\r\n4TB Bandwidth\r\nChicago High Traffic Only\r\n$6.95/month with SIXYEAR coupon, order from http://www.cloud3k.com and select the Chicago High Traffic.\r\n\r\n**Locations**\r\nChicago Metro (Indiana)\r\nChicago High Traffic (Illinois) - up to 10TB of bandwidth\r\nLas Vegas (Nevada)\r\nNew York Metro (New Jersey)\r\n\r\nPing and speed tests are available for each location at http://cloud3k.com/locations.php\r\n\r\n\r\n**What are cloud servers?**\r\nCloud servers feel just like a VPS or dedicated, but provide extra features such as high availability and load balancing. Our cloud servers run VPSGrid, a custom platform for Virtuozzo-based systems. From your end, you will not notice a difference except for better uptime and performance. On the backend, however, VPSGrid does the following:\r\n1. Creates a live backup of your server ensuring data will not be lost in the event of hardware failures.\r\n2. Monitors servers for downtime and uses the live backup in case of failure, protecting your server from long periods of downtime.\r\n3. Balances load between physical servers making sure you have the available CPU and RAM your server demands!\r\n\r\n\r\nCloud3K is a subsidiary of RockMyWeb, we have been running virtual servers for 6 years.  If you have any questions, feel free to post them here, PM me, or use our contact form."}