{"id": 56073, "date": "2015-06-25 12:01:35", "user": "matteob", "post": "[Buy your first 3€ FlexCloud credit and you will get 10€ free additional credit!! with coupon code: lowendtalk-flex](http://www.seflow.net/2/index.php/en/services/flexcloud/flexpricing)\r\n\r\nHowto order: Just submit new order, pay initial 3€ deposit and your account is instantly activated. We will review your order manually and will add 10€ additional free credit. On basic package you will get more than 3 month for free!\r\n\r\nSeFlow reputable dedicated italian provider, founded in 2004, is happy to announce new flexCloud product based on SSD distribuited storage with datacenter redundancy\r\n\r\n\r\nBased on onAPP, FlexCloud is a real cloud service. No single points of failure guarantee you maximum uptime and data security. Storage Area is shared on local node and managed by our software as one virtual SAN. All disks are SSD with automatic data replication on 4 nodes shared on two datacenters. We built dedicated 2x10Ge Storage Network to guarantee that all data are replicated in real time.\r\n\r\nWe developed a friendly interface to control all of your virtual servers. Create, resize, rebuild, and snapshot with single clicks. We created a real powerfull Cloud with easy access to all function to be user friendly. You not need to be an expert to create your enviroment.\r\n\r\nWe provide a 99.99% uptime SLA around network, power and virtual server availability. If we fail, we’ll credit you based on the amount of time that service was unavailable.\r\n\r\nMore features http://www.seflow.net/2/index.php/en/services/flexcloud/flextech\r\n\r\nSee plans avaiable http://www.seflow.net/2/index.php/en/services/flexcloud/flexpricing\r\n\r\n\r\nSome Features: \r\n\r\n&lt;ul&gt;\r\n&lt;li&gt;high availability on two italian datacenter (located in Milan)&lt;/li&gt;\r\n&lt;li&gt;Full SSD storage (based on Samsung EVO disks)&lt;/li&gt;\r\n&lt;li&gt;Free 500Mbps DDoS Protection&lt;/li&gt;\r\n&lt;li&gt;Hourly billing&lt;/li&gt;\r\n&lt;li&gt;Free Incoming Bandwidth&lt;/li&gt;\r\n&lt;li&gt;Multiple Location Avaiables (soon avaiable more than 7 locations!!)&lt;/li&gt;\r\n&lt;li&gt;Convert VM into template for multiple deployments&lt;/li&gt;\r\n&lt;li&gt;FREE Private Lan Avaiable&lt;/li&gt;\r\n&lt;li&gt;Dual-Stack IPv4 and IPv6 Capable&lt;/li&gt;\r\n&lt;li&gt;FREE AnyCast DNS&lt;/li&gt;\r\n&lt;li&gt;Change VM Package anytime&lt;/li&gt;\r\n&lt;/ul&gt;\r\n\r\nand much more. [FULL Features here](http://www.seflow.net/2/index.php/en/services/flexcloud/flexpricing)\r\n\r\n&lt;b&gt; How FlexCloud work?&lt;/b&gt;&lt;br&gt;\r\nJust charge your 3€ credit during the order process and you will get 13€ avaiable funds that you can use to create your vms. Deploy a vm is easy and take just one minutes. Anytime you can change package upgrading and downgrading resource. \r\n\r\n&lt;b&gt;Fast FAQ&lt;/b&gt;&lt;br&gt;\r\n-) How am I billed?  &lt;br&gt;\r\nEach FlexCloud is billed per hour up to its monthly cap. You can choose to fund your account via PayPal or you can pay your monthly bill via paypal or bank transfer.\r\n\r\n-) When do you charge my account?&lt;br&gt;\r\nWe charge your credit card on the 1st day of each month after usage. You can pay invoice directly or keep fuds to auto-pay\r\n\r\n-) How do I choose between monthly and hourly billing?&lt;br&gt;\r\nEach VM is billed per hour up to its monthly cap. The monthly cost of your VM is calculated by running the hourly rate for 28 days (672 hours). When you choose a package you can see hourly price and monthly price. If you change package during the month we calculate the sum of days you used new and previous package.\r\n\r\n\r\n[Buy your first 3€ FlexCloud credit and you will get 10€ free additional credit!! with coupon code: lowendtalk-flex](http://www.seflow.net/2/index.php/en/services/flexcloud/flexpricing)\r\n\r\n\r\nDiscover how our distribuited storage [can save your data](http://www.seflow.net/2/index.php/en/services/flexcloud/behindthescene) http://www.seflow.net/2/index.php/en/services/flexcloud/behindthescene\r\n\r\n\r\nFull Avaiable Packages http://www.seflow.net/2/index.php/en/services/flexcloud/flexpricing\r\n\r\n\r\nQuestion? Doubt? Do you want talk with our Head Cloud Manager? [Contact Form](http://www.seflow.net/2/index.php/en/company/contact)"}