{"id": 5762, "date": "2012-11-05 18:14:11", "user": "Damian", "post": "IPXcore is selling storage space on our existing nodes. These nodes are considered 'full' otherwise, however, have quite a bit of unsold disk space available. So _**we're**_ rounding out our servers, and _**you're**_ getting RAID-protected storage space on the cheap. \r\n\r\nThis comes with **_a bit of a caveat_**: as noted that these nodes are considered to be 'full', disk i/o may not be the most awesome you've ever experienced, but it will be sufficient for storage. You are encouraged to exercise the 3-day trial period (outlined in http://ipxcore.com/aup-tos/ in the Billing section ) and determine if this service will be right for you.\r\n\r\nAs of this writing, we're not going to limit what you can run inside your VPS. Want to, for example, run an IRC bouncer and store some things? No problem. We may revisit this policy if it ends up getting abused.\r\n\r\nThese nodes are running either RAID-5 or RAID-10, and entire nodes are backed up with Crashplan. There is no other redundancy or backup provided or offered.\r\n\r\n**_Some company info:_**\r\nWe've been up and running since May of 2011. We're running OpenVZ virtualization on our very own Dell, HP, and Supermicro -powered hardware.\r\nAll server nodes have 100mbit connection, sharing a 2gbit uplink.\r\nPast 30 days support ticket response time: 0 Day(s) 0 Hour(s) 29 Minute(s) and 3 Second(s)\r\n\r\n**_The Offer:_**\r\n\r\n**_ExistingServerStorage:_**\r\n64mb RAM\r\n32mb vSwap (Burst RAM available upon request)\r\n10gb disk space (more available at 3 cents per GB, read below)\r\n200gb monthly transfer \r\n1 CPU core at 50%\r\nBuffalo, NY datacenter (Colocrossing)\r\n\r\n$0.90 per month. This $0.90/month covers costs of IP, RAM, etc.\r\n\r\n**_Sign up here:_** https://ipxcore.com/order/cart.php?a=add&amp;pid=56\r\n\r\n**_As of this writing:_** 4400gb is available!\r\n\r\nYou may select an arbitrary amount of additional storage on the cart page, by entering a number in the Disk Space box. Your monthly transfer will be incremented the same as the amount of disk that you purchase.\r\n\r\nPlease note that due to issues with WHMCS/Solus interaction, your storage space will be wrong after you've paid. Please submit a support ticket after you've paid and your VPS is up-and-running to get it adjusted to the correct value.\r\n\r\n**_FYI:_** As outlined in the AUP/TOS ( http://ipxcore.com/aup-tos/ ), all new registrations MUST be made with verifiable postal address information. Repeating your province/state in the address fields will cause your account to be suspended til you update your account information. These plans are auto-verified with Maxmind; if you get auto-tagged for fraud, open a support ticket for resolution. All plans are also subject to manual verifications.\r\n\r\n**_Test IP:_** 198.144.190.10\r\n\r\nWe also do custom plans. Please contact us with your requirements.\r\n\r\n\r\n"}