{"id": 58324, "date": "2015-07-19 03:57:34", "user": "deployvm", "post": "&lt;b&gt;XHostFire was established in 2011 by IT enthusiasts and professionals. We were sick of services being offline by attacks or other activities, so we chose to specialise in servers with DDoS mitigation.  We offer a range of services such as shared, reseller and cloud hosting. We are also CloudFlare partners.&lt;/b&gt;\r\n\r\n&lt;p&gt;&lt;span&gt;Our LET offerings are listed below.&lt;/span&gt;&lt;/p&gt;\r\n\r\n&lt;p&gt;&lt;span&gt;&lt;b&gt;Prices are already discounted for LowEndTalk!&lt;/b&gt;&lt;/span&gt;&lt;/p&gt;\r\n\r\n&lt;p&gt;&lt;strong&gt;LET special:&lt;br /&gt;&lt;/strong&gt;\r\nCPU: 1x Intel (up to 3.5Ghz)&lt;br /&gt; \r\nRAM: 256MB DDR3&lt;br /&gt;\r\nHDD: 20GB&lt;br /&gt;\r\nBandwidth: 500GB monthly at 1Gbps&lt;br /&gt;\r\nIPv4: 1 Dedicated IP&lt;br /&gt;\r\nIPv6: 5 IPs&lt;br /&gt;\r\nPrice: $5 monthly&lt;br /&gt;\r\nFREE SETUP&lt;br /&gt;&lt;/p&gt;\r\n\r\n&lt;p&gt;&lt;span&gt;ORDER:&lt;/span&gt; &lt;a href=\"https://www.xhostfire.com/clientarea/cart.php?a=add&amp;amp;pid=29\" target=\"_blank\" rel=\"nofollow\"&gt;https://www.xhostfire.com/clientarea/cart.php?a=add&amp;amp;pid=29&lt;/a&gt;&lt;/p&gt;\r\n\r\n&lt;p&gt;&lt;strong&gt;KVMS1:&lt;br /&gt;&lt;/strong&gt;\r\nCPU: 1x Intel (up to 3.5Ghz) &lt;br /&gt; \r\nRAM: 512MB DDR3&lt;br /&gt;\r\nHDD: 50GB&lt;br /&gt;\r\nBandwidth: 750GB monthly at 1Gbps&lt;br /&gt;\r\nIPv4: 1 Dedicated IP&lt;br /&gt;\r\nIPv6: 5 IPs&lt;br /&gt;\r\nPrice: $7 monthly&lt;br /&gt;\r\nFREE SETUP&lt;br /&gt;&lt;/p&gt;\r\n\r\n&lt;p&gt;&lt;span&gt;ORDER:&lt;/span&gt; &lt;a href=\"https://www.xhostfire.com/clientarea/cart.php?a=add&amp;amp;pid=25\" target=\"_blank\" rel=\"nofollow\"&gt;https://www.xhostfire.com/clientarea/cart.php?a=add&amp;amp;pid=25&lt;/a&gt;&lt;/p&gt;\r\n\r\n&lt;p&gt;&lt;strong&gt;LOCATION: Kista, Sweden&lt;/strong&gt;&lt;br /&gt;\r\nFor other offers, please visit our website for a full list - &lt;a href=\"https://www.xhostfire.com/clientarea/vpshosting.php\" target=\"_blank\" rel=\"nofollow\"&gt;https://www.xhostfire.com/clientarea/vpshosting.php&lt;/a&gt;&lt;/p&gt;\r\n\r\n&lt;b&gt;WE HAVE SOME STOCK FOR SIBERIA VIRTUAL SERVERS: https://www.xhostfire.com/clientarea/cart.php?gid=14\r\n(Take it while it lasts)&lt;/b&gt;\r\n\r\n&lt;b&gt;Also in Kazan, Russia: &lt;/b&gt; https://www.xhostfire.com/clientarea/cart.php?gid=17\r\n\r\n&lt;p&gt;Management: SolusVM&lt;br /&gt;\r\nSetup: Within 24 hours. We will soon have instant setup ready!&lt;br /&gt;&lt;/p&gt;\r\n\r\n&lt;p&gt;&lt;b&gt;Network:&lt;br /&gt;&lt;/b&gt;\r\nThe server is located in a modern and newly built datacentre in Stockholm, Sweden. A diverse range of public and private peerings are employed, leading to excellent network performance. The current transit providers are Tele2 (large ISP in Sweden) and RETN (major carrier for EU/US/ASIA).\r\nTele2 provides quality IP transit and routes around Europe and America, ensuring the lowest latency.\r\nRETN is dominant in the CIS (Russia etc) and Asia. Users in Asia can experience shorter paths and latency due to peering at HK-IX and other assosicated exchanges.&lt;/p&gt;\r\n\r\n&lt;p&gt;&lt;b&gt;FAQ:&lt;br /&gt;&lt;/b&gt;\r\nQ: Where are your servers located?&lt;br /&gt;\r\nA: Our virtual servers are located in Stockholm, Sweden within the metropolitan region.&lt;br /&gt;\r\nQ: Do you limit/block any sort of ports or services?&lt;br /&gt;\r\nA: No, we do not block any services or ports. You are free to install and bind the network interface with any service.&lt;br /&gt;\r\nQ: Do you have a refund policy?&lt;br /&gt;\r\nA: Yes, we do have a refund policy if you are not satisified with your inital tests. We can only refund within 24 hours of server activation. If we see abnormalities with your server, you will not be refunded.&lt;br /&gt;\r\nQ: What operating systems can be installed?&lt;br /&gt;\r\nA: Since we are using hardware KVM virtualisation for our hypervisor, any sort of OS that can be installed through an ISO is supported. Please be aware that the provisioning of Windows incurs an extra fee.&lt;br /&gt;\r\nQ: Do you offer custom packages?&lt;br /&gt;\r\nA: Sure! We can offer any sort of configurations that is suited to your needs. Please contact us through email or ticket for further details.&lt;br /&gt;\r\nQ: Are you virtual servers managed?&lt;br /&gt;\r\nA: We offer some management (semi-managed) of your virtual machine, and this includes basic monitoring and system checks. If it is an isolated incident relating to a customised script or software, we may charge an extra fee. &lt;br /&gt;\r\nQ: How I purchase additional IPs?&lt;br /&gt;\r\nA: You can buy additional IPs through the addon section of our billing manager or submit a ticket for customised offers. We can offer IPs in different regions (e.g. in AFRNIC, ARIN) for geolocation or specialised purposes.&lt;br /&gt;\r\nQ: Do you use the latest hardware and is your bandwidth dedicated?&lt;br /&gt;\r\nA: We use only enterprise hardware from Kingston, Sandisk, Western Digital, Intel and HP for the main components in our server. The bandwidth speed on our hypervisor is dedicated 1Gbps and you should not suffer any network performance issues.&lt;br /&gt;&lt;/p&gt;\r\n\r\n&lt;p&gt;&lt;b&gt;Terms of Service and Acceptable Use Policy:&lt;br /&gt;&lt;/b&gt;\r\nWe try to be as lenient as possible on the type of content or activities allowed. \r\nProhibited content or activities&lt;br /&gt;\r\n- Any sort of spam, mass-mailing or scripts that generate unwanted mails without prior permission.&lt;br /&gt;\r\n- Spreading of malware, viruses or related tools from your server.&lt;br /&gt;\r\n- Any kind of outbound floods or abuse of bandwidth that can be considered as (D)DoS.&lt;br /&gt;\r\n- Hacking other servers, including but not limited to brute forces, dictionary attacks etc.&lt;br /&gt;\r\n- Child or illegal pornography&lt;br /&gt;\r\n- Use of the server for currency mining (bitcoin, litecoin etc) or excessive CPU consumption without prior permission.&lt;br /&gt;&lt;/p&gt;\r\n\r\n&lt;p&gt;Please confirm with us if you are unsure about the content you are intending to host, but we keep an open mind! Please remember this is Sweden.&lt;/p&gt;\r\n\r\n&lt;p&gt;&lt;b&gt;Payment methods:&lt;br /&gt;&lt;/b&gt;\r\nWe accept PayPal directly or credit cards/debit/bank cards through 2CheckOut. We are business verified and all transactions will be performned under SSL.&lt;br /&gt;&lt;/p&gt;\r\n\r\n&lt;p&gt;&lt;b&gt;Network testing:&lt;/b&gt;&lt;br /&gt;\r\nIP: 46.227.67.1&lt;br /&gt;\r\nTestfile: Contact us&lt;br /&gt;&lt;/p&gt;\r\n\r\n&lt;p&gt;*We are quite flexible with bandwidth, and additional bandwidth can be purchased at a low price. For any reason you exceed the quota, please let us know and we will work something out.&lt;/p&gt;"}