{"id": 5895, "date": "2012-11-11 09:15:13", "user": "KuJoe", "post": "As previously discussed in another thread, we're getting into the VPN business after numerous requests so here we are!\r\n\r\nWe're still building our infrastructure so keep that in mind when reviewing our services. Right now in the beta stage we only have 3 PPTP servers, 3 OpenVPN servers, and 2 authentication servers in our Tampa, FL. facility but we have 5 other locations we are planning on setting up in just for our VPN services. Keep in mind that all of the servers are on a different network than our VPSs (except for one of the authentication servers). The servers are still in our cabinet and owned by us, but they have a direct uplink to the data center switch so there's no worries about sharing bandwidth with our other services.\r\n\r\nHere's a breakdown of some of the features included:\r\nNo data retention - Logs take up space so we don't keep logs.\r\nData encryption - PPTP offers 128bit encryption while OpenVPN offers 1024bit encryption. Our hard drives are also encrypted and password protected.\r\nRotating IPs - If you need a new IP for any reason, just disconnect and wait 2 minutes and reconnect, the IP cycle so you should get a new IP but in the beta service there are only a few IPs in circulation.\r\n100Mbps port - During the beta, all servers are limited to 100Mbps ports that are shared by all clients.\r\n\r\nSo here's what you get for FREE:\r\n21 days of free access (after which the plan is automatically terminated)\r\n50-100GB of bandwidth (you chose what you want, I set the option to test our the slider and module)\r\n2 concurrent connections per client for personal use\r\nAccess to PPTP and OpenVPN servers in our Florida location\r\nA nice discount if you decide to switch from a beta to a paid account once we go live\r\n\r\n[Get an account here.](https://my.securedragon.net/cart.php?a=add&amp;pid=79)\r\n&lt;i&gt;Free beta accounts will not be reviewed if they fail our anti-fraud checks so please fill out all information as accurately as possible and do not order from a VPN or proxy. One beta account per person.&lt;/i&gt;\r\n\r\nFor more info, you can check out our website here: [cakevpn.com](http://cakevpn.com)\r\nOr check out our KB here: [Knowledgebase](https://my.securedragon.net/knowledgebase.php?action=displaycat&amp;catid=14)\r\n\r\nAny feedback is appreciated. As I mentioned before I am not very knowledgeable with OpenVPN so support for it is very limited at the moment (we are working to remedy this). If you have any issues feel free to contact me on here or raise a ticket. Thanks!"}