{"id": 64082, "date": "2015-09-24 16:01:08", "user": "AnthonySmith", "post": "Hi Folks,\r\n\r\nlatest LES and LHC plans from Inception Hosting with the updated and upgraded NL LES and LHC plans.\r\n\r\nStarting with LittleHappyCloud **KVM** Netherlands, quarterly payment options and the 768 and 1024 plans recently added, NAT IPv4 and a /64 IPv6 as standard and dedicated IPv4 available for purchase during checkout.\r\n\r\n&lt;img src=\"http://i.imgur.com/1o7U2G1.png\" /&gt;\r\n\r\nOrder Links: http://littlehappycloud.net/\r\n\r\nStill some limited space available in Singapore for **KVM** also on LittleHappyCloud:\r\n\r\nPlans all come with NAT IPv4 and a /96 IPv6 as standard.\r\n\r\n&lt;img src=\"http://i.imgur.com/Cz4NGng.png\" /&gt;\r\n\r\nOrder Links: http://littlehappycloud.net/singapore\r\n\r\n\r\nNow moving on to LowEndSpirit **OpenVZ** offers:\r\n\r\nThere are 7 locations available from Inception Hosting (15 locations total), all come with an IPv6 subnet ranging from /64 to /112 and NAT IPv4 and are €3.00 p/YEAR\r\n\r\n&lt;img src=\"http://i.imgur.com/0AOqD7f.png\" /&gt;\r\n\r\nOrder Links: https://clients.inceptionhosting.com/cart.php?gid=13\r\n\r\nRecently the LES lite packages were launched in Miami, Dallas and The Netherlands all at the low cost of €1.99 p/year\r\n\r\nNL = 64mb Ram, 1GB disk, 350GB BW\r\n\r\nMiami = 128mb Ram, 1GB disk, 200GB BW\r\n\r\nDallas = 128mb Ram, 1GB Disk, 200GB BW\r\n\r\n\r\nOr you can but all 3 in a bundle for €5.75 p/year with the **LowEndSpirit Lite** https://clients.inceptionhosting.com/cart.php?a=add&amp;bid=5\r\n\r\nYou can get all 7 Inception Hosting ran LowEndSpirit Locations for €17.50 p/year with the **LES All 7 locations Bundle** here: https://clients.inceptionhosting.com/cart.php?a=add&amp;bid=3\r\n\r\nAnd finally the **Happy Spirit Bundle**, which combines LES and LHC, you get all 7 LES **OpenVZ** locations as well as both LHC (Netherlands and Singapore) 128mb **KVM** packages, you can get that here: https://clients.inceptionhosting.com/cart.php?a=add&amp;bid=4 for €25.00 p/Year\r\n\r\n\r\nAll the above packages come with haproxy intergrated in to solusvm so you can host a site on port 80 regardless of this being NAT IPv4.\r\n\r\nIt is very simple, no scripts or messing around, just click on the proxy domains tab in solusvm and enter the domain, your done, e.g.\r\n\r\n&lt;img src=\"http://i.imgur.com/WjNuVMt.png\" /&gt;\r\n\r\nYou get 20 TCP and 20 UDP ports forwarded automatically and a pre forwarded port for ssh over IPv4 so you can get in straight away without having to change any configs, it has been made as easy as possible now and is almost completely automated.\r\n\r\n\r\nBasic terms of all of the above are:\r\n&lt;/pre&gt;\r\nPrivate proxy or VPN is fine\r\nIRC blocked in Miami\r\nNo TOR of any kind allowed\r\nNo torrents of any kind allowed\r\nCPU must not average over 30% of 1 core in a 24 hour period\r\nNo gaming or revenue bots of any kind\r\n&lt;/pre&gt;\r\n\r\n\r\nThanks for reading, any questions feel fee to ask, custom plans on LES or LHC are not being done, the only location with dedicated IPv4 as an add-on is LHC NL.\r\n\r\nSome test IP's and DC info are available here for the LHC/LES locations https://wiki.nyr.es/lowendspirit_test_files_and_ips"}