{"id": 7473, "date": "2013-01-21 02:33:05", "user": "laaev", "post": "ChicagoVPS is back with an unbeatable offer, we invite anyone to try out our services at no risk - the first month being just $1. ChicagoVPS offers plenty of perks and benefits to all customers, such as free DNS hosting, free monitoring, free manual backups along with automated weekly offsite backups of all ChicagoVPS nodes, 24x7 support, discounted pricing on control panel licenses, and so much more.\r\n\r\nA particular provider on here is migrating services away from the coast, we invite you to ChicagoVPS as well as we proudly offer VPS hosting **directly** out of Los Angeles, CA right in the best coast - along with 2 other locations you can choose from _(Chicago, IL or Buffalo, NY)_.\r\n\r\nChicagoVPS now rolls out automated weekly offsite backups of our nodes to ensure your data is in good hands, and we also offer free central backups for customers to take in SolusVM.\r\n\r\n- 2048MB (**2GB**) Dedicated Ram\r\n- **80 GB** Diskspace\r\n- **2TB** Monthly Bandwidth\r\n- 100Mbps Port\r\n- **2x** IPv4 Address\r\n- SolusVM/OpenVZ\r\n- Instant Setup\r\n- Free Backups\r\n- 3 Location Choices: Los Angeles, Chicago, or Buffalo!\r\n\r\nDiscounted Price: **$1.00 first month**, $7.00 per month thereafter. No contracts or hidden fees!\r\n\r\nUse promo code: **TeamCVPS** when checking out to receive first month at $1!\r\n\r\nOrder in Los Angeles, CA - https://billing.chicagovps.net/cart.php?a=add&amp;pid=143\r\nOrder in Chicago, IL - https://billing.chicagovps.net/cart.php?a=add&amp;pid=141\r\nOrder in Buffalo, NY - https://billing.chicagovps.net/cart.php?a=add&amp;pid=142\r\n\r\nCustomers who order this VPS may also select to order a discounted cPanel license at $10/month or DirectAdmin license at $5/month in the order form.\r\n\r\nThis offer is good while supplies last.\r\n\r\n**BONUS:** Free 25 Slot Mohawk Voice Server if you order the above VPS - https://billing.chicagovps.net/cart.php?a=add&amp;pid=46\r\n\r\nFree Monitoring: https://billing.chicagovps.net/cart.php?a=add&amp;pid=62\r\n\r\n**Network Test:**\r\n\r\nChicago, IL\r\nTest IP: 206.217.137.110\r\n\r\nBuffalo, NY\r\nTest IP: 75.127.3.3\r\n\r\nLos Angeles, CA\r\nTest IP: 198.23.128.127\r\n\r\nIf anyone has any questions, please email sales@chicagovps.net - we appreciate the opportunity and look forward to hosting you!\r\n\r\nThanks,\r\n\r\nKevin"}