{"id": 7586, "date": "2013-01-26 04:37:31", "user": "Brandon", "post": "**ProvisionHost.com**\r\nhttp://provisionhost.com\r\n\r\nIt has been quite some time since I posted our last offer. Over the past few weeks we've been doing a tremendous amount of restructuring at Provision Host. This includes resolving specific network issues in our Toronto location and thinking through different products and services you guys may be interested in. Since Provision Host was established in 2010, we've always focussed on offering great value to clients. In doing so, we've made it a commitment as a company, to continue striving for this. And quite frankly, other competing companies charge a medium - high end amount for the exact or similar services we offer. This is where we truly stand out and what has continued to drive forward our success.\r\n\r\nToday I present to you, two new plans (1 for each location)! This is exclusively for the LET community. The specifications are below...\r\n\r\n**PHVPS.25 Plan**\r\nDedicated RAM 128MB\r\nBurstable to 256MB\r\n5GB Disk Space\r\n500GB Bandwidth\r\nSolusVM Control Panel\r\nTun / Tap Enabled Upon Request\r\nOpenVZ\r\n\r\n**Annual Cost: $13.33 USD**\r\n\r\nToronto Location Order: [Order Now](https://client.provisionhost.com/cart.php?a=add&amp;pid=107)\r\nDallas Location Order: [Order Now](https://client.provisionhost.com/cart.php?a=add&amp;pid=107)\r\n\r\nNow at a first glance these specifications of this plan may not be tremendously persuading or anything special. However, what really makes our VPS server line stand out is simply the facilities we are in. In addition, to the networks that are accompanied with them. If uptime and redundancy is of utmost importance to you, we've got that covered. At this time we are offering two locations with the new plans. Toronto, which has been our most popular on LET, and Dallas.\r\n\r\n_Toronto Datacenter:_\r\nhttp://www.peer1.ca/infrastructure/datacenter-toronto\r\n\r\n_Dallas Datacenter:_\r\nhttp://www.databank.com/\r\n\r\nDallas Test File: http://dallas.provisionhost.com/100mb.test\r\nToronto Test File: http://toronto.provisionhost.com/100mb.test\r\n\r\nDallas Reviews:\r\nhttp://www.lowendtalk.com/discussion/3714/review-provision-host\r\nhttp://www.lowendtalk.com/discussion/3728/review-provisionhost-phvps-.5-pack\r\n\r\nI'd like to take the time to personally thank you for reading this offering (If you haven't read the whole thing, that's still fine). If you have any questions you may contact us at any time.\r\n\r\n**Sales: [Submit Sales Ticket](https://client.provisionhost.com/submitticket.php?step=2&amp;deptid=3)\r\nPersonal Skype: ph-brandon**"}