{"id": 75938, "date": "2016-02-16 09:09:02", "user": "Jonchun", "post": "![](https://www.gomach5.com/assets/images/logo.png)\r\n\r\nHello Everyone! We're back to provide more quality servers at affordable pricing. Today we've bumped up our E3-1220 offer to allow you to save more for commiting to a longer payment period.\r\n\r\nWe currently do not offer low end VPS, but if you're interested in them please post/PM me so we can judge if it's a market we should look in to!\r\n\r\nWe are colocated at Psychz in LA and fully own **all** our hardware.\r\n\r\n**Features**  \r\n- FREE 20Gbps Mitigation  \r\n- Tier 1 Bandwidth Providers including CT, CN2, CU  \r\n- 1 Gbps port as standard  \r\n- /29 IPv4 (5 Usable) - /64 IPv6 (Upon request)  \r\n- Free Hardware Replacement  \r\n- KVMoIP on demand  \r\n- 100% PIE approved ( @PieNotEvenEaten )  \r\n\r\n**Location:** Los Angeles\r\n\r\n\r\n== E3-1220 ==  \r\nE3-1220 (4 cores, 3.1Ghz with a turbo of 3.4Ghz, 8MB cache)  \r\n8 GB DDR3 ECC RAM  \r\n120 GB SSD  \r\n/29 IPv4  \r\n10 TB Bandwidth @ 1 Gbps  \r\n$49/month  \r\n[ORDER HERE](https://manage.gomach5.com/cart.php?a=add&amp;pid=9)\r\n\r\n\r\n\r\n**Need more RAM? No problem!** Simply purchase this server on a three month billing cycle and get either this RAM upgraded to 16GB **FOR FREE* or $5/month discount for life.\r\n\r\nIf you are after an even better deal, purchase this box on a six month basis and get double the RAM **AND** a $5/month discount!\r\n\r\n\r\n== HDD SPECIAL ==  \r\nDual L5420 (8 cores, 2.5Ghz, 12MB cache)  \r\n16 GB RAM  \r\n500 GB SATA 7200  \r\n/29 IPv4 (DDoS Protected!)  \r\n10 TB Bandwidth @ 1 Gbps  \r\n$40/month  \r\n[ORDER HERE](https://manage.gomach5.com/cart.php?a=add&amp;pid=6)\r\n\r\n\r\n== SSD SPECIAL ==  \r\nDual L5420 (8 cores, 2.5Ghz, 12MB cache)  \r\n16 GB RAM  \r\n120 GB SSD  \r\n/29 IPv4 (DDoS Protected!)  \r\n10 TB Bandwidth @ 1 Gbps  \r\n$44/month  \r\n[ORDER HERE](https://manage.gomach5.com/cart.php?a=add&amp;pid=7)\r\n\r\n\r\nDisk Upgrade: 128 GB SSD - $10/mo  \r\n1Tb Enterprise SATA - $10/mo  \r\nBringYourOwnDisk! - $25 setup [Disk Replacements are client's responsibility]  \r\n\r\nProvisioning is guaranteed to be within 2 business days of ordering, not including holidays. However, the expected provisioning time is significantly less. If your server has not been provisioned at the end of the 2nd business day, you are entitled to a full refund.\r\n\r\nAny offers marked \"Special\" are for new clients only. Existing clients may order another server with us, but cannot be used to replace an existing service.\r\n\r\nWhile most of our dedicated servers have IPMI it is **not guaranteed** for our LE* offers. If this absolutely necessary for you then please contact sales@gomach5.com prior to purchasing and we will see what can be done.\r\n\r\n**== Questions? ==**\r\n\r\nWe will be answering questions through this thread or at sales@gomach5.com. Existing clients should use proper support channels as needed. All sales questions will be responded to within 24 hours.\r\n\r\nThank you!\r\n\r\nTest IP: http://la-lg.gomach5.com/\r\n\r\nWebsite: http://www.gomach5.com/\r\n\r\n**== Reviews on LET! ==**  \r\n\r\n&gt; @mackenzie10 said: Love it! I can definitely vouch for the great support and commitment to continued development of the service's feature set. I feel pretty lucky to have found gomach5 and it fits my needs perfect as a box for some code projects.\r\nI just wanted to show some support too!\r\n\r\n.\r\n\r\n&gt; @lukesUbuntu said: very fast deployment was super quick! so far so good\r\n\r\n.\r\n\r\n&gt; @doghouch said: Never tried a GoMach VPS before, but the shared hosting is good. Plus, I know that Jonchun puts a lot of effort, considering the fact that the support is near-to-instant. 100% recommended :)\r\n\r\n.\r\n\r\n&gt; @PieNotEvenEaten said: 100 percent PIE approved provider!\r\n\r\n.\r\n\r\n&gt; @TinyTunnel_Tom said: Really good provider. Recommended 100%\r\n\r\n.\r\n\r\n&gt; @jarland said: Can vouch for this guy. He's really giving 110% to provide great service.\r\n\r\n.\r\n\r\n&gt; @hawc said: They are some pretty sweet deals - and support is fantastic too. I get replies in under 10 minutes, and they exceed what I was expecting too.\r\n\r\n.\r\n\r\n&gt; @lontong said: Got mine @ $31. Extremely satisfied with the network performance. Would definitely recommend your services to everyone!\r\n\r\n.\r\n\r\n&gt; @vavai said: I pick a new one on Jan 1. jonchun are quite responsive. Server was up within 1 day. I got a little problem regarding bridge network on Debian 8/Proxmox network but jonchun help me within minutes. Quite satisfied so far both for support response and server performance.\r\n\r\n.\r\n\r\nWith so many happy clients, I'm sure you want to be one too! Pick one up today ;)"}