{"id": 7610, "date": "2013-01-27 16:08:43", "user": "WinterHosting", "post": "Hey all, \r\n\r\nI am currently running a Public Test of our OpenVZ Platform, to decide if it should feature in our April 2013 Launch.\r\nWith this in mind, its time to test and prove the concept.\r\n\r\n**THIS IS IPV6 ONLY, THERE ARE NO IPV4 ADDRESSES AVAILABLE AT PRESENT**\r\n\r\nWe currently have 16 OpenVZ Containers free for 60-days there is no billing information required, prices will be announced well before the trial ends, thats what this test is for, to see exactly what each server is capable of, what its capable of hosting, and how it works in the so called real world.\r\n\r\nWe expect pricing to start at £7.50 PER QUATER for 256mb as listed below, and +£5.00 for each step in the package, again PER QUATER.\r\n\r\n**VPS 256 (4 Available)** 3 Remaining\r\n1 CPU Core, \r\n256MB RAM, \r\n10GB DiskSpace, \r\n8 x IPV6 Addresses,\r\nLinux OS, \r\n10Mbps Port, \r\nAll the traffic you can eat, \r\nFull Root Access\r\n\r\n**VPS 512 (4 Available)**\r\n1 CPU Core, \r\n512MB RAM, \r\n15GB DiskSpace, \r\n16 x IPV6 Addresses,\r\nLinux OS, \r\n10Mbps Port, \r\nAll the traffic you can eat, \r\nFull Root Access\r\n\r\n**VPS 768 (4 Available)** None Remaining - All Provisioned. Please Contact us by PM. Resorces Permitting you may still be able to Obtain one.\r\n2 CPU Core, \r\n768MB RAM, \r\n20GB DiskSpace, \r\n32 x IPV6 Addresses,\r\nLinux OS, \r\n100Mbps Port, \r\n1TB Traffic, \r\nFull Root Access\r\n\r\n**VPS 1024 (4 Available)** None Remaining - All Provisioned. Please Contact us by PM. Resorces Permitting you may still be able to Obtain one.\r\n2 CPU Core, \r\n1024MB RAM, \r\n40GB DiskSpace, \r\n64 x IPV6 Addresses,\r\nLinux OS, \r\n100Mbps Port, \r\n2TB Traffic, \r\nFull Root Access\r\n\r\n**We will have 4 Full KVM VM's Available in a few days each consisting of**\r\n\r\n4 Cores, 2GB RAM, 250GB Diskspace, 2.5TB Bandwidth, 100Mbps Port full Root Access, Windows/Linux Operating Systems. They will be announced here.\r\n\r\n**_Other Information_**\r\n\r\nAbuse will be dealt with accordingly, Termination, During the test we are pretty flexible, after all the more load generated the better from our perspective, Spamming is a big no no, we wont bother emailing you, your VPS will simply be terminated.\r\n\r\nAny questions please feel free to ask, if you would like to test with different specifications again just ask, if we can supply it and its within our testing plans we will allocate it to you."}