{"id": 7804, "date": "2013-02-06 07:35:21", "user": "marcm", "post": "We are bringing you once more our most popular packages at $7/month: The 1GB Xen and KVM Enterprise packages. As a bonus you will also get Free DDoS Protection and Free Enterprise Level Managed DNS service.\r\n\r\nA few words about how our DDoS protection works and why it is important to have it: the DDoS protection that we offer works at the network level so attacks are intercepted and mitigated there before they get to the application level (i.e. your web server). There is no interruption in your service (unless multiple consecutive attacks take place, then we suspend your server for a few minutes. If the attacks persist we can assign you a new IP address and null route your old one. Because attacks are mitigated at the network level we do not keep detailed logs of them.\r\n\r\nAbout our DNS service: we offer free DNS service with each VPS, and each customer can host up to 500 domains with our free DNS service.\r\n\r\n**Our DNS servers are**:\r\nkip.ns.vpsnodebox.net - Phoenix, AZ\r\nlyn.ns.vpsnodebox.net - Chicago, IL\r\nben.ns.vpsnodebox.net - Denver, CO\r\ngin.ns.vpsnodebox.net - Munster, DE\r\ndan.ns.vpsnodebox.net - Amsterdam, NL\r\nvic.ns.vpsnodebox.net - New York, NY\r\n\r\nAnd here are our LET $7/month VPS packages:\r\n\r\n1) **Enterprise KVPS 1024 (KVM)**:\r\nCPU Cores: 2\r\nGuaranteed RAM: 1024MB\r\nSwap Enabled: Yes\r\nStorage Space: 40GB\r\nBandwidth: 1TB\r\nNetwork Speed: 50 Mbit (per VPS)\r\nDedicated IPv4 Addresses: 1\r\nAvailable IPv6 Addresses: Yes\r\nAdvanced Control Panel: Yes\r\n99.9% SLA: Yes\r\nHardware DDoS Protection: Yes\r\nManaged DNS Service: Yes\r\nPrice: $7 / month\r\nCoupon code: KVM7LET\r\nDirect order link: https://my.vpsnodebox.com/cart.php?a=add&amp;pid=40\r\nService page link: http://www.vpsnodebox.com/enterprise-kvm-vps-servers\r\n\r\n2) **Enterprise EXVPS 1024 (Xen)**:\r\nCPU Cores: 6\r\nGuaranteed RAM: 1024MB\r\nSwap Enabled: Yes\r\nStorage Space: 40GB\r\nBandwidth: 1.25TB\r\nNetwork Speed: 100 Mbit (per VPS)\r\nDedicated IPv4 Addresses: 1\r\nAvailable IPv6 Addresses: Yes\r\nAdvanced Control Panel: Yes\r\n99.9% SLA: Yes\r\nHardware DDoS Protection: Yes\r\nManaged DNS Service: Yes\r\nPrice: $7 / month\r\nCoupon code: XEN7LET\r\nDirect order link: https://my.vpsnodebox.com/cart.php?a=add&amp;pid=11\r\nService page link: http://www.vpsnodebox.com/enterprise-xen-vps-servers\r\n\r\nWe update our Xen and KVM templates frequently, as well as our ISO images. At checkout you will find a complete list of available templates and ISO images. We build our own templates from scratch and we test them properly before releasing them. You can use our templates with confidence, they work very well.\r\nFor KVM we support the following Operating Systems:\r\n&lt;ul&gt;\r\n&lt;li&gt;Linux (please see distribution list below)&lt;/li&gt;\r\n&lt;li&gt;FreeBSD 8.3 and 9.1&lt;/li&gt;\r\n&lt;li&gt;OpenBSD 5.2&lt;/li&gt;\r\n&lt;li&gt;NetBSD 6.0&lt;/li&gt;\r\n&lt;/ul&gt;\r\nFor KVM and Xen we support the following Linux Distributions:\r\n&lt;ul&gt;\r\n&lt;li&gt;Arch Linux 2013.01&lt;/li&gt;\r\n&lt;li&gt;CentOS 5.9 and 6.3&lt;/li&gt;\r\n&lt;li&gt;Oracle Linux 6.3 (R6 U3 Server)&lt;/li&gt;\r\n&lt;li&gt;Scientific Linux 5.8 and 6.3&lt;/li&gt;\r\n&lt;li&gt;Cloud Linux 5.8 and 6.3&lt;/li&gt;\r\n&lt;li&gt;Fedora 17 and 18&lt;/li&gt;\r\n&lt;li&gt;Debian 6.0 and 7.0 (beta)&lt;/li&gt;\r\n&lt;li&gt;Ubuntu 10.04, 11.10, 12.04 and 12.10&lt;/li&gt;\r\n&lt;li&gt;Gentoo Linux 2012.07 and 2013.01&lt;/li&gt;\r\n&lt;li&gt;openSUSE 12.2&lt;/li&gt;\r\n&lt;li&gt;Slackware Linux 13.37 and 14.0&lt;/li&gt;\r\n&lt;/ul&gt;\r\nLocation: Phoenix, AZ\r\nData Center: PhoenixNAP\r\nTest IPv4: 198.15.125.177\r\nTest IPv6: 2001:470:c:1f4::a\r\nTest files: http://test.vpsnodebox.com - this address works over IPv4 and IPv6\r\n10MB file: http://test.vpsnodebox.com/10mb.bin\r\n100MB file: http://test.vpsnodebox.com/100mb.bin\r\n1000MB file: http://test.vpsnodebox.com/1000mb.bin\r\n\r\nFrequently Asked Question:\r\n&lt;ul&gt;\r\n&lt;li&gt;Q: Why is my first invoice more than $7 or less than $7? How does your billing work?&lt;br&gt;\r\nA: Our billing system is prorated around the middle of each month. We do this in order to align customer with the first day of each month for their next invoice due date. For instance if you order service before the middle of January then your total at checkout will be less than $7 and your next invoice will be due on February 1st. If your order after the middle of January then you will be billed for the remainder of January and also for February and your next invoice will be due on March 1st.&lt;/li&gt;\r\n&lt;li&gt;Q: What is the difference between the Xen Business Package and Xen Enterprise Package?&lt;br&gt;\r\nA: We deploy the Xen Business Package VPS servers on smaller nodes with more storage and less CPU power (Intel Xeon E3), while we deploy the Xen Enterprise Package VPS servers on larger nodes (Intel Xeon E5) with a little bit less storage, more CPU power and faster I/O speeds.&lt;/li&gt;\r\n&lt;li&gt;Q: Why is there a limit for the network speed? Is this per server or per VPS?&lt;br&gt;\r\nA: The network speed limit is per VPS and we do this in order to avoid network congestion. This way we can ensure that all our customers get a decent amount of network traffic 24/7.&lt;/li&gt;\r\n&lt;li&gt;Q: Can I deploy IRC or VPN services? What about torrenting?&lt;br&gt;\r\nA: If you wish to deploy IRC or VPN services on our network just open a support ticket to let us know. We will give you our written consent. Torrenting of copyrighted materials or engaging in other illegal activities is not allowed.&lt;/li&gt;\r\n&lt;li&gt;Q: How many IPv4 addresses can I get with my VPS? What about IPv6?&lt;br&gt;\r\nA: Our lowest VPS packages come with 1 IPv4 address, while our higher end VPS packages come with up to 12 IPv4 addresses. Because IPv4 space is limited, you will need to provide a written justificatio (in a support ticket) for each additional IPv4 address that you request over the default addresses that you are assigned. If you need IPv6 please open a support ticket and we will assign your VPS a /64 IPv6 block from Hurricane Electric.&lt;/li&gt;\r\n&lt;/ul&gt;\r\nIf you have any other questions please don't hesitate to ask.\r\nMarc M. @ VPS Node Box\r\n"}