{"id": 78776, "date": "2016-03-19 02:21:03", "user": "BBGNBrian", "post": "It's been a long time since we have posted an offer here on the LowEndTalk forums so we figured we would make a come back with an awesome deal on our new dedicated server.\r\n\r\n\r\n**Intel Dual Quad Core L5420**\r\n\r\n&lt;ul&gt;\r\n&lt;li&gt;2 x 2 TB Enterprise SATA Drives&lt;/li&gt;\r\n&lt;li&gt;1 Gbps Dedicated Network Uplink&lt;/li&gt;\r\n&lt;li&gt;10 TB Bandwidth Transfer&lt;/li&gt;\r\n&lt;li&gt;/30 or /29 network block FREE upon justification, further discounts available for /28 etc. &lt;/li&gt;\r\n&lt;li&gt;North Carolina Location Only! &lt;/li&gt;\r\n&lt;/ul&gt;\r\n\r\n  [Configure now!](https://portal.bigbrainglobal.com/cart.php?a=add&amp;pid=367)\r\n\r\n**LIMITED TIME OFFER**\r\n\r\nTerms: New server orders only\r\n\r\nCoupon Code: **helloagain**\r\n\r\n**Who Are We?**\r\n\r\n[Big Brain Global Networks](http://www.bigbrainglobal.com) is a group of hosting enthusiasts formed on the premise that there were a lot of individuals and business that needed web hosting, but did not have the wherewithal to maximize their environment’s performance. Our network starts right here in Northern Virginia where we are located in Reston, through North Carolina, Texas, Chicago, and London. We pride ourselves on customer support, transparency, and striving to provide the most rewarding hosting experience at an affordable cost. The internet has changed the way in which we live, communicate, and obtain information. Big Brain Global can be your conduit to hundreds of millions of people and businesses around the world. Big Brain Global realizes that your website could be your livelihood, and we are confident choosing us as your hosting provider will contribute to your success.\r\n\r\n&lt;ul&gt;\r\n**Big Brain Global Quick Facts:**\r\n&lt;li&gt;Founded in 2010&lt;/li&gt;\r\n&lt;li&gt;Fully Licensed and Compliant business in the state of Virginia&lt;/li&gt;\r\n&lt;li&gt;We own our hardware &lt;/li&gt;\r\n&lt;li&gt;We control our network - if something breaks, we know when/why and how! No need to rely others for answers&lt;/li&gt;\r\n&lt;li&gt;FULLY Redundant network infrastructure&lt;/li&gt;\r\n&lt;/ul&gt;"}