{"id": 88163, "date": "2016-07-24 12:37:14", "user": "jar", "post": "(Please note that we cannot migrate you from other plans to a promotion to save money. You are welcome to order a new plan as you see fit, but we cannot make extra effort to assist in reducing our income in that way)\r\n\r\nHi everyone! If you don't know me, I run a small business that provides e-mail hosting for your domain. I'm here to offer you a hell of a deal for summer time! But first, let me introduce MXroute.\r\n\r\nNo longer must you be bound by:\r\n\r\n- Running your own mail server.&lt;br&gt;\r\n- Paying Google's per user fee.&lt;br&gt;\r\n- Using shared hosting that only offers e-mail because cPanel supports it.\r\n\r\nHere's why you want to use MXroute:\r\n\r\n- Fully managed e-mail.&lt;br&gt;\r\n- Fully managed, fully redundant DNS.&lt;br&gt;\r\n- cPanel for user facing control panel (see below if that turns you off).&lt;br&gt;\r\n- One block of storage for all your accounts, your choice how it gets used.&lt;br&gt;\r\n- Greylisting&lt;br&gt;\r\n- in-house custom filters\r\n\r\nA while back, we moved to cPanel because it is well known and updated by a dedicated and fully staffed team. I realize that cPanel based hosts are a dime a dozen, but you cannot simply install cPanel and be MXroute. A lot of work goes into the back end to ensure quality e-mail delivery, and we provide you with fully managed support via support tickets, Twitter, and text message.\r\n\r\nNow, here's my insane offer for the summer of 2016!\r\n\r\nPlan: SUMMER2016&lt;br&gt;\r\nStorage: 15GB&lt;br&gt;\r\nE-mail Accounts: Unlimited&lt;br&gt;\r\nDomains: Unlimited&lt;br&gt;\r\nPrice: $10/year&lt;br&gt;\r\n&lt;a href=\"https://billing.mxroute.com/cart.php?a=add&amp;pid=46\"&gt;Click here to order&lt;/a&gt;\r\n\r\nWhen dealing with MXroute, I want you to feel like you are dealing with a trusted friend and not a large, uncaring corporation. MXroute is run by myself (Jarland Donnell), my best friend for 15 years (Ryan Arp), and my wife (Christine Donnell). We really look forward to doing business with more of the awesome people here at LET!"}