{"id": 88259, "date": "2016-07-26 01:24:57", "user": "MikeA", "post": "[ExtraVM](https://extravm.com) (Q4 2014) offers OpenVZ and KVM VPS in Montreal, Gravelines and Dallas. Our KVM are more expensive, but OpenVZ are considered budget prices and utilize OVH Game DDoS mitigation, which is known to work well against the majority of attacks with minimal drops for game and VoIP. You can request custom network firewall rules to be assigned for your IPv4. If you're interested check out our LET plans below. We take weekly backups of all OpenVZ VPS, and have multiple resource monitoring setup for our systems. We also support IPv6 and include it with every server.  \r\n  \r\nIf you have a question just submit a ticket, typical response time during North America daytime hours is under 10 minutes. You can also contact us via live chat on our website if we're available.  \r\n  \r\n**// 512MB OVZ**  \r\n1 CPU Core (4.0GHz)  \r\n512MB Dedicated RAM  \r\n6GB SSD Space  \r\n1TB Bandwidth (Free inbound)  \r\n100Mbps Port  \r\n1 IPv4 + 1 IPv6  \r\nDDoS Protected (Anti-DDoS Game)  \r\nMontreal, Canada &amp; Gravelines, France  \r\n$3.00/month  \r\n  \r\n**// 1024MB OVZ**  \r\n2 CPU Cores (4.0GHz)  \r\n1024MB Dedicated RAM  \r\n15GB SSD Space  \r\n2TB Bandwidth (Free inbound)  \r\n100Mbps Port  \r\n1 IPv4 + 1 IPv6  \r\nDDoS Protected (Anti-DDoS Game)  \r\nMontreal, Canada &amp; Gravelines, France  \r\n$6.00/month  \r\n  \r\nInterested? Order below.  \r\nMontreal, CA - [https://www.extravm.com/billing/cart.php?gid=11](https://www.extravm.com/billing/cart.php?gid=11)  \r\nGravelines, FR - [https://www.extravm.com/billing/cart.php?gid=15](https://www.extravm.com/billing/cart.php?gid=15)  \r\nWe also plan to offer VPS in Ashburn, VA and Sydney, AU later this year.  \r\n\r\nUse the promotion code \"LET10\" to get 10% off recurring on any OpenVZ plan. We also have KVM VPS on Psychz Networks in Dallas, however these are not considered LET pricing.\r\n\r\nAdditional IPv4 can be requested after ordering for $1.5/m and additional IPv6 for free. We support most common Linux distributions including CentOS 5, 6, 7, Ubuntu 14, 15, 16, Debian 6, 7, 8, Fedora 20, 21, 22, 23, Scientific 6 and Suse 13."}