{"id": 88787, "date": "2016-08-02 18:54:44", "user": "qps", "post": "Continuing on the success of our previous LowEndBox and LowEndTalk offers, [QuickPacket](https://www.quickpacket.com) is pleased to offer our popular Dual Xeon L5640 server out of Atlanta, GA.\r\n\r\n**Intel Dual Xeon L5640 - Dell or SuperMicro**\r\n\r\n- Dual Hex Core 2.26 GHz / 2x 12 MB Cache / HyperThreading (24 Threads!)\r\n- 32 GB RAM standard, up to 144 GB RAM for an additional fee\r\n- 2x 2 TB Serial ATA Hard Drives or 2x 128 GB SSDs\r\n- 4 usable IPv4 addresses on Private VLAN with Reverse DNS\r\n- /64 IPv6 Addresses upon request (More available with justification)\r\n- Dedicated KVM over IP / IPMI (uses 1 IP address)\r\n- 20 TB Bandwidth / 1 Gbps Port \r\n- Unmanaged\r\n- Located in Atlanta, GA\r\n\r\n**$49 per month - Click here to order: [Atlanta](https://www.quickpacket.com/billing/cart.php?a=add&amp;pid=194&amp;promocode=LEBAUG49) (COUPON CODE LEBAUG49)**\r\n\r\nQuickPacket also offers a number of software licenses as add-ons (open a sales ticket to order):\r\n\r\n- cPanel - VPS $11/month - Server $29.99/month\r\n- KernelCare - $2/month\r\n- CloudLinux - $9/month with cPanel, $11/month without\r\n- Softaculous - VPS $1/month - Server $2/month\r\n- WHMCS - Branded $12.80/month - Unbranded $14.80/month\r\n- DirectAdmin - VPS $5/month - Server $9/month\r\n\r\nFurther details about QuickPacket and the promo offer:\r\n\r\n- QuickPacket was founded in 2003 and is a registered LLC in North Carolina.\r\n- Network providers include PCCW, Cogent, Hibernia, GTT, Zayo, and peering ([AS46261](http://bgp.he.net/AS46261)).\r\n- Looking Glass/Test File: [Atlanta](http://lg.atl.quickpacket.com)\r\n- Atlanta servers are located in 470 E Paces Ferry Rd NE.\r\n- Warez-related, Bulk Mail, and Spam-related activities are strictly forbidden. Please review our [Terms of Service](http://www.quickpacket.com/tos.html) prior to ordering.\r\n- We accept PayPal, VISA, Mastercard, American Express, Discover, and Bitcoin (through BitPay) payments.\r\n- Coupon code is mentioned above and is embedded in the order link provided. The discounted price will be reflected on the second page of the order form.\r\n- Promotional pricing is available for new customers or existing customers adding additional servers. Promotional offers cannot be combined with other promotional offers.\r\n- Please contact our sales department with any questions prior to ordering. \r\n\r\nThanks for your interest!"}