{"id": 8880, "date": "2013-03-17 16:48:31", "user": "Brightbull", "post": "&lt;a href=\"https://swiftvm.com/forum.png\" target=\"_blank\"&gt;\r\n &lt;img src=\"https://swiftvm.com/forum.png\" /&gt;\r\n&lt;/a&gt;\r\n\r\n**Hey there LET,**\r\nSwiftVM is a new provider just a few weeks old, but we're already doing great, and we're here to stay. SwiftVM is being run by two friends, who have previous experience working for other hosts, and who enjoy working with systems and managing clients.\r\n\r\n**The Hardware**\r\nXeon E3-1270v2\r\n4 X 512GB Samsung 840 Pro's in HW-RAID 10 (1GB/s I/O)\r\n32GB DDR3 ECC Memory\r\n100Mbits from node to switch\r\nIPv4, IPv6 coming soon\r\n\r\n**The Offer**\r\nWe know that LowEndTalk is all about the \"As much RAM for 7$ as you can get\" stuff, so we want to make it a little different.\r\n\r\n4 Fair-Share Cores\r\n512MB Guaranteed RAM\r\n1024MB vSwap\r\n25GB SSD Storage (1GB/s I/O!)\r\n500GB Premium Traffic\r\n100Mbps Network Speed\r\n**Price:** $5/month\r\n**Order:** https://www.swiftvm.com/client/cart.php?a=add&amp;pid=15\r\nNOTE: Only limited stock, be fast!\r\n\r\nAdditional IPv4 at only $1 /month each.\r\n\r\nYou can order any of our other plans with 10% off LIFETIME using the promotioncode \"LET10FTW\" (Cannot be applied to existing orders) NOTE: Limited uses, be fast!\r\n\r\n**Great! Some benchmarks plox?**\r\nhttp://serverbear.com/benchmark/2013/03/02/zh4RuSIbl8eNt6hV\r\nhttp://serverbear.com/benchmark/2013/03/02/Em8FSaCugu5PCXML\r\n\r\n&lt;a href=\"http://serverbear.com/benchmark/2013/03/02/zh4RuSIbl8eNt6hV\" target=\"_blank\"&gt;\r\n &lt;img src=\"http://gyazo.com/71f97912ee2eb02ae0a5c0daa8461123.png\" /&gt;\r\n&lt;/a&gt;\r\n\r\nThis image has been resized to fit in the page. Click to enlarge.\r\n\r\n**What about your network?**\r\nVisit http://ping.swiftvm.com/ to download some testfiles or, you guessed it, ping ping.swiftvm.com.\r\n\r\n**Some uninteresting stuff after reading the good stuff above**\r\nWe strive to resolve our tickets within an hour, and usually we do this within a few minutes. We are however only a two-man operation, so lower priority tickets may be slightly delayed. If a ticket is not responded to within 2 hours we receive a notifcation on our phone so that we know there's things to do.\r\n\r\nFor support you can email us, open a ticket, give us a call or hop on live chat. We can also offer an emergency phone-number on request for urgent requests, routing calls to our cellphones in the case we are not working.\r\n\r\nToS TLDR: Anything that is illegal in the United States is not allowed. Private VPN, legal torrents, IRC, TOR relays and Minecraft servers are allowed. Exit nodes are NOT allowed.\r\n\r\n**Contact**\r\nE: hello@swiftvm.com\r\nT:+44 800-066-3088\r\nW: https://swiftvm.com/\r\n\r\nJordy on LET @Brightbull\r\nChris on LET @Eastonch\r\n\r\n_For those wondering why the topic got deleted, there was some confusion with timezones, for us it was 14 days since our last offer while it was 13 days since our last offer for the admins. :)_"}