{"id": 9488, "date": "2013-04-07 05:20:32", "user": "BlueVM", "post": "We felt that it was time a provider stepped up and made their KVM offers match their OpenVZ on RAM and pricing. BlueVM is pleased to announce our new KVM plans with improved RAM, disk I/O and network.\r\n\r\n**KVM1 - Buffalo, NY** - $2.50 /Mo.\r\n256 MB of RAM\r\n1 CPU (@2.0 Ghz)\r\n1 IP Address\r\n10 GB of Storage\r\n500 GB of Bandwidth\r\n[Click Here to Order](https://www.bluevm.com/cart.php?gid=44)\r\n\r\n**KVM2 - Buffalo, NY** - $5.00 /Mo.\r\n512 MB of RAM\r\n2 CPU (@2.0 Ghz)\r\n1 IP Address\r\n20 GB of Storage\r\n1 TB of Bandwidth\r\n[Click Here to Order](https://www.bluevm.com/cart.php?gid=45)\r\n\r\n**KVM3 - Buffalo, NY - LIMITED TIME SPECIAL PRICE: $5.99 /Mo!**\r\n1024 MB of RAM\r\n3 CPU (@2.0 Ghz)\r\n1 IP Address\r\n30 GB of Storage\r\n2 TB of Bandwidth\r\n[Click Here to Order](https://www.bluevm.com/cart.php?gid=46)\r\n\r\n\r\n**Quick FAQ:**\r\nQ: I have an existing KVM VPS with you can I upgrade to these new specs/price?\r\nA: Absolutely, just submit a ticket and we'll make the nessisary changes.\r\n\r\nQ: You recently migrated my VPS to your new hardware, but it hasn't come back yet... how can I solve this?\r\nA: More than likely your VPS just needs to be reconfigured, email rallias@bluevm.com and cc admin@bluevm.com and we will assist you in this process.\r\n\r\nQ: Do you offer X iso?\r\nA: We offer over 50 different ISOs, if it isn't on the list we can add it for you.\r\n\r\nQ: Is the $5.99 special for life?\r\nA: Yes, the price will remain the same for the life of your VPS.\r\n\r\nQ: What is your hardware comprised of?\r\nA: Dual E5-2620s with 128 GB of RAM, 4 x 2 TB in hardware RAID10 with 2 x 120 GB SSDs for cache.\r\n\r\nQ: Can I order more disk?\r\nA: Yes you can, at $0.50 per 5 GB, simply submit a ticket and it will be added to your account.\r\n\r\nQ: What locations do you offer and are there any plans for expansion?\r\nA: We currently only offer KVM plans in Buffalo, NY. We will be setting up servers for KVM in each of our 6 locations over the next few months. Atlanta and Texas should be the first locations to have our new hardware and that should be setup around the 30th of this month."}