{"id": 9936, "date": "2013-04-23 14:02:28", "user": "serverian", "post": "Hello LET,\r\n\r\nAfter a week of closed beta testing, we are glad to announce that we started taking orders.\r\n\r\nFor an opening gesture, we are offering the following plan for **$7/month** ($20/month regularly):\r\n\r\n&gt; KVM Virtualization\r\n1 vCPU (Intel Nehalem Xeon L5520, Fair share)\r\n512 MB Memory\r\n**500GB** RAID 50 Storage Space (HP P410 Controller with cache memory and BBU with Seagate Constellation ES hard drives)\r\n2000GB Traffic Limit\r\n1Gbps Uplink\r\n1 IPv4\r\n\r\n**&lt;a href=\"https://backupsy.com/cart.php?a=add&amp;pid=2&amp;promocode=GOTMEADEAL\"&gt;[ORDER NOW]&lt;/a&gt; or contact us about your questions here: https://backupsy.com/**\r\n\r\nFor whom wants a smaller storage VPS for $5/month:\r\n\r\n&gt; KVM Virtualization\r\n1 vCPU (Intel Nehalem Xeon L5520, Fair share)\r\n512 MB Memory\r\n**250GB** RAID 50 Storage Space (HP P410 Controller with cache memory and BBU with Seagate Constellation ES hard drives)\r\n1000GB Traffic Limit\r\n1Gbps Uplink\r\n1 IPv4\r\n\r\n**&lt;a href=\"https://backupsy.com/cart.php?a=add&amp;pid=1&amp;promocode=HOLYMOSES\"&gt;[ORDER NOW]&lt;/a&gt;**\r\n\r\n**If you want to try it before you buy, feel free to PM me. We are also offering a 7 day no questions asked money back guarantee.**\r\n\r\nWe utilize our custom control panel that has ability to install popular Linux distributions (Debian, Ubuntu, CentOS) automatically by scripting (Kickstart, Preseed). (You can however, install them manually by using our out of band Java based console)\r\n\r\nWe are also offering ISO mounts for popular storage management operating systems such as FreeNAS, Openfiler, Openmediavault and Turnkey Linux Fileserver. For additional ISO files, please contact us by simply opening a ticket and we will add them for free.\r\n\r\nYou can view our control panel screenshot here:\r\n\r\n&lt;img src=\"https://backupsy.com/imgs/backupsy-panel.png\"&gt;\r\n\r\n&gt; Location: Lombard, IL\r\nTest IP: 192.208.190.131\r\nTest File: http://192.208.190.131/1000MB.test\r\nUptime for last 30 days: 99.968% (Taken from nodeping)\r\n\r\nOur TOS is linked here: [https://backupsy.com/tos.html](https://backupsy.com/tos.html)\r\n\r\n**Disclaimer: Our VPS products are only allowed to run programs intended to store or assist in the backup of Subscriber's data. Anyone found running programs not intended to store or assist in backup will be suspended and asked to cease, if they fail to, termination will follow.**"}