{"id": "1087", "date": "Jul 6, 2013 at 8:05 PM", "user": "kujoe", "post": "\n<div class=\"bbWrapper\">I have a dedicated server I'm renting from WANSecurity (Kansas City, Missouri) and the specs are overkill for my needs now but I don't want to cancel it because I still use it but I only use a fraction of the resources. I'm looking for 2 people to split the server with to make things easier. So here's my offer:<br>\n<br>\n4x 2.3GHz Cores (Intel Xeon L5520)<br>\n<br>\n24GB DDR3 RAM<br>\n<br>\n500GB Disk Space<br>\n<br>\nBandwidth will be shared (2.5TB on a 1Gbps port)<br>\n<br>\nNATed IPv4 Addresses<br>\n<br>\nVMWare ESXi vSphere Access<br>\n<br>\n$25/month via Paypal<br>\n<br>\nI can handle port forwarding requests for free or we can work out a price for a dedicated IP. IPv6 is not available yet but when it is I'll be happy to hand out IPs for it. Bandwidth is not monitored but if we near our 2.5TB of usage I'll just throttle the network until the 1st of the next month. I will turn off the network to avoid overages since this bandwidth is pricey.<br>\n<br>\nSome random speed tests I ran from one of the VMs:<br>\n<br>\n<a href=\"https://www.speedtest.net/result/2804231951.png\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">http://www.speedtest.net/result/2804231951.png</a><br>\n<br>\n<a href=\"https://www.speedtest.net/result/2804284063.png\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">http://www.speedtest.net/result/2804284063.png</a><br>\n<br>\n<a href=\"https://www.speedtest.net/result/2804304311.png\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">http://www.speedtest.net/result/2804304311.png</a><br>\n<br>\n<a href=\"https://www.speedtest.net/result/2820494580.png\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">http://www.speedtest.net/result/2820494580.png</a><br>\n<br>\nThe server <b>DOES NOT COME WITH RAID</b>. I do have multiple drives in the server so if you want I can setup 2x 250GB disks and you can do software RAID on the OS yourself but the ESXi installation is on a single drive so there is still a single point of failure.<br>\n<br>\nNo support, SLAs, or any guarantees are offered. This was mainly used for development and has been running strong for a few months but all usage is at your own risk. I can split up your resources into multiple VMs if you'd like so you can build a test environment for whatever you need. I can also provide NFS storage if you want to maintain off-site backups.<br>\n<br>\n<i><b>This is a personal server and not related to Secure Dragon LLC. in any way, shape, or form.</b></i><br>\n<br>\nI will only accept users on here that I recognize as trustworthy and have a good track record on here and/or LET. If I don't pick you, don't take it personally but this is a completely trust-based situation since any form of abuse can cause me to lose my server (and the drives I sent them will not be returned).<br>\n<br>\nIf you have any questions feel free to ask.</div>\n<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n"}