{"id": "11867", "date": "Dec 28, 2018 at 3:17 AM", "user": "nicochico", "post": "\n<div class=\"bbWrapper\"><b><a href=\"http://www.canspace.ca\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">CanSpace Solutions</a></b> is Canada's leading provider of hosting services. Our <i>VPS plans are 100% Canadian</i>, and <i>fully managed solutions</i> - we handle the administration of your server, so you can focus on your business. <b>CanSpace Solutions</b> is a <b>CIRA certified</b> provider - certified annually by the <i>Government of Canada</i>, and we have been in the hosting business for over <i>10 years</i>. Our head office is located here in Canada. Our datacentres, along with all of our servers, are <b>located in Canada</b>. All our employees are here in Canada, and we only bill in Canadian dollars. We are the leading Canadian <b>.ca domain registrar</b>. We are trusted by Canada's largest companies and organizations. In case you haven't guessed it yet, CanSpace is a very proudly Canadian company - just like your own.<br>\n<br>\n<b>VPS Features:</b><br>\n<ul>\n<li data-xf-list-type=\"ul\">Full root access - you have full control to customize your hosting server as you like</li>\n<li data-xf-list-type=\"ul\">Always up to date - our Canadian technicians make sure that your VPS server software is updated on a nightly basis</li>\n<li data-xf-list-type=\"ul\">cPanel and WHM included. The hosting industry-leading control panel is included free of charge ($22/month value)</li>\n<li data-xf-list-type=\"ul\">All servers are located in Canada, on Canadian IP addresses</li>\n</ul>VPS solutions from CanSpace are <i>fully managed</i> - leave the technical hosting work to us while you build your business. We handle all aspects of VPS hosting server administration, including backups, server security, updates, and general maintenance. Server administration is a full-time job and requires around-the-clock staff - leave that up to us while you focus on your website!<br>\nCheck out <b>Cansapce.ca <a href=\"https://www.canspace.ca/vps.html\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Fully Managed Canadian VPS Hosting</a></b> packages:<br>\n<br>\n<b>VPS-25 Hosting Plan</b><br>\n25GB SSD Disk Space<br>\nUnlimited Bandwidth<br>\n1 vCore<br>\n6GB RAM<br>\nFully Managed<br>\n<b>Price - $89.99/mo [<a href=\"https://www.canspace.ca/vps.html\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">ORDER NOW</a>]</b><br>\n<br>\n<b>VPS-50 Hosting Plan</b><br>\n50GB SSD Disk Space<br>\nUnlimited Bandwidth<br>\n2 vCore<br>\n12GB RAM<br>\nFully Managed<br>\n<b>Price - $139.99/mo [<a href=\"https://www.canspace.ca/vps.html\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">ORDER NOW</a>]</b><br>\n<br>\n<b>VPS-100 Hosting Plan</b><br>\n100GB SSD Disk Space<br>\nUnlimited Bandwidth<br>\n4 vCore<br>\n24GB RAM<br>\nFully Managed<br>\n<b>Price - $179.99/mo [<a href=\"https://www.canspace.ca/vps.html\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">ORDER NOW</a>]</b><br>\n<br>\n<b>Additional Upgrades!</b><br>\n<i>Available for purchase during the checkout process. Dedicated IP addresses can be added at any time.</i><br>\nAdditional 50GB Disk Space <b>$19.99 / month</b><br>\nAdditional 100GB Disk Space <b>$34.99 / month</b><br>\nAdditional 200GB Disk Space <b>$54.99 / month</b><br>\nAdditional 500GB Disk Space <b>$99.99 / month</b><br>\nAdditional Dedicated IP <b>$3.00 / month</b><br>\n<br>\n<b>Additional Features:</b><br>\n<ul>\n<li data-xf-list-type=\"ul\">Backed up nightly. Our VPS hosting management team takes care of your VPS hosting backups and can restore server accounts at any time</li>\n<li data-xf-list-type=\"ul\">Free migration services - we can migrate your existing cPanel accounts over at no charge</li>\n<li data-xf-list-type=\"ul\">Reboot/restart access so that you can remotely reboot your hosting server if necessary</li>\n<li data-xf-list-type=\"ul\">Clean IP addresses - your VPS hosting server is provisioned on to Canadian IP addresses that are not present on any blacklists</li>\n</ul><b>Performance and Security Features:</b><br>\n<ul>\n<li data-xf-list-type=\"ul\">VPS Servers fully hardened with CSF and LFD firewalls, as well as high-level Web Application Firewall.</li>\n<li data-xf-list-type=\"ul\">Your server is monitored 24/7 by our Canadian security team for any hack attempts.</li>\n<li data-xf-list-type=\"ul\">DDoS-free datacentre. Unlike other VPS hosting providers we protect you from DDoS attacks and will never disable a VPS hosting server because of a DDoS attack.</li>\n<li data-xf-list-type=\"ul\">SSD drives with RAID-10, for redundancy, reliability, and lightning fast performance</li>\n</ul><b>Why Choose Canspace Service?</b><br>\n1) <b>Powered by Green Energy</b> - All servers from CanSpace are powered by entirely by <i>100% Canadian-generated green energy</i>. Power comes directly from the <i>Beauharnois hydroelectric generating station</i> in Quebec.<br>\n2) <b>High-Speed Network</b> - We have over <i>7.5 Tbps of network capacity available</i> in our datacentre to support our customers. We have multiple backbone bandwidth carriers, redundant storage, and our entire infrastructure is fully redundant at multiple levels.<br>\n3) <b>High availability infrastructure</b> - All CanSpace hosting services include protection against all types of DDoS attacks. A <i>160 Gbps anti-DDoS infrastructure</i> has been set up in our datacentre to mitigate up to <i>480 Gbps of traffic, 24/7</i>.<br>\n4) <b>Data Security</b> - All data with CanSpace is always stored within <i>Canadian borders</i>, and subject only to Canadian law. We do not store any data in the United States or elsewhere. Your data is not subject to foreign court-orders or to DMCA takedown requests, and no extra-national entity will ever have access to your data. This is a requirement for many of our Canadian-government clients and we service all our clients with these same advantages.<br>\n<br>\n<b>OUR GUARANTEES</b>:<br>\n1) <b>High VPS Performance</b> - Drastically faster than shared hosting plans, all VPS hosting solutions come with dedicated resources that are available to only your server.<br>\n2) <b>Fully Managed</b> - Focus on building your site and let us handle the technical hosting stuff. CanSpace handles all server administration including backups, security, maintainence, and updates.<br>\n3) <b>Dynamic VPS Resources</b> - VPS hosting plans are flexible and can be scaled up whenever necessary. As your website grows, so can the resources dedicated to your VPS hosting.<br>\n4) <b>WHM &amp; cPanel</b> - Full root access to your hosting server along with access to <i>WHM and cPanel ($22/month value)</i>. With root access you are completely free to customize your VPS hosting server as necessary.<br>\n5) <b>High Availability</b> - All VPS servers are hosted in our <i>DDoS-free datacentre</i>. Unlike other hosting providers we protect your servers against DDoS attacks instead of simply unplugging them.<br>\n6) <b>SSD Drives</b> - Your VPS servers will <i>utilize RAID-10 SSD storage</i> providing the fastest and most reliable hosting storage solution possible, providing lightning fast speeds and full redundancy.<br>\n<br>\nWe realize that hosting is about offering superior service, support, and reliability - and that you want to offer your clients the same thing. We treat all of our clients with the same level of service and professionalism - whether they are small startups or large corporations. We're always happy to hear from you! At <b>CanSpace</b> we pride ourselves on our superior customer support. We aim to answer all inquiries within half an hour, although most are answered in less than 10 minutes.<br>\n<br>\nExisting customers can submit a <a href=\"https://www.canspace.ca/clients/supporttickets.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\"><b>Support Ticket</b></a> via our Client Area. Our support technicians are available <b>24 hours a day, 7 days a week</b>. We highly encourage existing customers to use our ticket system so that we can properly track your issue.<br>\n<br>\n<u>TEL</u>: <b>1-888-99-DOT-CA</b><br>\n<u>E-mail</u>: <a href=\"mailto:info@canspace.ca\">info@canspace.ca</a><br>\n<b><a href=\"https://www.facebook.com/canspace.ca/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Like us on Facebook</a></b></div>\n<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n"}