{"id": "11872", "date": "Dec 29, 2018 at 1:12 AM", "user": "rumsfo", "post": "\n<div class=\"bbWrapper\">At <b><a href=\"https://www.aspnix.com/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">ASPnix</a></b>, you’re family. And we know how to treat our family. Our dedication to our customers means they are our priority, giving you the latest technological advancements, a 24/7 customer service network, and community forums to discuss technology, feedback, and general conversation. We care what you have to say and want to hear it. Welcome to the family.<br>\n<br>\nWe are pleased to announce our new <b><a href=\"https://www.aspnix.com/servers/virtual-cloud-servers/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Virtual Cloud Server plans</a></b> that will allow our customers more flexibility in building the exact virtual server that is required. No more pre-built plans that are not flexible, no more having to pay for 100s of GB of space when all you needed was more RAM. Pay only for what you need!<br>\n<br>\nOur new cloud platform is powered by <b>Samsung Data-Center</b> class SSD drives for maximum speed, over 1,000,000 IOPS performance!<br>\n<b>Powerful Intel Xeon</b> processors up to 16 cores, and DDR4 memory up to 32GB! Our new platform starts at <b>$20 per month</b> for a Windows VPS!<br>\n<br>\nThose that love Linux can now enjoy it on our <b>Hyper-V cloud</b> platform as well!<br>\n<b>CentOS, Fedora Server, Red Hat, Ubuntu Server and Debian</b> are all now supported! Get started with a Linux VPS today for only <b>$10 per month</b>.<br>\n<br>\nCustomers who are interested in starting their own hosting company or just want to make managing their Linux server a little easier can purchase our cPanel Control Panel addon.<br>\n<br>\nFor more information about our <b>new VPS plans visit</b> – <a href=\"https://www.aspnix.com/servers/virtual-cloud-servers/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">https://www.aspnix.com/servers/virtual-cloud-servers/</a><br>\n<br>\nNow is a perfect time to purchase a VPS and start hosting your own web site, database, point-of-sale system and much more! Customers all around the world trust their Virtual Cloud Server operations to us and our growing and expanding network! So why not give our new Virtual Server plans a try, and see how a VPS can benefit you today!<br>\n<br>\nIf you have any questions, please review our <a href=\"https://www.aspnix.com/kb/software-products-kb/database-vault-kb/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\"><b>product knowledgebase</b></a> if you are still not able to find your answer, please <b><a href=\"https://billing.aspnix.com/submitticket.php/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">contact our support team</a></b>.<br>\n<br>\nThank you for choosing <b>ASPnix Solutions!</b></div>\n<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n"}