{"id": "15817", "date": "Sep 25, 2020 at 12:00 AM", "user": "leapnikhil", "post": "\n<div class=\"bbWrapper\">I would like to let you know that we have launched a new PaaS cloud solution which allows -<br>\n<br>\n<ul>\n<li data-xf-list-type=\"ul\">Automated configuration of environment - Apache, PHP, Tomcat, Java, MySQL etc with version selection.</li>\n<li data-xf-list-type=\"ul\">Easy deployment with deployment manager (git, svn, archive) and phpMyAdmin for databases.</li>\n<li data-xf-list-type=\"ul\">Automated vertical and horizontal scaling of resources for each service.</li>\n<li data-xf-list-type=\"ul\">Hourly billing as per actual usage</li>\n</ul>You can easily host/test Asp.Net, Node JS, PHP, JAVA, WordPress, Magento applications online. You don't have to manually install any platform and all. Just have to select a version of the particular platform. It will get installed automatically.<br>\nDeploy an advanced highly reliable and auto-scalable Magento cluster in 10 minutes. Just select Magento version, choose India or USA datacenter and migrate your existing data in a few clicks.<br>\n<br>\nSignup now for a 14 day FREE TRIAL on <a href=\"https://cloudjiffy.com/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">https://cloudjiffy.com/</a><br>\n<br>\nCloudjiffy pricing structure:<br>\n<br>\nReserved Cloudlet Rs.54+tax/Cloudlet/Month<br>\nDynamic Cloudlet Rs.60+tax/Cloudlet/Month<br>\n<br>\n<b>Please note, a Cloudlet includes 128 MB of RAM and 400 MHz of CPU.</b><br>\n<br>\nI have written addons costing details here below:-<br>\nAdditional 1 GB bandwidth cost is Rs.4/GB/hour.<br>\nAdditional 1 GB space cost is Rs.4/GB/Month.<br>\nAdditional Public IP cost is Rs.100 + Tax/Month/IP.<br>\n<br>\nReserved Cloudlets these ones are reserved in advance and will be charged irrespective of your actual resource usage. In exchange, you’ll get significant automatic discounts based on their number.<br>\n<br>\nDynamic Cloudlets are added &amp; removed automatically according to the number of resources that are required by your application in a particular moment of time - i.e. they’re assigned when the load goes up and removed again as soon as it drops down. As a result, you pay based on your actual resource usage.<br>\n<br>\nSave up to 50% of your cost which you are paying to Amazon/Azure.<br>\n<br>\nYou can check CloudJiffy costing details here:- <a href=\"https://cloudjiffy.com/pricing.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">https://cloudjiffy.com/pricing.php</a><br></div>\n<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n"}