{"id": "3222", "date": "Jan 14, 2014 at 5:12 PM", "user": "perennate", "post": "\n<div class=\"bbWrapper\"><span style=\"font-size: 18px\"><b>Luna Node</b></span><br>\n<br>\n<a href=\"https://www.lunanode.com/cart.php?a=add&amp;pid=27\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Luna Node Dynamic</a> is our hourly billing virtualization platform featuring rapid virtual machine deployment, hourly billing, snapshotting capabilities (and imaging existing or new virtual machines from these snapshots), uploading custom ISO files, an API for automation, and more. Servers are currently provisioned out of SingleHop's Chicago datacenter, and we expect to be adding a location in BurstNET's facility in Scranton as well.<br>\n<br>\nLuna Node has been around for about half a year, offering reliable KVM virtual private servers at affordable prices. We use a custom panel on most of our plans, including Luna Node Dynamic. We are still slowly working on our free software billing panel at <a href=\"https://pbopb.lunanode.com/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">https://pbopb.lunanode.com/</a> (it is currently useable although missing a few nice features and payment gateways).<br>\n<br>\nHere's a more detailed feature explanation:<br>\n<br>\n<ul>\n<li data-xf-list-type=\"ul\">Hourly billing - only need a virtual machine for a few days, or don't know how long you'll want to use it for? Or have dynamic needs that require changing amounts of nodes? Luna Node Dynamic allows you to destroy your virtual machine at any time, and then only pay for the hours (instead of months) that it was used for. The service is prepaid, with Paypal and Bitcoin (via Coinbase) as our current billing options.</li>\n<li data-xf-list-type=\"ul\">Custom ISO files - you can submit a URL (HTTP, HTTPS, FTP, etc.) and the system will download your ISO file. Once downloaded, you can mount it and install an operating system over VNC.</li>\n<li data-xf-list-type=\"ul\">Snapshotting - for 512 MB, 1024 MB, and 2048 MB plans, you can snapshot your virtual machine; this will store the current state of the disk image, which you can then use to restore your virtual machine or to provision more machines. Each account gets three free snapshots; you can contact us if you need more.</li>\n<li data-xf-list-type=\"ul\">API - we provide a simple API that you can use to manage your servers without going through the web UI.</li>\n<li data-xf-list-type=\"ul\">Track billing - a simple Billing tab is inluded in the Luna Node Dynamic panel that allows you to check your expenses for each month, with expenses sorted by day.</li>\n</ul>To get started, you can <a href=\"http://www.lunanode.com/cart.php?a=add&amp;pid=27\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">create an account</a> from our billing panel for twelve dollars (so you will get $12.00 of credit with the initial account). More credit can be added directly from the Luna Node Dynamic panel (but support is handled through the billing panel).<br>\n&nbsp;<br>\n<br>\n<span style=\"font-size: 18px\"><b>Plans</b></span><br>\n<br>\n<ul>\n<li data-xf-list-type=\"ul\">512 MB - 1 vCPU, 15 GB storage, 1000 GB bandwidth, $0.005 hourly ($3.6 monthly)</li>\n<li data-xf-list-type=\"ul\">1024 MB - 2 vCPU, 20 GB storage, 1500 GB bandwidth, $0.0072 hourly ($5.18 monthly)</li>\n<li data-xf-list-type=\"ul\">2048 MB - 3 vCPU, 35 GB storage, 2000 GB bandwidth, $0.0139 hourly ($10.01 monthly)</li>\n<li data-xf-list-type=\"ul\">4096 MB - 3 vCPU, 70 GB storage, 2500 GB bandwidth, $0.0267 hourly ($19.22 monthly)</li>\n<li data-xf-list-type=\"ul\">8192 MB - 4 vCPU, 125 GB storage, 3000 GB bandwidth, $0.0514 hourly ($37.01 monthly)</li>\n<li data-xf-list-type=\"ul\">16384 MB - 6 vCPU, 250 GB storage, 4000 GB bandwidth, $0.1 hourly ($72 monthly)</li>\n</ul></div>\n<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n"}