{"id": "3374", "date": "Jan 27, 2014 at 10:48 AM", "user": "shovenose", "post": "\n<div class=\"bbWrapper\">ShoveHost has been around since 2011. All of our offers are from the American Internet Services LWDC in San Diego, California. Our servers are monitored 24/7 to maximize performance and uptime. The internet doesn't sleep, and neither do we. Well, at least not that much...<br>\n<br>\nOur OpenVZ nodes run modern Intel Xeon E3 processors, utilize fast DDR3 ECC RAM, and contain four WD RE4 Enterprise drives on LSI Hardware RAID w/BBU. This will ensure you get consistently excellent performance.<br>\n<br>\nRIght now, we have a super limited promotion just for vpsBoard. Our Deluxe VPS plan has the following specs:<br>\n<br>\n-3GB Guaranteed RAM<br>\n<br>\n-1GB Additional vSwap<br>\n<br>\n-80GB Disk Space<br>\n<br>\n-3 Shared CPU Cores<br>\n<br>\n-1TB Premium Bandwidth<br>\n<br>\n-1 IPv4 Address<br>\n<br>\n-10 IPv6 Addresses<br>\n<br>\nWe have two promo codes: Deluxe24, That's just $24/quarterly which ends up at getting an awesome 3GB VPS for $8/month.<br>\n<br>\nIf you don't want to pay quarterly, you can get this same plan at $12/month, with promo code Deluxe12.<br>\n<br>\nWhile quarterly will get you the best possible pricing, this is still an enormous discount over the regular price of $30/month for this VPS plan.<br>\n<br>\nPlease note that existing services do not quality for this promotion. There are only a very limited quantity of servers available at this price so if you're interested (you should be!) I wouldn't wait too long...<br>\n<br>\nHere's the order link:&nbsp;<a href=\"https://my.shovehost.com/cart.php?a=add&amp;pid=90\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">https://my.shovehost.com/cart.php?a=add&amp;pid=90</a><br>\n<br>\nPromo code for $24/Q:&nbsp;Deluxe24<br>\n<br>\nPromo code for $12/M: Deluxe12<br>\n<br>\nBonus offer: Buy TWO Deluxe VPS plans with the promotional code (doesn't matter if you get it monthly or quarterly) and get DOUBLE bandwidth and DOUBLE disk! (open a ticket to get this, it won't be automatic)</div>\n<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n"}