{"id": "3567", "date": "Feb 18, 2014 at 11:53 AM", "user": "kaniini", "post": "\n<div class=\"bbWrapper\">Tortoise Labs is merging its cloud lineup into its sister company, Centarra. This move comes shortly after the large expansion at 2323 Bryan. Centarra operates its own fully redundant, enterprise network. The Tortoise brand will continue to operate as a software engineering firm.<br>\n<br>\nCentarra cloud utilizes our own in-house control panel, Cloudware. From top to bottom, Cloudware was designed with the user in mind. Cloudware's core framework was released as Free Open Source Software (FOSS), as Centarra believes in bettering the software industry.<br>\n<br>\n<i><b>Get 30% off for life with coupon code: CENTARRA</b></i><br>\n<br>\nHere is a sampling of our offerings, log into Cloudware to see all of our packages. To order, please go to <a href=\"https://billing.centarra.com/vps/signup?c=centarra\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Cloudware</a> and create an account. Once you've created an account, you can easily add cloud instances!<br>\n<br>\n<b>vServers</b><br>\n<br>\nEach vServers comes with access to 8 cores and 20 Mbps of bandwidth.<br>\n<br>\nCloud 512<br>\n<br>\n512 MB of RAM + 512 MB Swap<br>\n<br>\n30 GB of disk space<br>\n<br>\n20 Mbps of bandwidth guaranteed on 1 Gbps unmetered*<br>\n<br>\n1 IPv4<br>\n<br>\n<s>$7.50</s> $5.25 a month!<br>\n<br>\n<a href=\"https://billing.centarra.com/vps/signup?c=centarra\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Sign up now</a><br>\n<br>\nCloud 1,024<br>\n<br>\n1,024 MB of RAM + 1,024 MB Swap<br>\n<br>\n60 GB of disk space<br>\n<br>\n20 Mbps of bandwidth guaranteed on 1 Gbps unmetered*<br>\n<br>\n2 IPv4 with IPJ<br>\n<br>\n<s>$15.00</s> $10.50 a month!<br>\n<br>\n<a href=\"https://billing.centarra.com/vps/signup?c=centarra\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Sign up now</a><br>\n<br>\n<b>Semi Dedicated vServers</b><br>\n<br>\nEach semi-dedicated vServers comes with access to 8 cores and 60 Mbps of bandwidth.<br>\n<br>\nCloud 4,096<br>\n<br>\n4,096 MB of RAM + 2,048 MB Swap<br>\n<br>\n240 GB of disk space<br>\n<br>\n60 Mbps of bandwidth guaranteed on 1 Gbps unmetered*<br>\n<br>\n8 IPv4 with IPJ<br>\n<br>\n<s>$50.00</s> $35 a month!<br>\n<br>\n<a href=\"https://billing.centarra.com/vps/signup?c=centarra\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Sign up now</a><br>\n<br>\n<b>Features</b><br>\n<br>\n<i>Choose Xen PV or Xen HVM</i><br>\n<br>\nEasily switch between Xen PV and Xen HVM in Cloudware.<br>\n<br>\n<i>RAID-z inspired data storage for un-paralleled reliability.</i><br>\n<br>\nWe utilize our own custom RAID to insure data integrity and reliability that is un-paralleled.<br>\n<br>\n<i>Add Custom Rules to Our Firewall</i><br>\n<br>\nAdd custom rules to our clustered firewall. Create your own ACL applied across our network and mitigation devices.<br>\n<br>\n<i>Unmetered Bandwidth</i><br>\n<br>\nEvery vServer comes with unmetered bandwidth. Don't worry about overages! Bandwidth is guaranteed to be available to each individual vServer at any time, 1000mbps guaranteed to each network segment. Certain services, such as BitTorrent and VPN usage, are not covered by this guarantee.<br>\n<br>\n<i>Three different and unique locations</i><br>\n<br>\nChoose between London, Atlanta, and Dallas for the location of your cloud instance.<br>\n<br>\n<i>Advanced REST API</i><br>\n<br>\nEasily add, remove, and alter services with our advanced and straight-forward REST API. Integrate seamlessly to allow for better uptime and resource spikes.<br>\n<br>\n<i>Operating Systems</i><br>\n<br>\nChoose from one of our six different operating systems or use Xen HVM to bring your own ISO.<br>\n<br>\n*The 1 Gbps unmetered is fair-share and users may be throttled if they use too much bandwidth.</div>\n<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n"}