{"id": "4", "date": "Mar 25, 2013 at 2:18 AM", "user": "manndude", "post": "\n<div class=\"bbWrapper\">Howdy VPS providers, welcome to the VPS Offers forum! We hope that this section will become a hot spot for those seeking VPS deals that drive traffic and sales to your site.<br>\n<br>\n<b>You may be eager to get your offer posted, however the following should be noted:</b><br>\n<br>\n<ul>\n<li data-xf-list-type=\"ul\">All offers require a moderator approval before being posted. Your offer <b><u>must</u></b> follow the guidelines listed below. Any discrepancy in your offer will delay it's ability to be seen by the public until it has been fixed and conforms with the guidelines/rules listed below.</li>\n</ul><br>\n<br>\n<br>\n<br>\n<br>\nWhile we are appreciative that you wish to post your offer here, we do have rules in place so that we post only quality offers from trustworthy vendors. Due to this, not all offers may be eligible to be posted.<br>\n<br>\n<b>Criteria for submitted offers:</b><br>\n<br>\n<ul>\n<li data-xf-list-type=\"ul\"><b>Submitter must have at least 25 posts before submission can become active.</b><br>\n</li>\n<li data-xf-list-type=\"ul\">Company <b>must</b> have valid WhoIS information publicly available and can not have private WhoIS enabled. <i><span style=\"font-size: 10px\">(Any new offers as of July 28th, 2013 will be checked for this and will not be posted regardless if they were posted in the past)</span></i></li>\n<li data-xf-list-type=\"ul\">Submissions by representative of companies only, no affiliate links.</li>\n<li data-xf-list-type=\"ul\"><u><b>No free VPS Offers.</b></u></li>\n</ul><b>Formatting guidelines for all submitted offers:</b><br>\n<br>\n<ul>\n<li data-xf-list-type=\"ul\">Title of post must include company name and must be descriptive of the offer.</li>\n<li data-xf-list-type=\"ul\">Offers <b>must</b> include the <b>datacenter</b>(s) available for the offer</li>\n<li data-xf-list-type=\"ul\">Offers <b>must</b> include the ACTUAL location (city) of the datacenter provinding the services available and not be misleading. Ex: <b>New York = New York City.</b> If you are in Buffalo, say 'Buffalo', not New York.</li>\n<li data-xf-list-type=\"ul\">Offer <b>must</b> include a small description of the company and of the plan details. Don't just list plans, tell us about your company.</li>\n<li data-xf-list-type=\"ul\"><b>Only one offer per every seven days may be posted!</b><br>\n</li>\n<li data-xf-list-type=\"ul\"><b>You must also have at least 5 non-offer related posts between offers!</b> (Ex: You post an offer on the 7th, and on the 14th you return to post a new offer. If you have not participated on the forum that previous week, your offer will not be approved)</li>\n</ul><br>\nThe guidelines and criteria listed above will help create a quality offers section that we hope our visitors will enjoy and one that we hope brings traffic and sales to the providers who submit them.</div>\n<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n"}