{"id": "4820", "date": "Jul 23, 2014 at 11:09 AM", "user": "perennate", "post": "\n<div class=\"bbWrapper\"><b>Luna Node Dynamic - dynamic virtualization platform (KVM)</b><br>\n<br>\n<a href=\"https://dynamic.lunanode.com/info.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Luna Node Dynamic</a> is an hourly billing virtualization platform featuring rapid virtual machine deployment, hourly billing, snapshotting capabilities (and imaging existing or new virtual machines from these snapshots), an API for automation, and more. Servers are currently provisioned out of Toronto.<br>\n<br>\n<a href=\"https://www.lunanode.com/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Luna Node</a> has been around for almost a year, offering reliable KVM virtual private servers at affordable prices. We use OpenStack for the Luna Node Dynamic backend.<br>\n<br>\nHere's a more detailed feature explanation:<br>\n<br>\n<ul>\n<li data-xf-list-type=\"ul\"><b>Hourly billing</b> - only need a virtual machine for a few days, or don't know how long you'll want to use it for? Or have dynamic needs that require changing numbers of instances? Luna Node Dynamic allows you to destroy your virtual machine at any time, and then only pay for the hours (instead of months) that it was used for. The service is prepaid, with Paypal and Bitcoin (via Coinbase) as our current billing options.</li>\n<li data-xf-list-type=\"ul\"><b>Custom operating systems</b> - you can submit a URL (HTTP, HTTPS, FTP, etc.) and the system will download your ISO image or qcow2 template. Once downloaded, you can provision new virtual machines with the custom operating system. For ISO images, OS installation can be completed via VNC.</li>\n<li data-xf-list-type=\"ul\"><b>Snapshotting</b> - hit a button to snapshot your virtual machine, and the current state of the disk image will be saved. You can then use it to restore your virtual machine to a previous saved state or to provision more machines. Snapshots are charged at $0.04 / GB / month (billed hourly); the first 20 GB is currently free but this is subject to change.</li>\n<li data-xf-list-type=\"ul\"><b>API</b> - we provide a simple API that you can use to manage your servers without going through the web UI.</li>\n<li data-xf-list-type=\"ul\"><b>Track billing</b> - a Billing tab is inluded in the Luna Node Dynamic panel that allows you to check your expenses for each month, with expenses sorted by day.</li>\n<li data-xf-list-type=\"ul\"><b>Floating IP addresses</b> - you can keep IP addresses on reserve in your account for $1/month (billed hourly). This means you can easily switch an external IP address between different virtual machines on your account. Additionally, if you don't need a VM for the time being you can snapshot it and then disassociate its floating IP address so that you only have to pay for the storage space and IP.</li>\n<li data-xf-list-type=\"ul\"><b>Redundant cloud storage</b>- VM's are provisioned on top of a distributed, fault-tolerant filesystem to prevent data loss</li>\n<li data-xf-list-type=\"ul\"><b>Private virtual networks</b> - you can create a private virtual network, and the private interface of virtual machines in that network will be isolated. (Each network is $4/month, billed hourly.)</li>\n<li data-xf-list-type=\"ul\"><b>Load balancing, firewall, VPN as a service </b>- inside your private network, these features are available. See <a href=\"https://wiki.lunanode.com/index.php/Virtual_networks\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">https://wiki.lunanode.com/index.php/Virtual_networks</a> for details. Currently you have to open a ticket for setup and configuration, but we are working on integrating it into the Luna Node Dynamic panel. </li>\n<li data-xf-list-type=\"ul\"><b>Detachable volumes </b>- create arbitrary-sized block devices (volumes) and attach/detach them to virtual machine instances on the fly.</li>\n<li data-xf-list-type=\"ul\"><b>Server monitoring</b> - we offer basic server monitoring, where you can set up checks, and receive notifications over email or SMS when the checks fail.</li>\n</ul><br>\nTo get started, you can <a href=\"https://dynamic.lunanode.com/register.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">register an account from our panel</a>; the initial deposit to your account is $12.00. After the initial deposit, more credit in smaller increments can be added directly from the Luna Node Dynamic panel.<br>\n<br>\n<b>Plans</b><br>\n<br>\n<ul>\n<li data-xf-list-type=\"ul\">512 MB RAM - 1 vCPU, 15 GB storage, 1000 GB bandwidth, $0.005 hourly ($3.6 monthly)</li>\n<li data-xf-list-type=\"ul\">1024 MB RAM - 2 vCPU, 20 GB storage, 1500 GB bandwidth, $0.0072 hourly ($5.18 monthly)</li>\n<li data-xf-list-type=\"ul\">2048 MB RAM - 3 vCPU, 35 GB storage, 2000 GB bandwidth, $0.0139 hourly ($10.01 monthly)</li>\n<li data-xf-list-type=\"ul\">4096 MB RAM - 3 vCPU, 70 GB storage, 2500 GB bandwidth, $0.0267 hourly ($19.22 monthly)</li>\n<li data-xf-list-type=\"ul\">8192 MB RAM - 4 vCPU, 125 GB storage, 3000 GB bandwidth, $0.0514 hourly ($37.01 monthly)</li>\n<li data-xf-list-type=\"ul\">16384 MB RAM - 6 vCPU, 250 GB storage, 4000 GB bandwidth, $0.1 hourly ($72 monthly)</li>\n</ul>Port speed is 1 gbit/s. <a href=\"https://dynamic.lunanode.com/info.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Click here for full plan list</a>.<br>\n<br>\nYou can open a ticket within the first week to request a refund of remaining credit on your account, no questions asked.<br>\n<br>\n<b>Locations</b><br>\n&nbsp;<br>\n<br>\nVirtual machines are provisioned in Toronto (245 Consumers Rd 300 Toronto). A test IP is available here: <a href=\"http://38.110.116.254/100MB.test\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">http://38.110.116.254/100MB.test</a><br>\n<br>\n<b>Links</b><br>\n<br>\n<ul>\n<li data-xf-list-type=\"ul\"><a href=\"https://dynamic.lunanode.com/info.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">More information</a><br>\n</li>\n<li data-xf-list-type=\"ul\"><a href=\"https://wiki.lunanode.com/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Wiki</a></li>\n<li data-xf-list-type=\"ul\">Contact us: <a href=\"http://mailto:sales@%5Bmember=lunanode%5D.com\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">sales@</a><a href=\"https://vpsboard.com/profile/917-lunanode/\" class=\"link link--internal\">lunanode</a>.com</li>\n<li data-xf-list-type=\"ul\"><a href=\"https://dynamic.lunanode.com/register.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Register an account</a></li>\n</ul></div>\n<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n"}