{"id": "5330", "date": "Sep 22, 2014 at 9:48 PM", "user": "perennate", "post": "\n<div class=\"bbWrapper\"><b>Luna Node Dynamic - dynamic virtualization platform (KVM)</b><br>\n<br>\n<a href=\"https://dynamic.lunanode.com/info.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Luna Node Dynamic</a> is an hourly billing virtualization platform featuring rapid virtual machine deployment, hourly billing, snapshotting capabilities, an API for automation, complementary minimal server monitoring / DNS hosting, and more. Virtual machines are provisioned in Toronto.<br>\n<br>\n<a href=\"https://www.lunanode.com/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Luna Node</a> has been around for over a year, offering reliable KVM virtual private servers at affordable prices. We use OpenStack for the Luna Node Dynamic backend.<br>\n<br>\nHere's a more detailed feature explanation:<br>\n<br>\n<ul>\n<li data-xf-list-type=\"ul\"><b>Hourly billing</b> - you can create or destroy virtual machines at any time, and then only pay for the hours that VMs were used for. This allows you to provision test containers or scale your Internet application without having to pay for a month per container. The service is prepaid, with Paypal and Bitcoin (via Coinbase) as our current billing options.</li>\n<li data-xf-list-type=\"ul\"><b>Custom operating systems</b> - simply submit a URL, and the system will download your ISO image or qcow2 template. Once downloaded, you can provision new virtual machines with the custom operating system. For ISO images, OS installation can be completed over VNC (noVNC client).</li>\n<li data-xf-list-type=\"ul\"><b>Snapshotting</b> - hit a button to snapshot your virtual machine, and the current state of the disk image will be saved to our distributed filesystem. You can then use it to restore your virtual machine to a previous saved state or to provision more VMs. Snapshots are charged at $0.04 / GB / month (billed hourly); the first 20 GB is currently free but this is subject to change.</li>\n<li data-xf-list-type=\"ul\"><b>API</b> - we provide a simple API that you can use to manage your servers without going through the web UI.</li>\n<li data-xf-list-type=\"ul\"><b>Track billing</b> - a Billing tab is included in the Luna Node Dynamic panel that allows you to easily check your expenses for each month, with expenses sorted by day. Invoices are also posted at the end of each month for users who require such documents.</li>\n<li data-xf-list-type=\"ul\"><b>Floating IP addresses</b> - you can keep IP addresses on reserve in your account for $1/month (billed hourly). This means you can easily switch an external IP address between different virtual machines on your account. Additionally, if you don't need a VM for the time being, you can snapshot it and then disassociate its floating IP address so that you only have to pay for the storage space and IP.</li>\n<li data-xf-list-type=\"ul\"><b>Redundant cloud storage</b> - VMs may optionally be provisioned on top of a distributed, fault-tolerant filesystem to prevent data loss or downtime in case of a host node failure.</li>\n<li data-xf-list-type=\"ul\"><b>Private virtual networks</b> - you can create a private virtual network, and the private interface of virtual machines in that network will be isolated from other clients. (Each network is $4/month, billed hourly.)</li>\n<li data-xf-list-type=\"ul\"><b>Load balancing, firewall, VPN as a service</b> - inside your private network, these features are available. See <a href=\"https://wiki.lunanode.com/index.php/Virtual_networks\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">https://wiki.lunanode.com/index.php/Virtual_networks</a> for details. Currently you have to open a ticket for setup and configuration, but we are working on integrating virtual network service management into the Luna Node Dynamic panel.</li>\n<li data-xf-list-type=\"ul\"><b>Detachable volumes</b> - create arbitrary-sized block devices (volumes) and attach/detach them to virtual machine instances on the fly. For example, you can store application data on a separate volume so that the OS can be upgraded independently.</li>\n<li data-xf-list-type=\"ul\"><b>Server monitoring</b> - we offer basic server monitoring at no additional cost, where you can set up checks (e.g. ping, TCP connect), and receive notifications over email or SMS when the checks fail.</li>\n</ul>To get started, you can <a href=\"https://dynamic.lunanode.com/register.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\"><b>register an account from our panel</b></a>; an initial deposit of $12.00 is required. After the initial deposit, more credit in smaller increments (minimum $5.00) can be added when needed. We accept payments through Paypal and Bitcoin.<br>\n<br>\n<b>Plans</b><br>\n<br>\n<ul>\n<li data-xf-list-type=\"ul\">512 MB - 1 vCPU, 15 GB storage, 1000 GB bandwidth, $0.005 hourly ($3.6 monthly)</li>\n<li data-xf-list-type=\"ul\">1024 MB - 2 vCPU, 20 GB storage, 1500 GB bandwidth, $0.0072 hourly ($5.18 monthly)</li>\n<li data-xf-list-type=\"ul\">2048 MB RAM - 3 vCPU, 35 GB storage, 2000 GB bandwidth, $0.0139 hourly ($10.01 monthly)</li>\n<li data-xf-list-type=\"ul\">4096 MB RAM - 3 vCPU, 70 GB storage, 2500 GB bandwidth, $0.0267 hourly ($19.22 monthly)</li>\n<li data-xf-list-type=\"ul\">8192 MB RAM - 4 vCPU, 125 GB storage, 3000 GB bandwidth, $0.0514 hourly ($37.01 monthly)</li>\n<li data-xf-list-type=\"ul\">16384 MB RAM - 6 vCPU, 250 GB storage, 4000 GB bandwidth, $0.1 hourly ($72 monthly)</li>\n</ul>Port speed is 1 gbit/s. <a href=\"https://dynamic.lunanode.com/info.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Click here for full plan list</a>.<br>\n<br>\nYou can open a ticket within the first week to request a refund of remaining credit on your account, no questions asked.<br>\n<br>\nNote that Canadian customers will be charged sales tax when adding credit, at 5.00% for those outside British Columbia and 12.00% for those in British Columbia.<br>\n<br>\n<b><a href=\"https://dynamic.lunanode.com/register.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Sign up for an account now!</a></b><br>\n<br>\n<b>Locations</b><br>\n<br>\nTest IP for Toronto location (245 Consumers Rd 300 Toronto) is here: <a href=\"http://toronto-test.lunanode.com/100MB.test\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">http://toronto-test.lunanode.com/100MB.test</a><br>\n<br>\n<b>About</b><br>\n<br>\nLunaNode Hosting Inc. is a registered company based in British Columbia, Canada. We first launched in August 2013, focusing on low-cost, reliable KVM virtual private server hosting. We use OpenStack for our back-end and an in-house billing / VM management panel called lndynamic on the front-end (we also developed and continue to maintain <a href=\"https://pbobp.lunanode.com/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">pbobp</a>, a free software billing panel, and use it for managed hosting services).<br>\n<br>\nUpload your PGP key to <a href=\"https://lunanode.com/gpgmw\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">https://lunanode.com/gpgmw</a> to receive encrypted email from our mail server.<br>\n<br>\n<b>Links:</b><br>\n<br>\n<ul>\n<li data-xf-list-type=\"ul\"><a href=\"https://dynamic.lunanode.com/info.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">More information</a><br>\n</li>\n<li data-xf-list-type=\"ul\"><a href=\"https://dynamic.lunanode.com/terms.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Terms of service</a></li>\n<li data-xf-list-type=\"ul\"><a href=\"https://dynamic.lunanode.com/privacy.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Privacy policy</a></li>\n<li data-xf-list-type=\"ul\"><a href=\"https://wiki.lunanode.com/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Wiki</a></li>\n<li data-xf-list-type=\"ul\">Contact us: sales@<a href=\"https://vpsboard.com/profile/917-lunanode/\" class=\"link link--internal\">lunanode</a>.com</li>\n<li data-xf-list-type=\"ul\"><a href=\"https://dynamic.lunanode.com/register.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Register an account</a></li>\n</ul></div>\n<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n"}