{"id": "5935", "date": "Dec 14, 2014 at 12:44 PM", "user": "turnkeyinternet", "post": "\n<div class=\"bbWrapper\"><b>Final 48 hours for TurnKey Internet's <a href=\"https://turnkeyinternet.net/blackfriday\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Black Friday</a> Deals! New Inventory back in stock at 80% off, close out deals - 80% off for life! Hurry now, before these discount offers are gone forever! View all deals at <a href=\"https://turnkeyinternet.net/blackfriday\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">https://turnkeyinternet.net/blackfriday</a> </b><br>\n&nbsp;<br>\n<br>\n<b><span style=\"color: #FF0000\">50% Off For Life! BLACK FRIDAY EXTENDED FINAL DAYS!! Hurry, good for new orders placed during our promotion!</span></b><br>\n<br>\n<b><span style=\"color: #FF0000\">50% Off For Life! Exclusive BLACK FRIDAY cloud server reseller platform promotion, 50% off for life.&nbsp; Hurry, good for new orders placed during our promotion!</span></b><br>\n<br>\nPlease see <a href=\"https://turnkeyinternet.net/blackfriday/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\"><b>All Our Black Friday Specials</b></a> and for all rules and Limitations of our specials. NOTE: Coupon must be used to place order to utilize discount.<br>\n<br>\n<br>\nTurnKey Internet’s cloud server reseller platform allows access to our fully automated white-labeled product line of enterprise-class cloud-hosted servers featuring over 100 pre-loaded Microsoft Windows Server and Linux Server template choices.&nbsp; The cloud servers are hosted on our world-class platform within TurnKey Internet’s SSAE 16 Type 2 and ENERGY STAR® certified datacenter in New York using private label IP addresses and a white label web control panel.<br>\n<br>\n<br>\nThis cloud reseller platform is <b>NOT like any other VPS or Cloud Server Program</b> because we let you own your clients, set your own prices, customize your own server plans and offer a complete white label experience.&nbsp; And we give you access to both linux, and windows based cloud server images!<br>\n<br>\n<br>\nThis secure reseller platform allows you to sell your own private label cloud servers and virtual private servers directly to your clients, with no hardware to buy, no software to install and nothing you need to manage - everything is done via our fully automated web control panel.<br>\n&nbsp;<br>\n<br>\nCompetitors offering similar reseller options make your clients sign up with them, then simply pay you a small commission or discount. TurnKey Internet's cloud server reseller platform lets you own the client and the client signs up directly with you and pays you directly.&nbsp; You setup your own custom pricing and plans to bundle with whatever add-on services you may want to include (such as web design, IT management, premium geographic backups, etc).&nbsp; You are in complete control!<br>\n<br>\n<br>\n<b>Here is what makes the TurnKey Cloud Reseller Platform unique</b><br>\n<br>\n&nbsp;<br>\n<br>\n<ul>\n<li data-xf-list-type=\"ul\"><b><span style=\"color: #FF0000\">You OWN your client</span> - your client signs up and pays you directly</b><br>\n</li>\n<li data-xf-list-type=\"ul\"><b>Set your own prices (unlimited profit potential)</b></li>\n<li data-xf-list-type=\"ul\"><b>Create your own plans (unique disk size, memory, bandwidth, additional IPs, and more)</b></li>\n<li data-xf-list-type=\"ul\"><b>white label Web Control panel for your clients - Suspend, reboot, Re-Image, Stop/Start, Monitor Bandwidth and more!</b></li>\n<li data-xf-list-type=\"ul\"><b>Fully Automated Web Control Panel (reboot, reformat, KVM over IP, Re-image, Provision)</b></li>\n<li data-xf-list-type=\"ul\"><b>No over-selling - fast and stable server nodes with guaranteed resources, powered by XEN based virtualization technology</b></li>\n<li data-xf-list-type=\"ul\"><b>Linux and Windows based servers fully supported! Our technology lets you resell Windows Cloud Servers!</b></li>\n<li data-xf-list-type=\"ul\"><b>No Setup Fees / No Royalties / No Commissions</b></li>\n<li data-xf-list-type=\"ul\"><b>Unlimited Cloud Servers / VPS's can be provisioned (you buy 1 block of resources and cut it up as you like)</b></li>\n<li data-xf-list-type=\"ul\"><b>Sell / Support IPv6 Enabled Servers! We include IPv6 On all Cloud Servers you provision!</b></li>\n<li data-xf-list-type=\"ul\"><b>IPv6 Ready! Free /64 IPv6 Subnet included to each Cloud Server</b></li>\n<li data-xf-list-type=\"ul\"><b>Sell from the nation's leading GREEN Datacenter (Certified Energy Star Datacenter, using 100% Green Energy)</b></li>\n<li data-xf-list-type=\"ul\"><b>Sell from TurnKey's SSAE-16 Type 2 Certified Datacenter located in New York</b></li>\n<li data-xf-list-type=\"ul\"><b>We handle backups for you (automatic!) via weekly cloud server images.</b></li>\n<li data-xf-list-type=\"ul\"><b>100% network uptime guarantee</b></li>\n<li data-xf-list-type=\"ul\"><b>24x7 toll-free phone, live chat, and help desk support</b></li>\n<li data-xf-list-type=\"ul\"><b>30-day money-back guarantee</b></li>\n<li data-xf-list-type=\"ul\"><b>NO term contract (month to month)</b></li>\n<li data-xf-list-type=\"ul\"><b>NO setup fees</b></li>\n</ul><br>\n<b>All New Deca-Core TURBO SSD Cloud Virtual Servers</b> - utilizing Ultra-Fast SSD disk technology for ultra fast disk IO speeds combined with Dual Deca Core E5 CPU's (W/HyperThreading = 40 CPU Cores!) makes our all-new Cloud VPS (Virtual Private Server) nodes the fastest available!&nbsp;&nbsp; All plans are powered on Xen virtualization technology backed by our own wholly owned New York datecenter, server equipment, and U.S. based support team.<br>\n<br>\n<ul>\n<li data-xf-list-type=\"ul\">&nbsp;</li>\n<li data-xf-list-type=\"ul\"><b>ALL NEW Enterprise Grade Multi-Deca Core Servers With Raid 10 SSD</b><br>\n</li>\n<li data-xf-list-type=\"ul\"><b>Each node is equipped with the latest and greatest in processing</b></li>\n<li data-xf-list-type=\"ul\"><b>Dual 2.30 GHz Deca-Core Intel® E5 processors with Turbo Boost</b></li>\n<li data-xf-list-type=\"ul\"><b>Up to 40 CPU cores per node visible to the operating system</b></li>\n<li data-xf-list-type=\"ul\"><b>Up to 384 GB of memory available per node</b></li>\n<li data-xf-list-type=\"ul\"><b>SAS 3.0 12 Gbps direct attached storage HDD backplane</b></li>\n<li data-xf-list-type=\"ul\"><b>Multi-10 Gigabit Backbone connections, Juniper MX240 Network Routing</b></li>\n</ul><br>\nSo how does this work?&nbsp; Very simple - you sign up at <a href=\"https://turnkeyinternet.net/blackfriday/cloud-reseller/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">http://www.turnkeyinternet.net/cloud-reseller</a>, you will have at least 200 GB of disk space, 16 GB ram, and 10+ ip's to start with.&nbsp; You can provision as many cloud servers and virtual private servers as you like within that total block of resources.&nbsp; You can purchase additional resources at any time, such as additional memory, or disk space. You will have fully automated access to provision your cloud based servers including reboot, re-image, delete, and even trouble shoot your cloud servers using the remote KVM over IP feature.&nbsp; This is all done via our white label web control panel.&nbsp; You market to and sign up your clients like you do today - with any price or server plan you like.&nbsp; You login via the web control panel and provision the server for your client, and give them a username and password, plus the link to the white label control panel so they can then manage their own cloud server.&nbsp; They never have to ask you for anything - they will have access to reboot, re-image or trouble shoot their own cloud server(s) via the remote KVM over IP tools.&nbsp; That's it - you own the client, your client pays you directly, and you have complete control over the client. Everything is fully automated for you, but if you ever need a hand with anything you can contact our fast and friendly support team 24 hours a day via telephone, email or the help desk.&nbsp; We will even help you trouble shoot any issues provisioning your cloud servers.&nbsp; We even offer you access to purchase popular software licensing direct from us such as cPanel, Plesk, DirectAdmin, as well as numerous Microsoft Windows licensing options.&nbsp; You can then resell those licenses or bundle them with your cloud server plans directly to your client. &nbsp;<br>\n<br>\n<br>\nPlease see <a href=\"https://turnkeyinternet.net/blackfriday/cloud-reseller/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\"><b>https://turnkeyinternet.net/blackfriday/cloud-reseller/</b></a> for all details on our all new cloud reseller platform.<br>\n<br>\n<br>\nWe offer 2 flavors of cloud-server reselling, our standard platform and the all new TURBO platform.&nbsp; The TURBO platform utilizes Ultra-Fast SSD disk technology for blazing fast disk IO speeds combined with Dual Octa-Core (8 Core) E5-2650 CPU's (W/HyperThreading = 32 Cores!) and Dual Deca-Core (10 Core with up to 40 CPUs with hyperthreading support) making your resold cloud servers and VPS's (Virtual Private Servers) the fastest available anywhere!&nbsp;&nbsp; All plans are powered on Xen virtualization technology backed by our own wholly owned New York datecenter, server equipment, and U.S. based support team.<br>\n<br>\n<br>\nThe Turbo cloud server reseller platform enhances the traditional cloud server experience through the use of cutting-edge efficiency technology, such as solid state drives (SSD’s), which have significantly faster input/output speeds than typical, rotational drives. SSD’s utilize no moving parts and run solely on flash memory. This allows TurnKey Turbo cloud servers to run ultra-fast and maximize the speed on all resources. At the core of the TurnKey Turbo cloud server platform is Intel’s® E5-26502 GHz Octa-Core (8-core) and Intel Deca-Core (10-Core) CPU technology, which increases speeds up to four times that of a traditional, Quad-Core cloud servers.&nbsp; If you have been selling cloud servers and virtual private servers (VPS's) in the past, the new TURBO cloud server platform will take your product offerings to a whole new level, opening up new sales opportunities to your clients.<br>\n<br>\nThe hard drives on the TURBO Cloud Server Reseller Plaftorm offer one hundred thousand IOPS (input/output per second) per drive. There are multiple SSD disks and multiple Octa-Core (8 Core) CPU’s or Multiple Deca-Core (10 Core) CPU's in each node, configured in RAID-10, using high-performance RAID cards with significant on-board caching capabilities. This is the most innovative, highest-performing node configuration on the market, and a ground-breaking alternative to the other cloud server and virtual private server (VPS) options out there.<br>\n<br>\nThe TurnKey Turbo Cloud Server Reseller Plaftorm is a top-of-the-line hosting solution ideal for webmasters, businesses, and individuals, alike. These cloud servers are ideal for sites and applications that transfer large amounts of information, like high-traffic blogs and expansive databases, and for those seeking the perfect balance of value, performance, and dependability.<br>\n<br>\n<br>\nAll Cloud Servers that you provision via your Cloud Reseller Plaftorm include the following:<br>\n<br>\n<ul>\n<li data-xf-list-type=\"ul\">Xen - No over-selling, all guaranteed resources!</li>\n<li data-xf-list-type=\"ul\">Linux or Windows (and custom OS's such as VMWare, Solaris, and more!)</li>\n<li data-xf-list-type=\"ul\">50+ Pre-ready Linux images to choose from</li>\n<li data-xf-list-type=\"ul\">50+ CD-ROM ISO CD discs to install custom operating systems</li>\n<li data-xf-list-type=\"ul\">Guaranteed RAM - No burst, no over-sold servers, fully-allocated RAM!</li>\n<li data-xf-list-type=\"ul\">RAID-10 ultra-fast SSD disks (On Turbo Cloud Server Pacakges)</li>\n<li data-xf-list-type=\"ul\">Tier-1 national backbone connections via BGP4 redundant Juniper powered core network</li>\n<li data-xf-list-type=\"ul\"><b>IPv6 /64 Address Block Included on each provisioned server</b><br>\n</li>\n<li data-xf-list-type=\"ul\">white label administration panel access (web-based) for you and your clients</li>\n<li data-xf-list-type=\"ul\">Automated reboots</li>\n<li data-xf-list-type=\"ul\">Automated OS reloads</li>\n<li data-xf-list-type=\"ul\">KVM/console access included free!</li>\n<li data-xf-list-type=\"ul\">Licensed installed server image versions of Windows Server 2012 and 2008 available (additional license costs may apply)</li>\n<li data-xf-list-type=\"ul\">Bring your own license versions for Server 2012 and 2008, and Windows XP, Windows 7, and Windows 8</li>\n<li data-xf-list-type=\"ul\">Control panels available: cPanel, Plesk, DirectAdmin, &amp; Webmin (additional license costs may apply)</li>\n<li data-xf-list-type=\"ul\">multiple IP address included - you allocate as you see fit to your servers</li>\n<li data-xf-list-type=\"ul\">Free SmarterTools bundle, an $800 value with Windows servers you provision<br>\n&nbsp;</li>\n</ul><b>FREE IPv6 Addresses</b> : We automatically include native IPv6 addressing, along with the more popular IPv4 Address(es) already included on your account. This means your applications and web sites will be ultra fast and directly reachable to anyone on the Internet using both the traditional IPv4 addresses as well as the new expansion into the IPv6 Addressed Internet. You don't need to do anything different, we simply make your hosting future proof here at TurnKey - and you are IPv6 enabled when you host with us!<br>\n<br>\n<span style=\"color: #FF0000\"><b>Choose from these terrific packages: </b></span><br>\n<br>\n<b>Professional Cloud Reseller</b><br>\n<br>\n<ul>\n<li data-xf-list-type=\"ul\">100+ Linux and Windows Server Templates to use</li>\n<li data-xf-list-type=\"ul\">16 GB RAM guaranteed</li>\n<li data-xf-list-type=\"ul\">200 GB SATA-III Cached Raid-10 Disk Space</li>\n<li data-xf-list-type=\"ul\">100 Mbit port included on each server</li>\n<li data-xf-list-type=\"ul\">2 TB bandwidth</li>\n<li data-xf-list-type=\"ul\">Weekly Backups (cloud server complete images)</li>\n<li data-xf-list-type=\"ul\">Standard High Performance Server Nodes</li>\n</ul><br>\nNow $66month* with coupon (was $132/mo!) | <a href=\"https://turnkeyinternet.net/blackfriday/cloud-reseller/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">ORDER NOW</a><br>\n<br>\n<br>\n<br>\n<b>Turbo Cloud Reseller</b><br>\n<br>\n<ul>\n<li data-xf-list-type=\"ul\">100+ Linux and Windows Server Templates to use</li>\n<li data-xf-list-type=\"ul\">16 GB RAM guaranteed</li>\n<li data-xf-list-type=\"ul\"><b>200 GB SSD Raid-10 Turbo</b> Disk Space</li>\n<li data-xf-list-type=\"ul\"><b>1000 Mbit (GigE) port included on each server</b><br>\n</li>\n<li data-xf-list-type=\"ul\">5 TB bandwidth</li>\n<li data-xf-list-type=\"ul\">Weekly Backups (cloud server complete images)</li>\n<li data-xf-list-type=\"ul\"><b>Turbo Dual Octa-Core (8 Core) or Deca-Core (10 Core) CPUs</b> with HyperThreading Server Nodes</li>\n</ul><br>\nNow $132/month* with coupon (was $265/mo!) | <a href=\"https://turnkeyinternet.net/blackfriday/cloud-reseller/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">ORDER NOW</a><br>\n<br>\n<br>\n<br>\nPre-Ready operating system images (in x32 and x64 options):<br>\n<br>\n<ul>\n<li data-xf-list-type=\"ul\">Centos 4.x, 5.x, 6.x</li>\n<li data-xf-list-type=\"ul\">Debian 4.x, 5.x, 6.x</li>\n<li data-xf-list-type=\"ul\">Fedora Core 14, 15, 16</li>\n<li data-xf-list-type=\"ul\">Ubuntu 10.04, 11.04</li>\n<li data-xf-list-type=\"ul\">Gentoo 2010, 2011</li>\n<li data-xf-list-type=\"ul\">Slackware 12.x, 13.x</li>\n<li data-xf-list-type=\"ul\">Windows Server 2008 R2 (Web and Standard Edition)</li>\n<li data-xf-list-type=\"ul\">Windows Server 2008 (Web and Standard Edition)</li>\n<li data-xf-list-type=\"ul\">Windows Server 2012 (Standard Edition)</li>\n<li data-xf-list-type=\"ul\">Windows Server 2008 R2 Standard w/Plesk 10.3</li>\n<li data-xf-list-type=\"ul\">CentOS 6.3 x32 &amp; x64—with Gnome</li>\n<li data-xf-list-type=\"ul\">CentOS 6.3 x32 &amp; x64—with cPanel</li>\n<li data-xf-list-type=\"ul\">CentOS 6.3 x32 &amp; x64—with XFCE</li>\n<li data-xf-list-type=\"ul\">CentOS 6.3 x32 &amp; x64—with Virtualmin</li>\n<li data-xf-list-type=\"ul\">CentOS 6 x32 &amp; x64</li>\n<li data-xf-list-type=\"ul\">CentOS 5.6 x32 &amp; x64</li>\n<li data-xf-list-type=\"ul\">CentOS 4.8 x32 &amp; x64</li>\n<li data-xf-list-type=\"ul\">Fedora 16 x32 &amp; x64—with and without XFCE</li>\n<li data-xf-list-type=\"ul\">Debian 5 x32 &amp; x64</li>\n<li data-xf-list-type=\"ul\">Debian 6 x32 &amp; x64</li>\n<li data-xf-list-type=\"ul\">Ubuntu 12.04 x32 &amp; x64—with and without XFCE</li>\n<li data-xf-list-type=\"ul\">Ubuntu 11.04 Server x32 &amp; x64</li>\n<li data-xf-list-type=\"ul\">Ubuntu 11.04 Desktop x32 &amp; x64</li>\n<li data-xf-list-type=\"ul\">Ubuntu 10.04 Server x32 &amp; x64</li>\n<li data-xf-list-type=\"ul\">Slackware 13 x32 &amp; x64</li>\n<li data-xf-list-type=\"ul\">Gentoo 2011 x32 &amp; x64</li>\n<li data-xf-list-type=\"ul\">Arch Linux 2010.05 x32 &amp; x64</li>\n<li data-xf-list-type=\"ul\">Windows Server 2012 Standard</li>\n<li data-xf-list-type=\"ul\">Windows Server 2008 R2 (all versions)</li>\n<li data-xf-list-type=\"ul\">Windows Server 2008 (all versions)</li>\n<li data-xf-list-type=\"ul\">CentOS 5 DESKTOP (xWindows Gnome, or KDE)</li>\n<li data-xf-list-type=\"ul\">CentOS 5 cPanel</li>\n<li data-xf-list-type=\"ul\">CentOS 5 cPanel DNS only</li>\n<li data-xf-list-type=\"ul\">CentOS 5 Nagios</li>\n<li data-xf-list-type=\"ul\">CentOS 5 Cacti</li>\n<li data-xf-list-type=\"ul\">CentOS 5 Webmin</li>\n<li data-xf-list-type=\"ul\">CentOS 5 Plesk</li>\n<li data-xf-list-type=\"ul\">CentOS 5 DirectAdmin</li>\n</ul><br>\nNote: Microsoft licenses, and other 3rd party software licenses are an additional fee as noted at check out, and can be purchased later (or you may use your own licenses).&nbsp; included ONLY on the Windows pre-ready OS templates listed above; you must provide your own OEM license (Windows 7 or 8, for example) if you choose to install an operating system from the VNC console using an ISO disc image.<br>\n<br>\n<br>\n<i>* Coupons are limited to 1 per client, new orders only, and may not be combined with other coupons or special offers. Cannot be used to transfer from existing TurnKey Internet service. Pricing is based on 1 year payment plan. Please visit the TurnKey Internet website linked above for specific limitations and regulations for this offer </i><br>\n<br>\nOffers above are priced monthly - there are no contract or term obligations required unless otherwise specified on the product page. Take advantage of an additional 10% off for annual subscriptions on most products, see individual product pages for specific offer details and limitations.<br>\n<br>\nAll discounts are for LIFE, as long as you keep the product active, paid, and the account in good standing your discount will apply for the life of the product you order!<br>\n<br>\n<b>To our loyal current clients: We love you!</b> We do not like it when companies treat new customers with discount offers better than their loyal existing customers too! We have great news for you, purchase any new Black Friday deal today and we will add on '1' free month of service to the new product for every year you have been a customer! Please be aware, you can not cancel or transfer from an existing TurnKey service at these Black Friday discount rates - but you can order a new service on these discount promotions and enjoy extra free months of service as a bonus for your continued loyalty!<br>\n<br>\n<br>\n<b>TURNKEY INTERNET’S DATA CENTER NOW HAS A ZERO CARBON FOOTPRINT!</b><br>\n<br>\nAt TurnKey Internet, we pride ourselves on our commitment to sustainability and the environment. TurnKey Internet's Energy Star Certified <a href=\"http://turnkeyinternet.net/datacenters/new-york/latham/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">New York Green datacenter</a> uses 100% renewable energy and officially reached the elite status of a ZERO CARBON FOOTPRINT. Using a dedicated on-site solar power generation plant, coupled with Hydro Electric power grid all energy used on our hosting services and colocation services are 100% renewable. Our facility uses Smart Aisle Cooling and Cold Containment Pod technology to make our datacenter the most energy efficient of its size anywhere!&nbsp; For more information, read our <b><a href=\"http://www.turnkeyinternet.net/green-initiative/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Green Initiative</a></b> page.<br>\n<br>\n<br>\n<b>About TurnKey Internet:</b><br>\n<br>\nAll servers are hosted in our company-owned and operated, ENERGY STAR certified,&nbsp; <a href=\"http://www.turnkeyinternet.net/green/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">green</a> data center in New York’s Tech Valley Region. Alternative technologies such as <b>on-site solar power generation</b>, cold containment pods, hydroelectricity, and SmartAisle cooling have eliminated our carbon footprint entirely, and made us the best of the best for energy efficiency nation-wide.<br>\n<br>\nSince 1999, TurnKey Internet has built a reputation of outstanding personalized service, reliability, and value.&nbsp; TurnKey is dedicated to success every step of the way.&nbsp; TurnKey maintains an A+ rating from the Better Business Bureau, is SSAE 16 Type 2 certified, ENERGY STAR certified, and the winner of the 2012 Excellence in Small Business Award from the U.S. Small Business Administration. We are experts in the cloud hosting and data center space, and are here to support you for any and all of your hosting needs.<br>\n<br>\nDon't just take our word for it - view these <a href=\"http://www.turnkeyinternet.net/reviews/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Verified Client Testimonials</a> and our <a href=\"https://www.shopperapproved.com/certificates/www.turnkeyinternet.net/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">5-star, perfect rating</a> from Shopper Approved.<br>\n<br>\n<br>\n<span style=\"color: #FF0000\"><b>FAQ:</b></span><br>\n<br>\n<b>Which payment methods do you accept?</b><br>\nAll major credit cards including VISA, MasterCard, American Express, Discover, VISA/MC debit cards. We also accept PayPal, PayPal e-Check, and Moneybookers.<br>\n<br>\n<b>Is there a speed test download file?</b><br>\nYes! <a href=\"http://www.turnkeyinternet.net/speed-test/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Speed Tests</a><br>\n<br>\n<b>How soon will my account be ready?</b><br>\nStandard web hosting, SEO hosting, Reseller packages, Virtual Servers and Cloud Servers are provisioned instantly to be live and accessible within minutes! Dedicated servers, custom orders, and colocation services are typically ready same business day. All new orders are subject to approval by our billing department and may require additional details to process your order such as photo identification verifying the billing address with payment method.<br>\n<br>\n<b>Are there any content restrictions?</b><br>\nNo bulk email services, no proxies, no warez/linking. Legal adult content permitted on dedicated servers only. Please see our <a href=\"http://www.turnkeyinternet.net/policies/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Terms of Service </a> for complete details.<br>\n<br>\n<b>How are your prices so low?</b><br>\nWhile it may seem incredible to offer these amazing prices and discounts, the reality is that in the data center and cloud hosting business, electricity is the largest expense. With our new on-site solar power system, we produce our own energy. The energy we use in excess of that comes from clean, renewable, hydro-electric power, sourced from Niagara Falls, New York, at a substantially reduced cost for power compared to traditional data centers. Our other green technology investments, such as Smart Aisle precision cooling and cold containment systems, provide an additional 33% efficiency over traditional data centers, further reducing our electricity utilization. This all adds up to entirely renewable electricity, and a zero carbon footprint, as evidenced by our EPA ENERGY STAR certification. Ultimately, this adds up to a lower cost of providing our reliable service.&nbsp; Lastly, we own and operate our own facility, servers, routers, and network connections.&nbsp; We are not resellers or wholesalers, so we do not have the higher operating costs of renting servers and equipment. This allows us to pass down the savings to our customers.<br>\n<br>\n<b>Where are the servers located?</b><br>\nThese specials are available in our ENERGY STAR certified, <a href=\"http://www.turnkeyinternet.net/green/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">GREEN</a> data center, in New York’s Tech Valley Region.<br>\n<br>\n<b>Do you have a money back guarantee?</b><br>\nYes. A 30-day, no-questions-asked, money-back guarantee is available to all new customers.<br>\n<br>\n<b>Why host with TurnKey Internet?</b><br>\nTurnKey Internet provides superior hosting performance at affordable prices, backed with bullet-proof reliability and a <a href=\"http://turnkeyinternet.net/policies/service-level-agreement/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">100% network up-time guarantee</a>.&nbsp; We offer the latest in technology, including green, renewable power produced on-site at our data center. Fully-managed services allow you peace of mind with off-site backups, firewall setup, and 24/7 system administration support.&nbsp; TurnKey Internet is a member of the Better Business Bureau of New York, with the <a href=\"http://turnkeyinternet.net/trusted-hosting/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">highest possible rating</a> of <b>A+</b>.<br>\n<br>\n<b>CONTACT US:</b><br>\nLive Chat: <a href=\"http://www.turnkeyinternet.net/help/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Live Sales Chat</a><br>\nEmail: <a href=\"http://mailto:sales@turnkeyinternet.net\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">sales@turnkeyinternet.net</a><br>\nWeb: <a href=\"http://www.turnkeyinternet.net\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">www.turnkeyinternet.net</a><br>\nFacebook: <a href=\"https://www.facebook.com/pages/TurnKey-Internet/285972374709\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">Turnkey Internet</a><br>\nTwitter: @TurnKeyInternet<br>\n&nbsp;</div>\n<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n"}