{"id": "6707", "date": "Apr 4, 2015 at 5:49 AM", "user": "kruno", "post": "\n<div class=\"bbWrapper\">KnownSRV offers top-notch VPS packages that are generous in both space and bandwidth. We guarantee trouble free service and peace of minds for hosting your websites.We utilize the latest virtualisation technology to give you the power to fully customise your own environment.<br>\n<br>\n&nbsp;<br>\n<br>\n<b>Why Us?</b><br>\n<br>\n- Fast and stable network<br>\n<br>\n- Secure servers<br>\n<br>\n- Privacy guaranteed!<br>\n<br>\n- 99.9% uptime<br>\n<br>\n- 24/7/365 e-mail support<br>\n<br>\n- RIPE LIR<br>\n<br>\n- Quality server grade hardware<br>\n<br>\n- Competitive pricing&nbsp;<br>\n<br>\n- No overselling<br>\n<br>\n- Realistic package specifications vs price<br>\n<br>\n- Unlimited OS Reinstalls<br>\n<br>\n- Full root access<br>\n<br>\n- SolusVM Control Panel to manage your VPS(reboot, reinstall, console access etc)<br>\n<br>\n- Custom rDNS<br>\n<br>\n- TUN/TAP/PPP supported<br>\n<br>\n- IPv6 ready!<br>\n<br>\n- Private network available on request if you have multiple servers<br>\n<br>\n- 7 day money-back guarantee - NO QUESTIONS ASKED!<br>\n<br>\n&nbsp;<br>\n<br>\n<b>Our Hardware and Network</b><br>\n<br>\nWe use only server grade HP-branded hardware. Our servers run on Intel E3-1240 and 4x SAS 15k RPM drives in hardware RAID10(with BBU!) which guarantees fantastic performance and data integrity. Our network contains only the best connections available. The network is fully built from redundant enterprise Cisco, Juniper and Brocade network equipment which allows us to guarantee 99.9% uptime.<br>\n<br>\n&nbsp;<br>\n<br>\n<b>Transit</b><br>\n<br>\nAS3257 (TiNET / GTT)<br>\n<br>\nAS2914 (NTT)<br>\n<br>\nAS6461 (Zayo)<br>\n<br>\nAS6762 (Seabone)<br>\n<br>\nAS9031 (EDPnet)<br>\n<br>\nAS174 (Cogent)<br>\n<br>\nAS33926 (Kaia Global)<br>\n<br>\n<b>Internet Exchanges</b><br>\n<br>\nAMS-IX<br>\n<br>\nNL-IX<br>\n<br>\nDE-IX<br>\n<br>\nMultiple private peers<br>\n<br>\n&nbsp;<br>\n<br>\n<b>Test IP:</b> 194.145.209.182<br>\n<br>\n<b>Test File:</b> <a href=\"http://194.145.209.182/100mb.test\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">http://194.145.209.182/100mb.test</a><br>\n<br>\n&nbsp;<br>\n<br>\n<br>\n<div style=\"text-align: center\"><b><span style=\"color: #0000FF\"><span style=\"font-size: 10px\">Why make the move to KnownSRV Solutions?</span></span></b><br>\n<br>​</div><br>\n<b>Great pricing</b> - We may not be the cheapest, but our prices are extremely reasonable, just remember that quality comes at a price, and we provide it at affordable prices.<br>\n<br>\n&nbsp;<br>\n<br>\n<b>Security/Efficiency</b> - Problems can occur at any time, some of which cannot be helped, but we here at KnownSRV have systems in place to detect the most common problems before they even occur, and put that together with our highly dedicated experienced staff and we are able to provide secure, efficient services.<br>\n<br>\n&nbsp;<br>\n<br>\n<b>Dedication to our customers</b> - We value every one of our customers, without customers we wouldn't have a successful business like we do today, which is why we provide our full dedication and focus towards our customers, to ensure that they are taken care of and are given the best service possible.<br>\n<br>\n&nbsp;<br>\n<br>\n<b>No Prism, no Patriot Act</b><br>\n<br>\nYour security and privacy are our top priorities. We have both technical and legal systems in place which allow us to protect your business and privacy. We respect net neutrality and freedom of speech. We will not suspend your site only because someone doesn't like your content or has a personal beef with you. &nbsp;<br>\n<br>\n&nbsp;<br>\n<br>\n<b>Managed Services</b><br>\n<br>\nKnownSRV is a well known managed provider. While we manage your servers free of charge, the service also includes custom server setups such as full security, installing nginx or Varnish in front of Apache for serving/caching static content in order to improve your loading speeds / performance. Need your server perfectly secured or/and optimizated for heavy traffic sites? No worries!<br>\n<br>\n&nbsp;<br>\n<br>\n<b>Professional DDoS Protection</b><br>\n<br>\nWe offer optional DDoS protected IP addresses. Protection currently contains 2 POPs - Netherlands and Romania. Romanian POP is provided by Voxility, Netherlands POP is built by us. We can mitigate attacks up to 200Gbps / 100M pps. We can protect against all kinds of layer3/4/7 attacks.&nbsp;<br>\n<br>\n&nbsp;<br>\n<br>\n<b>VPS Packages</b><br>\n<br>\nPlease take a look at our VPS packages and addons at:<br>\n<br>\n<a href=\"http://knownsrv.com/vps.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow noopener\">http://knownsrv.com/vps.php</a><br>\n<br>\n&nbsp;<br>\n<br>\n<b>Supported Payment Methods:</b><br>\n<br>\nWe currently accept PayPal, Credit/Debit Cards, Skrill, PayZa, WebMoney and BitCoins. If you do not have any of the payment methods mentioned, feel free to contact us to find out if any other method can be arranged.<br>\n<br>\n&nbsp;<br>\n<br>\n<b>Discounts!</b><br>\n<br>\nWe prepared amazing discounts which will be valid 2 months from now. There won't be a better time to get a service from KnownSRV.&nbsp;<br>\n<br>\nWHT_50 - 50% off first month on all shared hosting / VPS services.<br>\n<br>\n10off - 10% reccuring/lifetime discount on all shared hosting / VPS services<br>\n<br>\n&nbsp;<br>\n<br>\nIf you have any questions do not hesitate to contact us.<br>\n<br>\n&nbsp;<br>\n<br>\nMany Thanks<br>\n<br>\nKnownSRV LTD</div>\n<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n"}