{"id": 1891, "date": "2020-10-08 08:29:24", "user": "AnthonySmith", "post": "I thought I would try to do something different and more engaging. This approach may not work at all but I thought it was worth trying anyway.\r\n\r\nLet me know what you actually want, I will offer a couple of guidelines and some things you should know apart from that it is wide open.\r\n\r\nI can offer you KVM or OpenVZ 7 based servers in the UK (London) or USA (Phoenix Arizona)\r\n\r\nLondon specifics:\r\n\r\n* All services are in Clouvider DC.\r\n* All services have DDOS protection at no extra cost.\r\n* Pure SSD/NVMe are backed up to a separate local raid array nightly at no extra cost.\r\n* Free Direct Admin licenses are available on request.\r\n\r\nUSA Specifics:\r\n\r\n* All services are out of IOflood.\r\n* IPv6 is not available\r\n\r\nGeneral info:\r\n\r\n* I am unlikely to give great prices on crazy amounts of bandwidth comparative to the size of the VPS plan.\r\n* Docker is supported on the OpenVZ 7 services.\r\n* Abuse reports from torrenting = termination.\r\n* Crypto, card, PayPal accepted.\r\n* tor = termination.\r\n* Orders are not accepted when placed via a VPN or proxy without additional validation.\r\n* Orders are currently not accepted from China, Brazil or Iran.\r\n* Special deals are none refundable.\r\n* Managed migration is available for free from other hosts for KVM &gt; KVM\r\n\r\n# What do you want?\r\n\r\nlet me know what amount of the following resources you want:\r\n\r\nvCPU's (fair share is assumed)\r\nRAM\r\nDISK\r\nTransfer/BW\r\nIP's\r\nLocation\r\nAny Extras\r\n\r\nI will give you the best price I can and I will make that price available to anyone else for 7 days.\r\n\r\nIn the event, a deal can be made I will give you the closest plan order link to what you want, you will order that product but do not pay the invoice, then open a ticket with the order number and specs quoted here and I will update the order price, once you have paid I will update package to match that.\r\n\r\nDon't be shy :)\r\n"}