{"id": 2130, "date": "2020-11-26 21:35:25", "user": "Mr_Tom", "post": "VM Specialist is a small UK based firm specialising in custom spec, manged and unmanaged virtual servers. We’re not out to compete on price, but do offer a competitive service with 24/7 support. More information is on our website - which I’m redeveloping currently to better convoy the services offered and to simplify ordering, etc.\r\n\r\nThese are self/unmanaged and can be managed via our billing panel. noVNC client is available, as well as custom ISO uploading.\r\nWe also offer a 99.999% SLA, as well as 24/7 excellent support, and management services if required.\r\n\r\nOur offers are at: [https://console.vmspecialist.com/order/main/packages/order/?group_id=13](https://console.vmspecialist.com/order/main/packages/order/?group_id=13 \"https://console.vmspecialist.com/order/main/packages/order/?group_id=13\")\r\n\r\nThere some storage offers, and some US/DE KVM offers (on Clouviders network). All the current listings are yearly prices. If it's marked as sold/gone then it's gone. These don't qualify for free DirectAdmin but it can be added on at a reduced fee.\r\n\r\nI am going to put together some very limited, LES exclusive offers/bonuses on some higher spec plans for tomorrow only (27th), but otherwise these will be available until sold out.\r\n\r\nSamples currently live:\r\n\r\n* 1 core/1gb ECC RAM/15gb NVMe/2tb transfer - £22.50/year in New York/Los Angeles\r\n* 1 core/1gb ECC RAM/1tb storage/5tb transfer - £37.50/year\r\n* 2 core/2gb ECC RAM/30gb NVMe/2tb transfer - £31.00/year in Frankfurt, DE\r\n\r\nStandard [terms](https://www.vmspecialist.com/terms.html \"terms\") apply, but basically\r\n\r\n* No torrenting/anything likely to be classed as copyright infringement.\r\n* No IRC/other services likely to attract DDoS attacks (we may make exceptions depending on use case).\r\n* No CPU intensive workloads (crypto, etc).\r\n* No SPAM\r\n\r\nAll prices exclude VAT where applicable. Orders are manually approved/checked/etc."}