{"id": 2162, "date": "2020-11-28 06:21:52", "user": "Not_Oles", "post": "**Friday** is almost over here in Sonora! 🏜️ I've been trying all day to dream up a Cyber Weekend deal. What do you guys think of this one? \r\n\r\n**Not_Oles' Cyber Weekend Dream Deal!**\r\n\r\n**Buy three months. When you renew for the second three month period, you pay only for two months. Thus, month number six is free.**\r\n\r\n**Fine print:** Not recurring. If you cancel during the first three months you are charged the per diem rate. If you cancel during the second three month period you are charged the full monthly per diem rate during months four and five. Thus, no refunds during month six. Deal expires 11:59 PM UTC on Cyber Monday based on when Paypal payment is made. No service level agreement. Just for fun. Not for business use. Grumpy, incompetent administrator. Limited availability. Delivery might take awhile. GNU/Linux command line peeps encouraged. *BSD and Plan 9 users welcomed. Window$ users welcomed. Apple users welcomed too. Additional free month for first person who successfully [runs KVM inside an unprivileged LXC container.](https://dshcherb.github.io/2017/12/04/qemu-kvm-virtual-machines-in-unprivileged-lxd.html)\r\n\r\n**The Plans**\r\n\r\n4 x Ryzen 3700X, 4 GB ECC RAM, 50 GB NVME RAID 1, 1 IPv4, 1 Gbps, $10/mo\r\n\r\n8 x Ryzen 3700X, 8 GB ECC RAM, 100 GB NVME RAID 1, 1 IPv4, 1 Gbps, $20/mo\r\n\r\n**More information**\r\n\r\nHetzner AX51 in Helsinki\r\n\r\nLXC, but KVM if you have a good reason.\r\n\r\nYabs and additional information in [previous thread.](https://talk.lowendspirit.com/discussion/2094/new-lxc-or-kvm-vps-4-x-ryzen-3700x-4-gb-ecc-ram-50-gb-nvme-raid-1-1-ipv4-1-gbps-10-mo/p1)\r\n\r\nYou get access to the Proxmox control panel. You can see the load averages and performance graphs for the host node. You can start, stop, reboot, backup, and restore your VPS. You can see the load averages and performance graphs for your VPS. \r\n\r\nIPv4 works fine. IPv6 into the host node also works fine. No IPv6 in the VPSes until I figure out what to put in /etc/network/interfaces and whatever else is needed. A few reboots and network bumps are  guaranteed. \r\n\r\nCheck [my 1337 front end skillz.](https://metalvps.com)\r\n\r\n**How to Order and Pay**\r\n\r\nTo order, please post here, PM me, or use the email on my profile. \r\n\r\nPlease send Paypal payments to the email on my profile. Please read the fine print section, above, before paying.\r\n\r\n**What People are Saying**\r\n\r\n[\"the fastest VPS I ever used\"](https://talk.lowendspirit.com/discussion/comment/46072/#Comment_46072)\r\n\r\n[\"I've been using this one from him. Highly recommend! His support is really amazing!\"](https://talk.lowendspirit.com/discussion/comment/45718/#Comment_45718)\r\n\r\n[\"premium stuff\"](https://talk.lowendspirit.com/discussion/comment/46966/#Comment_46966)\r\n\r\n[\"resplendent as the Sonoran Sun\"](https://talk.lowendspirit.com/discussion/comment/46668/#Comment_46668)\r\n\r\n[\"god bless not_oles ^^\"](https://talk.lowendspirit.com/discussion/1509/how-to-add-a-domain)"}