{"id": 2303, "date": "2020-12-22 03:32:20", "user": "Not_Oles", "post": "¡Saludos! \r\n\r\nMaybe the Dawning of the Age of Aquarius is today! \r\n\r\n[\"The next “Age of Aquarius” moment is December 21st, 2020, when Jupiter and Saturn meet for the first time in millennia, at 0° Aquarius. What are the chances to have the 2 slowest moving visible planets of our solar system meeting exactly in the 1st degree of Aquarius? The Jupiter-Saturn conjunction on December 21st, 2020 may well be that final ‘cosmic push’ that will mark the official beginning of the Age of Aquarius.\"](https://astrobutterfly.com/2020/10/09/age-of-aquarius-the-next-chapter/)\r\n\r\nFor me, today's big Aquarius push was the first of the two tricks in @yoursunny's post, [Enable IPv4 Access in EUserv IPv6-only VS2-free](https://talk.lowendspirit.com/discussion/comment/51194#Comment_51194). As @yoursunny explained so clearly, all I had to do was change the DNS resolvers to point to a public NAT64 translator service. Then I could enjoy accessing IPv4-only websites via an IPv6-only VPS! Maybe another day soon I will implement @yoursunny's second trick from the linked post, VXLAN, so that my IPv6-only VPS is accessible from IPv4-only machines.\r\n\r\nMaybe the Age of Aquarius means that we no longer need to pay the IPv4 tax for our VPSes! Maybe I can deliver cheap but really high performance IPv6-only VPSes which also can access IPv4-only content! \r\n\r\nSssshhh! Please don't spoil the fun by mentioning the obvious fact that @AnthonySmith and many others have been doing NAT VPSes for a long time! \r\n\r\n**IPv6 only, NAT64 IPv4 enabled, Ryzen Premium $7 Deal!**\r\n\r\n**2 x Ryzen 3700X, 2 GB ECC RAM, 25 GB NVME RAID 1, no IPv4, 1 x /128 IPv6, 1 Gbps, $7/month**\r\n\r\nPremium Ryzen VPS -- the best performance you can get without spending more than three times as much every month for your own bare metal, dedicated server! \r\n\r\nIf you are sitting between oversold and slow on one side and expensive bare metal on the other side, then this best performance, premium Ryzen VPS is perfect for you!\r\n\r\nYou get access to the [Proxmox VE control panel.](https://proxmox.com/en/) **You can see real time load averages and performance graphs for the host node!** Do you know any other Hosting Provider who has sufficient confidence in his host node performance to let you see the host node load average numbers? Here is the host node load average graph as it looked while I, @Not_Oles, was writing this. Please note that nproc = 16 and the load averages are 0.4 or lower! This is with 6 nice neighbors! Tons of power remains available!\r\n\r\n![](http://talk.lowendspirit.com/uploads/editor/8n/4c0k894ur3ud.png \"\")\r\n\r\n**Add Ons**\r\n\r\nAdditional 2 x Ryzen 3700x + 2 GB ECC RAM + 25 GB NVME RAID 1, $3.00/month\r\n\r\nIPv4, as well as bigger plans, are available via @Not_Oles' [**LES Exclusive Deals,**](https://talk.lowendspirit.com/discussion/2289/new-ryzen-7-3700x-best-performance-premium-vpses) which are visible to logged in LES visitors. \r\n\r\n**More information**\r\n\r\nRunning on [Hetzner AX51-NVMe](https://www.hetzner.com/dedicated-rootserver/ax51/configurator) in Helsinki\r\n\r\nLXC, but KVM if you have a good reason, for example, running *BSD, Plan 9, Window$, or Apple. Or, maybe, you just like KVM.\r\n\r\nFrom the control panel, you can start, stop, reboot, backup, and restore your VPS. \r\n\r\nAlmost any GNU/Linux or *BSD flavor is available. With KVM we can run your custom .iso.\r\n\r\nIPv6 /64 or /96 or additional IPv4 addresses available if needed. Default $7 plans have 1 x /128 IPv6. \r\n\r\nBandwidth is unlimited, fair use.\r\n\r\nSeveral [Yabs benchmarks](https://github.com/masonr/yet-another-bench-script) were posted in [a previous thread.](https://talk.lowendspirit.com/discussion/2094/new-lxc-or-kvm-vps-4-x-ryzen-3700x-4-gb-ecc-ram-50-gb-nvme-raid-1-1-ipv4-1-gbps-10-mo/p1) Another Yabs from today on this exact VPS, but with the add on, is posted below.\r\n\r\nFree month for the first person who successfully [runs KVM inside an unprivileged LXC container.](https://dshcherb.github.io/2017/12/04/qemu-kvm-virtual-machines-in-unprivileged-lxd.html)\r\n\r\nWarning! Grumpy, incompetent, clueless administrator! \r\n\r\nLimited availability. Delivery might take awhile. 😴\r\n\r\nNo service level agreement. Not for business use. Intended especially for serious computer fun!\r\n\r\nCheck out [@Not_Oles' 1337 front end skillz!](https://metalvps.com)\r\n\r\n@Not_Oles tries to keep the system updated. Occasional reboots are guaranteed. \r\n\r\nPlease make your own off site backups! The on-the-server backups are not guaranteed to work or even to remain available.\r\n\r\n**How to Order and Pay**\r\n\r\nTo order, please post here, PM me, @Not_Oles, or use the email on my profile. \r\n\r\nPlease send Paypal payments to the email on my, @Not_Oles, profile. Please do not pay until after your VPS is set up, and until you are sure you are satisfied. \r\n\r\nIf you cannot pay by Paypal, let me know, and we will figure out another way. \r\n\r\n**Amazing Support**\r\n\r\nSupport is available via posting here, LES personal messages, email to the address on my profile, and Signal App. \r\n\r\n**What People are Saying**\r\n\r\n[\"Yes, please. I’ll take that.\"](https://talk.lowendspirit.com/discussion/comment/45802/#Comment_45802)\r\n\r\n[\"the fastest VPS I ever used\"](https://talk.lowendspirit.com/discussion/comment/46072/#Comment_46072)\r\n\r\n[\"I've been using this one from him. Highly recommend! His support is really amazing!\"](https://talk.lowendspirit.com/discussion/comment/45718/#Comment_45718)\r\n\r\n[\"premium stuff\"](https://talk.lowendspirit.com/discussion/comment/46966/#Comment_46966)\r\n\r\n[\"he is a great guy!\"](https://talk.lowendspirit.com/discussion/comment/49493/#Comment_49493)\r\n\r\n[\"he is the sweetest guy in LES ..\"](https://talk.lowendspirit.com/discussion/comment/48932/#Comment_48932)\r\n\r\n[\"Everybody loves @Not_Oles! &lt;3\"](https://talk.lowendspirit.com/discussion/comment/48936/#Comment_48936)\r\n\r\n[\"resplendent as the Sonoran Sun\"](https://talk.lowendspirit.com/discussion/comment/46668/#Comment_46668)\r\n\r\n[\"god bless not_oles ^^\"](https://talk.lowendspirit.com/discussion/1509/how-to-add-a-domain)"}