{"id": 2483, "date": "2021-01-28 13:07:50", "user": "martijnk", "post": "Hello folks,\r\n\r\nAs a provider I'm heavily experimenting with new and different services I can offer, and NOVOS BRICK is the new one. This is a cloud storage service based on Nextcloud. \r\n\r\nAs my girlfriend needed some cloud space to store her pictures and videos I was shocked to discover when she purchased Google Cloud space 200 GB for $29,99! And I couldn't offer her something similar.... omg :astonished: \r\n\r\nI've noticed Hetzner is offering kind of the same thing. Although they give you a full Nextcloud instance, probably running on a separate VPS where you can be admin, add users, apps etc. and have full control. And some of you are probably familiar with TransIP STACK, where they gave you free cloud space on a RAIDZ1 and eventually lost a lot of their users data during a rebuilt.\r\n\r\nWell with BRICK you purchase a certain amount of space. This can be 200 GB up to 10 TB.  Once your purchase is complete you'll get an email with all the details and you are ready to go. So this is not your own private Nextcloud, you'll just be a user of one big Nextcloud Cluster.\r\n\r\nWe've built a triple redundant Nextcloud cluster based on haproxy/nginx/galera and CephFS as backend storage solution. This is very easily expandable when load increases which I do hope it does over time obviously :)\r\n\r\nSo this is an introduction offer. You'll get 200 GB space life-time for €1. If you need more there's always the possibility to upgrade which is what I hope people do and what would make this profitable in the longer run:\r\n\r\n500 GB: € 2.50/mo or €25/yr\r\n1 TB: : €5/mo or €50/yr\r\n2 TB: €10/mo or €100/yr\r\n\r\netc. You get where this is going :)\r\n\r\nTo be completely honest, this is a beta test as well. I want to find out how the cluster performs, what your thoughts are. If more stuff needs to be added or done differently, so any feedback is welcome.\r\n\r\nI will add 100 accounts to the stock so I will be giving away 20 TB. If this all goes well and I'm running out I will probably add another 100 and so on :)\r\n\r\nIf you're interested here's the secret order link. This is on LES only for now but feel free to share it:\r\n\r\nhttps://billing.novos.be/cart.php?a=add&amp;pid=65\r\n\r\nMind you, we do run Maxmind fraud checks. So if you order please don't use a VPN or fake address info. If you do get flagged as fraud please open a ticket and we'll sort it :)\r\n\r\nThanks for reading!"}