{"id": 3347, "date": "2021-09-18 14:24:18", "user": "seriesn", "post": "| [![](https://nexusbytes.com/assets/img/logo.png \"\")](https://nexusbytes.com) | [![](https://entrybytes.com/assets/img/logo.png \"\") |](https://entrybytes.com)\r\n\r\n\r\n\r\n(Yes we spelt \"Versary\"  wrong. Deal with it :kissing_heart: .)\r\n\r\n\r\nDear friends and family,\r\n\r\nHope you and your loved ones are doing well and safe.\r\n\r\nWe want to start by saying, Thank you! Thank you for being a valued member of the Nexus Bytes Family. Thank you for supporting us constantly. Not simply by trusting us with your hard earned money but also by supporting us, through your kind word of mouth and referrals.  You are awesome and stay awesome!\r\n\r\n&lt;center&gt;![](https://files.servedez.com/others/5th.png)&lt;/center&gt;\r\n\r\nToday, we are excited to celebrate our 5th anniversary and as the founder of Nexus Bytes LLC, I (Jay) and my team humbly want to thank you for allowing us to continue our growth.  You continue to support a small independent business and we can never say enough thank you.  :).\r\n\r\nWith that said, we have 5 totally awesome and fun offers for you to celebrate this awesome occasion with us :)\r\n\r\n- **For our New Family members:**\r\n\r\n      - **50% Cash back** in the form of account credit on any new annual signup.\r\n\r\n             -  Promo code: **Fifthaversery50**\r\n\r\n- **Existing family members:** \r\n\r\n       - Upgrade your plan to the next level and with an annual commitment and secure **20% recurring discount**.\r\n\r\n            - Promo code: **Fifthaversery20 **\r\n\r\n      - Order additional services with annual commitment, **receive 10% recurring discount + 40% cash back**\r\n\r\n            - Promo code: **Fifthaversery45**\r\n\r\n*   Eligible brands: \r\n   *   https://nexusbytes.com/ and \r\n   *   https://EntryBytes.com\r\n*   No double dipping.\r\n*   Please see special notes at the bottom of this post for all the eligibility and criteria. \r\n\r\n![](https://ksr-ugc.imgix.net/assets/011/453/774/67b0835e7a19844ecd1db4e6ee46021d_original.jpg?ixlib=rb-4.0.2&amp;crop=faces&amp;w=1552&amp;h=873&amp;fit=crop&amp;v=1463682941&amp;auto=format&amp;frame=1&amp;q=92&amp;s=b7c2e64e369f7a52e19afff41252b3fb)\r\n\r\n##A party is not really a party without some cool stuff ;)\r\n\r\n**For existing and new family members:**\r\n\r\n- **Pizza party Raffle:** 2 winners every 12 hour for the next 48 hours! If you are a lucky family member, feel free to give us a shout out on our twitter [@NexusBytesLLC](https://twitter.com/NexusBytesLLC)\r\n\r\n- **Raffle for Nexus Bytes Merch**: Hoodies and T-shirts: 10 awesomely lucky family members.\r\n\r\n*   To participate in both of these raffles, please enter by completing this survey : [https://forms.gle/Qv1Km8iaqHHmL7hT6 ](https://forms.gle/Qv1Km8iaqHHmL7hT6)\r\n*   Last day to signup: September 20th, 2021\r\n\r\n- Unfortunately we can't ship to the following countries :( - Brunei, Eritrea, French Guiana, French Polynesia, Guadeloupe, Laos, Martinique, Mongolia, Myanmar, Reunion Island, Samoa, Saint Pierre and Miquelon, South Sudan, Tajikistan, Timor-Leste, Turkmenistan, Yemen, Cuba, Iran, Crimea, Syria, and North Korea\r\n\r\n\r\n\r\n**Please Note: **\r\n\r\n- Promo valid till the 25th of September, 11:59 PM EST.\r\n\r\n- Only annual commitments are eligible for the promotional discount and credit. \r\n\r\n*   Order must have the correct coupon added in order to be eligible. \r\n*   If you have signed up within the last 48 hours and fulfill the new signup and payment term requirement, please open a ticket and we will be happy to adjust your account :)\r\n\r\n- Promo credits are applied after service activation.\r\n\r\n- In the event of double dipping (signing up for a new service, receiving credit and then upgrading with a discount), account credit will be removed.\r\n\r\n- Can't be combined with switcher specials.\r\n\r\n- Applies to all our plans, excluding domain names.\r\n\r\nThank you for your continued love and support and here's to another awesome year &lt;3\\. Stay awesome!"}