{"id": "47856", "date": "Apr 10, 2015 at 8:16 PM", "user": "wh-coach", "post": "\n\t\t\t\n\t\t\t\n\t\t\t\t<div class=\"bbWrapper\">Like the subject says, $3.99/mo gets you a fantastic deal on a fantastic VPS:<br>\n<br>\n<ul>\n<li data-xf-list-type=\"ul\"> 2 x vCPU (expandable to 6) </li>\n<li data-xf-list-type=\"ul\"> 512 MB Ram (expandable to 2 GB) </li>\n<li data-xf-list-type=\"ul\"> a single IP address (expandable to 61 usable)</li>\n<li data-xf-list-type=\"ul\"> 5GB of SAS boot disk (expandable to 20 GB) </li>\n<li data-xf-list-type=\"ul\"> Access to virtually unlimited secondary disk storage (capped to 100 GB at order time but larger quantities are available on request, this storage can be added at any time in the future)</li>\n<li data-xf-list-type=\"ul\"> 5mbps of unmetered bandwidth (expandable to 100) </li>\n<li data-xf-list-type=\"ul\"> CentOS/Debian/Ubuntu Pre-installed</li>\n<li data-xf-list-type=\"ul\"> Virtual Console access </li>\n<li data-xf-list-type=\"ul\"> Access to OS images so you can reboot or re-install your OS if you choose</li>\n</ul><br>\nAll the options above are flexible depending on what you need. Adjustments are very easy to make during the ordering process. <br>\n<br>\nThese units are general purpose VPS units with limited restriction (fair use and anti-spam policy applies).<br>\n<br>\nTalk to us about how easy it is to create a private, back-end network! At any time, we can add another NIC to your VPS and assign a lan-speed, private network that you can use for delivering all the functions that you don't want exposed to the Internet.  Multiple VPS's will all show up on your console application so you can manage them from a single location!  <br>\n<br>\nClick <a href=\"https://billing.availanet.com/cart.php?a=add&amp;pid=13\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">-----&gt;&gt;&gt; HERE  &lt;&lt;&lt;----- </a> to be taken to the order page and see for yourself!</div>\n\t\t\t\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t"}