{"id": "52633", "date": "Nov 26, 2013 at 9:10 AM", "user": "paullopez", "post": "\n\t\t\t\n\t\t\t\n\t\t\t\t<div class=\"bbWrapper\">Hosting deals on festival season are the opportunity to get the best hosting services and packages at lower cost. This year on the special occasion of Thanksgiving Day, Thursday, November 28 and Black Friday, Friday, November 29 bodHOST.com open its doors for all customers to avail the best deals of the year.<br>\n<br>\nSo, start planning. Here is a list of the best deals on Thanksgiving and Black Friday. These offers will available until 1st Dec 2013. <br>\n<br>\n<b>VPS Hosting</b><br>\n<br>\n• Use coupon code <b>ThanksBod </b>for Linux &amp; Windows VPS Hosting to avail a 50% discount on the 1st Month Invoice. <br>\n<br>\n• Use coupon code <b>BodFriday </b>for Linux &amp; Windows VPS Hosting to avail 2 months free service on Annual payment which is quite equivalent to 25% OFF. <br>\n<br>\n<b>Dedicated Hosting</b><br>\n<br>\n• Use Coupon code <b>BHThanks </b>to avail a 25% discount on 1st Month invoice for all Dedicated Servers <br>\n<br>\n• Use Coupon Code <b>BHFriday </b>to avail 2 months free on Annual Payment for all Dedicated Servers. <br>\n<br>\n<b>Linux &amp; Windows Shared Hosting</b><br>\n<br>\n• Free domain name with every Shared Hosting plan ( .com, .net, .org, .biz, .info extensions only)<br>\n<br>\n<b>Linux &amp; Windows Reseller Hosting</b><br>\n<br>\n• Order your Reseller hosting plan and earn more while you spend less. Receive 25% flat discount. Use Coupon code <b>BHRTG25</b><br>\n<br>\n•\tEnd user support via ticket <br>\n<br>\n<b>R1Soft Backup</b><br>\n<br>\n•  15% discount on R1Soft backup plan. Use Coupon code <b>bodSAFE</b><br>\n<br>\nFor more information visit: <a href=\"http://www.bodhost.com/offers.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">bodHOST Latest OFFERS</a></div>\n\t\t\t\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t"}