{"id": "52786", "date": "Jan 14, 2014 at 11:48 AM", "user": "paullopez", "post": "\n\t\t\t\n\t\t\t\n\t\t\t\t<div class=\"bbWrapper\">Save your money on a VPS (Linux or Windows). We are offering affordable virtual private servers on the latest branded hardware with reliable and most trusted Virtualization platforms (VLite for Linux – Hyper-V for Windows). You can also choose billing cycle as per your convenience. <br>\n<br>\nbodHOST’s Linux VPS Plans starting at $29.99 monthly with 1.5 GB Ram, 600 GB Bandwidth, and 25 GB HDD. <br>\n<br>\nbodHOST’s Windows VPS Plans starting at $39.99 monthly with 1 GB Ram, 600 GB Bandwidth, and 30 GB HDD.<br>\n<br>\n<b>You can also upgrade your service as your business progress.</b><br>\n<br>\n<ul>\n<li data-xf-list-type=\"ul\">Linux VPS Enterprise - $49.99 monthly with 2 GB RAM, 1000 GB Bandwidth, and 45 GB HDD</li>\n<li data-xf-list-type=\"ul\">Linux VPS Corporate - $69.99 monthly with 2.5 GB RAM, 2000 GB Bandwidth, and 65 GB HDD</li>\n</ul><br>\n<ul>\n<li data-xf-list-type=\"ul\">Windows VPS Enterprise - $59.99 monthly, 1.5 GB RAM, 1000 GB Bandwidth, and 45 GB HDD</li>\n<li data-xf-list-type=\"ul\">Windows VPS Corporate - $79.99 monthly, 2 GB RAM, 200 GB Bandwidth, and 65 GB HDD</li>\n</ul><br>\n<b>No set up fee, guaranteed resources, data centers – US / Canada / UK / South East Asia (Note: if you would like to have your VPS in the UK or South East Asia – contact our sales executives via Live Chat to get more information and a price quote). </b><br>\n<br>\nWe always provide highly professional, yet affordable web hosting services. Our customer support always remains online at any time, day or night, through the Help Desk, Live Chat, and Phone. A quick response time is guaranteed through the Help Desk (Depends on the level of the issue). However, all your questions will be answered instantly through Live Chat and Phone.<br>\n<br>\n<b>And if you are interested in cloud computing solutions then you must consider following side:</b><br>\n<br>\nIn mid 2011 we launched our own in-house developed eNlight cloud platform and since then we have received a positive response for our cloud based services. With our cloud you do not need to sign up any contract as it is based on the pay as go model. <br>\n<br>\n<b>To order and predict cloud hosting cost visit: <a href=\"http://www.bodhost.com/cloud-hosting.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">Configure cloud server</a></b><br>\n<br>\n•\tPrepaid billing structure<br>\n•\tAutomatically scalable<br>\n•\tForecasting daily, weekly, monthly &amp; yearly costs<br>\n•\tCharges can be monitored through usage logs<br>\n•\tResource usage and associated billing through real time monitoring<br>\n•\tNo contract<br>\n•\tData centers – US / Canada / UK / South East Asia <br>\n<br>\n<b>For more information, please initiate a Live Chat OR Call us at Toll Free PH: 866-662-0909, International: +1.302.294.5628 OR Email us @ sales [at] bodHOST [.]Com</b></div>\n\t\t\t\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t"}