{"id": "57493", "date": "Apr 12, 2012 at 7:08 PM", "user": "ughosting", "post": "\n\t\t\t\n\t\t\t\n\t\t\t\t<div class=\"bbWrapper\"><b>UnixGuru Hosting provides fast hosting!</b><br>\n<br>\nShared/Reseller Servers with Powerful Hexacore Processors with 32GB RAM<br>\nNetwork: Gigabit Connectivity<br>\n<br>\nGeo-located IPs on different Class C networks, available in each zone for your SEO /SEM needs<br>\nGeolocalised IPs for: Belgium, Britain, Czech Republic, Finland, France, Germany, Ireland, Italy, Lithuania, Netherlands, Poland, Portugal, Spain &amp; Switzerland.<br>\n<br>\n<br>\n<u>Shared &amp; Reseller hosting</u><br>\n<br>\nChoose:<br>\n<a href=\"https://clientarea.unixguru.co.uk/cart\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">Shared hosting</a> in any of the above zones<br>\nFrom £1.50 a month (£1.13 with discount code)<br>\n<br>\n<a href=\"https://clientarea.unixguru.co.uk/cart/reseller\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">Reseller Hosting</a>: 8 x UK IPs on Multiple Class C Networks.<br>\n+ a shared IP in each of the above zones, in a single account.<br>\nFrom £9.40 a month (£7.05 with discount code)<br>\n<br>\n<b>PHP 5.3.10 with MySQL 5.5.20</b><br>\n<br>\nExtra PHP Features: SOAP &amp; fopen (Not offered by all hosts) great for affiliate networks.<br>\n<br>\nAll accounts come with Cron, SSH, DNS Contol, &amp; Softaculus Script Installer &amp; RVSite Builder, <span style=\"color: #FF0000\">NginX acceleration</span> and Active Firewall, to help thwarte DDoS, SYN, Port &amp; Html Floods and many other attacks.<br>\n<br>\n<br>\nWe've recently removed the setup fees from shared and reseller hosting.<br>\nand throughout 2012 you can get 25% off your first purchase with code: <b>HD-25-OFF</b><br>\n<br>\n<br>\n<u>Virtual Private Servers</u><br>\n<br>\nWe now provide VPS machine with various Linux Operating systems.<br>\nDirectAdmin available at £5pcm (more than 75% off the standard fee from DirectAdmin)<br>\nAs an option with DirectAdmin machines, you can have a slave DNS server to ensure your DNS is up, even if your server isn't.<br>\n<br>\nAgain, throughout 2012 enjoy 25% off your first purchase with code: <b>VPS-25-OFF</b><br>\n<br>\n<br>\n<u>Virtualised Dedicated Servers</u><br>\n<br>\nFor people who want power and flexibility we are now offering \"Virtualised Dedicated Servers\"<br>\n(Choose any two geolocalisation zones from the list above)<br>\n<br>\nA VPS using the entire resources of a Dedicated Server. Available on a Month by Month contract, you can upsize and downsize as necessary.<br>\nGreat for retailers with seasonal shifts.<br>\n<br>\nWe can live migrate your machine to a different dedicated server node in our private cloud, keeping your existing IPs, minimum downtime, no DNS changes necessary.<br>\n<br>\n(The power of the dedicated server, the flexibility of a VPS)</div>\n\t\t\t\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t"}