{"id": "58962", "date": "Dec 19, 2011 at 4:12 AM", "user": "hostingabove", "post": "\n\t\t\t\n\t\t\t\n\t\t\t\t<div class=\"bbWrapper\">The holidays are right around the corner, and we know everyone’s itching for getting a fantastic deal and that’s when we come into play. We offering <i>30%</i> off ANY of our Windows + Linux VPS based XEN Virtual Private Servers for LIFE! Just use the promo code “<b>holiday30</b>” when at the checkout and make sure to spread about your savings.<br>\n<br>\nClick <a href=\"http://hostingaddicts.com\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">HERE</a> to check us out!<br>\n<br>\n<b>Questions?</b><br>\nLet us know we are available 24x7x365 through our live chat, help desk, and by calling us toll free!<br>\n<br>\n<b>Why Us?</b><br>\n----<br>\n<i>Contract-FREE</i><br>\n<br>\nOur focus is maintaining quality service, affordable pricing, shaping our brand as being one of the highest-level service companies throughout the hosting industry. We count so much on our quality service we will NEVER offer contracts with any of our services. Why should we lock you in when we know you will want to stay with us anway? Let's get realistic and pass on the word to the world!<br>\n----<br>\n<i>Managed Services</i><br>\n<br>\nServer Management is for those individuals to businesses looking to sit back, relax, and not have to focus on maintaing, setting up, or monitoring your services 24 hours a day, 7 days a week, 365 days a year. Our server engineers are committed and dedicated to ensure your mission critical applications remain online, and if problems arise we will be notified that second of downtime to have the issue resolved without your visitors even noticing. Leave it to the pros, it's what we do! <br>\n----<br>\n<i>Superior Network UpTime</i><br>\n<br>\nNetwork Uptime is crucial and we take pride in ensuring 99.9% UpTime. Our Data Centre has multiple Tier 1 providers allowing continual streams of network to and from your servers. Why settle for less when you don't have too?<br>\n----<br>\n<i>DimeNOC Data Centre</i><br>\nYour server will be setup and deployed in Orlando, Florida in the HostDimeNOC Data Centre. All servers through HostingAddicts come default Un-Managed therefore allowing us to give substantial discounts for Premium Bandwidth, Superior Hardware, and reliability for your mission critical services. <br>\n----<br>\n<br>\n- Tanner<br>\n__________________</div>\n\t\t\t\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t"}