{"id": "60912", "date": "Jan 5, 2011 at 11:24 PM", "user": "invehosting", "post": "\n\t\t\t\n\t\t\t\n\t\t\t\t<div class=\"bbWrapper\">Hello HD members!<br>\n<br>\nIt's a new year! Have you been experiencing slowness, downtime, or other irritating things from your current host? Switch to us! Don't go another year with your current hosting company.<br>\n<br>\nCurrent Specials<br>\n<br>\nBuy one hosting package, and get another free! We'll double your resources on any plan you get. This applies to Shared, Reseller, and VPS! This special doesn't require a promo code!<br>\n<br>\nFor our VPS plans, this is our premium line based on XenServer Enterprise. We're working on a budget Xen and OpenVZ lines.<br>\n<br>\nWe offer every OS available, so feel free to ask what we can do!<br>\n<br>\nWe also have a stellar yearly hosting special below:<br>\n<br>\nWould you like to get a whole year's worth of hosting, for only $9.95? Well, here it is! It's not a scam, and it's not a trick. You may be asking how we can offer something that low. Basically, this package has lower amounts of resources than are available to our normal packages. So it's no trick, gimmick, or scam. It comes with the following:<br>\n<br>\nDiskspace: 1GB<br>\nBandwidth: 10GB<br>\n<br>\nIt comes with all the features that are big accounts have, with 2 add-on domains new! For more information about our features, just check it out below. This package is for new customers only, and is not available on our website.<br>\n<br>\nTo order, just click <a href=\"http://clients.invehosting.com/cart.php?a=add&amp;pid=33\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">HERE</a>!<br>\n<br>\nThis new special doesn't require a promo code, and is available until further notice!<br>\n<br>\nAbout us: We don't operate from a reseller account, and own all of our equipment and switches. We recently moved into our very own Datacenter space. We run premium Supermicro hardware that is custom built by our own technicians.<br>\n<br>\nWe have excellent packages, and they include the top features of the industry. All of our packages come with RVsitebuilder PRO, MySQL 5, PHP 5, Subversion, CVS, R1Soft Backup, Installatron, and much much more!<br>\n<br>\nShared Plans<br>\n<br>\nOur shared plans start from $6.95 to $15.95, monthly.<br>\nDiskspace: 10GB to 40GB<br>\nBandwidth: 30GB to 210GB<br>\nUnlimited Features (Emails, FTP, etc)!<br>\nCan include limited WHM access on request!<br>\n<br>\n<a href=\"http://www.invehosting.com/shared.html\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">http://www.invehosting.com/shared.html</a><br>\n<br>\nPayment Options<br>\n<br>\nWe proudly accept all major credit cards, as well as paypal payments. Our orders are processed by paypal. Accounts are activated quickly, but are screened by Maxmind. We also do phone verifications if the maxmind report and our manual fraud checks dictate that we should.<br>\n<br>\nAvailable with all Hosting Plans<br>\n<br>\n- $10.95 .COM, .NET, .ORG domain registrations<br>\n<br>\nOur Server Specs<br>\n<br>\n- Quadcore Xeon Processors<br>\n- CentOS Linux 5 Enterprise<br>\n- 12GB of DDR3 Memory<br>\n<br>\n<br>\nWe always use top of the line hardware! Every new server ordered is going to be the fastest server available and within reason for the usage!<br>\n<br>\nPremium Tier 1 Bandwidth!<br>\n<br>\nInveHosting General Information<br>\n<br>\n- 99.9% Uptime Guarantee<br>\n- 24/7 E-mail/Ticket Support<br>\n- Monthly Contracts Standard! We don't force long billing terms!<br>\n- Stable Network<br>\n- Free Backups using the powerful R1Soft!!!<br>\n- Free Backups offsite to an external location!<br>\n- Price Lock guarantee! We will never raise your price, although we may lower it<br>\n- We utilize a full DNS cluster to protect your sites and email from DNS outages<br>\n- ns1.mydomain.com, ns2.mydomain.com, ns3.mydomain.com, ns4.mydomain.com using our powerful DNS cluster for resellers!<br>\n- Unlimited features for Email, MySQL, etc.<br>\n- 30 day money back guarantee!<br>\n- All accounts are verified! Cuts down on fraud and black listing!<br>\n- We do NOT overload our servers!<br>\n<br>\nSupport Methods<br>\n<br>\n- Ticket Support (<a href=\"http://clients.invehosting.com\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">http://clients.invehosting.com</a>)<br>\n- Email Support (Billing@InveHosting.com, <a href=\"mailto:Sales@InveHosting.com\">Sales@InveHosting.com</a>, <a href=\"mailto:Support@InveHosting.com\">Support@InveHosting.com</a>)<br>\n<br>\nThanks for reading!!!!</div>\n\t\t\t\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t"}