{"id": "61157", "date": "May 23, 2011 at 9:09 PM", "user": "senseisteve", "post": "\n\t\t\t\n\t\t\t\n\t\t\t\t<div class=\"bbWrapper\">For 10% OFF of any Hostirian VPS Plan, use special coupon code of <b>vps10</b> <br>\n<br>\n<b>VPS Servers Starting at $4.95 (with coupon just $4.46)</b><br>\n<br>\n<b>Virtual Private Server (VPS) Solutions</b> – Step UP from shared hosting platforms to VPS, with just the right mix of memory and processing power to host everything from stand-alone services to ecommerce &amp; complex web applications.<br>\n<br>\n<b>Virtual Private Servers offe</b>r – an extraordinary range of control and flexibility, coupled by prices that won’t break the bank, all backed by a full BGP network with multiple upstream providers and diverse fiber paths. All of our VPS solutions use XenServer technology.<br>\n<br>\n<b>Featuring a 100% uptime guarantee &amp; Forever support</b> – at pricing levels UNMATCHED in the industry. Hostirian’s data centers are staffed with on-site engineers who are empowered to provider long-term value.<br>\n<br>\n<b>VPS Starter Package - $4.95/month</b> (with coupon, just $4.46)<br>\n256MB Dedicated Memory<br>\n10GB Disk Space<br>\n100GB Monthly Transfer<br>\n1 X 2.40GHz Xeon Processor<br>\n<br>\n<b>The Starter VPS (Virtual Private Server)</b> - is the next logical step up from a shared platform. It's ideal for stand- alone services, whether you need a private proxy, small email server, VPN endpoint or DNS server. <br>\n<br>\nThe Starter VPS is allotted disk space and memory independent of other allocations on our server, minimizing the opportunities for one user's activities to impact others. <br>\n<br>\nWhen you outgrow shared hosting, Virtual Private Servers offer the same complement of operating systems and software components expected from a dedicated server. <br>\n<br>\n<a href=\"http://www.hostirian.com/virtual-private-servers/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">ORDER Now</a><br>\n<br>\n<b>VPS Starter PLUS Package - $19.95/month</b><br>\n512MB Dedicated Memory<br>\n10GB Disk Space<br>\n100GB Monthly Transfer<br>\n1 X 2.40GHz Xeon Processor<br>\n<br>\nThe Starter Plus VPS is a Virtual Private Server package ideally suited for small to moderately dynamic websites. <br>\n<br>\nIf you need to scale up your applications or services, Starter Plus VPS is the right choice. Repositories, FTP Servers and databases perform well with this VPS package. <br>\n<br>\nThe Starter Plus VPS is an excellent value, especially in comparison to a dedicated server. <br>\n<br>\n<a href=\"http://www.hostirian.com/virtual-private-servers/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">ORDER Now</a><br>\n<br>\n<b>VPS Personal Package - $39.95/month</b><br>\n1024MB Dedicated Memory<br>\n40GB Disk Space<br>\n500GB Monthly Transfer<br>\n2 X 2.40GHz Xeon Processors<br>\n<br>\nThe Personal VPS provides an excellent platform for hosting large dynamic websites. It.s also makes an ideal entry-level webserver. <br>\n<br>\nThis package has ample memory allocation and processing power to run moderate to large dynamic websites or busy email servers. <br>\n<br>\nThe Personal VPS can also be used as a remote Linux desktop. <br>\n<br>\nAt $39.95/month, it's an affordable alternate to dedicated server hosting solutions. <br>\n<br>\n<a href=\"http://www.hostirian.com/virtual-private-servers/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">ORDER Now</a><br>\n<br>\n<b>VPS Standard Package - $69.95/mont</b>h<br>\n2048MB Dedicated Memory<br>\n80GB Disk Space<br>\n1000GB Monthly Transfer<br>\n3 X 2.40GHz Xeon Processors<br>\n<br>\nThe Standard VPS is ideally suited for large dynamic websites and for hosting multiple sites. <br>\n<br>\nNeed to scale up your web hosting business to host lots of clients sites? This plan has the right mix of memory and processing power to host forums and complex web applications. <br>\n<br>\nRunning ecommerce? Forget shared hosting - move up to a virtual private server. The Standard VPS package is ideal for all types of online business. The level of control and flexibility it grants is extraordinary.<br>\n<br>\n<a href=\"http://www.hostirian.com/virtual-private-servers/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">ORDER Now</a><br>\n<br>\n<b>VPS Business Package - $89.95/month</b><br>\n3072MB Dedicated Memory<br>\n160GB Disk Space<br>\n2000GB Monthly Transfer<br>\n4 X 2.40GHz Xeon Processors<br>\n<br>\nThe Business Class VPS exceeds the specifications of many dedicated servers, at a fraction of the cost. <br>\n<br>\nThis is one of the most robust VPS packages on the market today. It.s ideally suited for hosting tons of client sites, forums, ecommerce sites and a whole host of complex web applications. <br>\n<br>\nSet up Windows terminal services, file servers, SharePoint and database applications or use this package for application development. <br>\n<br>\nAt just $89.95/month, it's the intelligent alternative to a dedicated server. <br>\n<br>\n<a href=\"http://www.hostirian.com/virtual-private-servers/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">ORDER Now</a> <br>\n<br>\n<br>\nOur Forever support EXCEEDS industry standards, offering three ways to communicate with our staff 24/7/Forever<br>\n<br>\nPhone:<br>\nCall us at: 800-615-9349 or 314-692-3500. Live Onsite US Based Phone Support<br>\n<br>\nEmail:<br>\nEmail us at: <a href=\"mailto:support@hostirian.com\">support@hostirian.com</a>. This Automatically Creates a Trouble Ticket<br>\n<br>\nLive Chat:<br>\nClick the red “LIVE SUPPORT ONLINE” button at the upper-right-hand side of the website. Live Chat is set up for Pre and Post Sales Level 1 and Level 2 Support<br>\n<br>\n<b>Hostirian’s core focus is its customers</b> – Every support request is responded to within 15 minutes, every day, all day long.<br>\n<br>\n<b>Hostirian’s Value Add</b> - is its hands-on approach to hosting. Since its inception, Hostirian has helped countless businesses, just like yours, with customized virtual private server solutions. With more than 10 years of experience in the hosting industry, we know what it takes to provide successful and stress-free hosting services.<br>\n<br>\n<b>Are You Ready to Experience the Hostirian Advantage?</b> – Let us configure the perfect virtual private server solution that matches your specific IT needs.<br>\n<br>\nTake a <a href=\"http://www.hostirian.com/tour\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">TOUR</a> of our three data centers.<br>\n<br>\n<b>Free Install !!</b></div>\n\t\t\t\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t"}