{"id": "61170", "date": "May 28, 2011 at 4:51 PM", "user": "invehosting", "post": "\n\t\t\t\n\t\t\t\n\t\t\t\t<div class=\"bbWrapper\">Hello all!<br>\n<br>\nTo kick off memorial day, we're doing a huge sale on everything!!! InveHosting.com!<br>\n<br>\nOur specials for VPS are as follows:<br>\n<br>\nGet our Medium VPS plan with cPanel, and basic server management, for only $29.95 a month! Use <b>vpscpanel</b> promo code. Make sure when you're ordering to select cPanel, and select Centos with cPanel.<br>\n<br>\nGet our Medium VPS plan with free Windows OS (a $15 per month savings)! Simply use promo code <b>vpswindows</b>.<br>\n<br>\nGet our Advanced VPS plan with Windows and Spiceworks installed for only $33.95 a month. Ever wanted to monitor your network with Spiceworks? Now's your chance to get a cheap Spiceworks VPS! Use <b>vpsspiceworks</b> promo code.<br>\n<br>\nLast, but certainly not least, get any of our VPS plans with 20% off Monthly for life! Use the <b>vps20life</b> promo code!<br>\n<br>\nOur Sale Hours are:<br>\n<br>\nSaturday until 9PM<br>\nSunday from 1PM to 9PM<br>\nMonday from 8AM to 5PM<br>\n<br>\nPlease note, on Monday, on our facebook page (Facebook.com/InveHosting) We'll be releasing hourly specials starting at 8AM!<br>\n<br>\n+++++ Our Features +++++<br>\n<br>\nRAID10 Protected Diskspace<br>\nSolusVM Control Panel<br>\nControl your VPS remotely using any Android phone!<br>\nUnique server management offerings featuring Ksplice!<br>\n24 x 7 Technical Support<br>\n30 Day Money Back Guarantee<br>\n<br>\n+++++ Server Specs +++++<br>\n<br>\nMulticore CPUs of the latest models<br>\n32GB minimum in our host nodes!<br>\nMultiple Gigabit links<br>\nPremium Supermicro Equipment<br>\nAdaptec RAID cards<br>\nAll equipment is hand built and owned by InveHosting<br>\n<br>\n<br>\n+++++ Network +++++<br>\n<br>\nOur Datacenter is *********<br>\nInveHosting owns all of it's hardware, down to the switches.<br>\n<br>\nWe're also making custom deals at our website www.InveHosting.com! Please feel free to come in and chat with us!<br>\n<br>\nThanks for reading!</div>\n\t\t\t\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t"}