{"id": "61503", "date": "Mar 20, 2007 at 2:30 PM", "user": "ramprage", "post": "\n\t\t\t\n\t\t\t\n\t\t\t\t<div class=\"bbWrapper\"><b>ServerProgress Server Management 20% off VPS Clients Special! </b> - <a href=\"http://www.serverprogress.com\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">http://www.serverprogress.com</a><br>\n<br>\nFor a limited time we're currently<b> offering 20% </b>off for all VPS customers on all our services, excluding remote backup and all custom solutions. <br>\n<br>\nUse the coupon during signup: <b>HDVPS</b><br>\n<br>\n<b>SERVER MANAGEMENT</b><br>\n<br>\nNew Server Setup = $125 - 20% special discount = $100<br>\n<a href=\"http://www.serverprogress.com/server_setup.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">Full plan details</a><br>\nWe secure, optimize and update your server so it's production ready to start adding clients and so you can relax knowing that the system is in perfect shape for your business.<br>\n<br>\nSecurity Enhancements = $85 - 20% special discount = $68<br>\n<a href=\"http://www.serverprogress.com/security_enhancements.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">Full plan details</a><br>\nSecurity is an ongoing task for your server. We will review the current system and make sure its locked down tight from attacks, both internal and external protecting your clients and data. <br>\n<br>\nAnti-Spam Service = $75 - 20% specila discount = $60<br>\n<a href=\"http://www.serverprogress.com/antispam.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">Full plan details</a><br>\nLow resource usage, system wide virus scanning, spam protection and phishing protection for cPanel. Eliminate spam from your inbox and save time. The system is self maintaining and updates itself. <br>\n<br>\n<br>\n<b>NEW!  REMOTE BACKUP SERVICES</b><br>\n<br>\nBackup Storage<br>\n$25 USD Setup<br>\n$2/mo per gig space \tKeep your data safe with ServerProgress remote backup space. We offer remote backup storage space on secure servers offering you jailed SSH and FTP access with unlimited data transfer. Minimum order of 10 gigs space required. We can also do all the configuration on your server to use the backups.<br>\n<br>\nBackup Mail<br>\n$50 USD Setup<br>\n$10/mo per domain \tLosing email today is a business disaster. Stop losing critical email. ServerProgress Remote Backup Mail services Store and Forward will accept email for your domains even when your own mail server is down and delivery them to you when back online. This service is highly recommended for online business.<br>\n<br>\nBackup DNS<br>\n$50 USD Setup<br>\n$5/mo per domain \tIf your DNS server goes down, so does your website and all your email services tied to it. The majority of servers today do not have a failover DNS. DNSreport calls this \"Single Point of Failure\" failure. We can provide a secondary backup set of nameservers so your domain still works even if your server is down.<br>\n<br>\n<b>ServerProgress</b> specializes in Linux Server Management  for cPanel, Plesk and DirectAdmin servers. We worry about the technical things so you can worry about your business. <br>\n<br>\nContact Steve by phone or email to discuss your needs. <br>\n<a href=\"http://www.serverprogress.com/contact.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">http://www.serverprogress.com/contact.php</a></div>\n\t\t\t\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t"}