{"id": "61793", "date": "Oct 10, 2008 at 8:16 PM", "user": "zachary-mcclung", "post": "\n\t\t\t\n\t\t\t\n\t\t\t\t<div class=\"bbWrapper\">Who is TurnKey Internet?<br>\n<br>\nTurnKey Internet is a New York Corporation that offers premium quality web hosting for small and medium sized businesses that need fast, reliable, and cost-effective solutions for their Internet presence.  The management team has been offering Internet Services since 1994, and offering web hosting services since 1999.  TurnKey Internet is a proud member of the New York State Better Business Bureau with a 100% satisfaction rate.<br>\n<br>\nWhat is unique about  TurnKey Internet?<br>\n<br>\nTurnKey Internet owns and operates its facilities (network, computers, infrastructure, fiber optic circuits, etc.) and maintains its own dedicated local (not outsourced) staff. TurnKey Internet is not a reseller, or a sales  agent for another datacenter or web hosting company.  By owning our own infrastructure we are able to offer the most reliable service and competitive pricing backed by unmatched local 24 x 7 support.   TurnKey Internet’s products are backed with “Managed Service and Support” which means our staff  Take care of all the details such as remote backups, firewall setup, 24 x 7 uptime monitoring,  maintaining security patches and updates, plus much more – letting the client focus on running their business instead of worrying about day to day technical details.<br>\n<br>\nWhat does TurnKey Internet offer?<br>\n<br>\nTurnKey Internet offers 3 principal web hosting products: Dedicated Servers, Virtual Private Servers (VPS), and standard (shared) web hosting.  Each product is similar, however the needs of each client dictate which product is right for them (such as how much Internet traffic they plan to support, how large they need their online presence to be, what types of software features their web site will need, etc).<br>\n<br>\n1.\tDedicated Servers  <br>\nA Dedicated Server is a physical computer that resides in our datacenter for use by 1 client, providing the most secure and fastest possible web traffic speeds since no one else ‘shares’ the computer but their web site(s).  Customers can host an unlimited number of web sites, databases, secure web sites, mail servers and much more.  Dedicated servers let the customer install and modify any software or function of the server, ideal for businesses with customized hosting needs. The dedicated server is a requirement for businesses with busy web sites and an eye on growth. Prices start at just $159/month.<br>\n <br>\n2.\tVirtual Private Servers (VPS)  <br>\nThe Virtual Private Server (VPS) is similar to the dedicated server but costs less while providing a great balance of performance versus cost to the client.  The Virtual Private Server provides excellent security and fast web traffic speeds since no one else ‘shares’ their particular ‘virtualized’ server.  Customers can host an unlimited number of web sites, databases, secure web sites, mail servers and much more and are only limited by the size of the virtual private server package they purchase.  Virtual Private Servers like Dedicated servers let the customer install and modify any software or function of the server.  The VPS is ideal for businesses on a budget with customized hosting needs. VPS prices start at just $19/month.<br>\n<br>\n3.\tStandard (Shared) Web Hosting  <br>\nStandard also known as ‘shared’ web hosting is the entry point for today’s hosting world – offering a 1 size fits all concept of ease of use, low cost and feature rich capabilities.  Shared hosting is ideal for businesses just starting with web hosting or on a tight budget.  Standard (Shared) Hosting starts as low as $4.99/month.<br>\n<br>\nWhy Should Customers Choose TurnKey Internet?<br>\n<br>\n \tCompetitive pricing, packages as low as $4.99/month.<br>\n \tProven Track Record of providing quality Internet Services (since 1994!)<br>\n \tNo Middle Men – TurnKey Internet owns and operates its own facilities (datacenter, servers, network) <br>\n \tProfessional 24 x 7 x 365 managed local support. (backups, firewalls, monitoring, more)<br>\n \t100% Network Uptime Guarantee on our services.<br>\n \t30 day money back guarantee <br>\n<br>\nOctober Products and Pricing Sheet<br>\n<br>\nPrices are subject to change so please see <a href=\"http://www.turnkeyinternet.net/specials\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">http://www.turnkeyinternet.net/specials</a> for the latest pricing.<br>\n<br>\nDedicated Servers<br>\n\tTurnKey Dedicated Server October Special #1: $159/month  $0 Setup fee<br>\n\tIntel Dual Core 2.8 GHz  /  1 GB Ram  /   250 GB SATA II Disk Space  /  3000 GB Bandwidth<br>\n<br>\n\tTurnKey Dedicated Server October Special #2: $199/month   $0 Setup fee<br>\n\tIntel Quad Core 2.13 GHz  /  2 GB Ram  /   250 GB SATA II Disk Space  /  4000 GB Bandwidth<br>\n<br>\n\tTurnKey Dedicated Server October Special #3: $299/month   $0 Setup fee<br>\n\tIntel Quad Core 2.13 GHz  /  4 GB Ram  /  Qty (2) 250 GB SATA II Disk Space  With RAID / 6000 GB Bandwidth<br>\n<br>\nEvery dedicated server  includes 8  IP Addresess, Linux or Windows OS, Free ServerCP Panel and <br>\nGold Server Management <br>\nVirtual Private Servers (VPS) for Linux <br>\nTurnKey Linux VPS October Special #1: $19.99/month<br>\n1 CPU (2+ GHz) Max  /  256 MB RAM /  5 GB Secure Disk Space  /  100 GB Bandwidth<br>\n<br>\nTurnKey Linux VPS: $29.99/month<br>\n1 CPU (2+ GHz) Max  /  384 MB RAM /  10 GB Secure Disk Space  /  250 GB Bandwidth<br>\n<br>\nProfessional Linux VPS: $59.99/month<br>\n2 CPU (2+ GHz) Max  /  512 MB RAM  /  20 GB Secure Disk Space  /   500 GB Bandwidth<br>\n<br>\nMaximum Linux VPS: $89.99/month<br>\n4 CPU (2+ GHz) Max  /  1024 MB RAM /  40 GB Secure Disk Space  /  1000 GB Bandwidth<br>\n<br>\nEvery Linux VPS  includes 1 Dedicated IP Address, Linux (Red Hat), Free ServerCP Panel and <br>\nSilver Server Management <br>\n<br>\nVirtual Private Servers (VPS) for Windows<br>\n             Business Windows VPS: $59.99/month<br>\n512 MB Ram   /   20 GB Secure Disk Space   /   250 GB Bandwidth   /   1 CPU (2+ ghz) Max<br>\n<br>\n\tEnterprise Windows VPS: $99.99/month<br>\n\t1024 MB Ram  /  40 GB Secure Disk Space   /   1000 GB Bandwidth   /   4 CPU's (8+ ghz) Max<br>\n<br>\nEvery Windows VPS  includes 1 1 Dedicated IP Address,  Windows Server 2003 Enterprise Opearting System with Service Pack 2,  Free VPS Power Panel and Silver Server Management.<br>\n<br>\nFor questions in regaurds to services e-mail info(at)turnkeyinternet.net. To order visit <a href=\"http://www.turnkeyinternet.net/specials\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">http://www.turnkeyinternet.net/specials</a>.</div>\n\t\t\t\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t"}