{"id": "62442", "date": "Jan 11, 2010 at 8:28 PM", "user": "emorales", "post": "\n\t\t\t\n\t\t\t\n\t\t\t\t<div class=\"bbWrapper\"><b><a href=\"http://www.servint.net/landing.php?p=hd&amp;t=2/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\"><span style=\"color: red\">ServInt:</span></a> <i>RELAX. Your Business is Up and Running with ServInt LA and DC, now with Money Back Guarantee:</i></b><br>\n<br>\nThere are times in every company’s history when it has to take a big, bold step in its quest to grow. ServInt was blazing trails in 1995 and we haven’t stopped innovating since. In that same spirit, we’d like to announce the latest evolution of ServInt.<br>\n<br>\nIntroducing ServInt LA.<br>\n<br>\nToday, ServInt is offering our most popular discount, 50% off of your first month with the use of the promo code <span style=\"color: blue\">HD2010VPS</span> at ServInt LA, our latest data center, and ServInt DC our existing network of data centers.<br>\n<br>\nServInt LA is comprised of three major initiatives:<br>\n<br>\n1. Building a heavy duty data center presence on the West Coast of the United States, and empowering customers to buy hosting services in either location.<br>\n<br>\n2. Building a powerful cross-country network that makes traffic faster for all ServInt customers by allowing all of our data centers to take advantage of each others’ connectivity.<br>\n<br>\n3. Increasing the quality of ServInt’s network connectivity to Mexico, Latin America, and Asia.<br>\n<br>\nWe can proudly say we have done all three.<br>\n<br>\nThis is the same ServInt you know and love, just on the West Coast. We have on-site support technicians at ServInt LA, just as they are in DC. Though our Managed Services Team will continue to operate out of our mothership on the East Coast, we are building out ServInt LA to run according to the same high set of standards that have turned ServInt DC into such a success.<br>\n<br>\nWith this promo only, ServInt is also offering new customers a limited money-back guarantee. We believe we have the best VPS in the business, and we generally let our reputation speak for itself. However, should a migration not go as planned, or should you feel overwhelmed by the customizability of a ServInt VPS, we want to minimize the risk to you. So if you use this code and your site is within our <a href=\"http://www.ServInt.net/policies.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">Acceptable Use Policies</a> and you are having problems or are dissatisfied within your first 30 days of service, ServInt will give you your money back. Plain and simple.<br>\n<br>\nServInt's VPS is a powerful combination of CentOS Linux, Parallels Virtuozzo, and more than 50,000 lines of continually optimized code. A ServInt VPS is fast, powerful, and expertly managed.<br>\n<br>\nServInt has a committment to upgrade its hardware and software as technology progresses. Earlier this year we extensively upgraded the entire ServInt VPS line. We doubled RAM, raised and in most cases doubled storage, and increased bandwidth on each of our VPS packages at NO ADDITIONAL CHARGE.<br>\n<br>\nYou're <i>never</i> left behind with ServInt.<br>\n<br>\nEvery VPS product is a true Enterprise-class DSR - a Dedicated Server Replacement - brought to you exclusively by ServInt.<br>\n<br>\n<b><a href=\"http://www.servint.net/landing.php?p=hd&amp;t=2/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">Our Solutions:</a></b><br>\n<br>\nHere are just two examples:<br>\n<br>\n<b><a href=\"http://www.servint.net/landing.php?p=hd&amp;t=2/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\"><span style=\"color: blue\">Essential VPS</span></a></b><br>\n30 GB Disk Space (RAID 10 on 15k rpm SAS drives)<br>\n1 TB Monthly Transfer<br>\n768 MB Guaranteed (1.5 GB Burst RAM)<br>\n<a href=\"http://www.servint.net/landing.php?p=hd&amp;t=2/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">$49 Monthly after the first month</a><br>\n<br>\n<b><a href=\"http://www.servint.net/landing.php?p=hd&amp;t=2/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\"><span style=\"color: blue\">SuperVPS</span></a></b><br>\n75 GB Disk Space (RAID 10 on 15k rpm SAS drives)<br>\n3 TB Monthly Transfer<br>\n4 GB Guaranteed (8 GB Burst RAM)<br>\n<a href=\"http://www.servint.net/landing.php?p=hd&amp;t=2/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">$199 Monthly after the first month</a><br>\n<br>\nA ServInt VPS is fast, ingeniously and securely managed, and backed by a reputation we strive tirelessly to maintain. Our Managed Services Team takes their work seriously and personally, striving to provide the fastest, most efficient, least invasive PROACTIVE support in the industry.<br>\n<br>\nFor those interested in tracerouting to, pinging, or just simply testing a web download from ServInt LA, feel free to hit our West Coast speed test site (pardon the look, we're working on making it prettier):<br>\n<br>\n<a href=\"http://vps-speed-test-la.servint.net/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">http://vps-speed-test-la.servint.net/</a><br>\n<br>\nIf it looks familiar, that's because it is the same setup and has the same downloadable files as our East Coast speed test site:<br>\n<br>\n<a href=\"http://vps-speed-test-dc.servint.net/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">http://vps-speed-test-dc.servint.net/</a><br>\n<br>\nOur expertise in the command line helps you focus on the bottom line.<br>\n<br>\n<b><i>RELAX</i>. Your server is up and running.</b><br>\n<br>\n<i><b>Special Hosting Discussion Offer</b></i>:<br>\n<br>\nUse the Promotion Code <span style=\"color: blue\">HD2010VPS</span> when ordering and receive 50% off of the first month of any VPS or SuperVPS backed up by our very first money back guarantee at either ServInt LA or DC!<br>\n<br>\n<br>\n<i><b>ServInt's Green Hosting initiative:</b></i><br>\n<br>\nClick <a href=\"http://www.servint.net/servintgreeninitiative.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">for information on our Green Initiative</a>. Our entire VPS line is augmented by a massive carbon offsetting program, a large-scale tree planting campaign and an advanced recycling program. This is in addition to our continuous implementation of energy efficient technologies in both our hosting and our administration.<br>\n<br>\nServInt was named the #1 Green Host by <a href=\"http://www.findmyhost.com\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">findmyhost.com</a> in 2009, and the #1 VPS host overall for December 2009!<br>\n<br>\nAt ServInt, we feel we have a responsibility to better serve <i>and preserve</i>.<br>\n<br>\nCome join the ServInt family and help make a difference.<br>\n<br>\nContact <b><a href=\"mailto:sales@servint.com\">sales@servint.com</a></b> or call 1-800-5-SERVINT (1-800-573-7846). If you would like to place an order, please use the links provided above or <a href=\"http://www.servint.net\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\"><span style=\"color: red\">visit ServInt.net</span></a> for many more products and options.</div>\n\t\t\t\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t"}