{"id": "62539", "date": "Apr 7, 2010 at 11:45 AM", "user": "customhosting", "post": "\n\t\t\t\n\t\t\t\n\t\t\t\t<div class=\"bbWrapper\"><b>PingVPS.com | Totally Customisable VPS Plans! | 20% Permanent discount for the life of your VPS or take 50% off the first month!</b><br>\n<br>\nPingVPS offers non-oversold, unmanaged VPS.<br>\n<br>\nWe have a brand new product now available! <b>Totally customisable VPS plans</b> are now available to purchase. You can choose your Memory/HDD/Bandwidth and IP allocations so that you can get what you need without paying for things you don't. <br>\n<br>\nFor example if you want to hold some backups of your files and just need a lot of HDD space but 2gb of memory is total overkill, then you could build a VPS with 256mb memory, 300gb HDD and whatever bandwidth you need. Alternatively if you have a small website that gets a lot of traffic, and just need a few gb HDD but a lot of bandwidth you could tailor your VPS this way as well. The combinations are endless, and for the first time, totally up to you!<br>\n<br>\nIf this wasn't enough, we'll also give you a great 20% lifetime discount or 50% off the first month to sweeten the deal. Just remember to use one of the following codes at signup:<br>\n<br>\n<b>CUSTOMLIFE20</b> - 20% permanent discount for the life of your product<br>\n<b>CUSTOMFIRST50</b> - 50% discount for the first month<br>\n<br>\nWe have also now enabled our plans to be paid for either monthly, quarterly or annually. Paying quarterly gives you a 10% discount, paying annually gives you the equivalent to 2 months free! So if you signup for longer, you benefit from even more discount.<br>\n<br>\n<br>\n<b>Totally Customisable VPS Plan:</b><br>\nMemory from 64 MB - 4096 MB / Burst is double guaranteed<br>\nRAID 10 HDD from 5 GB - 300 GB<br>\nBandwidth from 10 GB - 3000 GB<br>\nIP Addresses from 1 - 32 (Subject to RIPE Justification)<br>\nCommercial Licenses: cPanel/WHM or Direct Admin<br>\nOS: CentOS/Ubuntu/Debian &amp; More!<br>\n[ <a href=\"https://pingcontrol.net/cart.php?a=add&amp;pid=16&amp;promocode=CUSTOMLIFE20\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">Order Custom VPS with 20% permanent discount</a> ]<br>\n[ <a href=\"https://pingcontrol.net/cart.php?a=add&amp;pid=16&amp;promocode=CUSTOMFIRST50\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">Order Custom VPS with 50% discount off first month</a> ]<br>\n<br>\n<b>What does it work out at?</b><br>\nMemory from equivalent £0.01/MB<br>\nHDD Space from equivalent £0.04/GB<br>\nBandwidth from equivalent £0.03/GB<br>\n<br>\nRemember to use the correct code at signup:<br>\n<b>CUSTOMLIFE20</b> - 20% permanent discount for the life of your product<br>\n<b>CUSTOMFIRST50</b> - 50% discount for the first month<br>\n<br>\n<br>\n<b>Test IP/1GB Download File:</b><br>\nIP: 188.165.152.209<br>\n1GB Test File: <a href=\"http://www.pingvps.com/1000mb.bin\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">http://www.pingvps.com/1000mb.bin</a><br>\n<br>\n<b>OS Templates:</b><br>\nWe have over 30 OS templates available to load onto your VPS. From the standard OS such as CentOS/Debian in both 32bit/64bit versions, OS with pre-installed hosting control panels like cPanel/webmin to other templates with remote desktop/ PBX system / Cloud computing online OS and more!<br>\n<br>\n<b>Location:</b><br>\nOur VPS servers are located in Roubaix France. With just 4ms to London, 4ms to Amsterdam, 4ms to Paris, 12ms to Frankfurt &amp; 1ms to brussels, you can see that the PingVPS servers are perfectly placed to serve all of Europe with its superb quality, low latency &amp; high speed connectivity.<br>\n<br>\n<b>Total Control:</b><br>\nWith Openvz+SolusVM Control Panel, our VPS give you complete control. Start/stop, re-install OS, add IP's, change root password, use virtual console for out of band connectivity.<br>\n<br>\n<b>Quality Hardware:</b><br>\nAll our servers use top spec hardware, with current generation core i7 based processors, 12gb or more DDR3 ECC registered RAM, 1gbps full duplex broadcom network cards, &amp; 3ware hardware RAID cards. We always use 4 drives in RAID10 configuration to ensure that your data is totally protected.<br>\n<br>\n<b>Terms:</b><br>\nWe offer 99.9% uptime guarantee, if the uptime is less than this we will offer refunds on a graded scale.<br>\nYou may cancel at any time by providing notice atleast 1 day before your due billing date.<br>\nYour VPS service may be used for lawful purposes only. PingVPS trades under UK Law.<br>\nPlease refer to our ToS for complete terms.</div>\n\t\t\t\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t"}