{"id": "62565", "date": "May 2, 2010 at 10:34 AM", "user": "customhosting", "post": "\n\t\t\t\n\t\t\t\n\t\t\t\t<div class=\"bbWrapper\"><b>PingVPS.com | VPS For £0.01! | Totally Customisable VPS Plans! | 20% Permanent discount for the life of your VPS or take 50% off the first month!</b> <br>\nThis is valid for all unmanaged VPS (standard or custom) ordered in May! <br>\nManaged cPanel VPS only available with 20% discount for life.<br>\n<br>\n<br>\nWe have 4 different products now available:<br>\n<br>\n1 - <b>Unmanaged VPS</b> - Our standard product, no frills just power &amp; stability<br>\n2 - <b>Managed cPanel VPS</b> - We manage OS updates, cpanel builds, support &amp; more<br>\n3 - <b>Trial VPS for £0.01</b> - Fully functional VPS, try us for a penny!<br>\n4 - <b>100% Customisable VPS</b> - Build it exactly how you want it. Starting from £1.34 (not including Discount!)<br>\n<br>\nWe now have the ultimate upgrade path! Start with a fully functional trial VPS for £0.01, if you like it then move on up to either a standard plan or a 100% customisable VPS, either way you can then continue to upgrade or downgrade your plan at any time, giving you total flexibility to increase your VPS size and power as and when you need to.<br>\n<br>\n<b>Trial VPS</b> <br>\nYou can test a VPS for one week for the sum total of <b>£0.01!</b> The VPS is fully functional but with a limited spec. (2GB HDD | 256mb Memory | 4GB Bandwidth | 1 IP) If you don't like what you get then you have no obligation to continue, if you do then you can choose to upgrade your VPS at the end of the trial, (or any point before that) you can upgrade to either one of our standard plans or a customised VPS plan and you can use any coupon still as if you were a new customer. <br>\n[ <a href=\"https://pingcontrol.net/cart.php?a=add&amp;pid=15\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">Order A Trial VPS For £0.01 Now!</a> ]<br>\n<br>\n*Please note: The number of trial accounts active at any one time will be limited so you may have to wait until one expires before yours can be activated. If there is going to be a delay you will be notified.<br>\n<br>\n<b>Unmanaged VPS</b> <br>\nIf you know what your doing and you want the best price for your VPS then unmanaged VPS is the choice for you. Because you are looking after your own support, we can reduce the cost to give you the best price possible. Starting from <b>£3.75 paid monthly</b> with 50% discount.<br>\n[ <a href=\"https://pingvps.com/vps-plans-prices/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">Order Standard Unmanaged VPS</a> ]<br>\n<br>\n<b>Totally customisable VPS plans</b> <br>\nYou can choose your Memory/HDD/Bandwidth and IP allocations so that you can get what you need without paying for things you don't. Create a 300gb storage VPS without the need to pay for lots of memory, or build a single website VPS with small amounts of memory and HDD but a large amount of bandwidth. The choices are endless. These plans are also unmanaged. Starting from <b>£0.67 paid monthly</b> with 50% discount.<br>\n[ <a href=\"https://pingcontrol.net/cart.php?a=add&amp;pid=16&amp;promocode=MAYFIRST50\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">Order Custom VPS with 50% discount off first month</a> ]<br>\n<br>\n<b>Managed cPanel VPS</b> <br>\nGetting to big for a cpanel reseller account? Move up to one of our managed cPanel VPS. We look after your OS updates, cPanel updates, any problems you have with apache, mysql etc. We do not however support 3rd party scripts. Anything that is not installed with CentOS 5 + cPanel will not be supported. Starting from <b>£19.16</b> with 20% discount for life.<br>\n[ <a href=\"https://pingvps.com/fully-managed-cpanel-vps/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">Order managed cPanel VPS</a> ]<br>\n<br>\nDont forget to add the correct discount coupon at checkout!<br>\n<b>MAYLIFE20</b> - 20% permanent discount for the life of your product (use on <b>any</b> product!)<br>\n<b>MAYFIRST50</b> - 50% discount for the first month (unmanaged VPS only)<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<b>Other Information:</b><br>\n<br>\n<br>\n<br>\n<b>Totally Customisable VPS Plan:</b><br>\nMemory from 64 MB - 4096 MB / Burst is double guaranteed<br>\nRAID 10 HDD from 5 GB - 300 GB<br>\nBandwidth from 10 GB - 3000 GB<br>\nIP Addresses from 1 - 32 (Subject to RIPE Justification)<br>\nCommercial Licenses: cPanel/WHM or Direct Admin<br>\nOS: CentOS/Ubuntu/Debian &amp; More!<br>\n[ <a href=\"https://pingcontrol.net/cart.php?a=add&amp;pid=16&amp;promocode=MAYLIFE20\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">Order Custom VPS with 20% permanent discount</a> ]<br>\n[ <a href=\"https://pingcontrol.net/cart.php?a=add&amp;pid=16&amp;promocode=MAYFIRST50\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">Order Custom VPS with 50% discount off first month</a> ]<br>\n<br>\n<b>What does it work out at?</b><br>\nMemory from equivalent £0.01/MB<br>\nHDD Space from equivalent £0.04/GB<br>\nBandwidth from equivalent £0.03/GB<br>\n<br>\n<br>\n<b>Test IP/1GB Download File:</b><br>\nIP: 188.165.152.209<br>\n1GB Test File: <a href=\"http://www.pingvps.com/1000mb.bin\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">http://www.pingvps.com/1000mb.bin</a><br>\n<br>\n<b>OS Templates:</b><br>\nWe have over 30 OS templates available to load onto your VPS. From the standard OS such as CentOS/Debian in both 32bit/64bit versions, OS with pre-installed hosting control panels like cPanel/webmin to other templates with remote desktop/ PBX system / Cloud computing online OS and more!<br>\n<br>\n<b>Location:</b><br>\nOur VPS servers are located in Roubaix France. With just 4ms to London, 4ms to Amsterdam, 4ms to Paris, 12ms to Frankfurt &amp; 1ms to brussels, you can see that the PingVPS servers are perfectly placed to serve all of Europe with its superb quality, low latency &amp; high speed connectivity.<br>\n<br>\n<b>Total Control:</b><br>\nWith Openvz+SolusVM Control Panel, our VPS give you complete control. Start/stop, re-install OS, add IP's, change root password, use virtual console for out of band connectivity.<br>\n<br>\n<b>Quality Hardware:</b><br>\nAll our servers use top spec hardware, with current generation core i7 based processors, 12gb or more DDR3 ECC registered RAM, 1gbps full duplex broadcom network cards, &amp; 3ware hardware RAID cards. We always use 4 drives in RAID10 configuration to ensure that your data is totally protected.<br>\n<br>\n<b>Terms:</b><br>\nWe offer 99.9% uptime guarantee, if the uptime is less than this we will offer refunds on a graded scale.<br>\nYou may cancel at any time by providing notice atleast 1 day before your due billing date.<br>\nYour VPS service may be used for lawful purposes only. PingVPS trades under UK Law.<br>\nPlease refer to our ToS for complete terms.</div>\n\t\t\t\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t"}