{"id": "62623", "date": "May 16, 2010 at 6:33 PM", "user": "jbvps", "post": "\n\t\t\t\n\t\t\t\n\t\t\t\t<div class=\"bbWrapper\">New Cloud Server Management Panel for 100% private label reselling or personal use.<br>\n<br>\nThis Service allows you to build and manage your own Branded cloud infrastructure with no haste's or fees every-time you do anything.<br>\n<br>\nFeatures.<br>\n<br>\n- Deploy servers as needed from 15 minute install time.<br>\n- Destroy unused servers.<br>\n- Manage all servers in one place using remote KVM<br>\n- Add and remove IP's instantly<br>\n- Edit Reverse DNS for all IP's<br>\n- Reboot, Power On, Power Off, Delete Server, Reinstall Server instantly<br>\n- Create users and provide 100% Private label access to them with the brandable server panel<br>\n- Deploy firewalls and private vlans to connect your servers to with 100% control over the firewall rules. (Coming Soon)<br>\n- Schedule backups and restore when needed in a 5 minute restore time. (Coming Soon)<br>\n- Attach ISO images to a server.<br>\n<br>\nOperating Systems<br>\n<br>\nWe currently support the following operating systems. If you need a custom OS we can ether install it for you or we can put the cd in the servers cd-rom drive and you can install the OS your self.<br>\n<br>\n* CentOS Linux<br>\n* Debian Linux<br>\n* Ubuntu Linux (Coming Soon)<br>\n* cPanel WHM<br>\n* Elastix VoIP<br>\n* TrixBox VoIP<br>\n* Windows 2003 Srv<br>\n* Windows 2008 Srv (Coming Soon)<br>\n<br>\nIf you have a suggestion for an OS please let us know and we can have it added.<br>\n<br>\n<br>\nServer Upgrades.<br>\n<br>\nWe offer the functionality for you to upgrade and downgrade your servers hardware whenever you need to. The following hardware can be added or removed.<br>\n<br>\n* Additional RAID-5 logical drives<br>\n* Number of CPUs (Coming Soon)<br>\n* Additional RAM (Coming Soon)<br>\n<br>\nMonthly Billing.<br>\n<br>\nPay at the end of the month for the servers you are using.<br>\nAny servers you don't want to pay for simply delete them before the billing date.<br>\n<br>\nTo View the Cloud Panel visit<br>\nwww.vps-hosting.ca</div>\n\t\t\t\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t"}