{"id": "64288", "date": "Jul 17, 2017 at 3:28 PM", "user": "turnkeyinternet", "post": "\n\t\t\t\n\t\t\t\n\t\t\t\t<div class=\"bbWrapper\"><div style=\"text-align: center\"><b><span style=\"color: Red\">ALL NEW : Fully White Label featuring Raid 10 SSD Disks &amp; Unlimited Un-Metered Bandwidth</span></b>​</div><br>\n<br>\n<b>TurnKey Internet, Inc</b> provides dedicated servers, colocation, web hosting, cloud, and virtual servers from its company-owned and operated <a href=\"https://www.turnkeyinternet.net/green-initiative/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">green</a> datacenter. Since 1999, TurnKey Internet, Inc. has built a reputation of outstanding personalized service, reliability, and value. Owning our own datacenter lets our <a href=\"http://www.shopperapproved.com/certificates/www.turnkeyinternet.net/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">on-site 5-star rated staff</a> answer your questions quickly and provide complete solutions direct from our expert team located right in the same building as your servers.  We are experts in the Cloud Hosting and Datacenter space with a true dedication to your online success every step of the way.<br>\n<br>\nTurnKey Internet’s cloud server reseller platform allows access to our white-labeled product line of enterprise-class cloud-hosted servers featuring over 100 pre-loaded Microsoft Windows Server and Linux Server template choices.  The cloud servers are hosted on our world-class platform within TurnKey Internet’s SSAE 16 Type 2 and ENERGY STAR® certified datacenter in New York using private label IP addresses and a white label web control panel. <br>\n<br>\n<br>\n<span style=\"color: red\"><b>Choose from these terrific packages: </b></span><br>\n<br>\nWe offer 2 cloud-server reseller packages to start with (you can always add on more disk, memory, or cpu cores at any time as well to the plan you pick, or upgrade from one to the other at any time!).  The Professional Cloud Reseller plan offers an amazing value and starting point for any VPS or Cloud Reseller to get going right away to sell VPS and CLOUD servers to their customers. Our all new Ultimate package offers more than 2x to 3x more capacity and value, plus Un-metered Gigabit bandwidth for every cloud server you provision for the ultimate performing VPS and Cloud Servers you resell to your customers!<br>\n<br>\nBoth cloud-server reseller packages are on our all-new Ultra-Fast platform which utilizes Ultra-Fast SSD disk technology for blazing fast disk IO speeds combined with nodes up to Dual Deca-Core (10 Core with up to 40 CPUs with hyperthreading support) making your resold cloud servers and VPS's (Virtual Private Servers) the fastest available anywhere!   All plans are powered on Xen virtualization technology backed by our own wholly owned New York datecenter, server equipment, and U.S. based support team.<br>\n<br>\n<b><u>Cloud Reseller Pro</u></b><br>\n<ul>\n<li data-xf-list-type=\"ul\"> 100+ Linux and Windows Server Templates to use</li>\n<li data-xf-list-type=\"ul\"> 40 CPU Cores <i>(*)</i></li>\n<li data-xf-list-type=\"ul\"> 20 GB RAM guaranteed </li>\n<li data-xf-list-type=\"ul\"> <b>120 GB Ultra-Fast SSD Raid-10</b> Disk Space</li>\n<li data-xf-list-type=\"ul\"> <b>100 Mbit port Un-metered Bandwidth included on each server</b> (up to 30TB per VPS/CLOUD you provision!)</li>\n<li data-xf-list-type=\"ul\"> 10 Rwhois/SWIPE IPv4 IP's + unlimited IPv6 Ips! </li>\n<li data-xf-list-type=\"ul\"> Weekly Backups (cloud server complete images) </li>\n<li data-xf-list-type=\"ul\"> Standard High Performance Server Nodes (Dual Hexa-Core @ 2.66 GHz minimum, and may be provisioned up to Tetra-Deca Core 2.0 Ghz)</li>\n</ul><b>$99/mo now 50% Off</b> Best Value Deal <i>(was $199/mo)</i> | <a href=\"https://www.turnkeyinternet.net/go.php?c=reseller_cloud_vps\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">ORDER NOW</a>  | <b><span style=\"color: Red\">Additional 10% Off For Life when you pre-pay Annually!</span></b><br>\n<br>\n<br>\n<br>\n<b><u>Cloud Reseller Ultimate</u></b><br>\n<ul>\n<li data-xf-list-type=\"ul\"> Up To 3x (Triple!) The CPU and IOPS Speed of the Professional Plan</li>\n<li data-xf-list-type=\"ul\"> 100+ Linux and Windows Server Templates to use</li>\n<li data-xf-list-type=\"ul\"> 90 CPU Cores <i>(**)</i></li>\n<li data-xf-list-type=\"ul\"> 60 GB RAM guaranteed </li>\n<li data-xf-list-type=\"ul\"> <b>300 GB Ultra-Fast SSD Raid-10</b> Disk Space</li>\n<li data-xf-list-type=\"ul\"> <b>1000 Mbit (GigE) port Un-metered Bandwidth included on each server</b> (up to 300TB per VPS/CLOUD you provision!)</li>\n<li data-xf-list-type=\"ul\"> 15 Rwhois/SWIPE IPv4 IP's + unlimited IPv6 Ips! </li>\n<li data-xf-list-type=\"ul\"> Weekly Backups (cloud server complete images) </li>\n<li data-xf-list-type=\"ul\"> <b>Ultimate Premium</b> High Performance Server Nodes (Dual Octa-Core 2.0 GHz minimum, and may be up to Tetra-Deca Core 2.0 Ghz)</li>\n</ul><b>$149/mo now 50% Off</b> Best Value Deal <i>(was $299/mo)</i> | <a href=\"https://www.turnkeyinternet.net/go.php?c=reseller_cloud_vps\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">ORDER NOW</a>  | <b><span style=\"color: Red\">Additional 10% Off For Life when you pre-pay Annually!</span></b><br>\n<br>\n<br>\n<i>Cloud Reseller Ultimate may be hosted on all-new Tetra-Deca (14-core) Intel E5-2660 v4 CPU's but are guaranteed to be hosted on a minimum of the all-new Octa-Core Intel CPU Technology E5-2660 platform running at 2.0 GHz. Cloud Reseller Pro may be hosted on the all-new Octa-Core platform but are guaranteed to be hosted on a minimum of Hexa-Core Intel CPU Technology running at 2.0 GHz and above. Ultimate Plan (**) total CPU cores based on 6 CPU Cores Distributed Across each Virtual Machine Professional Plan (*) total CPU cores based on 4 CPU Cores Distributed Across each Virtual Machine. </i><br>\n<br>\n<br>\nThis cloud reseller platform is <b>NOT like any other VPS or Cloud Server Program</b> because we let you own your clients, set your own prices, customize your own server plans and offer a complete white label experience.  And we give you access to both linux, and windows based cloud server images! <br>\n<br>\nThis secure reseller platform allows you to sell your own private label cloud servers and virtual private servers directly to your clients, with no hardware to buy, no software to install and nothing you need to manage - everything is done via our fully automated web control panel. <br>\n <br>\nCompetitors offering similar reseller options make your clients sign up with them, then simply pay you a small commission or discount. TurnKey Internet's cloud server reseller platform lets you own the client and the client signs up directly with you and pays you directly.  You setup your own custom pricing and plans to bundle with whatever add-on services you may want to include (such as web design, IT management, premium geographic backups, etc).  You are in complete control!<br>\n<br>\n<br>\n<b>Here is what makes the TurnKey Cloud Reseller Platform unique</b><br>\n<br>\n<ul>\n<li data-xf-list-type=\"ul\"> <span style=\"color: red\">You OWN your client</span> - your client signs up and pays you directly</li>\n<li data-xf-list-type=\"ul\"> Set your own prices (unlimited profit potential)</li>\n<li data-xf-list-type=\"ul\"> Create your own plans (unique disk size, memory, bandwidth, additional IPs, and more)</li>\n<li data-xf-list-type=\"ul\"> white label Web Control panel for your clients - Suspend, reboot, Re-Image, Stop/Start, Monitor Bandwidth and more!</li>\n<li data-xf-list-type=\"ul\"> Fully Automated Web Control Panel (reboot, reformat, KVM over IP, Re-image, Provision)</li>\n<li data-xf-list-type=\"ul\"> No over-selling - fast and stable server nodes with guaranteed resources, powered by XEN based virtualization technology</li>\n<li data-xf-list-type=\"ul\"> Linux and Windows based servers fully supported! Our technology lets you resell Windows Cloud Servers!</li>\n<li data-xf-list-type=\"ul\"> No Setup Fees / No Royalties / No Commissions</li>\n<li data-xf-list-type=\"ul\"> Unlimited Cloud Servers / VPS's can be provisioned (you buy 1 block of resources and cut it up as you like)</li>\n<li data-xf-list-type=\"ul\"> <b>Un-Metered Bandwidth</b> We give you 1000 Mbit (GigE) and 100 Mbit Options, no Bandwidth overages to worry about!</li>\n<li data-xf-list-type=\"ul\"> Sell / Support IPv6 Enabled Servers! We include IPv6 On all Cloud Servers you provision!</li>\n<li data-xf-list-type=\"ul\"> IPv6 Ready! Free /64 IPv6 Subnet included to each Cloud Server</li>\n<li data-xf-list-type=\"ul\"> Sell from the nation's leading GREEN Datacenter (Certified Energy Star Datacenter, using 100% Green Energy)</li>\n<li data-xf-list-type=\"ul\"> Sell from TurnKey's SSAE-16 Type 2 Certified Datacenter located in New York</li>\n<li data-xf-list-type=\"ul\"> We handle backups for you (automatic!) via weekly cloud server images</li>\n<li data-xf-list-type=\"ul\"> 100% network uptime guarantee</li>\n<li data-xf-list-type=\"ul\"> 24x7 toll-free phone, live chat, and help desk support</li>\n<li data-xf-list-type=\"ul\"> 30-day money-back guarantee</li>\n<li data-xf-list-type=\"ul\"> NO term contract (month to month)</li>\n<li data-xf-list-type=\"ul\"> NO setup fees</li>\n</ul><br>\n<br>\n<b>All New Tetra-Deca Core (14 Core) Ultra-Fast SSD Cloud Virtual Servers</b> - utilizing Ultra-Fast SSD disk technology for ultra fast disk IO speeds combined with Dual Tera-Deca Core E5 CPU's (W/HyperThreading = 56 CPU Cores!) makes our all-new Cloud VPS (Virtual Private Server) nodes the fastest available!   All plans are powered on KVM virtualization technology backed by our own wholly owned New York datecenter, server equipment, and U.S. based support team.<br>\n<br>\n<b><ul>\n<li data-xf-list-type=\"ul\"> ALL NEW Enterprise Grade Multi-Tera-Deca Core Servers (56 Total Cores visible) With Raid 10 SSD</li>\n<li data-xf-list-type=\"ul\"> Each node is equipped with the latest and greatest in processing</li>\n<li data-xf-list-type=\"ul\"> up to Dual 2.0 GHz Tetra-Deca Core Intel® E5-2660 V4 processors with Turbo Boost</li>\n<li data-xf-list-type=\"ul\"> Up to 56 CPU cores per node visible to the operating system</li>\n<li data-xf-list-type=\"ul\"> Up to 384 GB of memory available per node</li>\n<li data-xf-list-type=\"ul\"> SAS 3.0 12 Gbps direct attached storage HDD backplane</li>\n<li data-xf-list-type=\"ul\"> Multi-10 Gigabit Backbone connections, multiple Juniper MX240 Network Routers</li>\n</ul></b></div>\n\t\t\t\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t"}