{"id": 1065, "date": "2020-05-17 20:36:18", "user": "wdmg", "post": "Hi LES,\r\n\r\nMy organization (https://winterdragon.ca/ &amp; https://geeksolutions.ca/) is launching general availability on DDoS Mitigation services, both On-Premise and SaaS. We've been in the DDoS Mitigation business for over 3 years, prior to this brand working for universities &amp; colleges directly as an MSP providing DDoS Mitigation.\r\n\r\nWe've branched from our MSP roots and now do mitigation full time. So, without further ado, here's what we're offering!\r\n\r\n**SaaS Pro**\r\n\r\n* Fully automated setup\r\n* SaaS Management Panel\r\n* 1 TB of bandwidth included (clean)\r\n* Up to 500Gbit/sec Layer 3/4 mitigation, up to 50M requests per second Layer 7 mitigation\r\n* Unlimited Domains\r\n* Protect both TCP-based Game Servers (eg, Minecraft), Web Applications\r\n* Automatic on-demand Lets Encrypt SSL\r\n* Real-time attack alerts with Graph Photographs (automated), including Mbps, Packets Per Second and Requests Per Second\r\n\r\n*Pricing:* $50/mo for 50TB ($1/TB!)\r\n\r\n*Purchase Link:* [https://billing.geeksolutions.ca/index.php/order/main/packages/pm1/?group_id=6](https://billing.geeksolutions.ca/index.php/order/main/packages/pm1/?group_id=6 \"https://billing.geeksolutions.ca/index.php/order/main/packages/pm1/?group_id=6\")\r\n\r\n**How our mitigation works:**\r\n\r\n1. Hunter: Our in-house detection system will detect incoming floods within 1 minute (average 3s time-to-detect)\r\n2. Swooper: Our in-house mitigation systems swoops into action, applying rules in real-time to mitigate the incoming attacks, and adapt rules autonomously as the attack evolves\r\n3. Killer: The attack is mitigated and your website or game server remains online\r\n\r\n**FAQ**\r\n\r\n**Free trial?**\r\n\r\nUnfortunately, we are unable to provide a free trial at this time, however, we will provide a refund if you are not satisfied with our service within the first 15 days.\r\n\r\n**Setup Time?**\r\n\r\nSetup is usually within 12 hours of the order, as we do fraud checks manually. Please open a ticket if it has exceeded 12 hours on a Business Day, and we will be happy to investigate and set you up as soon as possible.\r\n\r\n**Filtering POP Locations?**\r\n\r\nWe currently have filtering POPs in the following locations:\r\n\r\n1. Toronto\r\n2. Montreal\r\n3. Vancouver\r\n4. San Francisco\r\n5. New York\r\n6. Miami\r\n7. London (England)\r\n8. France\r\n9. Germany\r\n10. Finland\r\n11. Brazil\r\n12. Australia\r\n13. Japan\r\n14. Netherlands\r\n\r\n**Bandwidth Billing Policy**\r\n\r\nBandwidth is only billed per clean TB used. \r\n\r\n**Minimum Payments**\r\n\r\nOur monthly minimum is $10 for 1TB of bandwidth, or, 50TB for $50. \r\n\r\n**Additional Bandwidth**\r\n\r\nAdditional bandwidth can be had for SaaS Pro plans $5/TB.\r\n\r\n**Can I request additional locations?**\r\n\r\nWe are open to adding POP locations when there is high-enough demand. Please open a ticket or comment below to request a location, if said location is viable we will add it to our network for the benefit of all our users.\r\n\r\n**Support**\r\n\r\nWe currently offer 24x7x365 support via Email, Ticket and Phone for technical support only. Regular sales and support is between 8 AM - 6 PM ET, Monday-Friday &amp; Saturday. On Sunday, between 10 AM - 4 PM ET.\r\n\r\n**Office**\r\n\r\nWe're based in Perth, Ontario. Our office is located at 2896 Rideau Ferry Rd, Unit 203-B, Perth, Ontario, Canada K7H 3C7. Our office is currently closed to the public due to the COVID-19 outbreak."}