{"id": 278, "date": "2019-12-10 05:20:34", "user": "SmallWeb", "post": "Hey folks, now that BF/CM is over I just wanted to pop a thread with what SmallWeb has to offer ending 2019 and starting 2020.\r\n\r\nFirstly, [SmallWeb](http:// \"SmallWeb\") is now introducing DirectAdmin Email Services. This service runs through MXroute who I'm sure most of you are aware of and respect individually for their great service.\r\n\r\nhttps://twitter.com/SmallWebHost/status/1204208123516522496\r\n\r\n**What's the features?**\r\n\r\n* **DirectAdmin Interface** - The email service uses a customised version of the DirectAdmin interface, removing unecessary web-related sections and opting for the \"Sidebar\" template for ease of use.\r\n\r\n\r\n*  **300/H Outbound Limit** - Each individual email address can send a maximum of 300 outbound emails per hour. Of course, please only use this for legitimate, non-spam use. I'm sure you will. \r\n\r\n\r\n* **Reputable IP Addresses** - The provider is known for their quality  high reputation pool of IP addresses and strict anti-spam and anti-blacklist measures to ensure your emails are good to go.\r\n\r\n\r\n* **The Necessary Protocols** - All necessary protocols are available such as IMAP, POP3 and SMTP.\r\n\r\n\r\n* **Webmail Interface Login** - We offer a webmail interface using the Roundcube email software. It's recently been updated with a fresh design and looks very modern. We're looking into expanding this range.\r\n\r\n**What's the package?**\r\n\r\nSWMAIL - 3GB Storage - £9.99/year - Now £4.99/year - Promocode: BETA - [Order Link For 3GB Email Account](https://smallweb.net/portal/order/config/index/email/?group_id=31&amp;pricing_id=599 \"Order Link\")\r\n\r\n\r\n&lt;hr&gt;\r\n\r\n\r\nOn to the Shared Hosting..\r\n\r\nSmallWeb offers shared hosting in 6 locations as of this post.\r\n\r\n* Amsterdam, Netherlands\r\n* Los Angeles, United States\r\n* Luxembourg, Europe\r\n* London, United Kingdom \r\n* Melbourne, Australia \r\n* New York, United States\r\n\r\nThe plans are:\r\n\r\n½GB - 05 Site - 100GB Bandwidth - Softaculous - Let's Encrypt - £3.99/Year\r\n1GB  - 10 Sites - 250GB Bandwidth  - Softaculous - Let's Encrypt - £6.99/Year\r\n2GB - 20 Sites - 500GB Bandwidth  - Softaculous - Let's Encrypt - £9.99/Year\r\n\r\n[Scroll the order form and choose a location here](https://smallweb.net/portal/order/main/index/shared \"Scroll the order form and choose a location here\")\r\n\r\nStarting the new year, more stock will be added for those borderline or out of stock.\r\n\r\n&lt;hr&gt;\r\n\r\nNow if you're wondering about reseller plans, they're being revamped for 2020! Aiming to target the 10-50GB storage requirement, with Free Blesta Licensing included for certain packages. For now! If you would like to save money on Blesta/bundle with your SmallWeb services I offer monthly branded. :)\r\n\r\nThank you for reading this if you have! Let me know if you have any questions.\r\n"}