{"id": 769, "date": "2020-03-10 22:39:48", "user": "seriesn", "post": "&lt;center&gt;![](https://www.cybera.ca/assets/Uploads/_resampled/resizedimage256300-nkQkF2.png)\r\n\r\n**Oh no! Here we go, being irrational again!!**\r\n\r\nIt is no secret that I love math and it would be weird if I don't celebrate the day (or days) with my new and current family members!\r\n\r\nIf you are thinking, oh no, I don't need another VPS, don't be rational! **You are not buying a VPS here, you are getting a slice of our delicious family pie!** &lt;/center&gt;\r\n\r\n\r\nNot going to bore anyone with too much texts. Here is the promo ( Ends on Saturday, March 14, 2020, 11:59 PM EDT ) :\r\n\r\n------\r\n**31.4% Off when you signup for our Ryzen and NVME Powered VPS with either 3, 6 or 12 months !**\r\n\r\n**Link to order and configure** : \r\n-\"VPS\" Plans: https://nexusbytes.com/cart.php?gid=16\r\n-\"Pool\" Plans: https://nexusbytes.com/cart.php?gid=18\r\n-\"vDedi\" Plans : https://nexusbytes.com/cart.php?gid=19\r\n**Eligible Plans:**  VPS-1G and above, Pool-2G and above, any vDedi Plans.\r\n**Virtualization type: KVM**\r\n**Locations : NYC,USA ; LA,USA; Falkenstein,Germany**\r\n**Code : _PiDay_**\r\n**Plans starts at*: $2.2/mo*\r\nYou save more when you signup with longer payment term :)\r\n\r\nThis will be our only Major promo for Q2. Once expired, I won't be able to honor it :(\r\n\r\n---------\r\n\r\n\r\n**What about those who already signed up for our regular plans without any discount code?**\r\n\r\n\r\nWe always take care of those, who are our own!\r\n\r\n---------\r\n\r\nPlease open a ticket before the promo ends and discount will be added to your account and will reflect during next renewal\r\n\r\n \r\nPromo can't be combined with Switcher Special and/or contract buyout.\r\n\r\nWhat is included with each [VPS](https://nexusbytes.com/cart.php?gid=16) plan :  \r\n[Free Windows](https://nexusbytes.com/knowledgebase/38/Family-Perks---Because-family-matters.html) + [Free Blesta](https://nexusbytes.com/knowledgebase/38/Family-Perks---Because-family-matters.html) + [Free Nat backup VPS](https://nexusbytes.com/knowledgebase/38/Family-Perks---Because-family-matters.html) \r\n\r\n**Quick FAQ:**\r\n\r\n* [Test IP and Download](https://nexusbytes.com/knowledgebase/24/Network-Info-.html)\r\n* We Accept: Debit/Credit Card, Paypal, AliPay, We Chat Pay, Bitcoin / BitcoinCash / LiteCoin / Ethereum\r\n* [48 Hours Refund Policy](https://nexusbytes.com/knowledgebase/6/Nexus-Bytes-LLC--48-Hour-Refund-Policy.html)\r\n* [TOS/AUP TLDR; Don't be a dick, don't behave like a criminal. Don't get in trouble, don't get me in trouble.](https://nexusbytes.com/knowledgebase/2/Policies)\r\n* Free Blesta Billing Software\r\n* Free Windows Server 19 or windows server 12 standard license with Annual and Semi-Annual payments (VPS-2G and above)\r\n* Not Eligble for contract buyout or switcher special.\r\n* Nested Virt Enabled\r\n* All codes and plans are recurring. You will be grandfathered in if we ever increase pricing.\r\n* Promo Plan cannot replace any existing service.\r\n* If you cancel any existing service within 30 days of signing up for the new promo plan, your promo discount will expire.\r\n\r\nTo those, who have given us the honor of serving you, thank you for being a member of the family. The rest, don't wait, join the the family! "}