{"id": 811, "date": "2020-03-20 12:06:13", "user": "Clouvider", "post": "**What sets us apart?**\r\n-Juniper only network with new equipment.\r\n-Multi 100Gbps core network (1.2+ Tbps Total Capacity) with N+1 resiliency at minimum and diverse routing.\r\n-Great peering at LINX, LONAP, AMS-IX, DE-CIX and all major local ISP's.\r\n-We transit with: Level3, Telia, NTT, GTT, TATA, ZAYO and Cogent which guarantees excellent connectivity - congestion free.\r\n-LINX and LONAP partner - we can connect you to these exchanges with your own ASN.\r\n-EU MPLS Network Spread over 7 data centres.\r\n-Tier 3 Data centres in London, Amsterdam &amp;amp; Frankfurt.\r\n-We aim at high quality for a reasonable price.\r\n-Clouvider is an established UK based business. We just turned 6!\r\n\r\n**So where are the offers?**\r\nOur current dedicated server offers can be seen on our [Dedicated Server Sale Page](https://www.clouvider.co.uk/dedicated-servers-sale/), subject to availability. If it’s not listed its gone! No promotional codes needed.\r\n\r\nOur base configuration sale dedicated servers can be found below.\r\n\r\n**Dedicated Servers on Sale**\r\n\r\nE-2276G (6 Cores, 12 Threads, 3.8 GHz &amp;amp; 4.9 Ghz Turbo),\r\n16 GB DDR4 ECC RAM, \r\n512GB NVMe, \r\n50TB @ 2.5Gbps over 10Gbps NIC,\r\n£58 ($68.13) per month.\r\nAvailable in Amsterdam.\r\n\r\nWe also have a number of 1Gbps and 10Gbps unmetered dedicated servers currently on sale!\r\n\r\n**FAQ’s:**\r\n\r\n*Can these servers be customised?*\r\nYes, we have several options during the checkout process for our Xeon E3 &amp; E systems. If you seek a different configuration please contact us.\r\n\r\n*Can I check your network?*\r\nYes, our LookingGlass can be found at [https://as62240.net/](https://as62240.net/), alternatively you can use the following test IP’s:\r\n185.42.223.63 - London, UK\r\n194.127.172.33 - Amsterdam, NL\r\n91.199.118.14 - Frankfurt, DE\r\n\r\n*How long for deployment?*\r\nOur standard delivery is within 3 working days. Custom configurations may take longer.\r\n\r\n*Do you offer IPMI Access?*\r\nYes, free VPN Secured IPMI access can be provided on request.\r\n\r\n*Do you offer IPv6?*\r\nYes, /64 or /48 subnets can be requested during the order process.\r\n\r\n*Can you accommodate x, y or z?*\r\nOpen a sales ticket to discuss our custom solutions, happy to help where possible.\r\n\r\n*Any questions or queries?*\r\nContact our team today at [https://www.clouvider.co.uk/contact/](https://www.clouvider.co.uk/contact/)\r\n\r\nAll prices are exclusive of VAT where applicable. Stock is limited and the offers are valid subject to stock remaining. Because of the limited stock, if the order is not paid within an hour, it will be regretfully cancelled and the stock returned to the pool for others to enjoy. Subject to our standard Terms &amp; Conditions [https://www.clouvider.co.uk/terms-conditions](https://www.clouvider.co.uk/terms-conditions). Cancellation notice period applies. Exchange rates valid as of 20th Mar 2020. Offer valid whilst promotional stocks last or until the 1st April 2020, whichever comes first."}