{"id": "26708", "post": "<div class=\"post-26708 post type-post status-publish format-standard hentry category-interview tag-cloud-net tag-iaas tag-onapp tag-paas tag-saas\" id=\"post-26708\"><h2 class=\"storytitle\"><a href=\"https://lowendbox.com/blog/cloud-platforms-warp-cores-and-revolutionary-software-interview-with-steve-fenton-head-of-marketing-for-onapp/\" rel=\"bookmark\">Cloud Platforms, Warp Cores, and Revolutionary Software: Interview with Steve Fenton, Head of Marketing for OnApp</a></h2><div class=\"meta\"><img data-lazyloaded=\"1\" src=\"/media/icons/tag_green.png\" data-src=\"/media/icons/tag_green.png\" alt=\"Tags: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> <a href=\"https://lowendbox.com/tag/cloud-net/\" rel=\"tag\">cloud.net</a>, <a href=\"https://lowendbox.com/tag/iaas/\" rel=\"tag\">iaas</a>, <a href=\"https://lowendbox.com/tag/onapp/\" rel=\"tag\">onapp</a>, <a href=\"https://lowendbox.com/tag/paas/\" rel=\"tag\">paas</a>, <a href=\"https://lowendbox.com/tag/saas/\" rel=\"tag\">SaaS</a> <img data-lazyloaded=\"1\" src=\"https://lowendbox.com/media/icons/calendar.png\" data-src=\"https://lowendbox.com/media/icons/calendar.png\" alt=\"Date/Time: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> April 20, 2021 @ 12:00 am, by raindog308</div><div class=\"storycontent tablelook\"><p><strong><img data-lazyloaded=\"1\" src=\"https://lowendbox.com/wp-content/uploads/2021/04/steve-fenton-onapp.jpg.webp\" loading=\"lazy\" class=\"wp-image-26709 size-full alignright litespeed-loaded\" data-src=\"https://lowendbox.com/wp-content/uploads/2021/04/steve-fenton-onapp.jpg.webp\" alt=\"\" width=\"300\" height=\"353\" align=\"right\" hspace=\"20\" data-srcset=\"https://lowendbox.com/wp-content/uploads/2021/04/steve-fenton-onapp.jpg.webp 300w, https://lowendbox.com/wp-content/uploads/2021/04/steve-fenton-onapp-255x300.jpg.webp 255w\" data-sizes=\"(max-width: 300px) 100vw, 300px\" sizes=\"(max-width: 300px) 100vw, 300px\" srcset=\"https://lowendbox.com/wp-content/uploads/2021/04/steve-fenton-onapp.jpg.webp 300w, https://lowendbox.com/wp-content/uploads/2021/04/steve-fenton-onapp-255x300.jpg.webp 255w\" data-was-processed=\"true\"></strong></p><p><em>In this post we continue our <a href=\"https://lowendbox.com/tag/interview/\" target=\"_blank\" rel=\"noopener\">interview series</a> with Steve Fenton, Head of Marketing of <a href=\"https://www.onapp.com\">OnApp</a>.&nbsp; OnApp recently released <a href=\"https://lowendbox.com/blog/onapp-brings-cloud-hosting-into-the-saas-age-with-cloud-net/\" target=\"_blank\" rel=\"noopener\">Cloud.net</a>, an exciting new cloud platform – read on for more details!&nbsp; You also might enjoy reading our recent <a href=\"https://lowendbox.com/blog/interview-ditlev-bredahl-ceo-of-onapp/\" target=\"_blank\" rel=\"noopener\">interview with OnApp’s CEO Ditlev Bredahl</a>.&nbsp; In this interview, Steve gives us a behind-the-scenes look at OnApp and their technology.&nbsp; Without further ado…</em></p><p><strong>Where in the world do you live?</strong></p><p>Hi! I live in the UK, near Cambridge.</p><p><strong>How does one get to be the Head of Marketing for OnApp?</strong></p><p>That is a secret :)</p><p><strong>Cloud.net has been launched!&nbsp; For people who might look at it as “yet another cloud service,” what do you think is new and revolutionary about Cloud.net?</strong></p><p>It has! But the first thing I’d say is, it isn’t a cloud service – it’s a cloud platform. It isn’t for end users looking to buy a VPS or a VM: it’s for cloud providers who use it to sell VPS or VMs.</p><p>What’s new and revolutionary? From one point of view Cloud.net does nothing new: it’s the same codebase you get with the OnApp cloud platform, it gives you the tools you need to design, sell and manage cloud services. Everyone reading this knows that there are already a ton of ways you can do the same kind of thing.</p><p>From another point of view… it <em>is </em>revolutionary in terms of how you use a cloud platform, how you engage with it, and <em>who</em> can use it commercially. It’s a SaaS cloud platform based on OnApp, but like all SaaS, it moves away from the nuts &amp; bolts so you can focus on actually using the software. You get your own OnApp cloud environment, deployed automatically in about 30 minutes, from $50 per month.</p><p><strong><img data-lazyloaded=\"1\" src=\"https://lowendbox.com/wp-content/uploads/2021/04/onapp-leb-deal-post-banner-march-21.png.webp\" loading=\"lazy\" class=\"size-full wp-image-26667 alignleft litespeed-loaded\" data-src=\"https://lowendbox.com/wp-content/uploads/2021/04/onapp-leb-deal-post-banner-march-21.png.webp\" alt=\"\" width=\"300\" height=\"300\" align=\"left\" hspace=\"20\" data-srcset=\"https://lowendbox.com/wp-content/uploads/2021/04/onapp-leb-deal-post-banner-march-21.png.webp 300w, https://lowendbox.com/wp-content/uploads/2021/04/onapp-leb-deal-post-banner-march-21-150x150.png.webp 150w\" data-sizes=\"(max-width: 300px) 100vw, 300px\" sizes=\"(max-width: 300px) 100vw, 300px\" srcset=\"https://lowendbox.com/wp-content/uploads/2021/04/onapp-leb-deal-post-banner-march-21.png.webp 300w, https://lowendbox.com/wp-content/uploads/2021/04/onapp-leb-deal-post-banner-march-21-150x150.png.webp 150w\" data-was-processed=\"true\">Let me see if I understand Cloud.net: you’re providing a management and capabilities layer.&nbsp; I can use Cloud.net to plug in my own servers/VMs, or if I don’t own what I need, I can either go rent some (e.g., from providers we all know in public datacenters), or buy resources on your marketplace.&nbsp; Meanwhile my entire cloud is on one “pane of glass” so to speak – one interface, one API, etc. to rule them all.&nbsp; Is that the main value you’re bringing or is there some other big component I’m missing?</strong></p><p>Cloud.net is a new way to sell cloud without owning or leasing any hardware at all – there are plenty of regions where hardware is a pain to get hold of, or just prohibitively expensive. With Cloud.net you can use our compute marketplace, and get up and running almost instantly. At the same time, you can also use your own servers and remove most of the set-up and configuration headache: Cloud.net automates server onboarding, user creation and your billing plan structure, so it’s super-fast..</p><p>You asked about the main value: it’s that combination of speed, simplicity and removing CAPEX from the equation.&nbsp; In demos we’ve done to some very well-known names in the industry, the feedback has been, wow… people who know how much hassle it is to do this with OpenStack or Virtuozzo or even with “classic” OnApp… they get the point immediately.</p><p>30 minutes to your own public cloud, 30 minutes from a customer’s order to their own personal private cloud, 30 minutes and you’ve bought no hardware at all… it’s all automated, and you can get started from 50 bucks a month. That is really powerful. I should also mention that we’re bringing these new automation features to our “full” OnApp cloud clients in our next release.</p><p><strong>Cloud.net seems to have a very mature on-prem bring-your-own-hardware model, which is not that common.&nbsp; Most cloud providers are more interested in selling their hosting VMs and services than enabling you to use your own.&nbsp; Do you find customers are mixing on-prem/owned servers with your marketplace, or are they predominantly signing up to use one or the other?&nbsp; What are use cases where people are using both their own metal and yours?</strong></p><p>I’m not sure I quite understand that distinction – when we say bring your own hardware, we mean hosts can bring their own hardware – or use our marketplace instead. For the hosts here at LEB, adding your own hardware is probably the natural starting point, the approach you’re used to –&nbsp; but we’re already seeing a lot of interest in the marketplace as a way to expand on demand when your end customers need it, or to avoid hardware costs in the first place.</p><p><strong>Who is the typical Cloud.net customer?&nbsp; Is it large or mid-sized enterprises who want to manage their own compute and other resources for their businesses, or hosting providers who want to use your products to make reselling systems easier, or…?</strong></p><p><span id=\"more-26708\"></span></p><p>It’s 100% aimed at cloud service providers – VPS hosts, cloud hosts, MSPs. OnApp is all about helping service providers, and Cloud.net is no different. From time to time we do get enterprise customers, especially those whose IT departments act like a true “internal service provider”, but they are rare. Cloud hosts/cloud service providers are the focus.</p><p>Cloud.net is designed to give smaller providers a way to take advantage of the OnApp approach to cloud – starting at $50 per month, the entry point is a lot lower than the full OnApp cloud platform – but we’re seeing interest from larger providers too, especially as a way to spin up private clouds for their customers very quickly.</p><p><strong>We have a lot of readers in the hosting industry.&nbsp; Your software offers integrations for WHMCS, VPS management, etc. so obviously you’re targeting that market segment.&nbsp; If I’m a provider today selling VMs, why do I want to consider moving to Cloud.net?&nbsp; And, since this is LowEndBox, if I do that am I going to need to move to a less cost-sensitive market segment or can I still cater to the hobbyist and low-end user?</strong></p><p>Great question, and cost usually generates some pretty robust discussions in this community :) Yes, OnApp targets “hosting”, but that can range from a smallish hosting provider right up to a massive MSP or Telco business: at a very high level, you’re all hosting applications and data for your customers, in your cloud, and we’re here to make that as simple and profitable for you as we can.</p><p>Does that mean you’re the same, and have the same needs? Of course not – there will always be sets in the “product Venn diagram” that don’t intersect – features, pricing, support, commercial model, whatever. Very few products do everything for everyone. Cloud.net aims to make cloud hosting with OnApp more accessible and affordable, but it isn’t going to suit everyone. If you’re happy being a hobbyist, that’s great – we wish you well.</p><p>If you’re like a lot of customers we have today, who started as a hobbyist – and literally, some of our biggest customers started by thinking “hell, I can host some sites/game servers/etc for my friends” – and then saw the business opportunity – then we’d like to help make that “what if” a reality.</p><p>If you’re already doing this with another platform, we’d like to show you how Cloud.net could accelerate that journey, too. OnApp powers some of the world’s biggest public clouds: it’s the most flexible, robust and proven way to sell cloud hosting, and Cloud.net gives you an easy way to get started at very low cost. By the way, if you’re already using another platform at a decent scale, we have a <a href=\"https://cloud.net/match-it\">special offer</a> for you :)</p><p><strong>I have heard some architects say they don’t like IaaS (Infrastructure as a Service, where you rent VMs) and prefer managed services, like databases, app servers, etc. that they don’t have to manage.&nbsp; Their thinking is that managing your own OS, DB, etc. takes manpower while letting some cloud provider just give you a DB instances or an app server reduces work.&nbsp; You guys obviously believe that IaaS is here to stay – Where do you think the line is between people who just want a managed service/application and people who want to control everything from the metal up?</strong></p><p>We have customers doing everything – from pure transactional IaaS public cloud, or VPS hosting, to managed applications and DBs, to virtual private cloud and on-premises private cloud, VMware cloud, everything. I have a simple view of these things: it’s all Infrastructure as a Service.</p><p>The nature of the service is different, and for the hosting provider and the end customer the human effort required should always be factored in – in other words, architects thinking that way are probably thinking smart, because as you say, they want to reduce work – and hopefully, they’re also thinking about what other value they could be adding by not having to worry about the infrastructure layer.</p><p>There are use cases where you’d absolutely still want to do that, and I also think some people just like doing things by hand – especially at the hobbyist kind of level, it’s kind of the point; weirdly, it’s also true at the higher end consultative/custom cloud kind of level, where you’re building everything bespoke for the customer.</p><p>There is no right or wrong, but with Cloud.net we’re clearly introducing a way to do this that leans away from the “do absolutely everything yourself” model. In mainstream IT, pretty much everything is moving to SaaS, and that is because the end result, not the mechanism to achieve it, is where people and businesses want to focus. We’re still 100% behind our more traditional, on-premises cloud platform, and our solutions for VMware and CDN too – but the Cloud.net option opens up cloud, even more, to the SaaS ethos.</p><p><strong>In many clouds, a VM is a VM is a VM, whether you’re using it for dev or production.&nbsp; In your marketplace, you’ve divided your offerings into three tiers (Essentials, Pro, Dev).&nbsp; Tell us a little what makes them different and why you take that approach.</strong></p><p>I would disagree – some VMs are more equal than others :) Some are hosted on infra with failover. Some use local storage. Some VMs have redundant storage, and SSD or better. Some have proper support. Some have SLAs that are more real than others, too.</p><p>When we launched the marketplace back in 2013 (we call it the OnApp Federation) we allowed our customers to set their own prices and feature sets, and so on, and funnily enough it was totally unworkable – both for customers who wanted to sell through it – how do I price this – and for customers who wanted to buy it – which of these zillion locations should I use?</p><p>So, we introduced the tiers approach a few years ago, set the wholesale pricing for each tier, and introduced a “cloud score” benchmark to help our everyone decide which tiers and locations suited them best. We benchmark each marketplace location, and insist on certain features for each tier.</p><p>The Dev tier is for “non-critical” workloads. SSD, failover, those things are not mandatory, and in general our Dev tier marketplace locations are lower performance/resilience – in other words, for lower cost VMs our customers want to sell. To be part of the Pro tier, you need failover (either SAN or our own software-defined storage). You need better performing storage too – SSD is mandatory, NVmE is preferred of course.</p><p>The new “Essentials” tier was launched with Cloud.net. That’s a little different: I think of it as the VPS tier, because it works on “blocks” of resource – a block is 1 core, 1GB, 25GB disk, 1TB bandwidth, $4/VM/mo – wholesale.</p><p>How our cloud provider customers choose to use the marketplace, and price their service to end users, that’s up to them – but the tiers and scoring system enable them to make an informed choice about the performance and features they’re delivering to their end users, their customers.</p><p><strong>Looking at the network map in your “<a href=\"https://Cloud.net/using-cloud-net-marketplace-compute/\" target=\"_blank\" rel=\"noopener\">Using Cloud.net with marketplace compute</a>” (about 2:25), it looks like you have network PoPs in North America and Europe, and then in some places I didn’t expect!&nbsp; Western Australia and Central America – is that right?&nbsp; Is Asia on your roadmap?</strong></p><p>That’s right. We have customers providing cloud services all over the world. Any customer can spin up a zone on the marketplace, and that’s available to any other customer who needs it. We have a CDN marketplace that works in the same way (but for our CDN platform, obviously).</p><p>For compute, we want to provide more APAC coverage too – typically we spin up locations when a customer asks for capacity in a city or country: then we reach out to our local cloud providers and make it happen. It’s a little quiet in Asia-Pacific at the moment because of Covid-19 – a lot of providers in that region have been struggling.</p><p><strong>How on earth did you guys get your hands an amazing domain like Cloud.net?</strong></p><p>That is also a secret :)</p><p><strong>Managing people from different cities in the same country can be challenging, just due to human nature, time zones, not having as much body language and in-person communication to read, etc.&nbsp; OnApp is truly global – Ukraine, Kuala Lampur, England, etc.&nbsp; How does your internal culture hold up with all those different backgrounds, time zones, and long distance relationships?</strong></p><p>We don’t really think of time zones and countries as barriers. We are global, we have people in the US, UK, UA, across the EU, and yes in Malaysia too – and customers, almost everywhere! Y’know, we talk, a LOT; pre-Covid we met a lot, and when we couldn’t do that, we talked even more – team get-togethers, online social things, dev talks, internal webinars, quizzes, virtual beers together, online Yoga, lots of stuff!</p><p>We have a great management team structure designed to give us a 360 degree view of what’s going on in the business (imaginatively, we call it 360) but probably even more important is the cascade of information beyond that. Being open and honest and respectful – that’s our culture, and I think those concepts are universal, and help everyone in our ecosystem – me, my immediate co-workers, the extended teams I work with, our partners, customers, everyone.</p><p><strong>When Ditlev says “we are going to add SAML and OAuth support to optimize security” or “granular access controls and CDN edge support is on our roadmap”, does a marketing guy really know what he’s talking about or is it like him saying “we’re going to increase the amount of dilithium in the warp core”?&nbsp; In other words, for a marketing position for a software company like OnApp, how tech savvy do you need to be?</strong></p><p>You should never arbitrarily increase the amount of dilithium in the warp core. It makes Scotty angry.</p><p>I’ve worked in b2b tech marketing, in one way or another, for longer than i care to remember. I’ve done PR, writing, consulting and marketing for ERP companies, accounting software companies, middleware companies, printer companies, phone companies, server companies, companies selling diggers, and drinks, and cats, and finance, and professional services…</p><p>I can hold my own at a high level, y’know, the elevator pitch, and also a little more as we get into detail… but I’m never going to be as tech-savvy as the people who actually conceive and build and support these products and services. A lot of marketing people try to sound like they <em>are </em>just as savvy, and that’s a mistake in my opinion.</p><p>Better to assume you know nothing and ask the right questions – even if they are stupid questions – as long as they are stupid questions based on market needs. What the hell is this? What problem does this solve? Why does someone need this? What do they do today? Why is this a better solution? Etc. After many years in b2b technology, I suppose I usually have some understanding, a place to start, but assuming nothing is usually a good idea.</p><p><strong>We have a lot of readers who work in the IT industry.&nbsp; What kind of candidates does OnApp look for?&nbsp; Beyond having the requisite technical and professional skills, what sets someone apart in your company’s eyes when you’re evaluating potential hires?</strong></p><p>I work with some scarily smart people, and that’s across all disciplines, from sales to engineering, from design to CDN to support. Even C-level too :) But smart isn’t everything – and actually we were talking about this recently in our management team, about how skills and experience are only relevant if they’re accompanied by the right attitude and approach.</p><p>You might be the foremost expert on X. but if you can’t work with us, you don’t fit with our ethos, you don’t collaborate well, you don’t think about our customers and what they need, every moment of every day… then, you’re probably not right for us.</p><p><strong>Anything else you’d like to add about OnApp or its products?</strong></p><p>I think I’ve said enough. Free trial at <a href=\"https://cloud.net\">Cloud.net</a>!&nbsp; More cloud at <a href=\"https://onapp.com\">onapp.com</a>! Thanks for the chance to answer your questions – if your readers have more, I’m <a href=\"mailto:steve.fenton@onapp.com\">steve.fenton@onapp.com</a>.</p><p><em>If you enjoyed this interview, be sure to check out the <a href=\"https://lowendbox.com/tag/interview/\" target=\"_blank\" rel=\"noopener\">rest of our interview series</a>!&nbsp; And if you’re interested in cloud.net, be sure to check out OnApp’s <a href=\"https://lowendbox.com/blog/do-you-sell-vps-at-scale-cloud-net-will-match-your-current-platform-pricing-if-they-can/\" target=\"_blank\" rel=\"noopener\">special offer</a> we posted on April 7th.</em></p><div class=\"relpost-thumb-wrapper\"><div class=\"relpost-thumb-container\"><h3>Related posts:</h3><div style=\"clear: both\"></div><div style=\"clear: both\"></div><div class=\"relpost-block-container\"><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/do-you-sell-vps-at-scale-cloud-net-will-match-your-current-platform-pricing-if-they-can/\"><div class=\"relpost-custom-block-single\" style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Do You Sell VPS at Scale? Cloud.net Will Match Your Current Platform Pricing (if they can!)\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2021/04/onapp-leb-deal-post-banner-march-21-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Do You Sell VPS at Scale? Cloud.net Will Match Your Current Platform Pricing (if they can!)</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/onapp-brings-cloud-hosting-into-the-saas-age-with-cloud-net/\"><div class=\"relpost-custom-block-single\" style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"OnApp Brings Cloud Hosting into the SaaS Age, with Cloud.net!\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2021/03/cloud-net-match-it-leb-300x250-1-150x150.gif) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">OnApp Brings Cloud Hosting into the SaaS Age, with Cloud.net!</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/industry-round-table-bitcoin-and-price-volatility/\"><div class=\"relpost-custom-block-single\" style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"BitCoin and Price Volatility: Industry Leaders Give Their Opinion!\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2021/01/LEB-Roundtable-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">BitCoin and Price Volatility: Industry Leaders Give Their Opinion!</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/solusio-vps-control-panel-initial-impressions-of-solus-io-should-you-switch/\"><div class=\"relpost-custom-block-single\" style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"LowEndBox review of SolusIO - Initial Impressions\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/10/solusio-review-150x150.jpg) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">SolusIO VPS Control Panel - Initial Impressions of Solus.io. Should You Switch?</div></div></a></div><div style=\"clear: both\"></div></div></div><div id=\"author-bio-box\" style=\"background: #f8f8f8; border-top: 2px solid #cccccc; border-bottom: 2px solid #cccccc; color: #333333\"><h3><a style=\"color: #555555;\" href=\"https://lowendbox.com/blog/author/raindog308/\" title=\"All posts by raindog308\" rel=\"author\">raindog308</a></h3><div class=\"bio-gravatar\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI3MCIgaGVpZ2h0PSI3MCIgdmlld0JveD0iMCAwIDcwIDcwIj48cmVjdCB3aWR0aD0iMTAwJSIgaGVpZ2h0PSIxMDAlIiBmaWxsPSIjY2ZkNGRiIi8+PC9zdmc+\" alt=\"\" data-src=\"https://secure.gravatar.com/avatar/4ce3b8640a70e05bd73ac25b8a37821c?s=70&amp;d=retro&amp;r=pg\" data-srcset=\"https://secure.gravatar.com/avatar/4ce3b8640a70e05bd73ac25b8a37821c?s=140&amp;d=retro&amp;r=pg 2x\" class=\"avatar avatar-70 photo\" height=\"70\" width=\"70\" loading=\"lazy\"></div><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"https://www.lowendtalk.com/profile/raindog308\" class=\"bio-icon bio-icon-website\"></a><p class=\"bio-description\">I'm Andrew, techno polymath and long-time LowEndTalk community Moderator. My technical interests include all things Unix, perl, python, shell scripting, and relational database systems. I enjoy writing technical articles here on LowEndBox to help people get more out of their VPSes.</p></div></div><div class=\"feedback\"></div></div>"}