{"id": "6693", "post": "<div class=\"post-6693 post type-post status-publish format-standard hentry category-editorial tag-editorial\" id=\"post-6693\"><h2 class=\"storytitle\"><a href=\"https://lowendbox.com/blog/editorial-review-of-free-web-hosting-panels/\" rel=\"bookmark\">Editorial: review of free web hosting panels</a></h2><div class=\"meta\"><img data-lazyloaded=\"1\" src=\"data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=\" data-src=\"/media/icons/tag_green.png\" alt=\"Tags: \"> <a href=\"https://lowendbox.com/tag/editorial/\" rel=\"tag\">editorial</a> <img data-lazyloaded=\"1\" src=\"data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=\" data-src=\"https://lowendbox.com/media/icons/calendar.png\" alt=\"Date/Time: \"> March 30, 2015 @ 1:00 pm, by Maarten Kossen</div><div class=\"storycontent tablelook\"><p>This week we’re featuring something special contributed by LowEndTalk member @jvnadr! It’s an extensive comparison of some of the most popular or well-known free web hosting panels.&nbsp; It’d like to thank him for this very valuable contribution!<b><br>\n</b></p><hr><p>This review reflects only my personal opinions. I divided panels in two categories: those I use and have tested extremely, and those I used for little time and/or tested them. So, in the second category, the review will be shorter and “lighter” ;-)</p><p>Also, this review is from an admin and end user perspective. Not from security side. I am not an expert of coding or developing and I cannot say for sure if a panel is secure enough.</p><p>On the other hand, I have been using and still use most of those panels myself for a big variety of purposes, so, I have some basic thoughts about security and I definitely have my strong opinion about stability, ease of use, resources, functionality and bugs I may be had to deal when using them.</p><p>Do not hang me for any mistakes, especially language mistakes you may find. I am not a native English speaker and even if you say when you don’t understand something that “it’s all greek for you”, for me, Greek is my native language :-P</p><p>A last thing: I am not affiliated with any of those panels, nor any hosting company or provider. This extended review has been written just for fun and as a contribution to the members of this community. Besides, I’m just an amateur but enthusiast vps admin, something I learned as a hobby but also as a need to control my hosting and internet needs of my main business.</p><p><span id=\"more-6693\"></span></p><p><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI3OTUiIGhlaWdodD0iNDU2IiB2aWV3Qm94PSIwIDAgNzk1IDQ1NiI+PHJlY3Qgd2lkdGg9IjEwMCUiIGhlaWdodD0iMTAwJSIgZmlsbD0iI2NmZDRkYiIvPjwvc3ZnPg==\" loading=\"lazy\" data-src=\"http://s29.postimg.org/n4yo2lc5z/hostingcontrolpanels.jpg\" alt=\"\" width=\"795\" height=\"456\" border=\"0\"></p><p>† (not security but function bugs)</p><p>†† (install scripts)</p><p>††† (ISPConfig is not actually a stand-alone control panel but more of a GUI, so, it can interact with almost all custom software a web hosting has)</p><p>†††† (Ajenti has not been tested from me for long enough to have a valid opinion about stability and bugs)</p><h2>WEBMIN / VIRTUALMIN / USERMIN</h2><p>Three products in one!</p><p>Webmin is the free web server control panel, with lot of features. It can almost do anything you can with command line and some more that you can’t! It will show you the command line output when you do a task, and has a ton of options to configure your server.</p><p>Virtualmin is the hosting control panel. As in webmin, it has a ton of options, most of them handled as a gui for command line tasks. Virtualmin, in addition, has 2 versions, one free and the PRO (webmin is always free). Virtualmin is more of a complete commercial product for reselling hosting and with great support, but functionality is basically covered by the free version.</p><p>Webmin/virtualmin comes with Usermin, that is basically a mail interface.</p><h3>FEATURES</h3><p>In fact, there is almost anything that you cannot do via Webmin/Virtualmin, even the most complex tasks.</p><p>In Webmin, you can manage networking, running processes, cron jobs, authentication, ssl, web server and all the functions of it, sql/php/ftp/ssh/mail etc., users, user privileges, ssh access, even hardware control.</p><p>In Virtualmin, you can create and handle users, domains, dns zones, php versions, virus and spam detection and all that not with some simple tasks, but with an extremely large base of options that is for experts only.</p><p>Usermin: You can use it instead of Roundcube or Squirelmain that are installed as an optional script.</p><h3>EASE OF USE</h3><p>Although it is easier to do some expert tasks from this GUI than using console, you must have in most of cases a good knowledge of Linux and server administrating because it is not just an interface with basic tasks.</p><p>Webmin/Virtualmin is not easy to use. A noobie will be able to create a new user and host a new website with the default options, but soon enough he will find himself stuck even in small things that need manual configuration (e.g. the default size of the mailbox or the default bandwidth allowed).</p><p>Even experienced users with great knowledge of Linux administrating, will have to learn how to use this Control Panel and all the options, to avoid tuning things by hand in a console. In fact, if you decide to use Webmin/Virtualmin, you will have to use the interface for most of tasks and be sure that a manual configuration in the command line will not “break” panel’s configuration.</p><p>On the other hand, day by day, learning this panel, will make your life easier!</p><p>Be careful:</p><p>This panel is not suitable IMHO for reselling accounts. You can do it, but it is for experts only, not for noobies/friends/random users you may have… If you hane no knowledge to manage servers or working with linux and starting to change parameters, you can even brake your installation…</p><h3>INSTALLATION</h3><p>There are several ways to install webmin/virtualmin, but the best and quicker is the automatic installation script of Virtualmin. Maybe the easiest installation in all compared panels!</p><p>Virtualmin is in fact something like a Webmin add-on. It sits as optional element and you can do a manual installation after webmin is installed itself.</p><p>So, the automatic script that works in most flavors of Linux and in FreeBSD (and not only: there are install scripts for Solaris, too!).</p><p><a href=\"http://software.virtualmin.com/gpl/scripts/install.sh\">http://software.virtualmin.com/gpl/scripts/install.sh</a></p><p>You just have to prepare your server with securing and update it. All other things will be installed automatically!</p><p>You will log in for the first time with your sudo ssh credentials (root or else) and you will see a post-script installation wizard using your browser that will tune clamav, sql, memory usage etc. Then, you can do any config you want in your server thru Webmin/Virtualmin itself!</p><p>Another way is to install only webmin and then, install in the top of it virtualmin as an add-on.</p><h3>EXTRAS</h3><p>You can install only webmin for handling your server and common tasks (like cron jobs, port config, ssl encryption or monitoring) and install another hosting panel of your choice (Cpanel, vestacp etc.). Just be careful to not use Webmin to configure things that are being handled from the third party hosting panel, too.</p><h3>CONCLUSION</h3><p>It is a great panel, that can handle from the easiest and basic tasks to the most complex ones. I use it in a lot of my personal vps and servers, especially when I want to have full control and do some more complex stuff or custom configurations.</p><p>But I do not choose it in vps that I want to have just some web hosting there, it is like you buy a Ferrari to use it driving from your home to the local market, 300m away…</p><h2>ISPCONFIG</h2><h3>FEATURES</h3><p>One of the best Web Hosting Panels out there, except… it is not really a hosting panel! Seriously, now, it is a GUI to control all the different elements<br>\nthat are used for a wide range of hosting.</p><p>The big difference with most of the rest panels, is that you first have to prepare the server yourself. And, when I say prepare, I mean install all elements that you need for hosting: Apache or Nginx, Mysql or MariaDB (not official, though). Php, whatever you like. Clamav, spamassassign or any antivirus and antispam system you want. Squirrel mail, Roundcube or whatever you want for webmail. Ruby, proftp, courier, postfix, mailman, fail2ban… The list is almost endless.</p><p>When you install all of those things and configure them, then, on the top of that, you install ISPconfig. Like magix, your new hosting panel can control all of those elements easily and with a very good interface.</p><p>So, features of this control panel is all the features that you put in your server. Like Webmin, you can control most of the server tasks and monitors (there are fewer options but the options you will need from a GUI for the 99,5% of the cases, are there!). The difference is that it is much more easy and understandable to do it. And much more quicker, too.</p><p>This panel is sweet also for reselling hosting. Your clients will find the interface easy enough and clean, although it is a bit outdated for the eye…</p><p>There is even an option to setup a cluster of servers and control all of them with the vserver option from just one ispconfig installation.</p><p>There is an easy package creation for resellers and end users, so, you can fit this panel even to a legal hosting business.</p><p>And, more of that, you can create and control ssh access, web traffic, control even prefixes for auto ftp/sql etc. account creation.</p><p>It is translated to 20 languages,</p><h3>EASE OF USE</h3><p>With some basic tabs (server managing, client managing, dns, mail, monitoring, sites and misc tools) there are tons of options under each tab. Three different roles (admin, reseller and end user), so, all you may have with Cpanel, are there for ISPconfig.</p><p>It is not an one-click-job panel, you cannot just create a user and automatically have dns zone, mail, ftp etc. Bat an end user has to create separate each different element for a complete hosting solution. This perspective has its “goods and bads”. It is not so quick and simple like Cpanel or VestaCP, but it is more configurable and controlled.</p><p>You have to do some manual configs in ftp and mail software you will use, to achieve the best possible security level or prevent spaming, but IMHO this is good because this way you are sure that all will work as they should.</p><p>It has a good balance between the needs than an expert professional has, and the needs of a noobie that just want an easy panel to setup some websites with some more features that just adding their domain. Not all automated, but not complex as console or Webmin is. And it is not difficult to use it, if the noobie spends a couple of hours to learn the basics.</p><h3>INSTALLATION</h3><p>This is the best part. The instructions. Building a hosting server or vps from scratch, is tricky in most cases. Especially, when you have to do it all manually. The difference here is that they have a huge base of step-by-step tutorials. And when I say, step by step, it is extremely detailed, from installing your living flavor of Linux and configuring the network, until configuring fail2ban and ruby for rails!</p><p>And when I say “a huge base”, there are more than 50 (!) different tutorials (always step by step) for every different configuration you may want. You want a combination of Ubuntu, Apache, Proftp, Mysql and courier? You’ve got it. You want Debian with nginx, bind, dovecot? You’ve got it. You want multiple versions of php? There are tutorials for that. Just follow all the needed steps to configure your server. You want to skip bind or mail server? No problem. Just skip those chapters and continue with next.</p><p>In fact, this database is perfect for setup a server, even if you don’t complete with ISPconfig. Just search instructions for “the perfect server” with ISPconfig in howtoforge.com and you will see what I mean.</p><h3>EXTRAS</h3><p>For commercial use, there is a whmcs module for a small fee, to automate hosting thru ISPconfig. They have a billing add on, a monitoring add on and some more, for small fees.</p><h3>CONCLUSION</h3><p>I think that this is the most balanced free hosting panel nowdays. It is secure, because you install manually and you secure manually all elements and because the panel itself is secure and stable enough. If you want a very easy and quick hosting panel for your server, maybe ISPconfig is not your case. It does not have a one-click installation script, but need work to prepare it. The prize is that when you complete installation and tuning, your life will be easier if you want an advanced panel to use and do not want the mess of the interface or the million of rather useless options that webmin has (useless options for the 99,999% of the tasks a webmaster want to control to his server).</p><p>For my main servers, this is my choice.</p><h2>VESTACP</h2><h3>FEATURES</h3><p>It does his job. I think that would be a good tagline for this panel. You will not find a ton of options here, like in Webmin or ISPconfig, but this is the beauty of this piece of software. You want an easy to use, automatic and secure web hosting panel to host your sites? You have it. You want some reseller options and then, give access to end users? It is easy to do, easy to config your packages, quick and clean! It lacks on advanced configuration tasks (some of them can be done using scripts, but the documentation is not great and it is not very friendly for the average user), but most of the users will find out that the options VestaCP gives to them is enough.</p><p>Another great feature of VestaCP is that it can interact with WHMCS, there is a module for this.</p><p>VestaCP has a feature that you don’t see in other panels, and it is very good: it has a Nginx layer on the top of apache, that runs the panel and caches things. This can speed up things in complex sites, but some times can cause minor issues that has to be solved with manual configuration.</p><p>Finally, it support Ubuntu, Debian, CentOS and RHEL.</p><h3>EASE OF USE</h3><p>IMO, developer designed this Panel having in mind easiness for the user. The interface is clean, not complex, nice to your eye, quick (you can do most of the jobs with 2-3 clicks). Some advanced tasks can be done by using ssh.</p><h3>INSTALLATION</h3><p>Very easy, in most of the cases. After a distro update/upgrade, you hust download the installation script and… voila!</p><p>I found in some cases that the automatic script was broken, although it was not a problem caused by the script but by a poorly configured distro template from the vps provider.</p><h3>CONCLUSION</h3><p>Although VestaCP is very young in age (less than 2 years, if I recall well), it started early to behave as a mature panel! Easy to install, secure enough, with clean interface, easy to use and with a lot of lovers here in LET/LEB community.</p><p>It is young, though, and there are things that can be improved or added to the features, but it is for sure one of the best free panels out there.</p><p>VestaCP has its own configuration, so, if you want to make custom configs in your server after installation, make sure that they will not break your hosting panel or that your configs will be working on top of the previous ones.</p><p>I use it for some sites that I want to have a quick, easy and lightweight system to control them, especially when I want to give access to owners of the sites that has not technical skills.</p><p>Recommended.</p><h2>SENTORA</h2><h3>FEATURES</h3><p>All you want for basic and intermediate tasks is there. It installs all the needed stuff for a hosting server and has a nice and clean interface. There are a lot of configurable options, but there are not a lot of really advanced controls there, you will have to do them using console.</p><p>If you want a web server combined with a mail server, this panel will do the job quickly and easily.</p><p>Very lightweight (I used it on a 128MB vps with Joomla installed on it and it still worked fine!).</p><h3>EASE OF USE</h3><p>Very easy to use. Especially for common tasks. But it has its own logic of doing some stuff. If you play with it you will learn it in a couple of hours and then, configuring the panel and your hosting needs will be a toy.</p><h3>INSTALLATION</h3><p>Just one click installation, using curl. Their script will install all the needed staff (apache, mysql, mail, ftp etc.) without you having to worry about anything. The con is that the installation script can only work on Ubuntu 12.04 and 14.03 and Centos 6.4. There is a new installer for freebsd but I have never tested it. You can install sentora/zpanel to other flavors but with manual installation, if you are brave!</p><h3>EXTRAS</h3><p>Lot of extras. A big community that contributes with add ons. You can find almost anything there: from free billing modules to shoutcast module (for automatic creations of shoutcast slots) and from zantastico (a module for automatic installation of scripts like joomla or wordpress) to advanced monitoring and login modules.</p><p>There are more than 100 different modules you can chose for free from their community forum.</p><h3>CONCLUSION</h3><p>This panel would be definitely my main choice for an easy to use, with all the basic and intermediate tasks I want from a panel. But, unfortunately, it isn’t. The reason? There is a lot of criticism here in LET/LEB community, from people they claim that this panel is e security hole. Some of the “haters”are not only respected members of this community, but people (mostly providers) that I personally give an advanced value to their opinion. And some of them are saying that, despite all software maybe is vulnerable some time, dev team of Sentora do not listen to warnings and claim that they know better and that their product is very secure. I am not a coder or a security expert, so I cannot guarantee you if it is indeed garbage from the perspective of security, or if all “haters” do not know what they are saying. But, some respected providers saying that a big percent of their client vps that has been compromised, has been proved that they had been wearing Sentora.</p><p>On the other hand, Sentora devs and supporters are claiming that there was some security issues in the past but their product now is mature enough and safer from most of hosting panels, even commercial. And they are calling for challenge.</p><p>So, if you decide to give this panel a shot, be careful from the prespective of security.</p><p>If you believe or find out that is secure enough, the rest of the conclusion about this panel is positive. User friendly, with lot of free addons, very good interface and very stable.</p><h2>KLOXO – MR</h2><h3>FEATURES</h3><p>Full of features. You can find anything you will ever need there and much more, but in a nice GUI (and I mean the new 7.x.x version GUI). This is good and bad. Good because an average user can manage everything that will need from an average web hosting panel there, bud because some time the interface is a bit confusing especially if you did ever have used Kloxo or Kloxo-MR in the past.</p><p>It is not so lightweight but it can run absolutely fine in a 512MB ram and over.</p><p>A great aspect is the full control over php versions.</p><p>There are tons of built it webmail GUI you can use (Afterlogic Lite, Telaen, Squirrelmail, Roundcube, Rainloop – try afterlogic, it is beautiful) and there are some must add-ons that are installed automatically as ClamAV, Spamassassin or Bogofilter, RK Hunter.</p><p>You can change automatically from apache to lighttpd or nginx with just a restart of the services, and use multiple php flavors running simultaneously!</p><h3>EASE OF USE</h3><p>It is not an easy to use panel. Not so complicated or for experienced users like Virtualmin/Webmin, but harder to use from ISP Config.</p><h3>INSTALLATION</h3><p>It is much more easy than ISPC to do the initial installation (just a script), but then, you have to dedicate some time to configure the panel to be fully working. It is working only on Centos/RHLE, so this may be limit some potential users.</p><h3>EXTRAS</h3><p>One of its great aspects is that there are a lot of extras you can use with. For billing it can be integraded with WHMCS, HostBill, Blesta and more, you can use not only Apache but a variety of web servers (Nginx, Nginx-Proxy and Lighttpd-proxy, Hiawatha and Httpd 2.4, the author says that soon will be available Squid, Varnish, ATS).</p><h3>CONCLUSION</h3><p>This is a good panel, but weird some times, especially in your initial configuration. It is not simple to use it – at least, not as simple as options like vesta or froxlor. But, you have a full web hosting panel that can be flexible for all of your needs.</p><p>On the downside, it is maintained only from one single person (Mustafa Ramadhan – that’s the MR in the name!) and it is based on the “full of holes” original Kloxo, although Mustafa claims that there are tons of bug – fixes and security – fixes from the initial panel from LXCenter.</p><p>There were from time to time some security concerns in hosting forums, but I have never seen any very serious accusation against Kloxo-MR on those conversations.</p><p>There is a fairly active community for helping other users, but the developing is still one-man-show (Mustafa is doing his best). At last, mr. Ramadhan is the only free web panel creator that is active also in LowEndTalk! So, this is a plus for us!</p><hr><p>End of part one!</p><p>Soon I will post some light reviews for EHCP, i-MSCP, Froxlor and Ajenti.</p><p class=\"dpsp-share-text\"></p><div id=\"dpsp-content-bottom\" class=\"dpsp-content-wrapper dpsp-shape-rounded dpsp-column-auto dpsp-has-spacing dpsp-no-labels dpsp-show-on-mobile dpsp-button-style-1 dpsp-has-icon-background dpsp-has-button-background dpsp-show-total-share-count dpsp-show-total-share-count-after\"><ul class=\"dpsp-networks-btns-wrapper dpsp-networks-btns-content dpsp-has-button-icon-animation\"><li><a rel=\"nofollow\" href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flowendbox.com%2Fblog%2Feditorial-review-of-free-web-hosting-panels%2F&amp;t=Editorial%3A%20review%20of%20free%20web%20hosting%20panels\" class=\"dpsp-network-btn dpsp-facebook dpsp-no-label dpsp-first\" title=\"Share on Facebook\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://twitter.com/intent/tweet?text=Editorial%3A%20review%20of%20free%20web%20hosting%20panels&amp;url=https%3A%2F%2Flowendbox.com%2Fblog%2Feditorial-review-of-free-web-hosting-panels%2F&amp;via=LowEndNetwork\" class=\"dpsp-network-btn dpsp-twitter dpsp-no-label\" title=\"Share on Twitter\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://www.linkedin.com/shareArticle?url=https%3A%2F%2Flowendbox.com%2Fblog%2Feditorial-review-of-free-web-hosting-panels%2F&amp;title=Editorial%3A%20review%20of%20free%20web%20hosting%20panels&amp;mini=true\" class=\"dpsp-network-btn dpsp-linkedin dpsp-no-label dpsp-last\" title=\"Share on LinkedIn\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li></ul><div class=\"dpsp-total-share-wrapper\"><span class=\"dpsp-icon-total-share\"></span><span class=\"dpsp-total-share-count\">2</span><span>shares</span></div></div><div id=\"author-bio-box\" style=\"background: #f8f8f8; border-top: 2px solid #cccccc; border-bottom: 2px solid #cccccc; color: #333333\"><h3><a style=\"color: #555555;\" href=\"https://lowendbox.com/blog/author/mpkossen/\" title=\"All posts by Maarten Kossen\" rel=\"author\">Maarten Kossen</a></h3><div class=\"bio-gravatar\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI3MCIgaGVpZ2h0PSI3MCIgdmlld0JveD0iMCAwIDcwIDcwIj48cmVjdCB3aWR0aD0iMTAwJSIgaGVpZ2h0PSIxMDAlIiBmaWxsPSIjY2ZkNGRiIi8+PC9zdmc+\" alt=\"\" data-src=\"https://secure.gravatar.com/avatar/67eeccea1ee5a1ce2f93adc061f69a5f?s=70&amp;d=retro&amp;r=pg\" data-srcset=\"https://secure.gravatar.com/avatar/67eeccea1ee5a1ce2f93adc061f69a5f?s=140&amp;d=retro&amp;r=pg 2x\" class=\"avatar avatar-70 photo\" height=\"70\" width=\"70\" loading=\"lazy\"></div><p class=\"bio-description\">Maarten Kossen was the administrator of LowEndBox from 2013 to 2015, and brought many ideas and improvements to the website during his leadership. Today he is member of our community and LowEndTalk.</p></div></div><div class=\"feedback\"></div></div>"}