{"id": "27885", "post": "<div class=\"post-27885 post type-post status-publish format-standard hentry category-interview tag-acronis tag-backup tag-burst-net tag-msp tag-odoo tag-soladrive tag-volumedrive\" id=\"post-27885\"><h2 class=\"storytitle\"><a href=\"https://lowendbox.com/blog/excellence-at-every-layer-of-the-stack-interview-with-john-barker-founder-of-soladrive/\" rel=\"bookmark\">Excellence at Every Layer of the Stack: Interview with John Barker, Founder of SolaDrive</a></h2><div class=\"meta\"><img data-lazyloaded=\"1\" src=\"/media/icons/tag_green.png\" data-src=\"/media/icons/tag_green.png\" width=\"16\" height=\"16\" alt=\"Tags: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> <a href=\"https://lowendbox.com/tag/acronis/\" rel=\"tag\">acronis</a>, <a href=\"https://lowendbox.com/tag/backup/\" rel=\"tag\">backup</a>, <a href=\"https://lowendbox.com/tag/burst-net/\" rel=\"tag\">burst.net</a>, <a href=\"https://lowendbox.com/tag/msp/\" rel=\"tag\">msp</a>, <a href=\"https://lowendbox.com/tag/odoo/\" rel=\"tag\">odoo</a>, <a href=\"https://lowendbox.com/tag/soladrive/\" rel=\"tag\">soladrive</a>, <a href=\"https://lowendbox.com/tag/volumedrive/\" rel=\"tag\">volumedrive</a> <img data-lazyloaded=\"1\" src=\"https://lowendbox.com/media/icons/calendar.png\" data-src=\"https://lowendbox.com/media/icons/calendar.png\" width=\"16\" height=\"16\" alt=\"Date/Time: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> August 1, 2021 @ 12:00 am, by raindog308</div><div class=\"storycontent tablelook\"><p><img data-lazyloaded=\"1\" src=\"https://lowendbox.com/wp-content/uploads/2021/07/soladrive.png\" loading=\"lazy\" class=\"alignright size-full wp-image-27886 litespeed-loaded\" data-src=\"https://lowendbox.com/wp-content/uploads/2021/07/soladrive.png\" alt=\"SolaDrive Logo\" width=\"300\" height=\"300\" align=\"right\" hspace=\"20\" data-srcset=\"https://lowendbox.com/wp-content/uploads/2021/07/soladrive.png 300w, https://lowendbox.com/wp-content/uploads/2021/07/soladrive-150x150.png 150w\" data-sizes=\"(max-width: 300px) 100vw, 300px\" sizes=\"(max-width: 300px) 100vw, 300px\" srcset=\"https://lowendbox.com/wp-content/uploads/2021/07/soladrive.png 300w, https://lowendbox.com/wp-content/uploads/2021/07/soladrive-150x150.png 150w\" data-was-processed=\"true\"><br>\n<em>Our <a href=\"https://lowendbox.com/category/interview/\" target=\"_blank\" rel=\"noopener\" aria-label=\"LowEndBox Interview Series\">interview series</a> has featured a lot of industry leaders and we continue today by talking with John Barker, Founder and President of Operations of <a href=\"https://www.soladrive.com/\" target=\"_blank\" rel=\"noopener\" aria-label=\"SolaDrive\">SolaDrive</a>, an enterprise managed solutions provider (MSP).&nbsp; They offer a wide variety of PaaS/SaaS solutions – everything from infrastructure basics like backups to heart-of-the-enterprise solutions like Odoo ERP…and they offer managed VPSes as well!&nbsp; (See below for a code).&nbsp; </em></p><p><em>As you read on you’ll recognize a few famous names from yesteryear: Volume Drive and burst.net, and learn how SolaDrive recovered from issues they experience with them.</em></p><p><em>Enjoy this look inside a leading MSP provider as John talks about his background, how SolaDrive has grown, and how he sees the industry developing in the future.</em></p><p><strong>Tell me about your background and SolaDrive’s history?</strong></p><p>First of all, I would like to thank LowEndBox for this interview opportunity. I have been in the hosting industry in various forms since 2005, about 16 years now. I started in my teen years developing gaming websites for Rise of Nations and Counter Strike Source while also managing multiple servers for these games. This piqued my interest in server management which led to my later involvement in web hosting.</p><p>This eventually transitioned into creating SolaDrive in 2009 that I have been working at ever since. SolaDrive is a managed service provider (MSP) offering SaaS and PaaS solutions. We offer a wide variety of services from managed VPS and dedicated servers, R1Soft and Acronis backup server hosting, high-end load balancing and HA (high availability) cloud hosting, to managed Odoo ERP hosting solutions. Since our start we have grown to multiple locations in multiple countries. We have no plans of leaving the hosting sector or making any changes to the core services we provide, only adapting to the ever-changing hosting industry and technology driven world.</p><p><strong><img data-lazyloaded=\"1\" src=\"https://lowendbox.com/wp-content/uploads/2021/07/soladrive_john_barker.png\" loading=\"lazy\" class=\"alignleft size-full wp-image-27888 litespeed-loaded\" data-src=\"https://lowendbox.com/wp-content/uploads/2021/07/soladrive_john_barker.png\" alt=\"John Barker\" width=\"400\" height=\"504\" align=\"left\" hspace=\"20\" data-srcset=\"https://lowendbox.com/wp-content/uploads/2021/07/soladrive_john_barker.png 400w, https://lowendbox.com/wp-content/uploads/2021/07/soladrive_john_barker-238x300.png 238w\" data-sizes=\"(max-width: 400px) 100vw, 400px\" sizes=\"(max-width: 400px) 100vw, 400px\" srcset=\"https://lowendbox.com/wp-content/uploads/2021/07/soladrive_john_barker.png 400w, https://lowendbox.com/wp-content/uploads/2021/07/soladrive_john_barker-238x300.png 238w\" data-was-processed=\"true\">The market is evolving rapidly, what are you and SolaDrive doing to stay relevant?</strong></p><p>That is a great question, and one we ask ourselves regularly to ensure we’re evaluating the products and services we offer to meet the current and future demand of hosting. While VPS and Dedicated Servers have been around for many decades, and in our opinion many more, we have branched out to offering other products. Since our beginning in 2009 we have added products such as managed backup services, Disaster Recovery as a Service (DRaaS) solutions, ERP hosting, Advanced Server Setups and Architecture Consultancy, Colocation Services, and specialization in WordPress &amp; Magento hosting. We plan to add even more services in the future as technology and hosting evolves.</p><p>Staying relevant and offering products or services that are in demand can sometimes be tough since technology is constantly changing and improving. In the last two years we have taken up a niche market of ERP (Enterprise Resource Planning) and CRM (Customer Resource Management) software hosting. While we mainly focus on managed Odoo hosting, advanced server setups, and hosting consultancy for Odoo, we also provide support and development for Odoo which we have found to be a successful new path for us. One of the silver linings from the COVID pandemic was a surge in demand for ERP hosting as small businesses were forced to close. Those who were able to adapt looked to move their stores and shops to online ecommerce platforms like Odoo, Magento, ERPnext and many others.</p><p><a href=\"https://www.soladrive.com/support/link.php?id=14\" target=\"_blank\" rel=\"noopener\" aria-label=\"SolaDrive Offer\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI2MDAiIGhlaWdodD0iNzMiIHZpZXdCb3g9IjAgMCA2MDAgNzMiPjxyZWN0IHdpZHRoPSIxMDAlIiBoZWlnaHQ9IjEwMCUiIGZpbGw9IiNjZmQ0ZGIiLz48L3N2Zz4=\" loading=\"lazy\" class=\"size-full wp-image-27887 aligncenter\" data-src=\"https://lowendbox.com/wp-content/uploads/2021/07/soladrive_banner.png\" alt=\"SolaDrive Banner\" width=\"600\" height=\"73\" align=\"center\" hspace=\"20\" data-srcset=\"https://lowendbox.com/wp-content/uploads/2021/07/soladrive_banner.png 600w, https://lowendbox.com/wp-content/uploads/2021/07/soladrive_banner-300x37.png 300w\" data-sizes=\"(max-width: 600px) 100vw, 600px\"></a></p><p><span id=\"more-27885\"></span></p><p><strong>What would you tell someone looking to start a hosting company today? What advice would you offer?</strong></p><p>Let me start by telling a few stories where this actually happened. When I first started providing hosting as a hobby many years ago and saw early success, people would sometimes ask if I could help them start up their own hosting venture. I ended up helping two people get started. From the initial website, billing software, support desk, acquiring a support team, to even their first clients. When I eventually transitioned to giving them the reins, they quickly backed off and found it “wasn’t for them” or “took too much of their time.”</p><p>Maybe I over simplified what it took to run your own hosting operation or made it sound easier than it really is.</p><p>So, if someone were to come to me today looking to start a hosting company, I would tell them how much time, money and dedication it takes to get one started. It’s not easy, and some nights you will wonder why you chose this path. The market is oversaturated making it even more difficult to compete against competitors offering the same services. You need to have a niche product or offer extremely great, next-level service to succeed and survive. But if you enjoy this kind of work and you stick through the struggles to find success, you will find it extremely rewarding.</p><p><strong>What is Odoo and what made you decide to start offering it as a service?</strong></p><p>Odoo is a business management software suite that covers your customer relationship management (CRM) and enterprise resource planning (ERP) needs for small to medium sized businesses. <a href=\"https://www.odoo.com/\">Odoo</a> is an open-source solution featuring more than thirty default modules, from inventory and warehouse management to accounting and billing. All modules interact with one another to transfer business information, keep everyone on the same page and maximize efficiency.</p><p>With Odoo it lets you review your inventory, monitor sales efforts, manage shipments and manufacturing efforts, review employee activity and productivity, and much more. The system also automates your accounting work. Odoo supports thousands of third-party modules and plug-ins and can also integrate with QuickBooks, Shopify, OpenCart, Prestashop, Magento and many other third-party systems. With Odoo you can manage all aspects of your business from one web-based software control panel. So, providing hosting services and support for this software that thousands of companies use everyday made sense to us.</p><p><strong>Where do you think the future takes the hosting industry?</strong></p><p>If I were a betting man, I would guess that Cloud Hosting will be the future due to its high-availability architecture and scalability. At the same time, I also believe that there will always be a place for VPS and bare-metal servers. While many companies have or are planning to transition to the “Cloud”, we have also seen many make the move to virtual servers and dedicated services due to cost, lack of flexibility and performance issues. So, I wouldn’t write off the original hosting technologies and methods quite yet.</p><p><strong>Tell me about a couple things in your professional history you wish you had a “do-over” on? What did you learn from them?</strong></p><p>I have made my fair share of business mistakes, more than I would probably like to admit. But they also helped me learn what not to do and how to avoid them in the future, along with ways to find success in this dog-eat-dog hosting industry. Whether it be a failed marketing strategy, handling of technical issues, or working with customers that were done less than stellar. It’s these mistakes that taught me how to improve the service we provide at SolaDrive.</p><p>If I had to recall the worst mistakes I’ve made, it would be in the beginning days of SolaDrive when I had chosen sub-par infrastructure providers for our hardware and server’s when finding good locations to offer our services. I first started with Volume Drive, which was a budget friendly provider that helped me get SolaDrive started when I didn’t have aggressive startup funds. Unfortunately, we were only with them a few years before they went belly up literally overnight. They actually had rented two U-Haul trucks and moved our equipment along with many other people’s to a random office building miles away from the original datacenter. It turned out they had stopped paying their bills with their facility provider (Burst.net). Fortunately, they had left behind about half of our servers and various other companies’ hardware that rented their own space/racks. In the frantic state of many clients being down, I made the quick decision of getting things back online with the actual data center provider Burst.net. At the time this seemed like a great decision by cutting out the middle-man, Volume Drive and hosting all of our servers with Burst.net themselves who were at the time a Fortune 500 fastest growing company.</p><p>Over that week I physically had to recover our remaining servers from Volume Drive and get them moved back to the original datacenter, Burst.net. After 6-7 days of headaches and a lot of late nights, we finally had everyone back online!</p><p>It didn’t take long though to realize Burst.net was also a sinking ship. Only a year later they had announced they were going out of business and started dropping their clients except for leased space clients. None-the-less, we saw the flash of horrors we had from Volume Drive repeat in our heads and were able to get out while they were still afloat. While migrating from datacenter to datacenter is never easy and usually involves significant downtime, we were able to plan all the details of this migration and execute with efficient success, unlike before. We ended up deciding to move all of our equipment to ColoCrossing where we have been ever since and very happy with the level of service all around. Since these incidents we have expanded exponentially to multiple datacenters and now offer services in 5 different locations worldwide.</p><p>We lost a lot of our customers due to these two incidents and regret ever choosing providers mainly based on budget. While I am very happy with the success SolaDrive has had, I sometimes reflect on these mistakes and wonder where we would be today if we had not suffered such a rocky start.</p><p><strong>Tell me about your top two successes in business?</strong></p><p>It’s not easy to gauge success when self-reflecting on what is considered achievements, when for the most part it can be subjective to each person’s view of success.</p><p>That being said, in my opinion one of the first things that comes to mind as a success has been hiring the right people, retaining them and having them be part of the growth of SolaDrive. In this line of work, the turnover rate of employees can sometimes be quite short. So being able to keep valued staff members who have helped SolaDrive mature to where it is today is an understatement to our growth. Without these skilled, reliable and ethically driven, creative thinkers I am not sure we would be at the same place.</p><p>I would contribute another success in business as my passion for technology and business. What was once a hobby for me, turned into a business that I thoroughly enjoy doing each and every day. I think if you can take something you love to do, and make a living out of it, then you’re setting yourself up for success. And in the world of technology and hosting where things are constantly changing, you have to put the time in and love what you do to stay successful or you’ll get burnt out quickly.</p><p><strong>What do you enjoy most about your role? What do you find most difficult?</strong></p><p>I would say the most enjoyable part of my job is working with customers on new business ventures that focus on the technical side. From the first discussion of a new setup to the final stages of implementation, I find those are the most interesting as you work with the customer to deliver a solution that meets or exceeds their expectations.</p><p>The most difficult part is similar to above, but when these solutions, usually the complex multi-server setups, don’t work as expected. While it’s not frequent, it can then take an excruciating amount of time and effort to find the cause of the issue and fix it. Usually, the result of a custom software or application.</p><p>Another difficult part of my role is to find new ways to bring customers in and then retain them with quality service and support. This can be a multi-faceted task as it includes marketing strategies, pre-sales and post-sales discussions, and then the technical side of getting services setup and delegated to the proper staff.</p><p><strong>Both personally and professionally, what guiding principles ground you?</strong></p><p>Be humble, have good morals/ethics, and stay determined.</p><p><strong>Give us some details on new and exciting things you are working on?</strong></p><p>One of this year’s goals and projects I am working on are switching away from the aging VPS software SolusVM and moving our VPS customers to a new KVM based platform, either Virtualizor or Solus.io. This isn’t an easy task however as most of our customers currently are on our XEN nodes. Eventually we will need to convert these customers to KVM and then transition them to this new management software. From our initial tests on just a few VPS, it looks like it will wind up taking us a lot of time and effort to complete.</p><p>Another project we hope to get to this year is automating the setup of our dedicated servers. Most of the time we have to customize each server setup based on each customer’s hardware choices so this wouldn’t normally be possible. What we plan to do is offer a few popular standard server configuration choices that wouldn’t be customizable, but would be automatically set up in under 10 minutes. It wouldn’t stop there though, customers with existing dedicated servers would have the ability to automate the reinstallation of their server with a click of a button. This is definitely a feature I think will be the most beneficial to us since our staff will no longer need to spend time manually installing or reinstalling servers.</p><p><strong>Why should customers trust you and your business?</strong></p><p>I believe customers can trust us because we have a proven track record of over 10 years providing quality services with truly helpful and honest customer service. I think that by treating each customer with exceptional, personable support that they will be satisfied with our service and find no reason to elsewhere. We have found this usually results in these satisfied customers telling their friends, colleagues and family which turn into new customers. It may sound cliché, but I honestly think the key to customers trusting you and being satisfied is to just provide them with the level of support and service you’d expect to receive.</p><p><strong>Final thoughts and anything you would like to add?</strong></p><p>I really appreciate having the opportunity to participate in this interview. It was really valuable to take the time to reflect on SolaDrive, from where we started to our biggest successes and lowest lows. I feel privileged to share my thoughts and experiences over the years with the LowEndBox community. It’s not every day that I take the time to look back and reflect on SolaDrive and the history we’ve gone through.</p><div class=\"relpost-thumb-wrapper\"><div class=\"relpost-thumb-container\"><h3>Related posts:</h3><div style=\"clear: both\"></div><div style=\"clear: both\"></div><div class=\"relpost-block-container\"><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/tarsnap-cloud-backups-for-the-truly-paranoid/\"><div class=\"relpost-custom-block-single\" style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"TarSnap\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/07/tarsnap-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Tarsnap: Cloud Backups for the Truly Paranoid</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/incremental-remote-backups-using-rsnapshot/\"><div class=\"relpost-custom-block-single\" style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Incremental Remote Backups Using rsnapshot\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/04/leb-centered-small.jpg) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Incremental Remote Backups Using rsnapshot</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/backing-up-your-vps-with-b2-and-rclone/\"><div class=\"relpost-custom-block-single\" style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Backing Up Your VPS With b2 and rclone\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/04/backup-vps-with-b2-rclone-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Backing Up Your VPS With b2 and rclone</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/poll-results-which-of-these-features-do-you-look-for-when-selecting-a-provider/\"><div class=\"relpost-custom-block-single\" style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Poll Results: Which of These Features Do You Look for When Selecting a Provider?\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/06/lowendbox-poll-results-150x150.jpg) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Poll Results: Which of These Features Do You Look for When Selecting a Provider?</div></div></a></div><div style=\"clear: both\"></div></div></div><div id=\"author-bio-box\" style=\"background: #f8f8f8; border-top: 2px solid #cccccc; border-bottom: 2px solid #cccccc; color: #333333\"><h3><a style=\"color: #555555;\" href=\"https://lowendbox.com/blog/author/raindog308/\" title=\"All posts by raindog308\" rel=\"author\">raindog308</a></h3><div class=\"bio-gravatar\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI3MCIgaGVpZ2h0PSI3MCIgdmlld0JveD0iMCAwIDcwIDcwIj48cmVjdCB3aWR0aD0iMTAwJSIgaGVpZ2h0PSIxMDAlIiBmaWxsPSIjY2ZkNGRiIi8+PC9zdmc+\" alt=\"\" data-src=\"https://secure.gravatar.com/avatar/4ce3b8640a70e05bd73ac25b8a37821c?s=70&amp;d=retro&amp;r=pg\" data-srcset=\"https://secure.gravatar.com/avatar/4ce3b8640a70e05bd73ac25b8a37821c?s=140&amp;d=retro&amp;r=pg 2x\" class=\"avatar avatar-70 photo\" height=\"70\" width=\"70\" loading=\"lazy\"></div><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"https://www.lowendtalk.com/profile/raindog308\" class=\"bio-icon bio-icon-website\"></a><p class=\"bio-description\">I'm Andrew, techno polymath and long-time LowEndTalk community Moderator. My technical interests include all things Unix, perl, python, shell scripting, and relational database systems. I enjoy writing technical articles here on LowEndBox to help people get more out of their VPSes.</p></div></div><div class=\"feedback\"></div></div>"}