{"id": "2332", "post": "<div class=\"post-2332 post type-post status-publish format-standard hentry category-editorial\" id=\"post-2332\"><h2 class=\"storytitle\"><a href=\"https://lowendbox.com/blog/exit0/\" rel=\"bookmark\">exit(0);</a></h2><div class=\"meta\"><img data-lazyloaded=\"1\" src=\"https://lowendbox.com/media/icons/calendar.png\" data-src=\"https://lowendbox.com/media/icons/calendar.png\" alt=\"Date/Time: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> January 19, 2012 @ 6:31 am, by LowEndAdmin</div><div class=\"storycontent tablelook\"><p>Well, posts here from the last few months have been slow, irregular and unenergised. Here is one post that I have intended to write for the last couple of months. TL;DR version — <em>for personal reasons and for the future of LowEndBox blog and LowEndTalk community, I have decided to step down and take an exit</em>.</p><p><span id=\"more-2332\"></span></p><h3>Some Background…</h3><p>1<sup>st</sup> of February 2008, I took on the moniker “LowEndAdmin” and a picture of an old <a href=\"http://en.wikipedia.org/wiki/Commodore_VIC-20\">VIC-20</a>, and wrote the very first blog entry “<a href=\"/blog/hello-world/\">Hello World</a>“. It has since been quite a ride over the last 4 years. I was a lone blogger back then. I worked as a software architect for a financial software company, and had some general amusement in the world of hosting and virtualisation. A low cost VPS where you get root account + total control was a niche that I rarely saw people writing about, back then at least. So I started blogging about low end VPS hosting with a monthly cost capped at $7/month. I was on the hunt of some cheap servers for my spare time projects at that time anyway. I was looking for servers that were <em>cheap enough</em> so that the cost of hosting can never used as excuses not to get my hands dirty with ideas.</p><p>Fast forward 4 years.</p><p><img data-lazyloaded=\"1\" src=\"/media/pix/analytics-2008-2011.jpg\" data-src=\"/media/pix/analytics-2008-2011.jpg\" alt=\"Analytics graph of visitors\" class=\"litespeed-loaded\" data-was-processed=\"true\"></p><p>LowEndBox.com is quite a different beast these days. It’s often mentioned in other webhosting forums (hmm, I meant <a href=\"http://www.webhostingtalk.com/\">WHT</a>). It’s one of the top 3 results when you search “cheap vps” on Google. Rather than scanning through offers sections on WHT, low end providers are jamming my inbox with listing requests every single day. It has built a hard core community over here and at <a href=\"http://www.lowendtalk.com/\">LowEndTalk</a>, where hosting related topics and <a href=\"http://www.lowendtalk.com/categories/offtopic\">other non-sense</a> are often discussed. It even endured <a href=\"/blog/load-testing-this-blog/\">some</a> <a href=\"/blog/ddosed-again-both-lowendbox-and-lowendtalk-affected/\">nasties</a>. Big thanks for the community for not forsaking the site when it was in trouble.</p><h3>Just Don’t Have The Time…</h3><p>However it seems that I’ll be the one deserting the community here.</p><p>Despite the apparent “success” of LowEndBox, for the past year it has become more of a <b>liability</b> to me, rather than an enjoyable blog, let alone a useful asset. The amount of work involved in posting escalates. The ever enlarging <a href=\"/category/deadpool/\">dead pool</a> means it takes more time to investigate all the n00b providers who sent me requests. Writing dead pool posts itself is actually mentally disturbing, by just thinking about all these scams in the hosting industry. And technical posts? Regarding to fine tuning services for low end systems? These became few and far between, as most people are here just for the cheap “too good to be true” VPS offers.</p><p>A blog that was originally set out to help me getting started to work on my side ideas became a big project in itself, where it sucks up valuable time where I could actually do some “work”. This was more of the case over the last 12 months, where I transit from being a faceless employee of a large corporation to being the boss of my own startup. For those who have worked in tech startups you would know how much time your own business demands, not to mention I also have family and church commitments. I often post on LowEndBox way pass 12am wondering, <em>“hey why am I still posting here?”</em> I just don’t have the time.</p><h3>Nor Enjoying The Community…</h3><p>Okay. I have to say that I got to “know” some great individuals over the last 4 years on this blog, although “know” does not go beyond a few email exchanges. Hopefully I’ll be able to keep in touch with some of you.</p><p>At the same time this community is also filled with teenage hosts plotting their next pump ‘n’ dump, and scam artists planning how to defraud a provider. Blogging here for 4 years forced me to see a lot of dark side of hosting business. Many are also quick to shot down a competitor, and people don’t hesitate to label others “scammers”. I too might be at fault here for being extra sceptical and cynical — but I have to admit that it does not make a community enjoyable.</p><p>And guess how much that motivates me to keep on writing here? Not much.</p><h3>Staled Growth of The Websites…</h3><p>With me severely lacking in time + motivation, unfortunately that it’s the community that suffers. I have to say that LowEndBox actually did not grow much in 2011, in terms of number of visitors and page views. At the same time I know there is so much you can do with a hosting oriented community.</p><p>But I don’t have time. That again draws in guilt because I know how much useful this website can be, <b>if</b> I have the time to code these new features and extra functionalities, <b>if</b> I have the time to be more interactive with other community members, <b>if</b>… The websites remain stale because their owner don’t have time nor enough motivation to grow it. Not cool.</p><h3>I am Taking an Exit…</h3><p><img data-lazyloaded=\"1\" src=\"data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=\" style=\"float: right; margin: 0 0 1ex 1ex;\" data-src=\"/media/pix/exit-usb-hub.jpg\" alt=\"EXIT\"> So, I decided that <b>that’s it for me</b>. I need to move on. Moreover, it’s not just <em>reducing responsibilities</em> and asking for extra hands. I want to be <b>out of here</b>, <b>completely</b>. Just don’t want to think about <em>“I wonder how LowEndBox is doing”</em> when I am taking a break after a long day at work.</p><p>I got a few options here.</p><ul><li><a href=\"http://en.wikipedia.org/wiki/Mark_Pilgrim_(software_developer)#.22Disappearance.22_from_the_internet\"><b>Mark Pilgrim-style infosuicide</b></a> by just shutting down all the sites and replying <code>HTTP/1.0 410 Gone</code>. We will just wake up one morning and LowEndBox is no more. And life moves on.<p>Probably not the best solution — even I would agree with that. Although I can see it as an attractive option when nothing else works.</p></li><li><b>Sell the sites on <a href=\"https://flippa.com/sell\">Flippa</a></b> to the highest bidder. This site fetches <em>just</em> ~USD$500 per month on the ads so I guess with 12 to 24 months valuation people might pay $10k for it? Seems to be a small chunk, but at least there’s something for me after blogging here for 4 years.<p>However, I think it might not be the best outcome for the community. Whoever buys the site you’ll be sure that they’ll want to have ROI. I don’t want to think about what will happen when the new owner just wants to squeeze every bit of revenue out from this site.</p><p>But then again, (1) everything has a price, and (2) never say never.</p></li><li><b>Pass on the baton</b> to the chosen one, to whoever is worthy, or just to the <em>“people”</em>, to the community. “Here is the key”, hmmm I mean the domain EPP code and my root password, take control and let the website be what it meant to be! Grow it, and continue to benefit to the el-cheapo hosting community!<p>I guess this might be the preferable outcome. However, whom should I pass the websites to? Who is willing to take up the responsibility? Many are willing to put up their hands I guess, but who would the community trust? A hosting company with lots of insider knowledge? A veteran leader who knows how to manage a community? A carefree college student who has lots of time on his hand? <em>Hmmm. Probably not the last one.</em></p></li></ul><p>Okay. I have now spelt out my intention and will just let the discussion roll from here. I will try to answer questions in this thread and keep people updated. If you wish to contact me directly, here is the email address: <a href=\"mailto:contact@lowendbox.com\">contact@lowendbox.com</a>.</p><h3>Updates</h3><p>Thanks for all the people who emailed me their offers. I have already decided on the outcome — I will pass the baton to one community member who has already formed a team to move the sites forward. Announcement will be made in the next couple of days when the dust settles.</p><p class=\"dpsp-share-text\"></p><div id=\"dpsp-content-bottom\" class=\"dpsp-content-wrapper dpsp-shape-rounded dpsp-column-auto dpsp-has-spacing dpsp-no-labels dpsp-show-on-mobile dpsp-button-style-1 dpsp-has-icon-background dpsp-has-button-background dpsp-show-total-share-count dpsp-show-total-share-count-after\"><ul class=\"dpsp-networks-btns-wrapper dpsp-networks-btns-content dpsp-has-button-icon-animation\"><li><a rel=\"nofollow\" href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flowendbox.com%2Fblog%2Fexit0%2F&amp;t=exit%280%29%3B\" class=\"dpsp-network-btn dpsp-facebook dpsp-no-label dpsp-first\" title=\"Share on Facebook\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://twitter.com/intent/tweet?text=exit%280%29%3B&amp;url=https%3A%2F%2Flowendbox.com%2Fblog%2Fexit0%2F&amp;via=LowEndNetwork\" class=\"dpsp-network-btn dpsp-twitter dpsp-no-label\" title=\"Share on Twitter\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://www.linkedin.com/shareArticle?url=https%3A%2F%2Flowendbox.com%2Fblog%2Fexit0%2F&amp;title=exit%280%29%3B&amp;mini=true\" class=\"dpsp-network-btn dpsp-linkedin dpsp-no-label dpsp-last\" title=\"Share on LinkedIn\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li></ul><div class=\"dpsp-total-share-wrapper\"><span class=\"dpsp-icon-total-share\"></span><span class=\"dpsp-total-share-count\">0</span><span>shares</span></div></div><div id=\"author-bio-box\" style=\"background: #f8f8f8; border-top: 2px solid #cccccc; border-bottom: 2px solid #cccccc; color: #333333\"><h3><a style=\"color: #555555;\" href=\"https://lowendbox.com/blog/author/admin/\" title=\"All posts by LowEndAdmin\" rel=\"author\">LowEndAdmin</a></h3><div class=\"bio-gravatar\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI3MCIgaGVpZ2h0PSI3MCIgdmlld0JveD0iMCAwIDcwIDcwIj48cmVjdCB3aWR0aD0iMTAwJSIgaGVpZ2h0PSIxMDAlIiBmaWxsPSIjY2ZkNGRiIi8+PC9zdmc+\" alt=\"\" data-src=\"https://secure.gravatar.com/avatar/11a4d9191634a9374eeca7d0e8982ba2?s=70&amp;d=retro&amp;r=pg\" data-srcset=\"https://secure.gravatar.com/avatar/11a4d9191634a9374eeca7d0e8982ba2?s=140&amp;d=retro&amp;r=pg 2x\" class=\"avatar avatar-70 photo\" height=\"70\" width=\"70\" loading=\"lazy\"></div><p class=\"bio-description\">The original owner of LowEndBox known as \"LowEndAdmin\" or \"LEA\" for short founded LowEndBox in 2008 and created the concept of hosting applications on low resource \"Low End Boxes\". After creating the roots of the community that we know today, \"LEA\" stepped aside and allowed others to carry the torch forward.</p></div></div><div class=\"feedback\"></div></div>"}