{"id": "27615", "post": "<div class=\"post-27615 post type-post status-publish format-standard hentry category-interview tag-automation tag-cheap-dedicated tag-cheap-vps tag-dedicated tag-level-one-servers tag-leveloneservers\" id=\"post-27615\"><h2 class=\"storytitle\"><a href=\"https://lowendbox.com/blog/full-speed-and-fully-automated-ahead-interview-with-leveloneservers-leadership/\" rel=\"bookmark\">Full Speed and Fully Automated Ahead! Interview with LevelOneServers Leadership</a></h2><div class=\"meta\"><img data-lazyloaded=\"1\" src=\"/media/icons/tag_green.png\" data-src=\"/media/icons/tag_green.png\" width=\"16\" height=\"16\" alt=\"Tags: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> <a href=\"https://lowendbox.com/tag/automation/\" rel=\"tag\">automation</a>, <a href=\"https://lowendbox.com/tag/cheap-dedicated/\" rel=\"tag\">cheap dedicated</a>, <a href=\"https://lowendbox.com/tag/cheap-vps/\" rel=\"tag\">cheap vps</a>, <a href=\"https://lowendbox.com/tag/dedicated/\" rel=\"tag\">dedicated</a>, <a href=\"https://lowendbox.com/tag/level-one-servers/\" rel=\"tag\">level one servers</a>, <a href=\"https://lowendbox.com/tag/leveloneservers/\" rel=\"tag\">leveloneservers</a> <img data-lazyloaded=\"1\" src=\"https://lowendbox.com/media/icons/calendar.png\" data-src=\"https://lowendbox.com/media/icons/calendar.png\" width=\"16\" height=\"16\" alt=\"Date/Time: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> July 5, 2021 @ 12:00 am, by raindog308</div><div class=\"storycontent tablelook\"><p><em><img data-lazyloaded=\"1\" src=\"https://lowendbox.com/wp-content/uploads/2021/06/leveloneservers.png.webp\" loading=\"lazy\" class=\"alignright wp-image-27609 size-full litespeed-loaded\" data-src=\"https://lowendbox.com/wp-content/uploads/2021/06/leveloneservers.png.webp\" alt=\"LevelOneServers Logo\" width=\"300\" height=\"300\" align=\"right\" hspace=\"20\" data-srcset=\"https://lowendbox.com/wp-content/uploads/2021/06/leveloneservers.png.webp 300w, https://lowendbox.com/wp-content/uploads/2021/06/leveloneservers-150x150.png.webp 150w\" data-sizes=\"(max-width: 300px) 100vw, 300px\" sizes=\"(max-width: 300px) 100vw, 300px\" srcset=\"https://lowendbox.com/wp-content/uploads/2021/06/leveloneservers.png.webp 300w, https://lowendbox.com/wp-content/uploads/2021/06/leveloneservers-150x150.png.webp 150w\" data-was-processed=\"true\">Our <a href=\"https://lowendbox.com/category/interview/\" target=\"_blank\" rel=\"noopener\" aria-label=\"LowEndBox Interview Series\">interview series</a> has featured a lot of industry leaders and we continue today by talking with Ian Dunlap and Nick Morgan of <a href=\"https://www.leveloneservers.com\" target=\"_blank\" rel=\"noopener\" aria-label=\"LevelOneServers\">LevelOneServers</a>. In this interview, you’ll learn how LevelOneServers has grown, things they’ve done right and mistakes they’ve learned from, and why they think automation is the future of the hosting industry.</em></p><p><em>You might also want to check <a href=\"https://www.leveloneservers.com\" target=\"_blank\" rel=\"noopener\" aria-label=\"LevelOneServers\">their site</a>, where they’ve got DDoS-protected dedicated servers starting at $60/mo and KVMs for $2/RAM GB/mo!</em></p><p><strong>Tell me about your background and your company’s history?</strong></p><p><strong>Ian Dunlap</strong> – In 2014 I was attending college for Network Information System Technologies. Being very avid into online games during that time I had my own personal game servers hosted with a shared hosting provider.</p><p>Unfortunately, the quality of the shared hosting did not reflect the price paid.<br>\nWith my experience in gaming and with my knowledge of IT, I decided to create my own game service provider. In late 2014 after months of planning my company, Dot-Tech LLC was founded.</p><p><strong>Nick Morgan</strong> – I had always been interested in the gaming industry and business since a young age having an entrepreneurial father. At the age of 13 I started to learn programming by building websites and other small scripts in batch. I heavily used these programming skills to help create internal tools for Dot-Tech to better improve services and internal tracking. Over the years of Dot-Tech I continued to improve my programming skills on the job and create more complex systems to help the company and dynamic web pages when needed. I later went on to study game development in college to further my skills as a programmer and further dive into the gaming industry.</p><p>Over the course of 2016, our company gradually moved our gaming division to owned hardware and quarter 4 of 2016 expanded to a dedicated server line in Dallas, TX under a new brand LevelOneServers. Being a small brand at that time LevelOneServers could not keep enough servers in stock to keep up with demand. Coming from a game hosting background, finding an upstream provider to work with which had good DDoS protection was a key attribute in our selection of Dallas, TX. Over the years of being in the dedicated server hosting industry, we have had the pleasure to work with large companies, helping them expand their networks and large gaming communities of thousands of concurrent players. Our goal with our dedicated server line has been to always offer a personalized support experience to our clients. Continuing our efforts on that goal in 2020 we expanded to creating our own Discord server where clients can have 1 on 1 instant communication with our staff via private support channels. This along with other factors I believe helped our company grow over 200% since May of 2020.</p><p><strong>What would you tell someone looking to start a hosting company today? What advice would you offer?</strong></p><p>The hosting industry is a great industry to be in. However, like all industries, it does have its own issues. Owning a host, specifically a small startup without venture capital can be stressful. Know the industry and how to operate all parts of a host. Working for another host or field within the hosting industry is a good way to learn and grow your knowledge. As an owner, depending on how you set up your host, it may require large time commitments (if you cannot afford staff right away). Automating as many systems and creating knowledge base articles can go a long way to lowering the time commitment. Additionally, expect to make no money in the first 3-6 months. Ideally, have enough money saved to run your host completely for 6 months. Most of all, care about the clients, be honest with them. Don’t sell services you can’t actually live up to, name and reputation matter. Too many startups open looking to make a quick dollar and realize this market is not “get rich quick” and deadpool (close) without the thought of how it affects their clients.</p><p><strong>Where do you think the future takes the hosting industry?</strong></p><p>Personally, I believe the hosting industry is heading all towards full automation. Nowadays most customers expect services to start provisioning upon purchase and to be able to use it as soon as an OS is installed. One thing we are constantly looking into is how we can allow for more of our services to be automated. I think finding ways to allow your customers to have access to their services through automation is something all hosts should take as a priority to do for any services they can.</p><p><span id=\"more-27615\"></span></p><p><strong>Tell me about your top two failures in business? What did you learn from them?</strong></p><p>While I do not consider this a failure, it was a major setback for our company and a good learning lesson. In our early days in the dedicated server industry, we used a very popular DDoS mitigation platform Staminus Communications. This protection platform worked very well for game servers. However, after only a few short months of using their platform, their platform was hacked which led to them closing. A lot of providers suffered from this platform closing including us. Our entire gaming division was unprotected and susceptible to DDoS attacks. Before we had been able to find a new protection provider we had been hit offline many times causing us to lose clients. Our ‘failure’ if you will, was heavily relying on a single DDoS mitigation platform to sustain our network without a backup plan in place. While we use Hivelocity’s DDoS protection, in the event of an issue arising where the DDoS protection is down, we have 2 other platforms on standby that we can easily switch to without too much delay.</p><p><strong>Tell me about your top two successes in business?</strong></p><p>One of our top successes as a business was buying/LTO hardware early on. We knew we wanted to be in the hosting industry and serving clients for a long time, so we decided to put in the upfront costs to own the hardware we needed to service our clients. Doing this allowed for much more control over the hardware to resolve issues or upgrade/replace parts per client requests. We found we have been able to provide much more reliability to our services by doing this.</p><p>While not necessarily a single moment within our company, but a long-term success of ours I am very proud of is being able to cultivate long-standing relationships with clients and to truly work with them to meet their needs as a growing business. It is one of my favorite things to see our clients succeed and help ease the pains of growth to allow them to focus on their business and how they can make it better. These long-standing relationships by far are our company’s biggest success and I truly believe that if you take care of your clients and help them to succeed your own success will follow.</p><p><strong>What do you enjoy most about your role? What do you find most difficult?</strong></p><p><strong>Ian Dunlap</strong> – My role and knowledge at Dot-Tech LLC allows me to work on all sides of the business. I enjoy working directly with clients regarding sales ensuring their needs are fulfilled. I also enjoy working with our system administrators on the new implementation of servers in our rack. However, being hands-on with all aspects of the business does occasionally lead to jobs less desirable. One being occasionally I will help out on the networking side. I do not envy our technicians who work on the networks. It’s just one job I cannot seem to enjoy doing.</p><p><strong>Nick Morgan</strong> – I am much more on the backend of the company usually working on behind-the-scenes scripts or tools that are used by our internal teams. I really enjoy being able to create new pieces of software which helps the future of Dot-Tech or automating existing systems within our company. Being able to take an existing system and finding ways to improve it or make it faster to complete tasks for our team is something that I truly love doing as it is both challenging and exciting to take on. What I find most difficult is definitely creating good UI/UX for the tools I create. I like to try to put in the effort to create pleasant and easy-to-use interfaces for even internal tools for my team. While I do not specialize in frontend design, I definitely think putting in the extra effort to make something visually appealing and easy to understand and use has great benefits for the people that need to use it.</p><p><strong>Both personally and professionally, what guiding principles ground you?</strong></p><p><strong>Ian Dunlap</strong> – First and foremost I am Christian and have been all of my life. As such I try to carry those beliefs to Dot-Tech LLC as principles to follow. We do our best to treat customers as we would want to be treated. Being honest, respectful, and staying true to our commitments are just some of the guiding principles.</p><p><strong>Nick Morgan</strong> – I would say one of my biggest beliefs is that if you work hard and put in effort above and beyond for both yourself and those around you that life has a way to do the same for you. How this translates to business is I believe looking out for partners/customers/fellow work associates will help yourself in turn. I always try to make sure those we do business with try to have a good and quality experience and they are given the tools to thrive themselves. If it means going the extra mile to make sure the success of those around you can happen, I truly believe it will open the doors to creating something big yourself.</p><p><strong>Give us some details on new and exciting things you are working on?</strong></p><p>One thing LevelOneServers is really looking forward to is expanding our services to new locations to give our clients more options of where to have their service. We have found lots of success in our Dallas location and are currently searching for our next location in the USA to provide our services. We are taking great care in selecting our next location so that we can guarantee the same level of support and quality as our current location. As with our current location, we will be ensuring our next location has DDoS protection by default for our clients.</p><p><strong>Why should customers trust you and your business?</strong></p><p>We are a business that isn’t afraid to directly help customers if it means a faster resolution time. While we have support representatives to help our clients, we commonly allow for issues to be pushed to executive-level employees of our company so that senior-level expertise can put eyes on the issue. Each time we do this we both help for better resolution times with clients and pass further knowledge to our support representatives so they become even better equipped to help.</p><p><strong>Final thoughts and anything you would like to add?</strong></p><p>I appreciate the opportunity you have given us to talk about our business. LowEndTalk has been a great community and platform to allow us to reach new customers. We look forward to continuing to grow within the LET community.</p><hr><p><em>Thanks, Ian and Nick, for the insights!&nbsp; Be sure to check out <a href=\"https://www.levelonesevers.com\" target=\"_blank\" rel=\"noopener\" aria-label=\"LevelOneSevers\">LevelOneServers</a> and also the rest of <a href=\"https://lowendbox.com/category/interview/\" target=\"_blank\" rel=\"noopener\" aria-label=\"LowEndTalk interview series\">interview series</a>&nbsp;for more insights from industry and community leaders.</em></p><div class=\"relpost-thumb-wrapper\"><div class=\"relpost-thumb-container\"><h3>Related posts:</h3><div style=\"clear: both\"></div><div style=\"clear: both\"></div><div class=\"relpost-block-container\"><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/full-speed-and-full-automation-ahead-interview-with-level-one-servers-leadership/\"><div class=\"relpost-custom-block-single\" style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"LevelOne Servers\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2021/06/leveloneservers-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Full Speed and Full Automation Ahead: Interview with Level One Servers Leadership</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/%f0%9f%8e%87-celebrate-fourth-of-july-with-some-cloudserver-deal-fireworks-2gb-vps-for-2-mo%f0%9f%8e%86/\"><div class=\"relpost-custom-block-single\" style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"CloudServer Logo\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/11/cloudserver-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">🎇 Celebrate Fourth of July with Some CloudServer Deal Fireworks! (2GB VPS for $2/mo!)🎆</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/lowendboxtv-weekend-update-for-july-3-2021/\"><div class=\"relpost-custom-block-single\" style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"LowEndBoxTV Weekend Update for July 3, 2021\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2021/07/leb-wu-20210703-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">LowEndBoxTV Weekend Update for July 3, 2021</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/win-a-free-vps-in-miami-or-las-vegas-from-hostodo/\"><div class=\"relpost-custom-block-single\" style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Hostodo Giveaway\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2021/06/hostodo_giveaway_3-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Win a FREE VPS in Miami or Las Vegas from Hostodo!</div></div></a></div><div style=\"clear: both\"></div></div></div><div id=\"author-bio-box\" style=\"background: #f8f8f8; border-top: 2px solid #cccccc; border-bottom: 2px solid #cccccc; color: #333333\"><h3><a style=\"color: #555555;\" href=\"https://lowendbox.com/blog/author/raindog308/\" title=\"All posts by raindog308\" rel=\"author\">raindog308</a></h3><div class=\"bio-gravatar\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI3MCIgaGVpZ2h0PSI3MCIgdmlld0JveD0iMCAwIDcwIDcwIj48cmVjdCB3aWR0aD0iMTAwJSIgaGVpZ2h0PSIxMDAlIiBmaWxsPSIjY2ZkNGRiIi8+PC9zdmc+\" alt=\"\" data-src=\"https://secure.gravatar.com/avatar/4ce3b8640a70e05bd73ac25b8a37821c?s=70&amp;d=retro&amp;r=pg\" data-srcset=\"https://secure.gravatar.com/avatar/4ce3b8640a70e05bd73ac25b8a37821c?s=140&amp;d=retro&amp;r=pg 2x\" class=\"avatar avatar-70 photo\" height=\"70\" width=\"70\" loading=\"lazy\"></div><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"https://www.lowendtalk.com/profile/raindog308\" class=\"bio-icon bio-icon-website\"></a><p class=\"bio-description\">I'm Andrew, techno polymath and long-time LowEndTalk community Moderator. My technical interests include all things Unix, perl, python, shell scripting, and relational database systems. I enjoy writing technical articles here on LowEndBox to help people get more out of their VPSes.</p></div></div><div class=\"feedback\"></div></div>"}