{"id": "3936", "post": "<div class=\"post-3936 post type-post status-publish format-standard hentry category-tutorials tag-tutorials-2\" id=\"post-3936\"><h2 class=\"storytitle\"><a href=\"https://lowendbox.com/blog/getting-started-with-ansible/\" rel=\"bookmark\">Getting started with ansible</a></h2><div class=\"meta\"><img data-lazyloaded=\"1\" src=\"/media/icons/tag_green.png\" data-src=\"/media/icons/tag_green.png\" alt=\"Tags: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> <a href=\"https://lowendbox.com/tag/tutorials-2/\" rel=\"tag\">tutorials</a> <img data-lazyloaded=\"1\" src=\"https://lowendbox.com/media/icons/calendar.png\" data-src=\"https://lowendbox.com/media/icons/calendar.png\" alt=\"Date/Time: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> May 18, 2013 @ 11:42 am, by Maarten Kossen</div><div class=\"storycontent tablelook\"><p>A common problem with managing multiple servers is keeping their configurations identical (or similar, depending on the purpose of the servers). When you set up a server (say server1), you tweak the configuration by hand and when you set up another server (server2) you do the same. But then there’s this setting you need to change on server2, which you then forget to change on server1. A different ecosystem was born.</p><p>What may also happen, is that you have to reinstall a server. Say, you’ve got your primary nameserver all set up and running for like a year, but then you want to (or have to) switch hosts. How on earth did you install that nameserver again? You probably need to start all over and google your way around. When switching hosts, this is not something you want to think about.</p><p><span id=\"more-3936\"></span></p><p>Enter ansible! Ansible is a tool which lets you perform actions on servers based on a definition called a playbook. You write a playbook (don’t worry, it’s not hard) where you define what needs to be done and you execute it with ansible. There’s no server-side software needed (well, except for python) and there’s hardly any configuration. By managing your servers with ansible you not only make sure their configuration is always identical and you always have the right tools (don’t you hate it when you go to a server, type ‘htop’ only to find out it’s not installed?). You also have your server configuration documented at all times.</p><p>So let’s get started and write our first playbook!</p><p><em>Note: because of the way WordPress works, some of my examples may have bad indentation and could have ansible throw errors. Make sure that if you copy-paste from this article, you fix indentation according to YAML standards.</em></p><h2>Setting up ansible</h2><p>To run ansible, you need Python 2.6 or higher on the machine you run ansible from. Most current operating systems have this by default. In addition to that, you need three Python modules:</p><ul><li>paramiko</li><li>PyYAML</li><li>jinja2</li></ul><p>The easiest way to install these is to use pip. Let’s first install pip for your distribution. This guide assumes you run Ubuntu (or some other Debian-based distribution) or CentOS.</p><p><strong>Ubuntu</strong></p><blockquote><p>sudo apt-get install python-pip python-dev</p></blockquote><p><strong>CentOS</strong></p><p>On CentOS, you need the EPEL Repository enabled for this to work:</p><blockquote><p>yum install install python-pip python-devel</p></blockquote><p>Now you’ve got pip installed, we can install ansible. We are going to install ansible from pip. pip has the most recent and stable version of ansible and is often more up-to-date than your OS repositories are. There are other ways to install ansible as well, which I’ll highlight in a bit. All dependencies will be pulled in by pip. This can also be done inside a virtualenv if you like (especially if you don’t want these dependencies to be in the way of other projects).</p><p><strong>Ubuntu</strong></p><blockquote><p>sudo pip install ansible</p></blockquote><p><strong>CentOS</strong></p><blockquote><p>pip install ansible</p></blockquote><p>There are other options to install ansible as well. Some distributions package it, you can run it directly from a git checkout or install it from a git checkout. There are also third-party repositories that have packaged versions of ansible and can you can even make a debian package from the git checkout. However, the pip way is the easiest way and in my opinion, the right way to install a python module.</p><h3>Hosts definition</h3><p>For ansible to work, you need a hosts definition. The default host definition is located in /etc/ansible/hosts. You can use a custom hosts definition (located outside /etc, for example) by defining them elsewhere and passing the -i [host-file location] parameter to the ansible-playbook command when running a playbook. We’re just going to work with /etc/ansible/hosts for now. Let’s open up the file and define out first hosts. If the file and/or directory don’t exist yet, you should create them:</p><blockquote><p>(sudo) mkdir /etc/ansible</p><p>(sudo) touch /etc/ansible/hosts</p></blockquote><p>Now let’s open up the empty hosts file and put the following contents in it:</p><blockquote><p>[example]<br>\n192.0.2.101<br>\n192.0.2.102</p></blockquote><p>What we’ve done here, is define a group named ‘example’. A group can be used in a playbook to run the playbook against a number of hosts. We’ve also added two hosts to the group. I’ve added them by IP address, but you can use hostnames as well. In your own host definition, replace these with actual the IP address(es) of your server(s). You can also defined just one host here and you don’t even need a group. It’s all up to you. However, for this guide, we’ll use a group with two hosts.</p><p>Now, there’s more that can be done with the hosts definition, like defining groups of groups, and even more can be done using groups. For simplicity’s sake, we’re just going to stick to this very basic version here.</p><p>Enough about installation, that’s not the most interesting part. Let’s write our first playbook!</p><h2>Writing your first playbook</h2><p>In ansible, a definition of how a server should look (or rather: how certain parts of a server should look) is called a playbook. In a playbook you define what actions ansible should take to get the server in the state you want. Only what you define gets done.</p><p>Playbooks are written in YAML. Read more about YAML here: <a href=\"http://en.wikipedia.org/wiki/YAML\">http://en.wikipedia.org/wiki/YAML</a></p><p>We’re going to write a playbook that does the following:</p><ul><li>Install apache2</li><li>Make sure index.html is present in /var/www/ and is owned by www-data</li><li>Restart apache</li></ul><p>Note that this is just a very basic playbook, but it’s enough to get you started. For simplicity’s sake, we’re going to assume the target systems defined in our host definition run a Debian-based OS. Let’s start with setting up the playbook. It’s really easy, because this is it:</p><blockquote><p>– hosts: all<br>\nuser: root<br>\nsudo: no</p></blockquote><p>Let’s go through this line-by-line.</p><blockquote><p>– hosts: all</p></blockquote><p>This line tells the playbook what hosts to run on. You can put a host or a group from your host definition here. I’ve used ‘all’ in the example, since we want the playbook to apply to all hosts in the definition we’ve just created (2 in total). You can also swap ‘all’ for ‘example’ in this case, as that’s the only group we’ve defined and that’s where all the hosts are in.</p><blockquote><p>user: root</p></blockquote><p>This line tells the playbook as which user to connect _and_ run the playbook. It’s possible to connect as user x and run the playbook as user y, but that’s something for the future. Right now, we’re assuming we’re connecting and executing the playbook as root.</p><blockquote><p>sudo: no</p></blockquote><p>We’re logging in as root, so we’re not using sudo. I’d always like to be verbose about this, since I have playbooks that use sudo as well. You can leave this out when using root as a user, though. If you change this to ‘yes’, your commands will be executed as the listed user but with sudo prefixes. If you use sudo, you need to pass the -K to the ansible-playbook command we’ll use later. Ansible will then ask you for your sudo password.</p><p>The next block is where the actual magic happens:</p><blockquote><p>tasks:<br>\n– name: install apache2<br>\naction: apt pkg=apache2 state=latest</p></blockquote><p>Basically, this is how all of ansible works. You have a name and an action. That’s the bare minimum for an ansible task (you can technically do without the name, but I don’t recommend it). Tasks are executed in the order in which they are defined. They are executed one-by-one against all hosts you run your playbook on.</p><p>Let’s dive into this.</p><blockquote><p>tasks:</p></blockquote><p>Indicates there’s a list of tasks coming. Simple as that.</p><blockquote><p>– name: install apache2</p></blockquote><p>This is the name of the task, or description. You can be as verbose as you want in here. This is what ansible will display when it executes the task.</p><blockquote><p>action: apt pkg=apache2 state=latest</p></blockquote><p>The action argument always starts with a module. A module is a part of ansible that executes your task. An action defines a module execution with the necessary parameters. In this case we’re using the apt module, since we’re running this against a Debian-based machine. The yum module works similar to the apt module, but package names may differ.</p><p>We’re passing two arguments to the apt module: pkg and state. The pkg argument tells the module which package we want to apply an action to. The state tells the module which state you want the package to be in. This can be latest, absent or present. Latest will update the package if a newer version is available, present will just make sure it’s there and absent will purge/remove the package if present.</p><p>So, summarized, the above tasks tells the apt module to install the latest version of the package apache2.</p><p>There’s a whole lot of modules, both official and contributed. I’m going to give two additional examples right now, so you get an idea how it works. We’re continuing the above tasks list, so we’re skipping ‘tasks:’ here.</p><blockquote><p>– name: Make sure index.html is present for the default virtual host<br>\naction: copy src=files/index.html dest=/var/www/index.html</p></blockquote><p>Right here, we’ve used to copy module to copy the index.html file to /var/www. The ‘files’ directory from src is a path relative to the playbook location. It may also be an absolute path. Copy copies the file to the destination only if there’s a difference. For the above to work, you need to create a ‘files’ folder and a file named ‘index.html’ in it.</p><blockquote><p>– name: Make sure index.html is owned by www-data<br>\naction: file path=/var/www/index.html owner=www-data group=www-data</p></blockquote><p>We’ve now used the file module to set the ownership of the index.html file we’ve just put in /var/www to www-data. Simple, isn’t it?</p><p>There’s one last thing to cover before we’ve completed out first playbook. Handlers. Handlers are similar to tasks in a sense that you can notify a handler. Let’s give you an example. Say we define the following handler (this can be done below the tasks block, ansible will make sure it knows about handlers when tasks are being executed):</p><blockquote><p>handlers:<br>\n– name: start apache2<br>\naction: service name=apache2 state=started</p></blockquote><p>This handler works just like a task: is uses the service module to make sure the service named ‘apache2’ is started. Now let’s use this handler in the above example where we install apache2:</p><blockquote><p>– name: install apache2<br>\naction: apt pkg=apache2 state=latest<br>\nnotify:<br>\n– start apache2</p></blockquote><p>What we did here, is add the notify part. This tells ansible to execute the handler ‘start apache2’ after it has finished this task. In this case, it makes sure apache2 is started. So why would I use a handler if I can also use a tasks to restart apache2? Well, in our example, we could have just as well have used a task. However, if there are more tasks that require an apache2 restart, having one central handler for it prevents you from defining the restart multiple times.</p><p>So, we’ve just written our first complete playbook. Here it is:</p><blockquote><p>– hosts: all<br>\nuser: root<br>\nsudo: no<br>\ntasks:<br>\n– name: install apache2<br>\naction: apt pkg=apache2 state=latest<br>\nnotify:<br>\n– start apache2<br>\n– name: Make sure index.html is present for the default virtual host<br>\naction: copy src=files/index.html dest=/var/www/index.html<br>\n– name: Make sure index.html is owned by www-data<br>\naction: file path=/var/www/index.html owner=www-data group=www-data<br>\nhandlers:<br>\n– name: start apache2<br>\naction: service name=apache2 state=started</p></blockquote><p>Save this as first-playbook.yml. Now let’s execute it!</p><p>Executing the playbook is easy. When you installed ansible, the ansible-playbook command became available to you. To run the playbook, all you need to do is:</p><blockquote><p>ansible-playbook first-playbook.yml</p></blockquote><p>This command will read the playbook, determine which hosts to run it against and as which user, and start executing your tasks. But I have assumed that you use a private key to log into the two servers we’ve listed before. However, that may not be the case. While I would recommend you to always log in with a private key, ansible also enables you to log in with a password. If we run:</p><blockquote><p>ansible-playbook first-playbook.yml -k</p></blockquote><p>It asks you for your SSH password for the user listed in the playbook.</p><p>Playbook executing looks as follows (I’ve cheated and I only ran my playbook against 127.0.0.1, so yours will look different):</p><p><a href=\"https://lowendbox.com/wp-content/uploads/2013/05/2013-Getting-started-with-ansible-Screenshot-1.png\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSIzMDAiIGhlaWdodD0iMjE3IiB2aWV3Qm94PSIwIDAgMzAwIDIxNyI+PHJlY3Qgd2lkdGg9IjEwMCUiIGhlaWdodD0iMTAwJSIgZmlsbD0iI2NmZDRkYiIvPjwvc3ZnPg==\" loading=\"lazy\" class=\"alignnone size-medium wp-image-3937\" alt=\"Running your first playbook\" data-src=\"https://lowendbox.com/wp-content/uploads/2013/05/2013-Getting-started-with-ansible-Screenshot-1-300x217.png.webp\" width=\"300\" height=\"217\" data-srcset=\"https://lowendbox.com/wp-content/uploads/2013/05/2013-Getting-started-with-ansible-Screenshot-1-300x217.png.webp 300w, https://lowendbox.com/wp-content/uploads/2013/05/2013-Getting-started-with-ansible-Screenshot-1.png.webp 1012w\" data-sizes=\"(max-width: 300px) 100vw, 300px\"></a></p><p>You can clearly see what ansible does, step-by-step, and it gives a summary at the end! Ansible is verbose if something goes wrong. For example: on very minimal Ubuntu installations, the python-apt package may be missing. Ansible needs this on the target server for the apt module to work. It will tell you to install this package first.</p><p>Congratulations! You’ve just run your first playbook! Log in to your servers and see for yourself that everything is in order!</p><h2>Final note</h2><p>The above is just a <em>very</em> basic example of ansible usage. Your playbooks will usually be longer and/or more complex. There’s also a lot more modules to work with. Ansible has very good documentation. A good place to get started is here: <a href=\"http://ansible.cc/docs/gettingstarted.html\">http://ansible.cc/docs/gettingstarted.html</a>. In the future, I’ll write additional guides on ansible, covering additional topics.</p><p class=\"dpsp-share-text\"></p><div id=\"dpsp-content-bottom\" class=\"dpsp-content-wrapper dpsp-shape-rounded dpsp-column-auto dpsp-has-spacing dpsp-no-labels dpsp-show-on-mobile dpsp-button-style-1 dpsp-has-icon-background dpsp-has-button-background dpsp-show-total-share-count dpsp-show-total-share-count-after\"><ul class=\"dpsp-networks-btns-wrapper dpsp-networks-btns-content dpsp-has-button-icon-animation\"><li><a rel=\"nofollow\" href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flowendbox.com%2Fblog%2Fgetting-started-with-ansible%2F&amp;t=Getting%20started%20with%20ansible\" class=\"dpsp-network-btn dpsp-facebook dpsp-no-label dpsp-first\" title=\"Share on Facebook\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://twitter.com/intent/tweet?text=Getting%20started%20with%20ansible&amp;url=https%3A%2F%2Flowendbox.com%2Fblog%2Fgetting-started-with-ansible%2F&amp;via=LowEndNetwork\" class=\"dpsp-network-btn dpsp-twitter dpsp-no-label\" title=\"Share on Twitter\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://www.linkedin.com/shareArticle?url=https%3A%2F%2Flowendbox.com%2Fblog%2Fgetting-started-with-ansible%2F&amp;title=Getting%20started%20with%20ansible&amp;mini=true\" class=\"dpsp-network-btn dpsp-linkedin dpsp-no-label dpsp-last\" title=\"Share on LinkedIn\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li></ul><div class=\"dpsp-total-share-wrapper\"><span class=\"dpsp-icon-total-share\"></span><span class=\"dpsp-total-share-count\">1</span><span>shares</span></div></div><div class=\"relpost-thumb-wrapper\"><div class=\"relpost-thumb-container\"><h3>Related posts:</h3><div style=\"clear: both\"></div><div style=\"clear: both\"></div><div class=\"relpost-block-container\"><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/centos-6-end-of-life-is-coming-upgrade-to-a-new-centos-7-vps-now/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"CentOS 6 End of Life is Coming! Upgrade to a new CentOS 7 VPS Now\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/04/centos-6-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">CentOS 6 End of Life is Coming! Upgrade to a new CentOS 7 VPS Now</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/best-web-hosting-control-panels-after-the-cpanel-price-hike/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Best Web Hosting Control Panels after the cPanel Price Hike\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/03/leb-banner-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Best Web Hosting Control Panels after the cPanel Price Hike</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/how-to-set-up-plex-media-server-on-your-vps/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"How to Set Up Plex Media Server on Your Cheap VPS\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/04/how-to-set-up-plex-media-server-on-vps-2-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">How to Set Up Plex Media Server on Your Cheap VPS</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/how-to-create-a-dns-server-on-debian-stretch/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"How To Create a DNS Server On Debian Stretch\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/04/leb-centered-small.jpg) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">How To Create a DNS Server On Debian Stretch</div></div></a></div><div style=\"clear: both\"></div></div></div><div id=\"author-bio-box\" style=\"background: #f8f8f8; border-top: 2px solid #cccccc; border-bottom: 2px solid #cccccc; color: #333333\"><h3><a style=\"color: #555555;\" href=\"https://lowendbox.com/blog/author/mpkossen/\" title=\"All posts by Maarten Kossen\" rel=\"author\">Maarten Kossen</a></h3><div class=\"bio-gravatar\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI3MCIgaGVpZ2h0PSI3MCIgdmlld0JveD0iMCAwIDcwIDcwIj48cmVjdCB3aWR0aD0iMTAwJSIgaGVpZ2h0PSIxMDAlIiBmaWxsPSIjY2ZkNGRiIi8+PC9zdmc+\" alt=\"\" data-src=\"https://secure.gravatar.com/avatar/67eeccea1ee5a1ce2f93adc061f69a5f?s=70&amp;d=retro&amp;r=pg\" data-srcset=\"https://secure.gravatar.com/avatar/67eeccea1ee5a1ce2f93adc061f69a5f?s=140&amp;d=retro&amp;r=pg 2x\" class=\"avatar avatar-70 photo\" height=\"70\" width=\"70\" loading=\"lazy\"></div><p class=\"bio-description\">Maarten Kossen was the administrator of LowEndBox from 2013 to 2015, and brought many ideas and improvements to the website during his leadership. Today he is member of our community and LowEndTalk.</p></div></div><div class=\"feedback\"></div></div>"}