{"id": "27592", "post": "<div class=\"post-27592 post type-post status-publish format-standard hentry category-interview tag-cheap-dedicated tag-cheap-vps tag-cloud tag-dedicated tag-hivelocity tag-hosting tag-hsphere\" id=\"post-27592\"><h2 class=\"storytitle\"><a href=\"https://lowendbox.com/blog/how-to-save-your-customers-270000-a-year-interview-with-steve-eschweiler-coo-of-hivelocity/\" rel=\"bookmark\">How to Save Your Customers $270,000 a Year: Interview with Steve Eschweiler, COO of HiVelocity</a></h2><div class=\"meta\"><img data-lazyloaded=\"1\" src=\"/media/icons/tag_green.png\" data-src=\"/media/icons/tag_green.png\" width=\"16\" height=\"16\" alt=\"Tags: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> <a href=\"https://lowendbox.com/tag/cheap-dedicated/\" rel=\"tag\">cheap dedicated</a>, <a href=\"https://lowendbox.com/tag/cheap-vps/\" rel=\"tag\">cheap vps</a>, <a href=\"https://lowendbox.com/tag/cloud/\" rel=\"tag\">cloud</a>, <a href=\"https://lowendbox.com/tag/dedicated/\" rel=\"tag\">dedicated</a>, <a href=\"https://lowendbox.com/tag/hivelocity/\" rel=\"tag\">hivelocity</a>, <a href=\"https://lowendbox.com/tag/hosting/\" rel=\"tag\">hosting</a>, <a href=\"https://lowendbox.com/tag/hsphere/\" rel=\"tag\">hsphere</a> <img data-lazyloaded=\"1\" src=\"https://lowendbox.com/media/icons/calendar.png\" data-src=\"https://lowendbox.com/media/icons/calendar.png\" width=\"16\" height=\"16\" alt=\"Date/Time: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> June 25, 2021 @ 12:00 am, by raindog308</div><div class=\"storycontent tablelook\"><p><em><img data-lazyloaded=\"1\" src=\"https://lowendbox.com/wp-content/uploads/2021/06/hivelocity-300x300.png.webp\" loading=\"lazy\" class=\"alignright size-medium wp-image-27593 litespeed-loaded\" data-src=\"https://lowendbox.com/wp-content/uploads/2021/06/hivelocity-300x300.png.webp\" alt=\"Hivelocity\" width=\"300\" height=\"300\" align=\"right\" hspace=\"20\" data-srcset=\"https://lowendbox.com/wp-content/uploads/2021/06/hivelocity.png.webp 300w, https://lowendbox.com/wp-content/uploads/2021/06/hivelocity-150x150.png.webp 150w\" data-sizes=\"(max-width: 300px) 100vw, 300px\" sizes=\"(max-width: 300px) 100vw, 300px\" srcset=\"https://lowendbox.com/wp-content/uploads/2021/06/hivelocity.png.webp 300w, https://lowendbox.com/wp-content/uploads/2021/06/hivelocity-150x150.png.webp 150w\" data-was-processed=\"true\">Our <a href=\"https://lowendbox.com/category/interview/\" target=\"_blank\" rel=\"noopener\" aria-label=\"LowEndBox Interview Series\">interview series</a> has featured a lot of industry leaders and we continue today by talking with Steve Eschweiler, COO of <a href=\"https://www.hivelocity.net\" target=\"_blank\" rel=\"noopener\">HiVelocity</a>. In this interview, you’ll get some practical advice about the hosting business and a great perspective from an industry veteran…plus an example of why you should be drinking IPAs.</em></p><p><strong>Tell me about your background and how you got involved with the hosting industry?</strong></p><p>Back in 2001 I had just left my job working for an MSP and was looking for a new opportunity. A few very close friends of mine were looking to start a hosting company and were in need of a technical sales person. I jumped at the chance to work with friends in a startup environment.</p><p><strong>Hivelocity has been around for years, tell us about the company’s history?</strong></p><p>We started Hivelocity in 2002 and were one of the very first providers of Hsphere. If you don’t remember Hsphere it was a great software that was geared to reseller hosting. We found a lot of success selling our reseller plans to web designers. However, after a few years all of our resellers started began requesting dedicated servers. At a certain point, probably around 2005, we started getting so many requests for dedicated servers that we made full systems our primary offering. In 2012 we made the leap to our own data center. In 2017 we opened our second data center and also expanded beyond Florida for the first time to Los Angeles. Since then we’ve added about 30 locations around the world.</p><p><strong>What would you tell someone looking to start a hosting company today? What advice would you offer?</strong></p><p>One thing I notice about a lot of emerging providers is so many of them rely on price as their primary benefit. Unless you have a ton of financial backing, more often than not, being the cheapest is not a recipe for success or even viability. There are a ton of hosting providers out there but none of us has solved all the problems for all our customers. None of us is the proper solution for every business. Find a problem that has not been solved and solve it. Find a need that is not being widely addressed and address it. Customers will pay a little extra to make their life easier and solve their problems.</p><p><strong>Where do you think the future takes the hosting industry? How is Hivelocity evolving to stay relevant?</strong></p><p>Obviously, I think cloud computing is going to continue growing and be a big part of the industry’s future. However, as we within the industry know, the cloud is just a bunch of servers. Hivelocity now offers our IaaS and bare-metal servers in 26 markets across the globe. While most of our competitors in the bare-metal industry were pivoting in an effort to compete with public clouds like AWS and Azure, we have remained focused on dedicated servers and perfecting the deployment and management of our metal. By sticking to our core service and now offering bare-metal across the globe, we are now actually providing metal to the hyper-scalers as their customers demand they get closer to the edge. What we have seen over the last few years with edge computing, dedicated servers are very much in vogue and we will continue to make the consumption of them easier.</p><p><span id=\"more-27592\"></span></p><p><strong><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSIyNDAiIGhlaWdodD0iMjQwIiB2aWV3Qm94PSIwIDAgMjQwIDI0MCI+PHJlY3Qgd2lkdGg9IjEwMCUiIGhlaWdodD0iMTAwJSIgZmlsbD0iI2NmZDRkYiIvPjwvc3ZnPg==\" loading=\"lazy\" class=\"alignleft size-full wp-image-27595\" data-src=\"https://lowendbox.com/wp-content/uploads/2021/06/Steve-Eschweiler.jpg\" alt=\"Steve Eschweiler of Hivelocity\" width=\"240\" height=\"240\" align=\"left\" hspace=\"20\" data-srcset=\"https://lowendbox.com/wp-content/uploads/2021/06/Steve-Eschweiler.jpg 240w, https://lowendbox.com/wp-content/uploads/2021/06/Steve-Eschweiler-150x150.jpg.webp 150w\" data-sizes=\"(max-width: 240px) 100vw, 240px\">Where do IaaS, colocation and edge compute players fit into a world dominated by the big clouds?</strong></p><p>I think we find ourselves in the very fortunate position of being in a rapidly growing industry regardless of where you fit within IaaS. We are seeing record growth across all our bare metal, colocation and private cloud offerings. The record signups are coming from SMBs and large corporations alike. Again, everything we consume digitally each day runs on servers and the big clouds want more servers in more locations, and we are happy to support that growth. With the recent launch of our API and Terraform Provider customers who operate in the big clouds can more easily shift workloads to us where appropriate.</p><p><strong>What type of feedback does Hivelocity hear from customers as to why they prefer to work with a medium sized operator instead of Azure or AWS?</strong></p><p>There are a few reasons but let’s start with cost. The cloud is a good option for companies that are very small and very big, but for your typical small to medium sized business, the cloud if often going to be a far more expensive solution. We did a case study a while back with a customer of ours who paid us about $30,000 per month for their dedicated server solution with us. The case study illustrated right from the AWS price calculator that the same resources would cost over $300,000 per month in the cloud. This may have been an extreme example but even if we are just $1000 per month less expensive, that is still a huge savings to a small company. Another big reason a business would choose Hivelocity over one of the giants is for the user experience. It is not by accident that we place a huge emphasis company wide on providing an exceptional customer service experience. The mind set that every customer is important is a clear differentiator between a provider of our size and someone like Microsoft where you are just a number.</p><p><strong>Tell me about things in your career you wish you had a “do over” on?</strong></p><p>I certainly wish I had mined some bitcoin when it was a few hundred dollars. For two decades I have spent my life in data centers surrounded by servers and never have I mined a single coin.</p><p><strong>Tell me about your top two successes at HiVelocity?</strong></p><p>One of things I am most proud of is the management team I helped assemble. The group of men and women who lead our numerous departments are some of the smartest and hardest working people I have ever known. I am not too proud to say I have surrounded myself with smarter people than myself and I am thankful for their expertise and efforts every day. I’m proud of how we’ve been able to grow the company together and actually improve the quality of customer experience that got us here.</p><p>One of my favorite successes is the time I landed the business of a pretty large publicly traded company at the bar. One minute I am sipping an IPA, the next minute I am talking data centers with a fairly well known executive. We drank together for hours and yada yada yada, they have been a great customer to us for years.</p><p><strong>What do you enjoy most about your role? What do you find most difficult?</strong></p><p>What I have always loved about my role here is the amount of influence my team and I have on our customer outcomes. I’ve worked at places where I saw something broken but didn’t have the ability to fix it and I’m grateful to be in a position to fix something when I see that it’s broken.</p><p>I’m used to it, but the most difficult part of any leadership role in the Internet industry is the constant sense of urgency and responsiveness that’s required to deliver a consistently excellent customer experience. The senior leaders (technical or business) are always on call.</p><p><strong>Both personally and professionally, what guiding principles ground you?</strong></p><p>Delight the customer and the rest falls in to place. Praise your team when they do well. Loyalty matters.</p><p><strong>Give us some details on new and exciting things you are working on?</strong></p><p>We’ve just recently launched our API and Terraform provider and are excited about the additional automation both internally and for customer self-service that comes along with that. Broadly, we’re looking at offering additional services on top of our core bare-metal offering</p><p><strong>What are the key reasons why customers continue to trust HiVelocity?</strong></p><p>As we have grown we have only gotten better at what we do. We haven’t let the accountants screw up our drive to be the best at what we do. So often companies get big and everyone’s focus shifts to maximizing profit margins. As we have grown, we have focused on how can we spend the extra money on making our service even better. A customer who liked our service 10 years ago when we only had our Tampa location can now get even better support, faster deployments and the use of our public API.</p><p><strong>Final thoughts and anything you would like to add?</strong></p><p>I certainly want to thank you and your team for providing all of us in the industry a medium to share our stories, our insights and our opinions. I think all of us in the industry appreciate you guys a lot. Lastly, I assume anyone who reads this is immersed in technology and hosting just like me. I would say to them, keep at it. We nerds are here to dominate the present and the future!</p><p><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI2NDAiIGhlaWdodD0iMzYwIiB2aWV3Qm94PSIwIDAgNjQwIDM2MCI+PHJlY3Qgd2lkdGg9IjEwMCUiIGhlaWdodD0iMTAwJSIgZmlsbD0iI2NmZDRkYiIvPjwvc3ZnPg==\" loading=\"lazy\" class=\"aligncenter wp-image-27594 size-full\" data-src=\"https://lowendbox.com/wp-content/uploads/2021/06/hivelocity_banner.png.webp\" alt=\"\" width=\"640\" height=\"360\" data-srcset=\"https://lowendbox.com/wp-content/uploads/2021/06/hivelocity_banner.png.webp 640w, https://lowendbox.com/wp-content/uploads/2021/06/hivelocity_banner-300x169.png.webp 300w\" data-sizes=\"(max-width: 640px) 100vw, 640px\"></p><hr><p><em>Thanks, Steve, for the insights!&nbsp; Be sure to check out <a href=\"https://www.hivelocity.net\" target=\"_blank\" rel=\"noopener\">HiVelocity</a>&nbsp;and also the rest of&nbsp;<a href=\"https://lowendbox.com/category/interview/\" target=\"_blank\" rel=\"noopener\">interview series</a>&nbsp;for more insights from industry and community leaders.</em></p><div class=\"relpost-thumb-wrapper\"><div class=\"relpost-thumb-container\"><h3>Related posts:</h3><div style=\"clear: both\"></div><div style=\"clear: both\"></div><div class=\"relpost-block-container\"><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/providers-do-you-have-news-to-share/\"><div class=\"relpost-custom-block-single\" style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Town Crier\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2021/06/Your-News-Here-1-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Providers: Do You Have News to Share?</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/hosterlabs-confirms-data-breach/\"><div class=\"relpost-custom-block-single\" style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Hosterlabs Logo\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/08/hosterlabs-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Hosterlabs Confirms Data Breach</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/meme-monday-brace-yourself/\"><div class=\"relpost-custom-block-single\" style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Meme Brace Yourself\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2021/06/brace-yourself-summer-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Meme Monday: Brace Yourself!</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/quadranet-30tb-of-bandwidth-on-an-e3-for-only-45-mo-in-los-angeles/\"><div class=\"relpost-custom-block-single\" style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"QuadraNet Logo\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/10/quadranet-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">QuadraNet: 30TB of Bandwidth on an e3 for Only $45/mo in Los Angeles!</div></div></a></div><div style=\"clear: both\"></div></div></div><div id=\"author-bio-box\" style=\"background: #f8f8f8; border-top: 2px solid #cccccc; border-bottom: 2px solid #cccccc; color: #333333\"><h3><a style=\"color: #555555;\" href=\"https://lowendbox.com/blog/author/raindog308/\" title=\"All posts by raindog308\" rel=\"author\">raindog308</a></h3><div class=\"bio-gravatar\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI3MCIgaGVpZ2h0PSI3MCIgdmlld0JveD0iMCAwIDcwIDcwIj48cmVjdCB3aWR0aD0iMTAwJSIgaGVpZ2h0PSIxMDAlIiBmaWxsPSIjY2ZkNGRiIi8+PC9zdmc+\" alt=\"\" data-src=\"https://secure.gravatar.com/avatar/4ce3b8640a70e05bd73ac25b8a37821c?s=70&amp;d=retro&amp;r=pg\" data-srcset=\"https://secure.gravatar.com/avatar/4ce3b8640a70e05bd73ac25b8a37821c?s=140&amp;d=retro&amp;r=pg 2x\" class=\"avatar avatar-70 photo\" height=\"70\" width=\"70\" loading=\"lazy\"></div><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"https://www.lowendtalk.com/profile/raindog308\" class=\"bio-icon bio-icon-website\"></a><p class=\"bio-description\">I'm Andrew, techno polymath and long-time LowEndTalk community Moderator. My technical interests include all things Unix, perl, python, shell scripting, and relational database systems. I enjoy writing technical articles here on LowEndBox to help people get more out of their VPSes.</p></div></div><div class=\"feedback\"></div></div>"}