{"id": "20503", "post": "<div class=\"post-20503 post type-post status-publish format-standard hentry category-virtual-servers category-tutorials tag-balenaetcher tag-bittorrent tag-couchpotato tag-debian tag-raspberry-pi tag-raspbian tag-usenet\" id=\"post-20503\"><h2 class=\"storytitle\"><a href=\"https://lowendbox.com/blog/how-to-install-and-configure-couchpotato-on-a-raspberry-pi/\" rel=\"bookmark\">How To Install And Configure CouchPotato On A Raspberry PI</a></h2><div class=\"meta\"><img data-lazyloaded=\"1\" src=\"/media/icons/tag_green.png\" data-src=\"/media/icons/tag_green.png\" alt=\"Tags: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> <a href=\"https://lowendbox.com/tag/balenaetcher/\" rel=\"tag\">balenaEtcher</a>, <a href=\"https://lowendbox.com/tag/bittorrent/\" rel=\"tag\">bittorrent</a>, <a href=\"https://lowendbox.com/tag/couchpotato/\" rel=\"tag\">CouchPotato</a>, <a href=\"https://lowendbox.com/tag/debian/\" rel=\"tag\">debian</a>, <a href=\"https://lowendbox.com/tag/raspberry-pi/\" rel=\"tag\">raspberry pi</a>, <a href=\"https://lowendbox.com/tag/raspbian/\" rel=\"tag\">Raspbian</a>, <a href=\"https://lowendbox.com/tag/usenet/\" rel=\"tag\">Usenet</a> <img data-lazyloaded=\"1\" src=\"https://lowendbox.com/media/icons/calendar.png\" data-src=\"https://lowendbox.com/media/icons/calendar.png\" alt=\"Date/Time: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> July 20, 2019 @ 8:31 am, by Jon Biloh</div><div class=\"storycontent tablelook\"><p><a href=\"https://couchpota.to/\">CouchPotato</a> an application server that will easily and automatically download movies and T.V. series. You can set the quality that you want to download e.g. 4K or 1080p, the movie you want and CouchPotato will continuously monitor BitTorrent and Usenet sites and download the version you want as soon as it becomes available.</p><p><span id=\"more-20503\"></span></p><p>In this guide, you will install CouchPotato on a <a href=\"https://www.raspberrypi.org/\">Raspberry PI</a> minicomputer. Raspberry PI’s make excellent CouchPotato servers because:</p><ol><li>They are low power and fan-less. You can leave them running 24/7 to download your moves without worrying about your energy bills.</li><li>They are full computers with a desktop environment so you can log and use GUI tools to manage them.</li><li>They are $35 USD!</li></ol><p>These reasons make a Raspberry PI an ideal home download server and a great introduction to using Linux if you haven’t already taken the plunge.</p><h2><a id=\"Requirements_9\"></a>Requirements</h2><p>You will need a few things to get your CouchPotato server up and running. They are as follows:</p><ol><li>Raspberry PI 3 or 4 (any version).</li><li>16GB MicroSD card.</li><li>Micro-USB Android phone charger (for the Raspberry PI).</li><li>USB keyboard.</li><li>HDMI monitor or TV to use a monitor.</li><li>USB storage device which is large enough to hold your Movies and T.V. shows.</li></ol><p>You will use the keyboard and mouse to access the Raspberry PI during the installation and configuration stages. You will not need them later during the normal use of CouchPotato as you will log into its web interface or log into the Raspberry PI’s desktop.</p><h2><a id=\"Installing_The_Operating_System_20\"></a>Installing The Operating System</h2><p>Your first job is to get the operating installed onto the microSD card that will hold the OS of the Raspberry PI. The operating system that we will install is <a href=\"https://raspbian.org/\">Raspbian</a>. Raspbian is based on the <a href=\"https://www.debian.org/\">Debian</a> operating system and compiled for the ARM CPU that the Raspbian uses.</p><p>Browse to the download page <a href=\"https://www.raspberrypi.org/downloads/raspbian/\">here</a> and download the <em>Raspbian Buster with desktop</em> image. This is a large, 1.1GB, file that you need to save to your computer. Do not unzip this file. The software we will use to flash it to the MicroSD card will do this for you.</p><p>If you are an experienced Linux user the command line instructions for flashing the Raspbian image are <a href=\"https://www.raspberrypi.org/documentation/installation/installing-images/linux.md\">here</a></p><p>Everyone else should download and install the software that we will use to flash the microSD card – <a href=\"https://www.balena.io/etcher/\">balenaEtcher</a>. This software is a beautiful cross-platform (Windows, OSX, and Linux) application that flashes SD cards and USB thumb drives.</p><p>Note, you will erase any data on the MicroSD card in the next step so make sure you have a copy of any data on it before you proceed.</p><p>Insert your microSD card into your computer and start up balenaEtcher. The simple screen that you will see looks like this:</p><p><img data-lazyloaded=\"1\" src=\"https://lowendbox.com/wp-content/uploads/2019/06/etcher-select-image.jpg.webp\" data-src=\"https://lowendbox.com/wp-content/uploads/2019/06/etcher-select-image.jpg.webp\" alt=\"\" class=\"litespeed-loaded\" data-was-processed=\"true\"></p><p>Click on the <code>Select image</code> button and browse to the Raspbian image you downloaded and select it. balenaEtcher will search for and automatically select the MicroSD card that plugged into your computer. Check that the size listed next to the device that balenaEtcher has selected is the same size as your MicroSD card just to be sure you are using the MicroSD card.</p><p>When you are ready hit <code>Flash!</code>. It will take several minutes to flash the microSD card. When balenEtcher has finished remove the microSD card and load it into your Raspberry PI.</p><p>Plug the screen and keyboard into your Raspberry PI and then plug in the phone charger. The Raspberry PI will now power on. Log in with the following details:</p><ul><li>Username – <code>pi</code></li><li>Password – <code>raspberry</code></li></ul><p>Follow the first-boot, on-screen instructions until you get to the desktop.</p><p>You will need to open a terminal from the desktop to continue the guide.</p><h2><a id=\"AutoMounting_The_USB_Device_47\"></a>Auto-Mounting The USB Device</h2><p>In this section, you will configure the PI to automatically join or mount the USB memory stick so that your movies will be saved onto it.</p><p>Raspbian will always give the device name <code>/dev/sda</code> to the first USB device that you plug into the Raspberry PI. This allows us to create an entry in the file that configures device mounting, the <code>/etc/fstab</code>, so that the USB you have your media on will always get automatically mounted at the same location.</p><p>Before you edit <code>/etc/fstab</code> you need to get the UID (<em>U</em>ser <em>ID</em>) of <code>pi</code> and the GID (<em>G</em>roup <em>ID</em>) of <code>users</code>. First, get the UID of <code>pi</code> by running this command:</p><pre><code class=\"language-sh\">sudo grep <span class=\"hljs-string\">\"pi\"</span> /etc/passwd\n</code></pre><p>This will give output that looks like the following:</p><pre><code>pi:x:1000:1000:,,,:/home/pi:/bin/bash\n</code></pre><p><code>pi</code>‘s UID is the first number i.e. 1000. The following command will get the UID of <code>users</code>:</p><pre><code class=\"language-sh\">sudo grep <span class=\"hljs-string\">\"users\"</span> /etc/group\n</code></pre><p>This prints the output:</p><pre><code>users:x:100:pi\n</code></pre><p>The UID of <code>users</code> is 100. Using this information open <code>/etc/fstab</code> with a text editor. Here <code>nano</code> is used:</p><pre><code class=\"language-sh\">sudo nano /etc/fstab\n</code></pre><p>Add a line that has the following format:</p><pre><code>/dev/sda1  /home/pi/Downloads  vfat  umask=0002,gid=&lt;GID&gt;,uid=&lt;UID&gt;  0  0\n</code></pre><p>Substituting the values we discovered earlier:</p><pre><code>/dev/sda1  /home/pi/Downloads  vfat  umask=0002,gid=100,uid=1000  0  0\n</code></pre><p>You must use the values from your Raspberry PI.</p><p>Finally, we need to change the user and group for `/home/pi/Downloads:</p><pre><code class=\"language-sh\">sudo chown -R pi:users /home/pi/Downloads\nsudo chmod -R <span class=\"hljs-number\">775</span> /home/pi/Downloads\n</code></pre><p>Plugin your USB device and confirm that it has been automatically mounted at <code>/home/pi/Downloads</code>. You will be prompted to open a file manager when you plug in the USB device that will open to its mount point i.e. <code>/home/pi/Downloads</code>.</p><h2><a id=\"Installing_And_Configuring_CouchPotato_97\"></a>Installing And Configuring CouchPotato</h2><p>The recommended method to install CouchPotato on a Linux server is to clone the Git repository. Before you can do that you will need to install Git and some additional Python libraries with the following commands:</p><pre><code class=\"language-sh\">sudo apt update\nsudo apt install git python-lxml python-pip\npip install --upgrade pyopenssl\n</code></pre><p>Next, you need to clone the CouchPotato repository into the home directory of the <code>pi</code> user with the following commands:</p><pre><code class=\"language-sh\"><span class=\"hljs-built_in\">cd</span> ~/\ngit <span class=\"hljs-built_in\">clone</span> https://github.com/CouchPotato/CouchPotatoServer.git CouchPotato\n</code></pre><p>You are now able to start the CouchPotato server by simply executing the Python script that was downloaded with the Git pull at <code>/home/pi/CouchPotato/CouchPotato.py</code>. This is not an ideal way to manage a service on Linux as it will not get started automatically on re-boot, you are not able to gracefully restart it. Instead, you will create a <a href=\"https://freedesktop.org/wiki/Software/systemd/\">systemd</a> <a href=\"https://www.freedesktop.org/software/systemd/man/systemd.service.html\">service</a> file with which you can manage CouchPotato as a first-class system service.</p><p>The CouchPotato repository contains a systemd service file that we can use with a little modification. You will need to edit the file so that the location of the <code>CouchPotato.py</code> is correctly specified and CouchPotato runs as the <code>pi</code> user. First, open the service file with a text editor, here <code>nano</code> is used:</p><pre><code class=\"language-sh\">nano /home/pi/CouchPotato/init/couchpotato.service\n</code></pre><p>And edit the <code>[Service]</code> section to look like this:</p><pre><code>[Service]\nExecStart=/home/pi/CouchPotato/CouchPotato.py\nType=simple\nUser=pi\nGroup=pi\n</code></pre><p>Next, copy this file to <code>/etc/systemd/system/</code>:</p><pre><code class=\"language-sh\">sudo cp /home/pi/CouchPotato/init/couchpotato.service /etc/systemd/system/\n</code></pre><p>Now, get systemd to start CouchPotato automatically on boot:</p><pre><code class=\"language-sh\">sudo systemctl <span class=\"hljs-built_in\">enable</span> couchpotato\n</code></pre><p>You can now start CouchPotato using the following systemd command:</p><pre><code class=\"language-sh\">sudo systemctl start couchpotato\n</code></pre><p>You can now log into CouchPotato as it is up and running. However, you will not be able to do anything because there are no “downloaders” installed and running. A downloader is an external tool that will download the movies. CouchPotato supports two protocols for downloading; Bittorrent for bittorrents and NZBs from Usenet sites.</p><p>You will install and configure these two downloaders before logging to CouchPotato so that you can start downloading as soon as you log in.</p><h2><a id=\"Installing_And_Configuring_a_Bittorrent_Downloader_Transmission_148\"></a>Installing And Configuring a Bittorrent Downloader: Transmission</h2><p>CouchPotato supports several different Bittorrent servers for automatically downloading bittorrents. The BitTorrent server that you will install in this guide is <a href=\"https://transmissionbt.com/\">Transmission</a> because of its ease of installation and lightweight resource footprint.</p><p>Transmission is installed with a single <code>apt</code> command:</p><pre><code class=\"language-sh\">sudo apt install transmission-daemon\n</code></pre><p>The <code>transmission-daemon</code> server will start automatically so shut this down before proceeding:</p><pre><code class=\"language-sh\">sudo systemctl stop transmission-daemon.service\n</code></pre><p>Transmission will run as the user <code>debian-transmission</code>. This user will need to be added to the <code>users</code> group so that they have permission to write to the <code>Downloads</code> directory. Do this by executing the following command:</p><pre><code class=\"language-sh\">sudo usermod <span class=\"hljs-operator\">-a</span> -G users debian-transmission\n</code></pre><p>Finally, you need to change the password that CouchPotato will need to use to access the Transmission server. This is held in a configuration file at <code>/etc/transmission-daemon/settings.json</code>. Open this file with a text editor:</p><pre><code>sudo nano /etc/transmission-daemon/settings.json\n</code></pre><p>Then find the line that looks like this:</p><pre><code> \"rpc-password\": \"{2f889e06ebec2515e6db5a8c70cec6fe8d89a50dUVQqNg9z\",\n</code></pre><p>And change everything between the second set of speech marks to a new password. Make a note of the new password.</p><p>Finally, start the transmission server:</p><pre><code class=\"language-sh\">sudo systemctl start transmission-daemon.service\n</code></pre><p>The BitTorrent downloader is now configured and running.</p><h2><a id=\"Installing_And_Configuring_A_Usenet_Downloader_NZBGet_183\"></a>Installing And Configuring A Usenet Downloader: NZBGet</h2><p>Install NZBGet with the following command:</p><pre><code class=\"language-sh\">sudo apt install nzbget\n</code></pre><p>Next, you will need to set a unique password for NZBGet because unlike Transmission a unique password is not generated on installation. Open the NZBGet configuration file with a text editor:</p><pre><code class=\"language-sh\">sudo nano /etc/nzbget.conf\n</code></pre><p>And scroll down until you find this line:</p><pre><code>ControlPassword=tegbzn6789\n</code></pre><p>Then change <code>tegbzn6789</code> for a new password. Make a note of this password then save and exit the text editor.</p><p>Finally, you need to create a systemd unit file for NZBGet so that it can be managed by systemd. Open the service file with a text editor:</p><pre><code class=\"language-sh\">sudo nano /etc/systemd/system/nzbget.service\n</code></pre><p>And paste in the following:</p><pre><code>[Unit]\nDescription=NZBGet\nAfter=network.target\n\n[Service]\nExecStart=/usr/bin/nzbget -D\nExecStop=/usr/bin/nzbget -Q\nExecReload=/bin/kill -HUP $MAINPID\nUser=pi\nKillMode=process\nType=forking\n\n[Install]\nWantedBy=multi-user.target\n</code></pre><p>Then enable and start NZBGet:</p><pre><code class=\"language-sh\">sudo systemctl <span class=\"hljs-built_in\">enable</span> nzbget.service\nsudo systemctl start nzbget.service\n</code></pre><p>The Usenet downloader is now configured and running. You can log into CouchPotato, perform the initial configuration and begin using it.</p><h2><a id=\"Logging_into_CouchPotato_234\"></a>Logging into CouchPotato</h2><p>CouchPotato is now running and listening on the public IP address of the Raspberry PI. You will need to get the IP of the Raspberry PI so that you can log into CouchPotato. In the terminal you have open run this command:</p><pre><code class=\"language-sh\">hostname -I\n</code></pre><p>The IPv4 IP address will be the first one listed. Take this IP address and create a URL that has the same format as the following one:</p><pre><code>http://&lt;IP&gt;:5050\n</code></pre><p>Substituting <code>&lt;IP&gt;</code> with an example private network IP gives us the example URL:</p><pre><code>http://192.168.0.3:5050\n</code></pre><p>Enter that into a browser on your computer on the same local network as your Raspberry PI.</p><p>The first time you log into CouchPotato you will be presented with the configuration wizard page. Here, we will work from top to bottom to configure CouchPotato.</p><h3><a id=\"Username_and_Password_254\"></a>Username and Password</h3><p>The first section is where you can set a user name and password for CochPotato. This is not mandatory but it is recommended.</p><h3><a id=\"Configuring_NZBGet_257\"></a>Configuring NZBGet</h3><p>Scroll down a little further in the <em>What download apps are you using?</em> section until you see the line marked <em>NZBGet</em>. Toggle the switch on the right to enable this downloader. This will reveal three dialog boxes:</p><ul><li>Host – Leave this set to <code>localhost:6789</code></li><li>Password – Edit this to the password you set in the <em>Installing And Configuring A Usenet Downloader: NZBGet</em> section.</li><li>Category – Set to a category that you want CouchPotato so display these downloads.</li></ul><h3><a id=\"Configuring_Transmission_264\"></a>Configuring Transmission</h3><p>Transmission is the line below NZBGet. Toggle the switch on the right to enable Transmission.</p><p>When you toggle the switch a dialog box will be revealed with the following four boxed:</p><ul><li>Host – Leave this set to <code>http://localhost:9091</code></li><li>Username – Leave this set to <code>transmission</code></li><li>Password – Copy and paste the password you noted in the <em>Installing And Configuring a Bittorrent Downloader: Transmission</em> section</li><li>Directory – This selects the directory where your downloads will be saved. When you click on this field a new box will open showing all the directories under the user <code>pi</code>‘s home directory. Select the <em>Downloads</em> directory.</li></ul><p>When you have finished this the Transmission section should look like this:</p><p><img data-lazyloaded=\"1\" src=\"data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=\" data-src=\"https://lowendbox.com/wp-content/uploads/2019/07/couchpotato-transmission-configure-completed.jpg.webp\" alt=\"\"></p><h2><a id=\"Select_Additional_Torrent_Providers_277\"></a>Select Additional Torrent Providers</h2><p>CouchPotato is pre-configured to access torrent sites to search for the movies that you want to download. The more that you enable the faster that CouchPotato will be able to find the movies you want. Most of the sites listed need a registered account that you will need to sign up for.</p><p>The following sites do not need a registered account so enable them immediately to speed up your searches:</p><ul><li>KickAssTorrents</li><li>YTS</li><li>ThePirateBay</li><li>MagnetDL</li><li>NZBClub (Free NZB Site)</li><li>Binsearch (Free NZB Site)</li></ul><p>You’re now ready to start using CouchPotato. Just hit:</p><p><img data-lazyloaded=\"1\" src=\"data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=\" data-src=\"https://lowendbox.com/wp-content/uploads/2019/07/CP-first-screen-ready-awesomness.jpg.webp\" alt=\"\"></p><h2><a id=\"Enabling_The_VNC_Remote_Desktop_292\"></a>Enabling The VNC Remote Desktop</h2><p><a href=\"https://en.wikipedia.org/wiki/Virtual_Network_Computing\">VNC</a> is an open-source version of the Windows Remote Desktop Protocol. It enables a person to log into the desktop environment of a remote computer such as your Raspberry Pi. When you have enabled VNC you will not have to use a keyboard and mouse to access your Raspberry PI’s desktop.</p><p>The default Raspbian image contains all the VNC components so you don’t need to install anything but you do need to enable it.</p><p>Open a terminal on the Raspbian desktop and enter the following command:</p><pre><code class=\"language-sh\">sudo raspi-config\n</code></pre><p>This will open a command-line menu. Use the up and down arrows and enter to navigate the menus. Proceed as follows:</p><ol><li>Highlight <code>Interfacing Options</code> and hit enter.</li><li>Highlight <code>P3 VNC</code> and hit enter.</li><li>Hit enter for <code>&lt;Yes&gt;</code>.</li><li>Confirm <code>&lt;OK&gt;</code>.</li><li>Use the <code>TAB</code> key to highlight <code>&lt;Finish&gt;</code> and hit enter to exit the program.</li></ol><p>You can now log into your Raspberry PI desktop using the <a href=\"https://www.realvnc.com/en/connect/download/viewer/\">VNC Viewer</a>. Downland and install this application on your local computer and use the IP address of your Raspberry PI to log in as the <code>pi</code> user.</p><h2><a id=\"Moving_Your_Movies_To_Your_Computer_311\"></a>Moving Your Movies To Your Computer</h2><p>After your downloads have completed you will need to move the movies and T.V. shows to your main computer so you can watch them. Here we will look at two easy ways of doing this.</p><h3><a id=\"Moving_The_USB_Device_314\"></a>Moving The USB Device</h3><p>The first method is to unplug the USB device from your Raspberry PI, plug it into your local computer, copy off the data and then plug it back into the Raspberry PI.</p><p>The following procedure will ensure that you do not corrupt the data on the USB device.</p><ol><li>Log into your Raspberry PI’s desktop via the VNC Viewer application linked to in the <em>Enabling The VNC Remote Desktop</em> section.</li><li>Shutdown the Raspberry PI.</li><li>Unplug the USB.</li><li>Plug the USB device into your local computer.</li><li>Copy your off on the device and onto your computer.</li><li>Eject or unmount the USB device.</li><li>Unplug the USB device.</li><li>Plug the USB device into the Raspberry PI.</li><li>Unplug and plug back in the power cable to the Raspberry PI.</li></ol><h3><a id=\"Copying_Files_Over_The_Network_328\"></a>Copying Files Over The Network</h3><p>Your Raspberry PI is connected to the local network so you can transfer your media to it over the network instead of manually moving the USB to your computer to copy the files.</p><p>The best program to get files securely from your Windows computer to the Raspberry PI is called <a href=\"https://winscp.net/eng/index.php\">WinSCP</a>. Follow that link to download, install and open WinSCP.</p><p>WinSCP will open the following dialog box:</p><p><img data-lazyloaded=\"1\" src=\"data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=\" data-src=\"https://lowendbox.com/wp-content/uploads/2019/06/winscp-select-host.jpg.webp\" alt=\"\"></p><p>Fill in the boxes as follows:</p><ul><li><em>Host</em> – Enter the IP of your Raspberry PI.</li><li><em>Username</em> – Enter <code>pi</code>.</li><li><em>Password</em> – Enter the password for user <code>pi</code>.</li></ul><p>Click <em>Save</em> and create a bookmark for the Raspberry PI. Finally, hit <em>Login</em> to log into your Raspberry PI.</p><p>Use the address bar in the right-hand panel to navigate to <code>/home/pi/Downloads</code>. You can download your movies and T.V. shows from this directory and then delete after you have them on your computer.</p><p>&nbsp;</p><p class=\"dpsp-share-text\"></p><div id=\"dpsp-content-bottom\" class=\"dpsp-content-wrapper dpsp-shape-rounded dpsp-column-auto dpsp-has-spacing dpsp-no-labels dpsp-show-on-mobile dpsp-button-style-1 dpsp-has-icon-background dpsp-has-button-background dpsp-show-total-share-count dpsp-show-total-share-count-after\"><ul class=\"dpsp-networks-btns-wrapper dpsp-networks-btns-content dpsp-has-button-icon-animation\"><li><a rel=\"nofollow\" href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flowendbox.com%2Fblog%2Fhow-to-install-and-configure-couchpotato-on-a-raspberry-pi%2F&amp;t=How%20To%20Install%20And%20Configure%20CouchPotato%20On%20A%20Raspberry%20PI\" class=\"dpsp-network-btn dpsp-facebook dpsp-no-label dpsp-first\" title=\"Share on Facebook\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://twitter.com/intent/tweet?text=How%20To%20Install%20And%20Configure%20CouchPotato%20On%20A%20Raspberry%20PI&amp;url=https%3A%2F%2Flowendbox.com%2Fblog%2Fhow-to-install-and-configure-couchpotato-on-a-raspberry-pi%2F&amp;via=LowEndNetwork\" class=\"dpsp-network-btn dpsp-twitter dpsp-no-label\" title=\"Share on Twitter\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://www.linkedin.com/shareArticle?url=https%3A%2F%2Flowendbox.com%2Fblog%2Fhow-to-install-and-configure-couchpotato-on-a-raspberry-pi%2F&amp;title=How%20To%20Install%20And%20Configure%20CouchPotato%20On%20A%20Raspberry%20PI&amp;mini=true\" class=\"dpsp-network-btn dpsp-linkedin dpsp-no-label dpsp-last\" title=\"Share on LinkedIn\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li></ul><div class=\"dpsp-total-share-wrapper\"><span class=\"dpsp-icon-total-share\"></span><span class=\"dpsp-total-share-count\">6</span><span>shares</span></div></div><div class=\"relpost-thumb-wrapper\"><div class=\"relpost-thumb-container\"><h3>Related posts:</h3><div style=\"clear: both\"></div><div style=\"clear: both\"></div><div class=\"relpost-block-container\"><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/lowendprotection-homemade-raspberry-pi-security-cloud-camera-setup/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"LowEndProtection: Homemade Raspberry Pi Security Cloud Camera Setup\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/07/rpi_security1-150x150.jpg) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">LowEndProtection: Homemade Raspberry Pi Security Cloud Camera Setup</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/giveaway-subscribe-to-lowendbox-for-a-chance-to-win-free-raspberry-pis-netgear-nighthawk-router-and-racknerd-account-credits/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"[GIVEAWAY] Subscribe to LowEndBox for a chance to win Free Raspberry Pi's, NETGear NightHawk Router,...\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/11/giveaway1-800-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">[GIVEAWAY] Subscribe to LowEndBox for a chance to win Free Raspberry Pi's, NETGear NightHawk Router,...</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/your-own-dedi-for-5-mo-you-can-with-a-raspberry-pi-from-rpi-servers/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Your Own Dedi for $5/mo?  You Can With a Raspberry Pi From RPI Servers!\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/10/rpiservers-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Your Own Dedi for $5/mo? You Can With a Raspberry Pi From RPI Servers!</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/how-to-run-a-tor-node-on-your-vps/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"How to Run a TOR Node on Your VPS\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/07/tor2-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">How to Run a TOR Node on Your VPS</div></div></a></div><div style=\"clear: both\"></div></div></div><div id=\"author-bio-box\" style=\"background: #f8f8f8; border-top: 2px solid #cccccc; border-bottom: 2px solid #cccccc; color: #333333\"><h3><a style=\"color: #555555;\" href=\"https://lowendbox.com/blog/author/jbiloh/\" title=\"All posts by Jon Biloh\" rel=\"author\">Jon Biloh</a></h3><div class=\"bio-gravatar\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI3MCIgaGVpZ2h0PSI3MCIgdmlld0JveD0iMCAwIDcwIDcwIj48cmVjdCB3aWR0aD0iMTAwJSIgaGVpZ2h0PSIxMDAlIiBmaWxsPSIjY2ZkNGRiIi8+PC9zdmc+\" alt=\"\" data-src=\"https://secure.gravatar.com/avatar/f766d6dc4b5f406b9f3cb0339d48de95?s=70&amp;d=retro&amp;r=pg\" data-srcset=\"https://secure.gravatar.com/avatar/f766d6dc4b5f406b9f3cb0339d48de95?s=140&amp;d=retro&amp;r=pg 2x\" class=\"avatar avatar-70 photo\" height=\"70\" width=\"70\" loading=\"lazy\"></div><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"https://www.lowendtalk.com/profile/jbiloh\" class=\"bio-icon bio-icon-website\"></a><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"http://Jbiloh\" class=\"bio-icon bio-icon-twitter\"></a><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"https://www.linkedin.com/in/jon-biloh-4b32598/\" class=\"bio-icon bio-icon-linkedin\"></a><p class=\"bio-description\">I'm Jon Biloh and I own LowEndBox and LowEndTalk. I've spent my nearly 20 year career in IT building companies and now I'm excited to focus on building and enhancing the community at LowEndBox and LowEndTalk.</p></div></div><div class=\"feedback\"></div></div>"}