{"id": "20041", "post": "<div class=\"post-20041 post type-post status-publish format-standard hentry category-virtual-servers category-tutorials tag-plex tag-plex-media-server tag-raspberry-pi tag-raspbian tag-rpi\" id=\"post-20041\"><h2 class=\"storytitle\"><a href=\"https://lowendbox.com/blog/install-plex-raspbian-stretch/\" rel=\"bookmark\">How To Install and Use A Plex Media Server On Raspbian Stretch</a></h2><div class=\"meta\"><img data-lazyloaded=\"1\" src=\"data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=\" data-src=\"/media/icons/tag_green.png\" alt=\"Tags: \"> <a href=\"https://lowendbox.com/tag/plex/\" rel=\"tag\">Plex</a>, <a href=\"https://lowendbox.com/tag/plex-media-server/\" rel=\"tag\">Plex Media Server</a>, <a href=\"https://lowendbox.com/tag/raspberry-pi/\" rel=\"tag\">raspberry pi</a>, <a href=\"https://lowendbox.com/tag/raspbian/\" rel=\"tag\">Raspbian</a>, <a href=\"https://lowendbox.com/tag/rpi/\" rel=\"tag\">RPI</a> <img data-lazyloaded=\"1\" src=\"data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=\" data-src=\"https://lowendbox.com/media/icons/calendar.png\" alt=\"Date/Time: \"> June 17, 2019 @ 8:33 pm, by Liam</div><div class=\"storycontent tablelook\"><p><a href=\"https://www.plex.tv/\">Plex</a> is a media streaming application that allows you to keep your media collection – movies, music, photos – on a server attached to your local network and access them from a browser-based interface or app. Plex even streams a wide variety of podcasts and shows directly from the internet and by upgrading to the <a href=\"https://www.plex.tv/plex-pass/\">Premium</a> (paid) tier Plex offers many more services. You can use the free version of Plex if you only want to view your own media and free to view streaming content.</p><p>In this guide, we will install Plex on a <a href=\"https://www.raspberrypi.org/\">Raspberry PI</a> minicomputer. Raspberry PI’s make grade Plex streaming servers because:</p><p><span id=\"more-20041\"></span></p><ol><li>They are low power and fan-less. You can leave them running 24/7 without worrying about your energy bills.</li><li>They are sufficiently powerful to stream HD movies to your computer.</li><li>They are full computers with a desktop environment so you can log and use GUI tools to manage them.</li><li>They are $35 USD!</li></ol><p>These reasons make a Raspberry PI an ideal home streaming server and a great introduction to using Linux if you haven’t already taken the plunge.</p><h2><a id=\"Requirements_10\"></a>Requirements</h2><p>You will need a few things to get your Plex server up and running. They are as follows:</p><ol><li>Raspberry PI 3 (any version).</li><li>16GB microSD card.</li><li>Micro-USB Android phone charger (for the Raspberry PI).</li><li>USB keyboard.</li><li>HDMI monitor or TV to use a monitor.</li><li>USB storage device which is large enough to hold your media.</li><li>A Plex user account (optional). You will need to this to claim your Plex media server and lock it to your account with your user name and password. You can register a Plex user account (for free) at <a href=\"https://www.plex.tv/\">https://www.plex.tv/</a></li></ol><p>You will use the keyboard and mouse to access the Raspberry PI during the installation and configuration. You will not need them later during normal use of Plex as we will configure the Raspberry PI be accessible via a VNC remote desktop connection.</p><h2><a id=\"Installing_The_Operating_System_22\"></a>Installing The Operating System</h2><p>Your first job is to get the operating installed onto the microSD card that will hold the OS of the Raspberry PI. The operating system that we will install is <a href=\"https://raspbian.org/\">Raspbian</a>. Raspbian is based on the <a href=\"https://www.debian.org/\">Debian</a> operating system and compiled for the ARM CPU that the Raspbian uses.</p><p>Browse to the download page <a href=\"https://www.raspberrypi.org/downloads/raspbian/\">here</a> and download the <em>Raspbian Stretch with desktop</em> image. This is a large, 1.1GB, file that you need to save to your computer. Do not unzip this file. The software we will use to flash it to the microSD card will do this for you.</p><p>If you are an experienced Linux user the command line instructions for flashing the Raspbian image are <a href=\"https://www.raspberrypi.org/documentation/installation/installing-images/linux.md\">here</a></p><p>Everyone else needs to download and install the software that we will use to flash the microSD card – <a href=\"https://www.balena.io/etcher/\">balenaEtcher</a>. This software is a beautiful cross-platform (Windows, OSX, and Linux) application that flashes SD cards and USB thumb drives.</p><p>Note, you will erase any data on the microSD card in the next step so make sure you have a copy of any data on it before you proceed.</p><p>Insert your microSD card into your computer and start up balenaEtcher. The simple screen that you will see looks like this:</p><p><img data-lazyloaded=\"1\" src=\"data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=\" data-src=\"http://lowendbox.com/wp-content/uploads/2019/06/etcher-select-image.jpg.webp\" alt=\"\"></p><p>Click on the <code>Select image</code> button and browse to the Raspbian image you downloaded and select it. balenaEtcher will search for and automatically select the microSD card that plugged into your computer. Check that the size listed next to the device that balenaEtcher has selected is the same size as your micoSD card just to be sure you are using the right device.</p><p>When you are ready hit <code>Flash!</code>. It will take several minutes to flash the microSD card. When balenEtcher has finished remove the microSD card and load it into your Raspberry PI.</p><p>Plug the screen and keyboard into your Raspberry PI and then plug in the phone charger. The Raspberry PI will now power on. Log in with the following details:</p><ul><li>Username – <code>pi</code></li><li>Password – <code>raspberry</code></li></ul><p>Follow the first-boot, on-screen instructions until you get to the desktop.</p><p>You will need to open a terminal to continue the guide.</p><h2><a id=\"System_Users_and_Groups_49\"></a>System Users and Groups</h2><p>When you install Plex later in this guide a new system user will be created called <code>plex</code>. We are going to create this user now so that we can use it before we install Plex.</p><p>In the terminal you have open on the Raspberry PI run the following command to create the new user called <code>plex</code>:</p><pre><code class=\"language-sh\">sudo useradd plex\n</code></pre><p>This command will not create a home directory at <code>/home/plex</code> it will only add the user to the system. Now that <code>plex</code> exists we are going to add them to the <code>users</code> group. This will allow us to mount the USB storage device using the <code>users</code> group which will allow both <code>plex</code> and <code>pi</code> to read and write to the device.</p><p>The following command will add <code>plex</code> to the <code>users</code> group:</p><pre><code class=\"language-sh\">sudo usermod <span class=\"hljs-operator\">-a</span> -G users plex\n</code></pre><h2><a id=\"AutoMounting_The_USB_Device_64\"></a>Auto-Mounting The USB Device</h2><p>Raspbian will always give the device name <code>/dev/sda</code> to the first USB device that you plug into the Raspberry PI. This allows us to create an entry in the file that configures device mounting, <code>/etc/fstab</code>, so that the USB you have your media on will always get automatically mounted at the same location.</p><p>Before you edit <code>/etc/fstab</code> you need to get the UID (<em>U</em>ser <em>ID</em>) of <code>pi</code> and the GID (<em>G</em>roup <em>ID</em>) of <code>users</code>. First, get the UID of <code>pi</code> by running this command:</p><pre><code class=\"language-sh\">sudo grep <span class=\"hljs-string\">\"pi\"</span> /etc/passwd\n</code></pre><p>This will give output that looks like the following:</p><pre><code>pi:x:1000:1000:,,,:/home/pi:/bin/bash\n</code></pre><p><code>pi</code>‘s UID is the first number i.e. 1000. The following command will get the UID of <code>users</code>:</p><pre><code class=\"language-sh\">sudo grep <span class=\"hljs-string\">\"users\"</span> /etc/group\n</code></pre><p>This prints the output:</p><pre><code>users:x:100:pi,plex\n</code></pre><p>The UID of <code>users</code> is 100. Using this information open <code>/etc/fstab</code> with a text editor. Here <code>nano</code> is used:</p><pre><code class=\"language-sh\">sudo nano /etc/fstab\n</code></pre><p>Add a line that has the following format:</p><pre><code>/dev/sda1  /media/pi/Media  vfat  umask=0002,gid=&lt;GID&gt;,uid=&lt;UID&gt;  0  0\n</code></pre><p>Substituting the values we discovered earlier:</p><pre><code>/dev/sda1  /media/pi/Media  vfat  umask=0002,gid=100,uid=1000  0  0\n</code></pre><p>You must use the values from your Raspberry PI.</p><p>Finally, we need to create the directory we have set as the mount point and change its user and group:</p><pre><code class=\"language-sh\">sudo mkdir -p /media/pi/Media\nsudo chown -R pi:users /media/pi\nsudo chmod -R <span class=\"hljs-number\">775</span> /media/pi\n</code></pre><p>Plug in your USB device and confirm that it has been automatically mounted at <code>/media/pi/Media</code>. You will be prompted to open a file manager when you plug in the USB device that will open to its mount point i.e. <code>/media/pi/Media</code>.</p><h2><a id=\"Installing_Plex_113\"></a>Installing Plex</h2><p>Plex is not installable from the default Raspbian repositories. As a result, you will need to add the Plex repository and their APT signing key.</p><p>Add their APT key with the following command:</p><pre><code class=\"language-sh\">sudo wget https://downloads.plex.tv/plex-keys/PlexSign.key -O - | sudo apt-key add -\n</code></pre><p>Next, open a new APT sources file that will contain the address of the Plex repository:</p><pre><code class=\"language-sh\">sudo nano /etc/apt/sources.list.d/plex.list\n</code></pre><p>Add this line:</p><pre><code>deb https://downloads.plex.tv/repo/deb public main\n</code></pre><p>Save and exit. Before installing new software a good policy is to first perform a system update. This will help avoid any installation errors. Run these two commands to get your Raspberry PI up to date:</p><pre><code class=\"language-sh\">sudo apt update\nsudo apt upgrade\n</code></pre><p>When they have completed install Plex with this command:</p><pre><code class=\"language-sh\">sudo apt install plexmediaserver\n</code></pre><p>Plex is now installed and ready to start serving media. You should, if you haven’t already done so, plug in your USB device that contains your media now.</p><h2><a id=\"Logging_into_Plex_144\"></a>Logging into Plex</h2><p>Plex is now running and listening on the public IP address of the Raspberry PI. You will need to get the IP of the Raspberry PI so that you can log into Plex. In the terminal you have open run this command:</p><pre><code class=\"language-sh\">hostname -I\n</code></pre><p>The IPv4 IP address will be the first one listed. Take this IP address and create a URL that has the same format as the following one:</p><pre><code>http://&lt;IP&gt;:32400/web/\n</code></pre><p>Substituting <code>&lt;IP&gt;</code> with an example private network IP gives us the example URL:</p><pre><code>http://192.168.0.2:32400/web/\n</code></pre><p>Enter that into a browser on your computer on the same local network as your Raspberry PI.</p><p>Here, if you have signed up for a Plex account, you need to use those credentials to log into your Plex server. The Plex server will verify the user name and password with the Plex servers. You do not need to do this but not doing so will disable functionality including some security features.</p><h2><a id=\"Adding_Your_Media_Library_164\"></a>Adding Your Media Library</h2><p>During the initial login and setup you will be prompted to add your own media library with the following dialog:</p><p><img data-lazyloaded=\"1\" src=\"data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=\" data-src=\"http://lowendbox.com/wp-content/uploads/2019/06/plex-add-library-startup.png.webp\" alt=\"\"></p><p>You can also do this from the Plex desktop after the initial setup by clicking on the <em>Add Library</em> link in the side navigation panel.</p><p>When you click “Add Library” dialog box will open:</p><p><img data-lazyloaded=\"1\" src=\"data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=\" data-src=\"http://lowendbox.com/wp-content/uploads/2019/06/plex-select-library-type2.jpg.webp\" alt=\"\"></p><p>Choose the type of media on your USB device and change the name of the library by clicking on the <em>Name</em> field. Then click <em>Next</em>.</p><p>Now click on the <em>BROWSE FOR MEDIA FOLDERS</em> button on the page that follows:</p><p><img data-lazyloaded=\"1\" src=\"data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=\" data-src=\"http://lowendbox.com/wp-content/uploads/2019/06/plex-add-folders.jpg.webp\" alt=\"\"></p><p>This will open a new dialog:</p><p><img data-lazyloaded=\"1\" src=\"data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=\" data-src=\"http://lowendbox.com/wp-content/uploads/2019/06/plex-add-folder.jpg.webp\" alt=\"\"></p><p>Select the <em>Media</em> folder and click <em>ADD</em>. This is the folder we created to mount your USB cevice e.g. <code>/media/pi/Media</code>. Finally, confirm that this is correct by clicking the <em>ADD LIBRARY</em> button. All your media on the USB device will now appear on the Plex desktop and be ready to stream to any device on your local network.</p><h2><a id=\"Enabling_The_VNC_Remote_Desktop_187\"></a>Enabling The VNC Remote Desktop</h2><p><a href=\"https://en.wikipedia.org/wiki/Virtual_Network_Computing\">VNC</a> is an open source version of the Windows Remote Desktop Protocol. It enables a person to log into the desktop environment of a remote computer such as your Raspberry PI. When you have enabled VNC you will not have to use a keyboard and mouse to access your Raspberry PI’s desktop.</p><p>The default Raspbian image contains all the VNC components so you don’t need to install anything but you do need to enable it.</p><p>Open a terminal on the Raspbian desktop and enter the following command:</p><pre><code class=\"language-sh\">sudo raspi-config\n</code></pre><p>This will open a command line menu. Use the up and down arrows and enter to navigate the menus. Proceed as follows:</p><ol><li>Highlight <code>Interfacing Options</code> and hit enter.</li><li>Highlight <code>P3 VNC</code> and hit enter.</li><li>Hit enter for <code>&lt;Yes&gt;</code>.</li><li>Confirm <code>&lt;OK&gt;</code>.</li><li>Use the <code>TAB</code> key to highlight <code>&lt;Finish&gt;</code> and hit enter to exit the program.</li></ol><p>You can now log into your Raspberry PI desktop using the <a href=\"https://www.realvnc.com/en/connect/download/viewer/\">VNC Viewer</a>. Downland and install this application on your local computer and use the IP address of your Raspberry PI to log in as the <code>pi</code> user.</p><h2><a id=\"Adding_New_Media_To_Your_Library_206\"></a>Adding New Media To Your Library</h2><p>When you need to update the media on your USB device so that you have new movies or shows to watch there are two ways to get this done.</p><h3><a id=\"Moving_The_USB_Device_209\"></a>Moving The USB Device</h3><p>The first method is to unplug the USB device from your Raspberry PI, plug it into your local computer, copy the data onto it and move it back.</p><p>The following procedure will ensure that you do not corrupt the data on the USB device.</p><ol><li>Log into your Raspberry PI’s desktop via the VNC Viewer application linked to in the <em>Enabling The VNC Remote Desktop</em> section.</li><li>Shutdown the Raspberry PI.</li><li>Unplug the USB.</li><li>Plug the USB device into your local computer.</li><li>Copy your data on the device.</li><li>Eject or unmount the USB device.</li><li>Unplug the USB device.</li><li>Plug the USB device into the Raspberry PI.</li><li>Unplug and plug back in the power cable to the Raspberry PI.</li></ol><p>When your Raspberry PI boots up log back into Plex click on the three dots next to your Media Library then click on <em>Scan Library Files</em>. This will prompt Plex to review the contents of the USB device and add the new media files to your Library.</p><h3><a id=\"Copying_Files_Over_The_Network_225\"></a>Copying Files Over The Network</h3><p>Your Raspberry PI is connected to the local network so you can transfer your media to it over the network instead of manually moving the USB to your computer to copy the files.</p><p>The best program to get files securely from your Windows computer to the Raspberry PI is called <a href=\"https://winscp.net/eng/index.php\">WinSCP</a>. Follow that link to download, install and open WinSCP.</p><p>WinSCP will open the following dialoge box:</p><p><img data-lazyloaded=\"1\" src=\"data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=\" data-src=\"http://lowendbox.com/wp-content/uploads/2019/06/winscp-select-host.jpg.webp\" alt=\"\"></p><p>Fill in the boxes as follows:</p><ul><li><em>Host</em> – Enter the IP of your Raspberry PI.</li><li><em>Username</em> – Enter <code>pi</code>.</li><li><em>Password</em> – Enter the password for user <code>pi</code>.</li></ul><p>Click <em>Save</em> and create a bookmark for the Raspberry PI. Finally, hit <em>Login</em> to log into your Raspberry PI.</p><p>Use the address bar in the right-hand panel to navigate to <code>/media/pi/Media</code>:</p><p><img data-lazyloaded=\"1\" src=\"data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=\" data-src=\"http://lowendbox.com/wp-content/uploads/2019/06/wins-scp-file-browser-layout-pi.jpg.webp\" alt=\"\"></p><p>You can create directories to organize your media in there and the Plex server will automatically index everything.</p><h2><a id=\"Accessing_Your_Media_247\"></a>Accessing Your Media</h2><p>In this guide, you have accessed your Plex with a browser from your local computer. You are also able to access your Plex server from your phone or tablet via the official Plex app. This link will install if for <a href=\"https://play.google.com/store/apps/details?id=com.plexapp.android\">Android</a>. If you are using an iPhone or an iPad search for “Plex” in the AppStore on your device.</p><h2><a id=\"Conclusion_250\"></a>Conclusion</h2><p>You have now got a Raspberry PI installed and running as your Plex media server on your local home network. This article covered the basic installation and configuration to get a Plex up and running. Now that you have done that you should read some of the articles on the Plex website that cover how to get the most of your Plex server: <a href=\"https://support.plex.tv/articles/\">https://support.plex.tv/articles/</a> .</p><p>&nbsp;</p><p class=\"dpsp-share-text\"></p><div id=\"dpsp-content-bottom\" class=\"dpsp-content-wrapper dpsp-shape-rounded dpsp-column-auto dpsp-has-spacing dpsp-no-labels dpsp-show-on-mobile dpsp-button-style-1 dpsp-has-icon-background dpsp-has-button-background dpsp-show-total-share-count dpsp-show-total-share-count-after\"><ul class=\"dpsp-networks-btns-wrapper dpsp-networks-btns-content dpsp-has-button-icon-animation\"><li><a rel=\"nofollow\" href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flowendbox.com%2Fblog%2Finstall-plex-raspbian-stretch%2F&amp;t=How%20To%20Install%20and%20Use%20A%20Plex%20Media%20Server%20On%20Raspbian%20Stretch\" class=\"dpsp-network-btn dpsp-facebook dpsp-no-label dpsp-first\" title=\"Share on Facebook\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://twitter.com/intent/tweet?text=How%20To%20Install%20and%20Use%20A%20Plex%20Media%20Server%20On%20Raspbian%20Stretch&amp;url=https%3A%2F%2Flowendbox.com%2Fblog%2Finstall-plex-raspbian-stretch%2F&amp;via=LowEndNetwork\" class=\"dpsp-network-btn dpsp-twitter dpsp-no-label\" title=\"Share on Twitter\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://www.linkedin.com/shareArticle?url=https%3A%2F%2Flowendbox.com%2Fblog%2Finstall-plex-raspbian-stretch%2F&amp;title=How%20To%20Install%20and%20Use%20A%20Plex%20Media%20Server%20On%20Raspbian%20Stretch&amp;mini=true\" class=\"dpsp-network-btn dpsp-linkedin dpsp-no-label dpsp-last\" title=\"Share on LinkedIn\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li></ul><div class=\"dpsp-total-share-wrapper\"><span class=\"dpsp-icon-total-share\"></span><span class=\"dpsp-total-share-count\">0</span><span>shares</span></div></div><div class=\"relpost-thumb-wrapper\"><div class=\"relpost-thumb-container\"><h3>Related posts:</h3><div style=\"clear: both\"></div><div style=\"clear: both\"></div><div class=\"relpost-block-container\"><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/lowendprotection-homemade-raspberry-pi-security-cloud-camera-setup/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"LowEndProtection: Homemade Raspberry Pi Security Cloud Camera Setup\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/07/rpi_security1-150x150.jpg) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">LowEndProtection: Homemade Raspberry Pi Security Cloud Camera Setup</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/giveaway-subscribe-to-lowendbox-for-a-chance-to-win-free-raspberry-pis-netgear-nighthawk-router-and-racknerd-account-credits/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"[GIVEAWAY] Subscribe to LowEndBox for a chance to win Free Raspberry Pi's, NETGear NightHawk Router,...\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/11/giveaway1-800-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">[GIVEAWAY] Subscribe to LowEndBox for a chance to win Free Raspberry Pi's, NETGear NightHawk Router,...</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/your-own-dedi-for-5-mo-you-can-with-a-raspberry-pi-from-rpi-servers/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Your Own Dedi for $5/mo?  You Can With a Raspberry Pi From RPI Servers!\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/10/rpiservers-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Your Own Dedi for $5/mo? You Can With a Raspberry Pi From RPI Servers!</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/how-to-set-up-plex-media-server-on-your-vps/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"How to Set Up Plex Media Server on Your Cheap VPS\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/04/how-to-set-up-plex-media-server-on-vps-2-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">How to Set Up Plex Media Server on Your Cheap VPS</div></div></a></div><div style=\"clear: both\"></div></div></div><div id=\"author-bio-box\" style=\"background: #f8f8f8; border-top: 2px solid #cccccc; border-bottom: 2px solid #cccccc; color: #333333\"><h3><a style=\"color: #555555;\" href=\"https://lowendbox.com/blog/author/liam/\" title=\"All posts by Liam\" rel=\"author\">Liam</a></h3><div class=\"bio-gravatar\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI3MCIgaGVpZ2h0PSI3MCIgdmlld0JveD0iMCAwIDcwIDcwIj48cmVjdCB3aWR0aD0iMTAwJSIgaGVpZ2h0PSIxMDAlIiBmaWxsPSIjY2ZkNGRiIi8+PC9zdmc+\" alt=\"\" data-src=\"https://secure.gravatar.com/avatar/2a78fb56721359b1d81ed05edb5a734f?s=70&amp;d=retro&amp;r=pg\" data-srcset=\"https://secure.gravatar.com/avatar/2a78fb56721359b1d81ed05edb5a734f?s=140&amp;d=retro&amp;r=pg 2x\" class=\"avatar avatar-70 photo\" height=\"70\" width=\"70\" loading=\"lazy\"></div><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"http://www.lowendbox.com\" class=\"bio-icon bio-icon-website\"></a><p class=\"bio-description\"></p></div></div><div class=\"feedback\"></div></div>"}