{"id": "25188", "post": "<div class=\"post-25188 post type-post status-publish format-standard hentry category-interview tag-interview tag-qa\" id=\"post-25188\"><h2 class=\"storytitle\"><a href=\"https://lowendbox.com/blog/interview-qa-with-servermania-co-founder-and-cmo-justin-blanchard/\" rel=\"bookmark\">Interview: Q&amp;A with ServerMania Co-Founder and CMO Justin Blanchard</a></h2><div class=\"meta\"><img data-lazyloaded=\"1\" src=\"/media/icons/tag_green.png\" data-src=\"/media/icons/tag_green.png\" alt=\"Tags: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> <a href=\"https://lowendbox.com/tag/interview/\" rel=\"tag\">interview</a>, <a href=\"https://lowendbox.com/tag/qa/\" rel=\"tag\">q&amp;a</a> <img data-lazyloaded=\"1\" src=\"https://lowendbox.com/media/icons/calendar.png\" data-src=\"https://lowendbox.com/media/icons/calendar.png\" alt=\"Date/Time: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> January 18, 2021 @ 3:13 am, by Jon Biloh</div><div class=\"storycontent tablelook\"><p><img data-lazyloaded=\"1\" src=\"https://lowendbox.com/wp-content/uploads/2021/01/JB-cover.jpg.webp\" loading=\"lazy\" class=\"screenshot alignnone litespeed-loaded\" title=\"Justin Blanchard, Co-Founder and CMO of ServerMania\" data-src=\"https://lowendbox.com/wp-content/uploads/2021/01/JB-cover.jpg.webp\" alt=\"Justin Blanchard, Co-Founder and CMO of ServerMania\" width=\"350\" height=\"452\" data-was-processed=\"true\"></p><p><span style=\"font-weight: 400;\">Today we are continuing our <a href=\"https://lowendbox.com/category/interview/\">Low End Box Interview Series</a>, and we’re thrilled to talk to Justin Blanchard, Co-Founder and Chief Marketing Officer of ServerMania. The ServerMania story is especially exciting because in the early years of their impressive expansion they marketed heavily on LowEndBox to our users with great deals. Today ServerMania continues to innovate having just launched a new cloud offering and their impressive expansion globally. </span></p><p><span style=\"font-weight: 400;\">This is the second interview we’ve done with ServerMania, having first interviewed <a href=\"https://lowendbox.com/blog/interview-qa-with-servermania-ceo-kevin-blanchard-on-building-an-industry-leader-and-taking-care-of-customers/\">Co-Founder and CEO Kevin Blanchard in July 2020</a>.</span></p><p><span style=\"font-weight: 400;\">So, let’s get started with the interview!</span></p><p><strong>Tell me about your background and ServerMania’s history?</strong></p><p>Before joining the hosting industry and co-founding ServerMania, I owned and operated a marketing consulting company for nearly a decade. My client base included several institutions such as the financial sector, hotel &amp; hospitality including casinos, property development, e-commerce and internet hosting. During that period, I provided a range of services including corporate and brand identity, multimedia design, web development, marketing feasibility studies, and SEO.</p><p>In early 2000 my brother incorporated and managed his hosting company B2 Net Solutions Inc. and in 2008 I joined his company in the capacity of Brand Manager. In the three years that followed, we shared a unified vision to evolve B2 Net into a next-gen hosting company. It was by 2011 that we decided the company would need to reinvent itself to stay competitive and innovative in a highly saturated market, while solving the several industry pain points that were identified in our industry – specifically focused on customer service.</p><p>To differentiate ourselves further, we agreed it was necessary to launch and rebrand with a custom control panel that would give clients a better experience. By early 2013, ServerMania was founded as a result of completing a successful rebrand in less than two years. Through this rebrand, we established the essentials to position ServerMania as a strong competitor in the marketplace and by the end of 2013 we had already seen over 300% revenue increase.</p><p>At this point in time, I realized that I wanted to seek a permanent position as a partner in the company in the capacity of CMO in 2014. Since then, ServerMania has successfully expanded its network year after year. We now have eight data center locations across the USA, Canada, Europe and New Zealand.</p><p><span id=\"more-25188\"></span></p><p><strong>What would you tell someone looking to start a hosting company today? What advice would you offer?&nbsp;&nbsp;</strong></p><p>Make sure it’s something you are passionate about. The hosting market can seem very competitive, but that does not mean there aren’t any niches to take advantage of. Establish your own brand, something that is unique and memorable that you can get behind. There are plenty of tools available in today’s marketplaces that are cost-effective and user-friendly.</p><p>Also, it’s important to build a good business plan and find yourself a strategic hosting provider who will work with your needs, and really go the extra mile in both service and support. They might be far and few, but this was crucial in our earlier years of success.</p><p><strong>Where do you think the future takes the hosting industry and ServerMania specifically?</strong></p><p>For years, the e-commerce market has been growing with the demand for web and app hosting services. Since COVID, this market is exploding and it’s safe to say this market is resilient and pandemic-proof. I believe that the future for the hosting industry, particularly web hosting, over the next decade will be focused around the shift towards highly available services. This is why we have been innovating our cloud to provide customers with turn-key hosting solutions in order to keep up with user expectations.</p><p>Cloud computing will continue to evolve as we move into the future, and technology on the cusp of mainstream adoption – from driverless cars to ubiquitous robotics to augmented and virtual reality — will all depend on the cloud.</p><p>With traditional hosting infrastructure being shifted to cloud computing models, ServerMania is looking to adapt by blending our bare metal infrastructure into our cloud and offering hybrid solutions. I believe that hybrid solutions are here to stay, and bare-metal cloud is a good approach to implement as cloud computing is one of the most continually disruptive forces in IT markets.</p><p><strong>What makes your company unique in today’s evolving market landscape? How are you evolving with the times?</strong></p><p>Our core team members were all customers at some point in time and as a result, we understand the importance of quality service. This is the fundamental basis on which our company has been built upon. Starting small and from our homes helped us recognize the value and importance of personalized service in an industry where everything is becoming more and more automated. Especially in light of COVID and the evolving times, we’ve had to adapt to work-from-home schedules while still maintaining strong inter-office relations.</p><p>To maintain our competitive edge, we strive to uphold a customer-centric decision-making process. We are proud to see that many of our clients today were some of our early customers back in 2012. We greatly value customer loyalty and use this as a constant reminder to make sure we are constantly upholding superb customer service.</p><p><strong>What do you enjoy most about your role? What do you find most difficult?</strong></p><p>Every day brings new challenges which requires different solutions. It’s very rewarding to see the accomplishments of our marketing and sales team and how it affects our customers.</p><p>Along with the responsibilities of my role, I spend my time overseeing new areas and marketing tactics that we alter to fit our business. With this comes some challenges since not all marketing techniques can be applied to each industry. Therefore, it is critical to find the balance of what works for our products and services.</p><p><strong>Both personally and professionally, what guiding principles ground you?</strong></p><p>I always choose to operate with integrity and accountability. I’m a believer that you should always follow through with your promises to your staff and moreover, to your customers. I also believe that being transparent and having good and open communication is crucial when working in any sized team. This is the driving force behind ServerMania and what really helps our entire team succeed.</p><p><strong>Give us some details on new and exciting things you are working on?</strong></p><p>We always have so many new and exciting projects on the go at ServerMania, but some highlight worthy mentions are new product development with innovations to our cloud and UX improvements across our various platforms.</p><p>In addition, we are also revamping our affiliate program with even more incentives, resources and promotional tools to empower our affiliates. We’ve seen a growing need for managed services and super high bandwidth plans, so we are currently working on enhancing both of these product services.</p><p><strong>Why should customers trust you and your business?</strong></p><p>Customers trust ServerMania because we invest in the right technology, focus on delivering a world-class personalized customer experience, and work hard every day to always improve our service offering.</p><p>Since 2003, we have been the trusted server provider to enterprise companies all over the world. Our testimonials are proof of businesses both small and large that are migrating to us from other providers such as AWS because of the service and support levels we uphold and the experience they receive. We pride ourselves on providing personal customer service and going the extra mile in tailoring our solutions to meet the needs and budget of our clients. As a result, we are proud to say that many of our clients have been with us for over 10 years.</p><p>A common concern in our industry today is centered around data privacy and security. At ServerMania, we take this extremely seriously. We are GDPR compliant and abide by the most stringent personal data protection and privacy rules.</p><p><strong>Final thoughts and anything you would like to add?</strong></p><p>At ServerMania, our team members take a great deal of pride in what they do and execute each task with their best intent. Our service is still very familial which we strive to keep consistent, regardless of how much we grow.</p><p>We’ve been part of the LEB community since 2013 and would like to thank this community for supporting us during our earlier years of growth.</p><p><strong>To check out ServerMania’s cloud free, click the banner below:</strong></p><p><a href=\"https://www.servermania.com/servers/cloud-server-hosting-leb-5.htm?utm_source=lowendbox&amp;utm_medium=banner-300x250&amp;utm_campaign=freetrial\" target=\"_blank\" rel=\"noopener noreferrer\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSIzMDAiIGhlaWdodD0iMjUwIiB2aWV3Qm94PSIwIDAgMzAwIDI1MCI+PHJlY3Qgd2lkdGg9IjEwMCUiIGhlaWdodD0iMTAwJSIgZmlsbD0iI2NmZDRkYiIvPjwvc3ZnPg==\" loading=\"lazy\" class=\"aligncenter wp-image-25189 size-full\" data-src=\"https://lowendbox.com/wp-content/uploads/2020/11/servermania-cloud-2.jpg.webp\" alt=\"\" width=\"300\" height=\"250\"></a></p><div class=\"relpost-thumb-wrapper\"><div class=\"relpost-thumb-container\"><h3>Related posts:</h3><div style=\"clear: both\"></div><div style=\"clear: both\"></div><div class=\"relpost-block-container\"><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/poll-did-you-enjoy-our-interview-series/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Poll: Did You Enjoy Our Interview Series?\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/06/lowendbox-poll-150x150.jpg) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Poll: Did You Enjoy Our Interview Series?</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-interserver-director-of-marketing-stacey-talieres/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Stacey Talieres, Director of Marketing of InterServer\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/11/LEN0050-150x150.jpg) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with InterServer Director of Marketing Stacey Talieres</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-x4b-ceo-mathew-heard-on-the-ddos-protection-and-the-future-of-the-industry/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"John Brancela, CEO of ServerHub Inc\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/10/Brancela_LEB-150x150.jpg) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with ServerHub CEO John Brancela on Growing with the Market</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-dedipath-cto-ernie-quick-on-his-company-and-making-success-happen/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"DediPath\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/10/DediPath_Logo-150x150.jpg) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with DediPath CTO Ernie Quick on His Company and Making Success Happen</div></div></a></div><div style=\"clear: both\"></div></div></div><div id=\"author-bio-box\" style=\"background: #f8f8f8; border-top: 2px solid #cccccc; border-bottom: 2px solid #cccccc; color: #333333\"><h3><a style=\"color: #555555;\" href=\"https://lowendbox.com/blog/author/jbiloh/\" title=\"All posts by Jon Biloh\" rel=\"author\">Jon Biloh</a></h3><div class=\"bio-gravatar\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI3MCIgaGVpZ2h0PSI3MCIgdmlld0JveD0iMCAwIDcwIDcwIj48cmVjdCB3aWR0aD0iMTAwJSIgaGVpZ2h0PSIxMDAlIiBmaWxsPSIjY2ZkNGRiIi8+PC9zdmc+\" alt=\"\" data-src=\"https://secure.gravatar.com/avatar/f766d6dc4b5f406b9f3cb0339d48de95?s=70&amp;d=retro&amp;r=pg\" data-srcset=\"https://secure.gravatar.com/avatar/f766d6dc4b5f406b9f3cb0339d48de95?s=140&amp;d=retro&amp;r=pg 2x\" class=\"avatar avatar-70 photo\" height=\"70\" width=\"70\" loading=\"lazy\"></div><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"https://www.lowendtalk.com/profile/jbiloh\" class=\"bio-icon bio-icon-website\"></a><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"http://Jbiloh\" class=\"bio-icon bio-icon-twitter\"></a><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"https://www.linkedin.com/in/jon-biloh-4b32598/\" class=\"bio-icon bio-icon-linkedin\"></a><p class=\"bio-description\">I'm Jon Biloh and I own LowEndBox and LowEndTalk. I've spent my nearly 20 year career in IT building companies and now I'm excited to focus on building and enhancing the community at LowEndBox and LowEndTalk.</p></div></div><div class=\"feedback\"></div></div>"}