{"id": "24833", "post": "<div class=\"post-24833 post type-post status-publish format-standard hentry category-interview tag-finland tag-interview tag-pulsedmedia tag-qa tag-seedboxes\" id=\"post-24833\"><h2 class=\"storytitle\"><a href=\"https://lowendbox.com/blog/interview-qa-with-aleksi-ceo-of-pulsedmedia/\" rel=\"bookmark\">Interview: Q&amp;A with Aleksi, CEO of PulsedMedia</a></h2><div class=\"meta\"><img data-lazyloaded=\"1\" src=\"/media/icons/tag_green.png\" data-src=\"/media/icons/tag_green.png\" alt=\"Tags: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> <a href=\"https://lowendbox.com/tag/finland/\" rel=\"tag\">finland</a>, <a href=\"https://lowendbox.com/tag/interview/\" rel=\"tag\">interview</a>, <a href=\"https://lowendbox.com/tag/pulsedmedia/\" rel=\"tag\">pulsedmedia</a>, <a href=\"https://lowendbox.com/tag/qa/\" rel=\"tag\">q&amp;a</a>, <a href=\"https://lowendbox.com/tag/seedboxes/\" rel=\"tag\">seedboxes</a> <img data-lazyloaded=\"1\" src=\"https://lowendbox.com/media/icons/calendar.png\" data-src=\"https://lowendbox.com/media/icons/calendar.png\" alt=\"Date/Time: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> October 24, 2020 @ 12:00 am, by raindog308</div><div class=\"storycontent tablelook\"><p><a href=\"https://pulsedmedia.com/\" target=\"_blank\" rel=\"noopener noreferrer\"><img data-lazyloaded=\"1\" src=\"https://lowendbox.com/wp-content/uploads/2020/09/pulsedmedia-300x300.png.webp\" loading=\"lazy\" class=\"size-medium wp-image-24834 alignright litespeed-loaded\" data-src=\"https://lowendbox.com/wp-content/uploads/2020/09/pulsedmedia-300x300.png.webp\" alt=\"\" width=\"300\" height=\"300\" align=\"right\" hspace=\"20\" data-srcset=\"https://lowendbox.com/wp-content/uploads/2020/09/pulsedmedia.png.webp 300w, https://lowendbox.com/wp-content/uploads/2020/09/pulsedmedia-150x150.png.webp 150w\" data-sizes=\"(max-width: 300px) 100vw, 300px\" sizes=\"(max-width: 300px) 100vw, 300px\" srcset=\"https://lowendbox.com/wp-content/uploads/2020/09/pulsedmedia.png.webp 300w, https://lowendbox.com/wp-content/uploads/2020/09/pulsedmedia-150x150.png.webp 150w\" data-was-processed=\"true\"></a>Our <a href=\"https://lowendbox.com/category/interview/\">LowEndBox Interview Series</a> has featured many interesting personalities so far and today we’re excited to bring you an interview with the <strong>CEO and Founder of Pulsed Media, Aleksi</strong>.&nbsp; I learned a lot about the seedbox market from reading his answers and I think you’ll find this interview an interesting look into a fascinating niche market.&nbsp; From hardware to Finnish taxes, this interview is jam-packed so let’s jump in!</p><p><strong>Where in the world is your company located?</strong></p><p>Helsinki, Finland</p><p><strong>Tell me about your background and your company’s history</strong></p><p><a href=\"https://pulsedmedia.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Pulsed Media</a> has been providing seedboxes since early 2010. It was more of a passion project with another person who had been offering seedboxes but did not know how to manage and operate a proper business, the founder of <a href=\"https://pulsedmedia.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Pulsed Media</a> actually had to loan 20€ just to get the billing system + site setup as he was paying off debt with every dime he had. In February 2010 preorder sales opened and we got immediately hundreds of sales, had some issues with small French DC initially and we got scammed, no servers but servers paid upfront, we quickly moved to OVH and the founder paid new servers by selling his car — fast forward a few months and <a href=\"https://pulsedmedia.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Pulsed Media</a> was already a full time job enough to make living for one person in August/September 2010 when the orders gate was reopened.</p><p>Rest is history so to speak, today we at <a href=\"https://pulsedmedia.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Pulsed Media</a> have our own DC, Network and all hardware without debt, providing services to tens of thousands of users — of whom quite a many has been with us from the very beginning. Today we work with utmost top of the line hardware for seedboxes with unprecedented performance, with world class power efficiency (PUE) and close to even being net carbon negative via funding forestation projects.</p><p>Personally i’ve been involved in hosting industry more or less since the late 90s, always getting back to it. I colocated first servers before turning 18, for profit as well. Built and operated a browser MMO in the late 90s which needed a good stable and fast (10Mbps was fast back then!) internet connection. It was one of the very first MMOs, and very first games ever with microtransactions. It had mediocre success with few thousands daily active players – but truly that opened the gates for the hosting industry, started around then offering shell accounts + web hosting.</p><p><span id=\"more-24833\"></span></p><p><strong>How do you see the seedbox market in 2020? How has the market changed/evolved?</strong></p><p>The overall market has been diminishing year over year, a lot of data points suggest that the current seedbox market is a mere shadow of it’s former self. It’s also quite “cemented” in certain key players on the market with little variance. Seedbox market has turned more over to streaming and various additional things people can do with their seedboxes, turning ever more towards a personal power house of a service, reminiscent of “shell services” of the late 90s early 00s. Way more different kind of software is sought after by users, and for some users seedbox is synonymous with streaming. A decade ago users had very low reliability expectation, but today users tend to expect enterprise level reliability from their seedboxes. Seedboxes have also become ever lower cost and most of the performance bottlenecks have transitioned to being software bottlenecks instead of hardware.</p><p><strong>You post offers on LowEndTalk. Do you do a lot of advertising or do your customers come mostly via word of mouth, Reddit, reviews, etc.?</strong></p><p>We actually do quite minimal amount of advertising or marketing, and that’s been the case pretty much always. Word of mouth or via referrals/affiliates is how almost all users find us. We used to be very active on some forums in the past, but as atmosphere has changed we have chosen to be less active on these forums.</p><p><strong>What makes your company unique in today’s evolving market landscape? How are you evolving with the times? How has your technology changed over the years?</strong></p><p>For the seedbox niche we are one of the very few, or maybe the only one, who <em>actually</em> has their own datacenter. This drives tremendous cost efficiency, which has been proven again and again, if it’s the combination of big storage and good network you are looking for; We are who can deliver. We have evolved from basic 2 disk RAID0 entry level servers in the beginning now to really highend servers, some of our production servers may sport 36 disk RAID10 arrays, with latest EPyC high core count processors for example. We started with servers costing less than 20€ a month each, and have evolved to servers which may cost tens of thousands just to acquire.</p><p>Most effort for the past 5 years has gone to the hardware development, and this has changed tremendously. A lot of effort has been put in place to ensure all around the most cost effective and most reliable high storage high throughput platform can be achieved, working from basic infrastructure of setting up electric cabinets, to monitoring electrical and environmentals in real time and finding ways to build better servers. It’s quite the change from primary focus being software.</p><p>It’s a lot of work to operate your own datacenter from start to finish, and that’s where most effort goes towards.</p><p>Link speeds to the server have grown over the past decade from 100Mbps upto 20Gbps as well.</p><p><strong>Do you do a lot of business with cryptocurrencies (BitCoin, etc.)?</strong></p><p>YES WE DO! We were probably the first ever hosting business to accept Bitcoin as payment, around the time that famous Pizza was sold. As soon as some exchange rate was established for BTC to EUR/USD we started accepting BTC as payment.</p><p>You can probably still find the offer posting from Bitcointalk with a little bit of googlefu.</p><p><strong>What do you enjoy most about your role? What do you find most difficult?</strong></p><p>Personally i really like solving the puzzle of making things ever more efficient and therefore ever more value to our users. I’m a optimization nerd lol. Most difficult situation is aggressive customers, especially those who are specifically looking and hoping for trouble; or otherwise looking to cause general mayhem.</p><p><strong>Both personally and professionally, what guiding principles ground you?</strong></p><p>Freedom of information and privacy, honesty above anything else.</p><p><strong>Give us some details on new and exciting things you are working on</strong></p><p>Building the absolute highest end AMD EPyC based servers, for a customer who is looking for latest top of the line EPyC servers, with lots of storage, nvme cache and even GPUs — ie. servers with “All of the bells and whistles”, and simultaneously trying to achieve good cost effectiveness for them.</p><p>On the other hand, even these epycly highend servers for seedboxes seem mild in that comparison for above, we are looking for ways to do ever larger RAID10 arrays for our Dragon-R seedbox series, 36 drives and beyond. At that scale the options for high performance start to get scarce. These servers have really been game changers for us and our users, it almost looks like the performance is quite endless.</p><p>On lower priority we’ve been working for quite a while to develop our own high density storage server platform for up to 12 drives per server, these will utilize mITX server boards. We should even be able to include high capacity UPS (30min+) for each storage server at a fairly low cost. Our plan is to primarily built this first for our own use, and then start selling globally this platform. Even with “just” mITX boards we should be able to scale these for 16c/32t CPUs and upto 128GB RAM with 10Gbps links with <em>today’s hardware</em> already on the market. This is more of an manufacturing and product development journey, and working with all the different suppliers takes a lot of time. We are now at the point that our upcoming beta chassis should be very close to final, after which we need to develop the PDUs (Power Distribution Units) and some custom electronics. This project is quite an venture, as for the platform we start from bare sheet metal, and a robot does cutting, bending, inserts etc. For the base hardware we have sold some custom servers already, but the chassis’ are not yet production ready – next iteration should be. These chassis’ will be world leading in density. This is also more of an passion project still, rather than business plan or strategy. Nevertheless, it’s quite exciting and we hope to be able to showcase it in detail within a year or two.</p><p>We are also working to bring regular ol’ dedicated servers in fully automated fashion to market place, this should allow us to provide instant provisioning and drive the base cost down. Optimally, we’d like to become the provider who provides services to the providers. For seedboxes this means that other seedbox vendors get their servers from us, and we’ve been making some progress towards that even without automation.</p><p><strong>What are your biggest challenges?</strong></p><p>Taxes (staff), plain and simple. Finland is quite good country for this kind of business in all other forms but taxes and hiring staff. Finland has <strong>extremely high taxation</strong>, to the tune that you generally need to budget 30€+ per work hour as cost. How do you hire someone for a position which brings value of 10€ per hour, when you have to pay multiples more? Answer is quite simply: You don’t.</p><p>Our income taxes, unemployment insurances, social welfare etc. makes it so that it’s extremely hard to hire anyone motivated, and this pool of people is ever decreasing as it’s just so easy to chill on the benefits. I personally know some people who are even paying off their mortgages from the social welfare benefits.</p><p>We wish we could hire more staff. Everything we do has to be under the lens of how much human time does this take, as that’s the single most expensive thing for anything.</p><p>After that becomes transaction fees, a lot of people would be surprised how extraordinarily high these can be. For our auction offers the total transaction fees might even be 25% of the cost of the service sometimes. Contracts prohibits us from speaking more specifically about this.</p><p><strong>Why should customers trust you and your business?</strong></p><p>We’ve been very long in business, we are transparent, with good strong privacy policy, and almost never changing terms of service (it’s been maybe 9 years since that’s been updated?) and we stand by all of that. For seedbox niche especially, this is extremely rare, we are an actual established and real business who pay their taxes and bureaucratic dues. We are not going anywhere, and you can trust that all the legal terms put forth hold true no matter what. We do not hide behind anonymity.</p><p>We take pride in being stable, reliable, albeit thus a bit boring service provider. If that’s not enough, we also happen to generally offer the best value for your hard earned money, simply put, we take pride in also offering more for less.</p><p>But don’t take our word for it, we have a large customer base who has been with us for what seems like forever, we have very good retention rate and a quite a big number of users have been with us for more than a decade now.</p><p>Our core values are freedom of information and privacy, honest business where we want to offer our users the best possible service at a sensible cost.</p><p><strong>Final thoughts and anything you would like to add?</strong></p><p>It’s been quite an ride for the past decade, and looking forward to the next decade! Really looking forward to extending our portfolio of services to ensure that people can make their data available 24/7/365 at high speed, reliability and decent cost.</p><p>We’d like to build another DC in the near future as well, but we need your help! Join us, use and enjoy our services to make that possible. Especially if you are an vendor, do contact us for custom quote and let’s make a situation where win-win-win happens, we win, you win, and your end users win.</p><p class=\"dpsp-share-text\"></p><div id=\"dpsp-content-bottom\" class=\"dpsp-content-wrapper dpsp-shape-rounded dpsp-column-auto dpsp-has-spacing dpsp-no-labels dpsp-show-on-mobile dpsp-button-style-1 dpsp-has-icon-background dpsp-has-button-background dpsp-show-total-share-count dpsp-show-total-share-count-after\"><ul class=\"dpsp-networks-btns-wrapper dpsp-networks-btns-content dpsp-has-button-icon-animation\"><li><a rel=\"nofollow\" href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flowendbox.com%2Fblog%2Finterview-qa-with-aleksi-ceo-of-pulsedmedia%2F&amp;t=Interview%3A%20Q%26A%20with%20Aleksi%2C%20CEO%20of%20PulsedMedia\" class=\"dpsp-network-btn dpsp-facebook dpsp-no-label dpsp-first\" title=\"Share on Facebook\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://twitter.com/intent/tweet?text=Interview%3A%20Q%26A%20with%20Aleksi%2C%20CEO%20of%20PulsedMedia&amp;url=https%3A%2F%2Flowendbox.com%2Fblog%2Finterview-qa-with-aleksi-ceo-of-pulsedmedia%2F&amp;via=LowEndNetwork\" class=\"dpsp-network-btn dpsp-twitter dpsp-no-label\" title=\"Share on Twitter\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://www.linkedin.com/shareArticle?url=https%3A%2F%2Flowendbox.com%2Fblog%2Finterview-qa-with-aleksi-ceo-of-pulsedmedia%2F&amp;title=Interview%3A%20Q%26A%20with%20Aleksi%2C%20CEO%20of%20PulsedMedia&amp;mini=true\" class=\"dpsp-network-btn dpsp-linkedin dpsp-no-label dpsp-last\" title=\"Share on LinkedIn\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li></ul><div class=\"dpsp-total-share-wrapper\"><span class=\"dpsp-icon-total-share\"></span><span class=\"dpsp-total-share-count\">0</span><span>shares</span></div></div><div class=\"relpost-thumb-wrapper\"><div class=\"relpost-thumb-container\"><h3>Related posts:</h3><div style=\"clear: both\"></div><div style=\"clear: both\"></div><div class=\"relpost-block-container\"><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-dedipath-cto-ernie-quick-on-his-company-and-making-success-happen/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"DediPath\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/10/DediPath_Logo-150x150.jpg) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with DediPath CTO Ernie Quick on His Company and Making Success Happen</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-the-founder-of-jsdelivr-dmitriy-akulov/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Interview: Q&amp;A with the Founder of jsdelivr, Dmitriy Akulov\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/09/jsdelivr-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with the Founder of jsdelivr, Dmitriy Akulov</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-letbox-owner-mahmoud-elghanam-on-the-hosting-industry-and-his-experience/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Interview: QA with LetBox Owner Mahmoud Elghanam\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/06/letbox-logo-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with LetBox Owner Mahmoud Elghanam on the Hosting Industry</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-aalayer-founder-armand-on-the-web-design-industry-and-great-customer-service/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"AALayer Web Hosting Design\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/05/aa-layer-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with AALayer Founder Armand on the Web Design Industry and Great Customer Service</div></div></a></div><div style=\"clear: both\"></div></div></div><div id=\"author-bio-box\" style=\"background: #f8f8f8; border-top: 2px solid #cccccc; border-bottom: 2px solid #cccccc; color: #333333\"><h3><a style=\"color: #555555;\" href=\"https://lowendbox.com/blog/author/raindog308/\" title=\"All posts by raindog308\" rel=\"author\">raindog308</a></h3><div class=\"bio-gravatar\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI3MCIgaGVpZ2h0PSI3MCIgdmlld0JveD0iMCAwIDcwIDcwIj48cmVjdCB3aWR0aD0iMTAwJSIgaGVpZ2h0PSIxMDAlIiBmaWxsPSIjY2ZkNGRiIi8+PC9zdmc+\" alt=\"\" data-src=\"https://secure.gravatar.com/avatar/4ce3b8640a70e05bd73ac25b8a37821c?s=70&amp;d=retro&amp;r=pg\" data-srcset=\"https://secure.gravatar.com/avatar/4ce3b8640a70e05bd73ac25b8a37821c?s=140&amp;d=retro&amp;r=pg 2x\" class=\"avatar avatar-70 photo\" height=\"70\" width=\"70\" loading=\"lazy\"></div><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"https://www.lowendtalk.com/profile/raindog308\" class=\"bio-icon bio-icon-website\"></a><p class=\"bio-description\">I'm Andrew, techno polymath and long-time LowEndTalk community Moderator. My technical interests include all things Unix, perl, python, shell scripting, and relational database systems. I enjoy writing technical articles here on LowEndBox to help people get more out of their VPSes.</p></div></div><div class=\"feedback\"></div></div>"}