{"id": "26107", "post": "<div class=\"post-26107 post type-post status-publish format-standard hentry category-interview tag-centos tag-cloudlinux tag-immunify360 tag-kernelcare tag-lenix\" id=\"post-26107\"><h2 class=\"storytitle\"><a href=\"https://lowendbox.com/blog/interview-with-igor-seletskiy-ceo-of-cloudlinux-on-project-lenix-centos-changes-and-much-more/\" rel=\"bookmark\">Interview with Igor Seletskiy, CEO of CloudLinux on Project Lenix, CentOS Changes, and Much More!</a></h2><div class=\"meta\"><img data-lazyloaded=\"1\" src=\"/media/icons/tag_green.png\" data-src=\"/media/icons/tag_green.png\" alt=\"Tags: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> <a href=\"https://lowendbox.com/tag/centos/\" rel=\"tag\">centos</a>, <a href=\"https://lowendbox.com/tag/cloudlinux/\" rel=\"tag\">cloudlinux</a>, <a href=\"https://lowendbox.com/tag/immunify360/\" rel=\"tag\">immunify360</a>, <a href=\"https://lowendbox.com/tag/kernelcare/\" rel=\"tag\">kernelcare</a>, <a href=\"https://lowendbox.com/tag/lenix/\" rel=\"tag\">lenix</a> <img data-lazyloaded=\"1\" src=\"https://lowendbox.com/media/icons/calendar.png\" data-src=\"https://lowendbox.com/media/icons/calendar.png\" alt=\"Date/Time: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> January 1, 2021 @ 12:00 am, by raindog308</div><div class=\"storycontent tablelook\"><p><img data-lazyloaded=\"1\" src=\"https://lowendbox.com/wp-content/uploads/2020/12/Igor_Seletskiy_KernelCare-500.jpg.webp\" loading=\"lazy\" class=\"size-full wp-image-26108 alignright litespeed-loaded\" data-src=\"https://lowendbox.com/wp-content/uploads/2020/12/Igor_Seletskiy_KernelCare-500.jpg.webp\" alt=\"\" width=\"500\" height=\"522\" align=\"right\" hspace=\"20\" data-srcset=\"https://lowendbox.com/wp-content/uploads/2020/12/Igor_Seletskiy_KernelCare-500.jpg.webp 500w, https://lowendbox.com/wp-content/uploads/2020/12/Igor_Seletskiy_KernelCare-500-287x300.jpg.webp 287w\" data-sizes=\"(max-width: 500px) 100vw, 500px\" sizes=\"(max-width: 500px) 100vw, 500px\" srcset=\"https://lowendbox.com/wp-content/uploads/2020/12/Igor_Seletskiy_KernelCare-500.jpg.webp 500w, https://lowendbox.com/wp-content/uploads/2020/12/Igor_Seletskiy_KernelCare-500-287x300.jpg.webp 287w\" data-was-processed=\"true\">Recently, CentOS <a href=\"https://lowendbox.com/blog/centos-rip-long-live-centos-stream/\" target=\"_blank\" rel=\"noopener noreferrer\">dropped the bombshell news</a> that they would be moving upstream from RHEL, which radically changes the Linux distribution landscape.&nbsp; Various companies and organizations announced they were going to step into the “RHEL Clone” void,&nbsp; One of the most prominent was <a href=\"https://www.cloudlinux.com/\" target=\"_blank\" rel=\"noopener noreferrer\">CloudLinux</a>.&nbsp; They announced <a href=\"https://www.projectlenix.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Project Lenix</a> which will continue where “CentOS Classic” left off.</p><p><a href=\"https://www.linkedin.com/in/iseletsk\" target=\"_blank\" rel=\"noopener noreferrer\">Igor Seletskiy</a> is the founder and CEO of <a href=\"https://www.cloudlinux.com/\" target=\"_blank\" rel=\"noopener noreferrer\">CloudLinux</a> and we thought this would be a good time to pick his brain on how the Linux landscape is changing and get his insights on the hosting industry.&nbsp; This interview is a real treat for our community, so let’s dig in!</p><p><strong>Where in the world do you live?</strong></p><p>I am in Palo Alto, California. However, the company has been fully remote for the last 6 years, and we have people in all corners of the world.</p><p><strong>Tell me about your background and your company’s history.</strong></p><p>I’ve studied programming, and realized in college that I have a passion for Linux.&nbsp; I got into the hosting industry in 1997 – creating one of the first few commercial control panels (H-Sphere), site builders (SiteStudio), and web-based file managers (WebShell). Back then, everything was “one of the first”. I ended up selling the company in 2005.</p><p>In 2009, I was ready to try it again, and doing a Linux / hosting related project was a no brainer. I have received a lot of support from the hosting industry – including some of the major players like cPanel &amp; Parallels. Without that support, <a href=\"https://www.cloudlinux.com/\" target=\"_blank\" rel=\"noopener noreferrer\">CloudLinux</a> would not be possible.</p><p>We have focused on helping shared hosters with stability, and we got it right. Today, everyone knows that if you want stable shared hosting servers, you have to run CloudLinux OS.</p><p>Over the years we added <a href=\"https://www.kernelcare.com/\" target=\"_blank\" rel=\"noopener noreferrer\">KernelCare</a> – a rebootless kernel updates product, <a href=\"https://www.imunify360.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Imunify360</a> – security product for hosters, and recently extended lifecycle support for CentOS 6. It has been a fun ride so far, and it only seems to be getting more exciting.</p><p><strong>Managing users’ unruly processes is a key pain point. You’ve conquered a lot of these resource management issues with CloudLinux, CageFS, MySQL governor, etc., as well as enabling greater uptime with KernelCare. Do you see your mission as solving hosting provider’s resource management problems or is there more to what you’re bringing to the market?</strong></p><p>That is definitely a major part of what we do. I like to automate things, and reduce the need for human interactions. Humans have huge brains to do creative stuff, there’s no point for them to do the same thing over and over again. We are still very much focused on hosting, even though we see a lot of demand for our products from enterprise customers as well.</p><p><strong>If you look at the big clouds (Amazon, Azure, Google, etc.), they have fleets of PhDs to write custom kernels and software to manage their systems. Is it fair to say that your target market is the next rung or two down – people who can’t afford to write their own AWS-like software – and enabling mid-sized and smaller players to continue to compete in the always fiercely competitive hosting industry?</strong></p><p>I think the hosting market is changing – while also staying the same. We still have shared hosting – and we will have it for at least another decade. Colocation is still there. Dedicated &amp; VPS are morphing more and more into infrastructure as a service. At the same time, the way new software is written &amp; deployed is changing as well. More and more developers want to work with PaaS, serverless &amp; K8S. This is both an opportunity and a risk for traditional hosters. CloudLinux alone cannot solve this, but we are trying to help the industry to continue to grow &amp; expand.</p><p><strong>Let’s jump into a hot button issue. CentOS is changing to CentOS Stream and will no longer be (let’s be honest) downstream of RHEL. Most people interpret this as IBM wanting to end “RHEL for free” and improve RHEL revenue. Do you see this the same way or do you think other considerations are at work?</strong></p><p>Oh, I see it the same way. I do believe IBM is looking to boost their quarterly earnings, and they are ready to sacrifice CentOS to achieve that. It happened once before, around 2004, when RedHat terminated free RedHat Linux, and forked into RHEL &amp; Fedora. RedHat was saying that Fedora would be ok for most people… but they made it as unstable as it gets for production workloads pretty quickly. I believe the same playbook is used now. CentOS Stream will be unusable for most production environments.</p><p><strong>You recently announced you will be releasing a “free, open-sourced, community-driven, 1:1 binary compatible fork of RHEL 8 (and future releases) in the Q1 of 2021” (<a href=\"https://www.projectlenix.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Project Lenix</a>). That’s awesome. While this is a potentially an enormous benefit to Linux users, how do you see CloudLinux benefitting? How does this fit in with your other products?</strong></p><p>It has been an exciting time for us. We have benefited tremendously from the Open Source community, and now is the time we can give back. First of all, it is easy enough to do. CloudLinux OS 8 is already a fork of RHEL – with some changes. So, all we need to do is strip away the changes, and make it available for free.</p><p>There are so many benefits for us there. But first, we need a healthy hosting market – and the hosting market needs a free enterprise grade OS.</p><p>We also expect that producing the new OS will create enough publicity and credibility for us, so that it will be simpler for us to sell KernelCare and extended lifecycle support products into the enterprise.</p><p><strong>What is your company culture like inside?</strong></p><p>We’re an engineering company that loves Linux. Most of the people are either developers or sysadmins. Otherwise, we try to promote independent decision making and doing the right thing in all possible situations.</p><p><strong>I see you’re hiring. Other than strong technical skills, what kind of candidate is likely to be successful at CloudLinux?</strong></p><p>We like people who are self-motivated and driven. We are fully remote, so there is a great deal of flexibility,- and not that much oversight. We judge people based on what they can deliver. We like people that are capable of making up their own mind, can make decisions, and take ownership. Another important aspect for us, as we are working across multiple time zones, is the ability to communicate well, and communicate asynchronously is very important.</p><p><strong>10 years ago, AWS was just getting started, ipv6 was still in “we’ll get to that soon” mode, and most sites were still using plain old http. Today the landscape is quite different – some of it evolutionary, some of it quite revolutionary. Where do you see the hosting market going over the next 10 years?</strong></p><p>It is amazing for me to see that the shared hosting market is still growing on a regional scale, with WordPress becoming more and more popular, and even the VPS market still going strong and continually growing. I think we will have another 10 years of that. There are also plenty of managed services opportunities.</p><p>On the other hand, most future growth is going to PaaS / SaaS, and hosters might not be in the best position to crack that market.</p><p><strong>We recently saw Oracle announce it was leaving Silicon Valley, joining HP, Palantir, and others. Do you think the Bay Area will continue to see a drain as additional companies move away?</strong></p><p>Oh yes, and most likely we will be a casualty of that exodus as well. The weather is still great in the Bay Area, but I dread each visit to San Francisco. Housing is crazy expensive, schools are getting worse and worse, and the taxes are crazy.</p><p>Yet, the main issue is the government, I don’t mind paying higher taxes, but I clearly see mismanagement at an absurd level.</p><p>Of course, I will miss the concentration of smart and interesting people, but it seems a lot of them are leaving the Bay Area anyway.</p><p><strong>Please take this as a compliment: I can’t believe you guys are still an independent company and haven’t been acquired by some larger firm interested in your technology and customer relationships. How is it that you’ve managed to stay small and scrappy in an industry full of giants?</strong></p><p>Well, we’re not that small anymore. We have more than 180 people, we are profitable and are growing fast. I cannot say people weren’t interested in buying. We are just not interested in selling. We don’t need capital, we are having fun, so why sell? I don’t plan to retire, ever!</p><p><strong>Anything new and exciting coming down the road from CloudLinux?</strong></p><p>We have a few interesting projects on the horizon. We’re investing in live patching MySQL databases. That would allow us to deliver security updates for MySQL without restarting the MySQL server. As it can take minutes of downtime for large MySQL servers to properly restart, we believe that such ability will be in demand.</p><p>We are experimenting with automated optimization/speed up of WordPress sites on shared hosting. There are a few other projects that are even in an earlier stage – like high availability MySQL &amp; PostgreSQL servers using Kubernetes. We will see what will come out of them.</p><p><strong>Finally, any advice you’d care to share with hosting providers in today’s market?</strong></p><p>A lot of hosters are finding their niche, but if you are a “generic” hosting company, you have to focus on quality of service and monetization. Make sure your churn is low, and try to get your customers to be dependent on as many services you provide as possible. The more customers use your services, the harder it will be for the customer to leave.</p><hr><p>You can learn more about the projects mentioned in this article at these links:</p><ul><li><a href=\"https://www.projectlenix.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Project Lenix</a>: “a free, open-sourced, community-driven, 1:1 binary compatible fork of RHEL® 8 (and future releases)”</li><li><a href=\"https://www.cloudlinux.com/\" target=\"_blank\" rel=\"noopener noreferrer\">CloudLinux</a>: “the super-platform for stability and efficiency in shared hosting, developed to address the unique needs of web hosts.”</li><li><a href=\"https://www.kernelcare.com/\" target=\"_blank\" rel=\"noopener noreferrer\">KernelCare</a>: “Live patching for Linux kernels, OpenSSL &amp; glibc.”</li><li><a href=\"https://www.imunify360.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Immunify360</a>: “a next-generation security solution built for Linux VPS, Dedicated, and Shared servers. It uses cloud heuristics and the unique, proactive approach to provide total protection against known and unknown attacks.”</li></ul><p>&nbsp;</p><div class=\"relpost-thumb-wrapper\"><div class=\"relpost-thumb-container\"><h3>Related posts:</h3><div style=\"clear: both\"></div><div style=\"clear: both\"></div><div class=\"relpost-block-container\"><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/centos-rip-long-live-centos-stream/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"CentOS, RIP...Long Live CentOS Stream?!?\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/12/centos-logo-300-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">CentOS, RIP...Long Live CentOS Stream?!?</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/visualwebtechnologies-wide-range-of-cloudlinux-backed-cpanel-offers-in-virginia/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"VisualWebTechnologies: Wide Range of Cloudlinux-backed cPanel Offers in Virginia\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/09/visualwebtechnologies-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">VisualWebTechnologies: Wide Range of Cloudlinux-backed cPanel Offers in Virginia</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/serveria-cloud-vps-hosting-dedicated-servers-and-more-offers-starting-at-1-99-mo/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Serveria - Cloud VPS Hosting, Dedicated servers and more! Offers starting at $1.99/mo!\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/04/leb-centered-small.jpg) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Serveria - Cloud VPS Hosting, Dedicated servers and more! Offers starting at $1.99/mo!</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/hudsonvalleyhost-4-99-mo-4gb-openvz-linux-vps-normally-20-mo-40-off-select-items-and-more-for-cyber-monday/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Hudson Valley Host\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2019/12/hvh-scaled-150x150.jpg) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">HudsonValleyHost – $4.99/mo 4GB OpenVZ Linux VPS (normally $20/mo) + 40% OFF select items and more f...</div></div></a></div><div style=\"clear: both\"></div></div></div><div id=\"author-bio-box\" style=\"background: #f8f8f8; border-top: 2px solid #cccccc; border-bottom: 2px solid #cccccc; color: #333333\"><h3><a style=\"color: #555555;\" href=\"https://lowendbox.com/blog/author/raindog308/\" title=\"All posts by raindog308\" rel=\"author\">raindog308</a></h3><div class=\"bio-gravatar\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI3MCIgaGVpZ2h0PSI3MCIgdmlld0JveD0iMCAwIDcwIDcwIj48cmVjdCB3aWR0aD0iMTAwJSIgaGVpZ2h0PSIxMDAlIiBmaWxsPSIjY2ZkNGRiIi8+PC9zdmc+\" alt=\"\" data-src=\"https://secure.gravatar.com/avatar/4ce3b8640a70e05bd73ac25b8a37821c?s=70&amp;d=retro&amp;r=pg\" data-srcset=\"https://secure.gravatar.com/avatar/4ce3b8640a70e05bd73ac25b8a37821c?s=140&amp;d=retro&amp;r=pg 2x\" class=\"avatar avatar-70 photo\" height=\"70\" width=\"70\" loading=\"lazy\"></div><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"https://www.lowendtalk.com/profile/raindog308\" class=\"bio-icon bio-icon-website\"></a><p class=\"bio-description\">I'm Andrew, techno polymath and long-time LowEndTalk community Moderator. My technical interests include all things Unix, perl, python, shell scripting, and relational database systems. I enjoy writing technical articles here on LowEndBox to help people get more out of their VPSes.</p></div></div><div class=\"feedback\"></div></div>"}