{"id": "24959", "post": "<div class=\"post-24959 post type-post status-publish format-standard hentry category-interview tag-interview tag-interviews tag-qa tag-serverhub-com\" id=\"post-24959\"><h2 class=\"storytitle\"><a href=\"https://lowendbox.com/blog/interview-qa-with-x4b-ceo-mathew-heard-on-the-ddos-protection-and-the-future-of-the-industry/\" rel=\"bookmark\">Interview: Q&amp;A with ServerHub CEO John Brancela on Growing with the Market</a></h2><div class=\"meta\"><img data-lazyloaded=\"1\" src=\"/media/icons/tag_green.png\" data-src=\"/media/icons/tag_green.png\" alt=\"Tags: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> <a href=\"https://lowendbox.com/tag/interview/\" rel=\"tag\">interview</a>, <a href=\"https://lowendbox.com/tag/interviews/\" rel=\"tag\">interviews</a>, <a href=\"https://lowendbox.com/tag/qa/\" rel=\"tag\">q&amp;a</a>, <a href=\"https://lowendbox.com/tag/serverhub-com/\" rel=\"tag\">serverhub.com</a> <img data-lazyloaded=\"1\" src=\"https://lowendbox.com/media/icons/calendar.png\" data-src=\"https://lowendbox.com/media/icons/calendar.png\" alt=\"Date/Time: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> December 6, 2020 @ 3:28 am, by Jon Biloh</div><div class=\"storycontent tablelook\"><p><img data-lazyloaded=\"1\" src=\"https://lowendbox.com/wp-content/uploads/2020/10/Brancela_LEB.jpg.webp\" loading=\"lazy\" class=\"screenshot alignnone litespeed-loaded\" title=\"John Brancela, CEO of ServerHub Inc\" data-src=\"https://lowendbox.com/wp-content/uploads/2020/10/Brancela_LEB.jpg.webp\" alt=\"John Brancela, CEO of ServerHub Inc\" width=\"300\" height=\"375\" data-was-processed=\"true\"></p><p><span style=\"font-weight: 400;\">As we continue our <a href=\"https://lowendbox.com/category/interview/\">Low End Box Interview Series</a>, today we are talking to John Brancela, Founder and CEO of ServerHub, Inc., a medium-large sized IaaS, Colocation and Cloud Computing operator that has been in business since 2004! John is certainly an industry veteran, so we are especially excited to gain his perspective on the evolving nature of the hosting space. </span></p><p><span style=\"font-weight: 400;\">So, let’s get started with the interview!</span></p><p><strong>Serverhub has been up for quite a while! Tell me a little bit about yourself and your journey starting one of the earliest web hosting providers in the US.</strong></p><p>It really has! My name is John Brancela, Founder and CEO of ServerHub, Inc. The company was founded in 2001, back in the early days of web hosting. In a way, I feel extremely fortunate that I decided to hop on and catch that wave, it allowed me to be part of the field as it emerged and witness the many groundbreaking technologies from a front row seat.</p><p>Looking back, my most prominent memory was my first HostingCon in Chicago. I was absolutely fascinated by the internet, and like many of my fellow tech-enthusiasts at the time, I believed the sky was the limit for what it could accomplish with the right mindset and hardwork. HostingCon was in many ways a formative point in my early career, and one of the most exciting and validating experiences on a personal level. Going there and meeting all those people made me feel like I was part of something bigger, a newer version of reality and the world for what it could be.</p><p>After over 15 years in the industry, that one day at HostingCon was probably what gave me the courage to start ServerHub and continue to grow it into what it is today, and I feel extremely grateful for my geeky passionate team that never fails to stand behind our products and vision. ServerHub would not be what it is today without each and every one of them.</p><p><span id=\"more-24959\"></span></p><p><strong>We all have our little guilty pleasures when it comes to our jobs, especially if it is a job we are passionate about. What would you say you personally enjoy the most about your role? And what do you find most difficult?</strong></p><p>I truly enjoy being able to see everything from a 30,000 FT overview, and I definitely enjoy doing it with my best friend Rohip, heading the operations team at ServerHub. All the inside jokes we made over the years, we definitely need our very own dedicated server for those.</p><p>I also enjoy the rush of it all, seeing customer growth from acquisition to upgrade, observing my team outperform themselves on every milestone and absolutely crush their goals, and watching all those orders cooking in the kitchen, so to speak. There’s never a boring day when you’re heading a growing tech company. The challenge, the sweet overcoming. It definitely keeps you young.</p><p><strong>In a competitive and breakneck fast industry like yours, how do you go about differentiating your services?</strong></p><p>We are luckier than most in that we have many assets we could capitalize on. ServerHub has been around since the very beginning, and the years are not the only notches on our belt. We have one of the strongest networks in the field, both in terms of speed, amount of data centers and solid peering agreements with giant tech conglomerations and fast-growing startups alike.</p><p>Our uptime is one of the most dependable in our line of work, operating at a consistently high rate of 99.9999%. Our port speeds are resilient and diverse, going up to 40 Gbps. Our services offerings are well-rounded, and our technicians are highly-qualified, meticulously trained and passionately specialized in what they do. Our planning is air-tight and fueled by a personal fervor for the field, and we are constantly ahead of the curve in adopting and implementing emerging technologies in storage, networking and processing.</p><p>I am luckier than most in that I managed to do what I like for a living, and find people who are just as passionate about it to do it with me. This gives ServerHub plenty of space to position our individual services on a variety of levels according to need, keep up with trends and target highly-specific niches in both the local market and beyond.</p><p><strong>Tell me about your top two failures in business? What did you learn from them?</strong></p><p>We were luckier than most on that front. As a team of highly-calculating nerds, we are rather risk averse in some aspects, but aggressive where we need to be. This has made us very cautious about the risks we have to take and the risks we can avoid, which ultimately kept us nimble and strong in the face of revenue setbacks and model enhancements.</p><p><strong>&nbsp;</strong>With that said, although we have certainly had some setbacks over the years, nothing juicy or noteworthy comes to mind. My biggest advice when you have an issue, set back or failure is pivot. Strong actions go a long way where technology is involved.</p><p><strong>Tell me about your top two successes in business?&nbsp;</strong></p><p>Where passion projects are concerned, ServerHub was definitely a generous source of happiness for me and my team over the years. From setting up our first server cluster in the early days to to building one of the strongest networks in the industry, the journey has given us many days of almost child-like excitement.</p><p>However, one memory far exceeds the rest in giggle factor. We had an exceptionally large gaming customer who had a small window of time to deploy over 1200 baremetal servers across three different data centers, including two in the United States and one in Europe.</p><p>For all those who don’t know, gaming server configurations are some of the most demanding in the industry. They require a high degree of security, agility and performance to make the cut. So we rallied our troops, and we went to the mattresses! Within three short weeks, we were able to procure, customize and configure all the hardware; rack, stack, cable. It was intense, we were flying team members to each location to complete the work, and to many of us it really felt like one of those high-action cutscenes from Ocean’s Eleven.</p><p>The experience was extremely rewarding. Our team had a lot of fun, our customer was extremely impressed and we earned their trust, business and friendship for many years to come.</p><p><strong>What do you enjoy most about your role? What do you find most difficult?</strong></p><p>I enjoy being able to see everything from a 30,000 FT overview. I think for me the most enjoyment I get, is when I see customer growth and a lot of orders in the kitchen so to speak, and watching our teams outperform and crush goals.</p><p>It is also nice to be challenged continuously as it keeps you sharp and on your toes.</p><p><strong>Both personally and professionally, what guiding principles ground you?</strong></p><p>When we sat down to map out the mission and vision of ServerHub, we wanted to make sure that we were building a human company as we are building a tech company. That’s why we decided to not steer too far from our personal values when we were choosing how we wanted to build the team.</p><p>At ServerHub, we value honesty, openness, personal excellence; the three main ingredients to a successful and happy company, as well as a successful and happy human being.</p><p>It is true that without a customer, your business does not exist. Plain and simple. But what is a company without a healthy, autonomous and driven team?</p><p>Always set a high standard, and make sure to always show empathy in all you do. Your customers are with you because they need your help in solving a problem, and your team is with you because they can help you solve that problem. If you treat both the way you want to be treated, the rest will follow.</p><p><strong>Spill the beans. Are there any new and exciting things in store for ServerHub?</strong></p><p>We had so many plans for 2020, but I would be lying if I said COVID-19 didn’t sidetrack a couple projects. Adapting to the new reality has been a challenge for everybody, but I am lucky to have a team of passionate and resilient individuals that go above and beyond and make it possible.</p><p>As we get used to the new normal, we are definitely on track for some pretty exciting things. This quarter, we are adding Warsaw, Poland as ServerHub’s newest location in Eastern Europe. That brings our network up to 13 data centers around the world; a staggering milestone for ServerHub as well as the industry at large.</p><p>In Q1 2021, we plan to open our second datacenter location in Toronto, which will be a part of our new end to end 100G optical network. We also plan to break into new markets in South America, Africa and Asia Pacific (APAC) in 2021. We also have a brand new baby project in the works, but I’ll tell you all about that in good time. We don’t want to spoil the surprise.</p><p>In addition to breaking new ground, we have also begun the planning and implementation stage of offering 100G as a default between our carriers all the way down to our cores in all of our datacenter locations.</p><p>High capacity will continue to be a huge driver for business moving forward, we are already known for our rock-solid network and these upgrades will continue to fortify our successes for years to come.</p><p><strong>Garnering trust is by far one of the hardest aspects of an IaaS business. How did you go around garnering customer loyalty for ServerHub, Inc.? And what would you advise other businesses following your lead?</strong></p><p>Businesses often lose track of what is important as they gain traction in the market. Time has that effect on corporations, things tend to stagnate and the process that was once a saving grace could be the very chains that entrench a company and its people in endless red-tape.</p><p>We have been at this for a long time, and we make it a point to treat everyday like it’s our very first. By keeping a small business mentality, both at the office and at home, we keep ourselves agile.</p><p>Our team is also one of our biggest assets. We were careful to look for passion as well as expertise in our hiring process, and as a result, we were lucky enough to surround ourselves with people that make everyday at the office as fun and rewarding on a personal level as it is on a professional level.</p><p>With these tools in our metaphorical belts, I would say that is why our customers love us. At ServerHub, we proudly have one of the lowest customer churns in the industry. Most of our customers have been with us for years, and we expect that same kind of amiable relationship for years to come.</p><p><strong>For someone who has been around since the very beginning, where do you think the future holds for the web hosting industry?</strong></p><p>Technology evolves lightning fast. Can you imagine we have only had the internet for 50 years? And over the course of five short decades, the industry has changed form hundreds of times on thousands of levels. With all that in mind, the last five years have definitely been the most interesting.</p><p>For instance, those last five years have seen a lot of consolidation. Giant names like FastServers and groundbreaking acquisitions like the IBM/SoftLayer and SingleHop/InterNAP don’t even come to mind anymore.&nbsp; The market is vast, and I believe that if smaller companies continue to focus on driving value to their customers and providing exceptionally tailored added services to their customers, they will continue to grow in this competitive marketplace. Where the internet is concerned, there&nbsp; will always be a strong market outside of AWS, Azure and GCP. The future will be all about driving value moving forward and setting yourself apart from the giants, and there is a lot of space that is just sitting there, ripe for the taking.</p><p><strong>What about those who are looking to start a hosting company today. What advice would you give them to survive in an industry where they have to compete with some mega-players like Azure and AWS?</strong></p><p>Web hosting changed so much over the years, some concepts like cloud hosting did not even exist back then! There is a way to look at it where starting back then was better, because you were there for everything, but there’s another way of looking at it where starting today could save you a lot of wasted time <em>literally </em>re-inventing the wheel.</p><p>To those taking the leap today, I would say there is a lot of work headed your way. But as demanding as this industry is, it is also incredibly fun and rewarding. Who would not love to play with fancy new hardware toys day in and day out for a living? It’s the dream.</p><p><strong>Final thoughts and anything you would like to add?</strong></p><p>Go for it, whatever it is. If you like it enough, and you persevere, there is no way you will not reach your goals and surpass them.</p><p><a href=\"https://serverhub.com\" target=\"_blank\" rel=\"noopener noreferrer\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSIyNTgiIGhlaWdodD0iMjU4IiB2aWV3Qm94PSIwIDAgMjU4IDI1OCI+PHJlY3Qgd2lkdGg9IjEwMCUiIGhlaWdodD0iMTAwJSIgZmlsbD0iI2NmZDRkYiIvPjwvc3ZnPg==\" loading=\"lazy\" class=\"aligncenter wp-image-24927 size-full\" data-src=\"https://lowendbox.com/wp-content/uploads/2020/10/sh-258x250-1.gif.webp\" alt=\"\" width=\"258\" height=\"258\"></a></p><div class=\"relpost-thumb-wrapper\"><div class=\"relpost-thumb-container\"><h3>Related posts:</h3><div style=\"clear: both\"></div><div style=\"clear: both\"></div><div class=\"relpost-block-container\"><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-dedipath-cto-ernie-quick-on-his-company-and-making-success-happen/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"DediPath\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/10/DediPath_Logo-150x150.jpg) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with DediPath CTO Ernie Quick on His Company and Making Success Happen</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-the-founder-of-jsdelivr-dmitriy-akulov/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Interview: Q&amp;A with the Founder of jsdelivr, Dmitriy Akulov\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/09/jsdelivr-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with the Founder of jsdelivr, Dmitriy Akulov</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-letbox-owner-mahmoud-elghanam-on-the-hosting-industry-and-his-experience/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Interview: QA with LetBox Owner Mahmoud Elghanam\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/06/letbox-logo-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with LetBox Owner Mahmoud Elghanam on the Hosting Industry</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-aalayer-founder-armand-on-the-web-design-industry-and-great-customer-service/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"AALayer Web Hosting Design\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/05/aa-layer-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with AALayer Founder Armand on the Web Design Industry and Great Customer Service</div></div></a></div><div style=\"clear: both\"></div></div></div><div id=\"author-bio-box\" style=\"background: #f8f8f8; border-top: 2px solid #cccccc; border-bottom: 2px solid #cccccc; color: #333333\"><h3><a style=\"color: #555555;\" href=\"https://lowendbox.com/blog/author/jbiloh/\" title=\"All posts by Jon Biloh\" rel=\"author\">Jon Biloh</a></h3><div class=\"bio-gravatar\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI3MCIgaGVpZ2h0PSI3MCIgdmlld0JveD0iMCAwIDcwIDcwIj48cmVjdCB3aWR0aD0iMTAwJSIgaGVpZ2h0PSIxMDAlIiBmaWxsPSIjY2ZkNGRiIi8+PC9zdmc+\" alt=\"\" data-src=\"https://secure.gravatar.com/avatar/f766d6dc4b5f406b9f3cb0339d48de95?s=70&amp;d=retro&amp;r=pg\" data-srcset=\"https://secure.gravatar.com/avatar/f766d6dc4b5f406b9f3cb0339d48de95?s=140&amp;d=retro&amp;r=pg 2x\" class=\"avatar avatar-70 photo\" height=\"70\" width=\"70\" loading=\"lazy\"></div><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"https://www.lowendtalk.com/profile/jbiloh\" class=\"bio-icon bio-icon-website\"></a><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"http://Jbiloh\" class=\"bio-icon bio-icon-twitter\"></a><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"https://www.linkedin.com/in/jon-biloh-4b32598/\" class=\"bio-icon bio-icon-linkedin\"></a><p class=\"bio-description\">I'm Jon Biloh and I own LowEndBox and LowEndTalk. I've spent my nearly 20 year career in IT building companies and now I'm excited to focus on building and enhancing the community at LowEndBox and LowEndTalk.</p></div></div><div class=\"feedback\"></div></div>"}