{"id": "24377", "post": "<div class=\"post-24377 post type-post status-publish format-standard hentry category-interview tag-cloud tag-cloud-net tag-ditlev-bredahl tag-interview tag-onapp tag-qa tag-solusvm tag-vps-net\" id=\"post-24377\"><h2 class=\"storytitle\"><a href=\"https://lowendbox.com/blog/interview-ditlev-bredahl-ceo-of-onapp/\" rel=\"bookmark\">Interview: Q&amp;A with Ditlev Bredahl, CEO of OnApp</a></h2><div class=\"meta\"><img data-lazyloaded=\"1\" src=\"/media/icons/tag_green.png\" data-src=\"/media/icons/tag_green.png\" alt=\"Tags: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> <a href=\"https://lowendbox.com/tag/cloud/\" rel=\"tag\">cloud</a>, <a href=\"https://lowendbox.com/tag/cloud-net/\" rel=\"tag\">cloud.net</a>, <a href=\"https://lowendbox.com/tag/ditlev-bredahl/\" rel=\"tag\">ditlev bredahl</a>, <a href=\"https://lowendbox.com/tag/interview/\" rel=\"tag\">interview</a>, <a href=\"https://lowendbox.com/tag/onapp/\" rel=\"tag\">onapp</a>, <a href=\"https://lowendbox.com/tag/qa/\" rel=\"tag\">q&amp;a</a>, <a href=\"https://lowendbox.com/tag/solusvm/\" rel=\"tag\">SolusVM</a>, <a href=\"https://lowendbox.com/tag/vps-net/\" rel=\"tag\">vps.net</a> <img data-lazyloaded=\"1\" src=\"https://lowendbox.com/media/icons/calendar.png\" data-src=\"https://lowendbox.com/media/icons/calendar.png\" alt=\"Date/Time: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> September 2, 2020 @ 12:00 am, by raindog308</div><div class=\"storycontent tablelook\"><p>Our&nbsp;<a href=\"https://lowendbox.com/category/interview/\">LowEndBox Interview Series</a> has featured many interesting personalities so far and today we’re excited to bring you an interview with the <strong>CEO of OnApp, Ditlev Bredahl</strong>.&nbsp; The name OnApp will be familiar to nearly anyone who’s ever worked in the hosting industry.&nbsp; You may recognize some other famous names in Ditlev’s past, such as vps.net and SolusVM.&nbsp; Ditlev has been involved with computers since the days of the Timex Sinclair and you’ll find his perspective on the hosting industry and where it’s going to be both well-informed and fascinating.&nbsp; Let’s go!</p><p><b><img data-lazyloaded=\"1\" src=\"https://lowendbox.com/wp-content/uploads/2020/08/onappceo-300x204.jpg.webp\" loading=\"lazy\" class=\"size-medium wp-image-24378 alignleft litespeed-loaded\" data-src=\"https://lowendbox.com/wp-content/uploads/2020/08/onappceo-300x204.jpg.webp\" alt=\"\" width=\"300\" height=\"204\" align=\"left\" hspace=\"20\" data-srcset=\"https://lowendbox.com/wp-content/uploads/2020/08/onappceo-300x204.jpg.webp 300w, https://lowendbox.com/wp-content/uploads/2020/08/onappceo.jpg.webp 600w\" data-sizes=\"(max-width: 300px) 100vw, 300px\" sizes=\"(max-width: 300px) 100vw, 300px\" srcset=\"https://lowendbox.com/wp-content/uploads/2020/08/onappceo-300x204.jpg.webp 300w, https://lowendbox.com/wp-content/uploads/2020/08/onappceo.jpg.webp 600w\" data-was-processed=\"true\">Where in the world do you live?</b></p><p><span style=\"font-weight: 400;\">I live in London, UK – have been here for many years now. Originally I am from Denmark, but I have worked or lived in countries around the world.</span></p><p><b>Tell me about your background and your company’s history</b></p><p><span style=\"font-weight: 400;\">I’ve always been involved in tech – being 47yo my very early IT experiences started with ZX81, Spectrums, Vic20 and my beloved C64 (which I still have somewhere in storage). I’ve been programming or building hardware all my life – but never really been super good at either. My strength seems to have been in the grey area between business and tech. Though, I am happiest building new products and coming up with new ideas.&nbsp;</span></p><p><span style=\"font-weight: 400;\">OnApp was a spinout of UK2 Group. At UK2 we built</span><a href=\"http://vps.net\"> <span style=\"font-weight: 400;\">VPS.net</span></a><span style=\"font-weight: 400;\">, and the core of OnApp was what we used to manage that platform. It was the golden days of cloud, I remember Carlos (Rego, now CVO at OnApp) and me getting</span><a href=\"http://vps.net\"> <span style=\"font-weight: 400;\">VPS.net</span></a><span style=\"font-weight: 400;\"> from 0 to 1m USD run rate in about 5 weeks. We had long waiting lists of people that wanted to buy cloud, at some stage we even asked them to write a poem about</span><a href=\"http://vps.net\"> <span style=\"font-weight: 400;\">VPS.net</span></a><span style=\"font-weight: 400;\"> to get to the top of the list…we got 100s of poems :)</span></p><p><span style=\"font-weight: 400;\">At UK2 we also started the high-bandwidth server industry (possibly together with FDC), some funny threads on WHT </span><a href=\"https://www.webhostingtalk.com/showthread.php?t=631838\"><span style=\"font-weight: 400;\">here</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://www.webhostingtalk.com/showthread.php?t=932815\"><span style=\"font-weight: 400;\">here</span></a><span style=\"font-weight: 400;\"> when we built the 100tb.com brand. </span></p><p><span style=\"font-weight: 400;\">After selling UK2 Group to Lloyds Development Capital (</span><a href=\"http://ldc.co.uk\"><span style=\"font-weight: 400;\">LDC.co.uk</span></a><span style=\"font-weight: 400;\">) we transformed the</span><a href=\"http://vps.net\"> <span style=\"font-weight: 400;\">VPS.net</span></a><span style=\"font-weight: 400;\"> software stack into OnApp. AWS was starting to become a real factor in our industry, and we were on a mission to provide the industry with the tools that could enable them to fight back. A good strong platform at a good price with great support. That was OnApp then … and hopefully OnApp today :)</span></p><p><span style=\"font-weight: 400;\">The first years of OnApp were pretty hectic…it was all about growth, hiring talented people and getting new releases out. Fast forward to today, we are now kind of a grown up company, with investors, board meetings and +120 employees across our 3 locations. We have a very strict QA structure, and release schedules…we can still release new products and bleeding edge features, but with all the large customers relying on our platform now, everything is just a little harder.&nbsp;</span></p><p><span style=\"font-weight: 400;\">I get it, we really can only release super solid code today – but I do miss the old days :)</span></p><p><span id=\"more-24377\"></span></p><p><b>Let me see if I understand your market position. The “big boy clouds” like AWS, Azure, and Google have fleets of PhDs to write their own cloud hosting software. Your software is designed for the next tier down, to allow both public hosting providers and private enterprises to build (and possible sell) cloud services. Am I close? How do you see OnApp’s market position?</b></p><p><span style=\"font-weight: 400;\">Well, yes and no – first of all, +95% of our revenue comes from service providers. We eat sleep and drink hosting and, like me, most of my teams have a background in the industry and we are still on a mission to keep the scene vibrant and alive. Yes, we do have a few enterprises that buy direct from us, but about a year ago we spun out that arm of our business (check out</span><a href=\"http://sunlight.io\"> <span style=\"font-weight: 400;\">sunlight.io</span></a><span style=\"font-weight: 400;\">) – I felt we had lost focus on our service provider customers, so after moving that part of our business to Sunlight we are now back with a laser sharp focus. I started my first hosting company in 1997 – this is the industry that made us, and we stand behind it 100%.&nbsp;</span></p><p><span style=\"font-weight: 400;\">True, AWS, Azure and Google will probably never use our software, that being said there are many of our service provider partners and customers that use our software to spin up and manage infrastructure inside AWS. So while we help our industry build alternatives to AWS, we also help them to manage hyperscale infrastructure. Our ethos is that workloads should work where they work best. Sometimes that is on-prem, sometimes it’s in co-lo or a hoster’s DC … and sometimes it’s in AWS. We want to be there to help ensure fluidity across all infrastructure and platforms.&nbsp;</span></p><p><span style=\"font-weight: 400;\">Over the years OnApp has moved from serving the long tail, the SME/SoHo hosters, to mostly dealing with large MSPs and Telcos. That has been great for us, it has made us profitable and given us the solidity to invest in new products and services. However, in the last year or so (especially after selling SolusVM and spinning out Sunlight) I feel that our positioning has moved too far from our original hoster focus – and I am currently looking at launching a new range of products that will lower entry barriers, both price-wise and technically. I want OnApp to be the ideal solution for both the small hoster and the large Telco. Personally, I feel very much at home at LET, it’s just been a challenge to build products that would be financially viable for that very price focused crowd…Watch this space!</span></p><p><b>SolusVM is heavily used by many providers who participate on LowEndBox. You acquired Solus in 2014, and then sold it to Plesk in 2018. Has Solus’s day passed? Has the industry moved on to better technology?</b></p><p><span style=\"font-weight: 400;\">NO – Solus was (and is) a great software stack. Phil (original SolusVM founder/developer) and his guys managed to *almost* own an entire segment and I honestly feel that without Solus the LET scene would look a bit different.&nbsp;</span></p><p><span style=\"font-weight: 400;\">We did not buy it to sell it, we wanted Phil to stay on board and get V2 out – but honestly it proved almost impossible. A complete rewrite seemed like the only option and we simply could not find the resources to do that internally.</span></p><p><span style=\"font-weight: 400;\">We were not 100% convinced we should sell, but eventually we got an offer (all in, almost 10x our investment) that was too good a deal to walk away from. Webpros (cPanel/Plesk/etc) is a good home for Solus, and I know Phil has stayed on board and they are doing cool stuff with the brand now.&nbsp;</span></p><p><b>Do you think the hosting software industry is going through a period of consolidation? I’m thinking of acquisitions like SolusVM, Plesk, cPanel, etc.</b></p><p><span style=\"font-weight: 400;\">Looking at the software vendors there really are not that many sizeable players left … DirectAdmin, OnApp, Proxmox, CloudLinux and a handful of other players – the rest have been picked up or gone away. Not sure how much consolidation there is left?&nbsp;</span></p><p><span style=\"font-weight: 400;\">I think new players will enter the market and disrupt what us old timers are doing. At OnApp we are cool with that, it keeps us on our toes and ensures that we always think about product development and keep focusing on creating value for our partners.&nbsp;</span></p><p><span style=\"font-weight: 400;\">There are areas of our industry that are honestly kind of dated. Like control panels, or billing systems – I think someone should rethink how servers are managed and how customers are billed. It’s all a bit clunky and not very slick.&nbsp;</span></p><p><span style=\"font-weight: 400;\">At OnApp we are always looking for cool technology to partner with or even acquire – please read this as an invitation to contact me (</span><a href=\"mailto:d@onapp.com\"><span style=\"font-weight: 400;\">d@onapp.com</span></a><span style=\"font-weight: 400;\">) directly if you’d like to work with us.</span></p><p><b>On your website, it says OnApp is “building a greener cloud”. Green IT is getting a lot of discussion because of climate change. You’re a software company, so how does OnApp make the cloud greener?</b></p><p><span style=\"font-weight: 400;\">From an environmental perspective our industry is among the worst of the worst. In fact our CO2 footprint is worse than the entire aviation industry combined. Since OnApp launched we’ve built thousands of clouds for hosts and other service providers,&nbsp; so we’re very much part of the problem.&nbsp;</span></p><p><span style=\"font-weight: 400;\">Last year we decided to take a stand, and do our part. So we’ve committed to offset the CO2 emissions from all of the physical compute resources being managed with OnApp software. Some of that infrastructure is our own – our development, test and demo clouds – but the majority belongs to our customers. So if your cloud runs on OnApp, your company is already a little bit greener. We base the offset calculation on how many active compute nodes there are, across all OnApp clouds, and it takes into account the type of hardware being used, published energy consumption numbers for different hardware types, average utilization rates, and carbon offset conversion ratios in different countries. It was a fairly complicated process, but we wanted to make it so that anyone running OnApp can safely say that their clouds are ‘green’ and CO2 neutral. It’s important.&nbsp;</span></p><p><b>What’s your company culture like inside?</b></p><p><span style=\"font-weight: 400;\">It’s an interesting question, especially during Covid19. OnApp is my 6th startup, and I guess you learn a bit from every organisation you build. From that perspective I think that UK2 really showed me the way. There I built segments/domains for each brand and/or product and ensured that the people heading up those domains were fully autonomous, and felt ownership. My role (as CEO) was to facilitate their work, ensure that they had the resources (cash, support systems and infrastructure) available to pursue their strategy. That worked exceptionally well and created a very forward thinking company with a lot of flexibility and agility given the size of the team (almost 300 at the time I sold).&nbsp;</span></p><p><span style=\"font-weight: 400;\">I’ve tried to replicate the same structure at OnApp, but it is admittedly harder. It’s not possible to fully segment out parts of our product (like CDN, Storage, Networking etc.) and give them a level of autonomy – God knows I’ve tried. At OnApp we have to think coherently and look holistically at every release to ensure that the user experience, APIs and overall quality of the release is on par and aligned across the platform.&nbsp;</span></p><p><span style=\"font-weight: 400;\">From a company culture perspective that does create challenges as we are spread across three continents. Our main development hub is in Lviv, Ukraine – some of our smartest guys are there. A lot of the key people there have been with me for almost 10 years now and without them OnApp would not exist.</span></p><p><span style=\"font-weight: 400;\">Our CDN developers are based in Kuala Lumpur: we acquired Aflexi some years ago and kept the office and team there. Again, the team there are probably among the top CDN specialists in the world.&nbsp;</span></p><p><span style=\"font-weight: 400;\">Finally we have our HQ in London, UK. This is where management, some sales and marketing and parts of the company administration is located. In total we are only 20-25 people in the UK. We also have a bunch of people spread around the world in other locations incl. USA, Thailand, Russia etc.&nbsp;</span></p><p><span style=\"font-weight: 400;\">Each of those locations have a different view on how teams should be run, like, what it means to be a manager … or at a very practical level, how products are built. In Ukraine they are very strict and almost militant when it comes to PRDs, SCRUM etc – where it’s quite a bit different in Kuala Lumpur, here ‘user stories’ are the predominant planning tool. Combining the two can be a challenge and we’ve had many robust discussions on that topic over the years.</span></p><p><span style=\"font-weight: 400;\">Across all offices I try to keep a very free, open line of communication. Our management layers are few and flat and we have anonymous ways of constantly capturing team feedback. We use a system called Peakon for that – and it works great.</span></p><p><span style=\"font-weight: 400;\">I just realised I didn’t mention how Covid19 have changed our company culture – well, it has …&nbsp; in a big way. We’ve gotten much better at communicating, and keeping each other up to date. And ‘work-from-home’ (that I frowned upon before) is now the new normal – and it just works.&nbsp;</span></p><p><b>Your products are both for public and on-prem clouds. How do you see clouds evolving? When the buzzword came along, there was a vision that within a few years, private data centers would be a thing of the past, but they’re still alive and growing.</b></p><p><span style=\"font-weight: 400;\">It’s all coming together into one pool of infrastructure. On-prem, off-prem, public, private, IaaS, PaaS, SaaS etc etc – those terms are much less interesting today than just a few years ago. Now it’s all about fluidity of workloads, ensuring that devops teams across our customers or partners can move workloads from location a to b … from on-prem to off-prem … from VMware to KVM … from AWS to local infrastructure etc etc.</span></p><p><span style=\"font-weight: 400;\">It’s where our development efforts have been for the last number of years … and also why we built Cloud.net.</span></p><p><b>Tell us about your latest offering,<a href=\"http://cloud.net\"> cloud.net</a>.</b></p><p><span style=\"font-weight: 400;\">So, Cloud.net is the next step towards our goal of simplifying infrastructure for service providers, and enabling that fluidity I was just talking about. It’s a way for you to spin up a complete public or private cloud without CAPEX on hardware, and without long-term OPEX commitment either. We provide the whole cloud environment as a managed service, the OnApp cloud platform and the underlying hardware, and it comes with 24×7 support and 5×9 SLAs.&nbsp; And the pricing is really simple, just pay month to month.</span></p><p><span style=\"font-weight: 400;\">It’s a cloud in a box, easy to deploy and instantly available. </span><span style=\"font-weight: 400;\"><br>\n</span><span style=\"font-weight: 400;\"><br>\n</span><span style=\"font-weight: 400;\">The ultimate goal with Cloud.net is to provide Cloud-as-a-Service, and we have much more to come on that front. I basically feel that it should be much simpler and cheaper to set up clouds. We are not quite there with Cloud.net yet, but keep an eye out for what’s to come :)&nbsp;&nbsp;</span></p><p><b>Every time you turn around today, someone is slapping the term “AI” on a product. For cloud hosting, how do you see AI playing a role – both today and in the near-term future?</b></p><p><span style=\"font-weight: 400;\">Oh man – that’s one of my pet peeves. AI will obviously be huge, it will be awesome and it will change the way we all do stuff on a day to day basis. However we are not there yet, and most of what people call AI is simply If-Then statements that do not get smarter with time or learn from past processes.&nbsp;</span></p><p><span style=\"font-weight: 400;\">Now, there is an AI angle in our industry, for sure. I feel that workload locations would be a great place to start. Workloads don’t care where they are, they just want to work. And AI could help moving workloads around to ensure they are optimally placed – both from a financial, security and performance perspective. We have discussed this a lot internally at OnApp and we will bring out tools to make that possible.</span></p><p><b>What do you enjoy most about your role? What do you find most difficult?</b></p><p><span style=\"font-weight: 400;\">I am a product guy at heart. I love getting my hands dirty and building out new product strategies and rethinking the way we all do business. It’s harder at a maturing company like OnApp. Things take time and sometimes I get frustrated in the time to market, long priority lists and all the different priorities that we just have to respect before focusing on a specific development or new initiative.</span></p><p><span style=\"font-weight: 400;\">I do a lot of angel investments (through</span><a href=\"http://www.kickass.capital\"> <span style=\"font-weight: 400;\">www.kickass.capital</span></a><span style=\"font-weight: 400;\">) and I envy the startups that I work with there. It’s just much easier at their stage. On the flip side, OnApp is financially solid and that obviously brings a great deal of comfort as well.</span></p><p><b>Both personally and professionally, what guiding principles ground you?</b></p><p><span style=\"font-weight: 400;\">My kids (14+16 years old) and I often say ‘all you can do, is all you can do’. I feel, both personally and professionally, that we should strive to do our utmost, but also know our limitations so we can build a network – both personally and professionally – that can help us succeed where we have shortcomings. All you can do… is all you can do. I love it – it’s what I expect of myself, and people around me.&nbsp;</span></p><p class=\"dpsp-share-text\"></p><div id=\"dpsp-content-bottom\" class=\"dpsp-content-wrapper dpsp-shape-rounded dpsp-column-auto dpsp-has-spacing dpsp-no-labels dpsp-show-on-mobile dpsp-button-style-1 dpsp-has-icon-background dpsp-has-button-background dpsp-show-total-share-count dpsp-show-total-share-count-after\"><ul class=\"dpsp-networks-btns-wrapper dpsp-networks-btns-content dpsp-has-button-icon-animation\"><li><a rel=\"nofollow\" href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flowendbox.com%2Fblog%2Finterview-ditlev-bredahl-ceo-of-onapp%2F&amp;t=Interview%3A%20Q%26A%20with%20Ditlev%20Bredahl%2C%20CEO%20of%20OnApp\" class=\"dpsp-network-btn dpsp-facebook dpsp-no-label dpsp-first\" title=\"Share on Facebook\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://twitter.com/intent/tweet?text=Interview%3A%20Q%26A%20with%20Ditlev%20Bredahl%2C%20CEO%20of%20OnApp&amp;url=https%3A%2F%2Flowendbox.com%2Fblog%2Finterview-ditlev-bredahl-ceo-of-onapp%2F&amp;via=LowEndNetwork\" class=\"dpsp-network-btn dpsp-twitter dpsp-no-label\" title=\"Share on Twitter\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://www.linkedin.com/shareArticle?url=https%3A%2F%2Flowendbox.com%2Fblog%2Finterview-ditlev-bredahl-ceo-of-onapp%2F&amp;title=Interview%3A%20Q%26A%20with%20Ditlev%20Bredahl%2C%20CEO%20of%20OnApp&amp;mini=true\" class=\"dpsp-network-btn dpsp-linkedin dpsp-no-label dpsp-last\" title=\"Share on LinkedIn\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li></ul><div class=\"dpsp-total-share-wrapper\"><span class=\"dpsp-icon-total-share\"></span><span class=\"dpsp-total-share-count\">3</span><span>shares</span></div></div><div class=\"relpost-thumb-wrapper\"><div class=\"relpost-thumb-container\"><h3>Related posts:</h3><div style=\"clear: both\"></div><div style=\"clear: both\"></div><div class=\"relpost-block-container\"><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/servermanias-new-public-cloud-now-open-for-business/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"ServerMania's New Public Cloud Now Open for Business!\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/11/servermania-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">ServerMania's New Public Cloud Now Open for Business!</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-dedipath-cto-ernie-quick-on-his-company-and-making-success-happen/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"DediPath\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/10/DediPath_Logo-150x150.jpg) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with DediPath CTO Ernie Quick on His Company and Making Success Happen</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-the-founder-of-jsdelivr-dmitriy-akulov/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Interview: Q&amp;A with the Founder of jsdelivr, Dmitriy Akulov\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/09/jsdelivr-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with the Founder of jsdelivr, Dmitriy Akulov</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/lowendprotection-homemade-raspberry-pi-security-cloud-camera-setup/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"LowEndProtection: Homemade Raspberry Pi Security Cloud Camera Setup\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/07/rpi_security1-150x150.jpg) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">LowEndProtection: Homemade Raspberry Pi Security Cloud Camera Setup</div></div></a></div><div style=\"clear: both\"></div></div></div><div id=\"author-bio-box\" style=\"background: #f8f8f8; border-top: 2px solid #cccccc; border-bottom: 2px solid #cccccc; color: #333333\"><h3><a style=\"color: #555555;\" href=\"https://lowendbox.com/blog/author/raindog308/\" title=\"All posts by raindog308\" rel=\"author\">raindog308</a></h3><div class=\"bio-gravatar\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI3MCIgaGVpZ2h0PSI3MCIgdmlld0JveD0iMCAwIDcwIDcwIj48cmVjdCB3aWR0aD0iMTAwJSIgaGVpZ2h0PSIxMDAlIiBmaWxsPSIjY2ZkNGRiIi8+PC9zdmc+\" alt=\"\" data-src=\"https://secure.gravatar.com/avatar/4ce3b8640a70e05bd73ac25b8a37821c?s=70&amp;d=retro&amp;r=pg\" data-srcset=\"https://secure.gravatar.com/avatar/4ce3b8640a70e05bd73ac25b8a37821c?s=140&amp;d=retro&amp;r=pg 2x\" class=\"avatar avatar-70 photo\" height=\"70\" width=\"70\" loading=\"lazy\"></div><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"https://www.lowendtalk.com/profile/raindog308\" class=\"bio-icon bio-icon-website\"></a><p class=\"bio-description\">I'm Andrew, techno polymath and long-time LowEndTalk community Moderator. My technical interests include all things Unix, perl, python, shell scripting, and relational database systems. I enjoy writing technical articles here on LowEndBox to help people get more out of their VPSes.</p></div></div><div class=\"feedback\"></div></div>"}