{"id": "24828", "post": "<div class=\"post-24828 post type-post status-publish format-standard hentry category-interview tag-bunnycdn tag-cdn tag-ddos tag-network tag-slovenia\" id=\"post-24828\"><h2 class=\"storytitle\"><a href=\"https://lowendbox.com/blog/interview-qa-with-dejan-from-bunnycdn/\" rel=\"bookmark\">Interview: Q&amp;A with Dejan from BunnyCDN</a></h2><div class=\"meta\"><img data-lazyloaded=\"1\" src=\"/media/icons/tag_green.png\" data-src=\"/media/icons/tag_green.png\" alt=\"Tags: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> <a href=\"https://lowendbox.com/tag/bunnycdn/\" rel=\"tag\">bunnycdn</a>, <a href=\"https://lowendbox.com/tag/cdn/\" rel=\"tag\">cdn</a>, <a href=\"https://lowendbox.com/tag/ddos/\" rel=\"tag\">ddos</a>, <a href=\"https://lowendbox.com/tag/network/\" rel=\"tag\">network</a>, <a href=\"https://lowendbox.com/tag/slovenia/\" rel=\"tag\">slovenia</a> <img data-lazyloaded=\"1\" src=\"https://lowendbox.com/media/icons/calendar.png\" data-src=\"https://lowendbox.com/media/icons/calendar.png\" alt=\"Date/Time: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> October 17, 2020 @ 12:00 am, by raindog308</div><div class=\"storycontent tablelook\"><p><a href=\"https://www.bunnycdn.com/\" target=\"_blank\" rel=\"noopener noreferrer\"><img data-lazyloaded=\"1\" src=\"https://lowendbox.com/wp-content/uploads/2020/10/bunny3.png.webp\" loading=\"lazy\" class=\"alignnone wp-image-25051 size-full litespeed-loaded\" data-src=\"https://lowendbox.com/wp-content/uploads/2020/10/bunny3.png.webp\" alt=\"\" width=\"300\" height=\"300\" align=\"right\" hspace=\"20\" data-srcset=\"https://lowendbox.com/wp-content/uploads/2020/10/bunny3.png.webp 300w, https://lowendbox.com/wp-content/uploads/2020/10/bunny3-150x150.png.webp 150w\" data-sizes=\"(max-width: 300px) 100vw, 300px\" sizes=\"(max-width: 300px) 100vw, 300px\" srcset=\"https://lowendbox.com/wp-content/uploads/2020/10/bunny3.png.webp 300w, https://lowendbox.com/wp-content/uploads/2020/10/bunny3-150x150.png.webp 150w\" data-was-processed=\"true\"></a>Our&nbsp;<a href=\"https://lowendbox.com/category/interview/\">LowEndBox Interview Series</a> has featured many interesting personalities so far and today we’re excited to bring you an interview with the <strong>CEO and Founder of <a href=\"https://www.bunnycdn.com\" target=\"_blank\" rel=\"noopener noreferrer\">BunnyCDN</a>, Dejan </strong>(aka @BunnySpeed on LowEndTalk).&nbsp; I really enjoyed reading this interview and I think you will as well, as his incredible passion for his company and their fun culture really shines through.&nbsp;&nbsp;I encourage you to visit <a href=\"https://bunnycdn.com/about\" target=\"_blank\" rel=\"noopener noreferrer\">their web site</a>, which is one of the sharpest I’ve seen in a long time – very cool use of a memorable art theme (rabbits, which connote speed).</p><p><strong>Tell me about your background and your company’s history?</strong></p><p><a href=\"https://www.bunnycdn.com\" target=\"_blank\" rel=\"noopener noreferrer\">BunnyCDN</a> actually started as my personal side-project around 8 years ago while I was still working as a full time mobile software developer at a different company. I have always been a very creative person and worked on many small little projects or pieces of software to explore ideas or just for the fun of it.</p><p>Amongst other things at the time, I was running a mildly popular “Japanese PoP culture” website (wink) that was presenting an ever-increasing traffic bill. Back then, everyone was charging crazy prices for CDN bandwidth unless you were a large enterprise with a multi-year contract. Being from Eastern Europe, I practically had almost no money, so even the budget CDNs were somehow incredibly expensive. So in the good low-end spirit, I built my own simple CDN to speed up the content delivery. At that point, it was just one of the many little projects that I did.</p><p>While I was playing with the routing and checking the results, something clicked in my head and I realized that there is a clear market need for a service like that and likely there were many more website owners that would very much need a service like this.</p><p>After around 2 years of planning, going through ideas and development, I launched the first version, but starting without any kind of funding meant a slow and rocky start. Turns out starting a CDN is tricky when your budget is nonexistent and just a small peak of video traffic can overload your whole system. Also, if you’re the only one working on it, it will need your attention 24/7.</p><p>However, I kept working on it pretty much 7 days a week and tried to find solutions in software to solve hardware and cost issues and automate as much as possible. It was all very slow, but we were gradually getting some traction and with the help of a friend, I was able to move over full time in 2017.</p><p>After that, things really sped up. I could finally focus my full attention to what I loved and we started to build a proper team. Fast forward to 2020, we are now one of the top CDN brands out there and we’re now growing faster than ever with close to 10.000 customers already. Handling a random 100 Gbit peak of traffic over a couple of seconds is just a regular occurrence these days, so it’s been a very exciting journey for me to see the company grow and evolve.</p><p><span id=\"more-24828\"></span></p><p><strong>Why run a CDN? I mean, your team obviously has the talent to do lots of thing – what was it about the CDN market that intrigued you?</strong></p><p>As I mentioned, I’ve always explored many different ideas and probably hundreds of tiny projects, but nothing really stuck with me in the same way. I always wanted to make a service that would really make difference, but I never saw a real opportunity to do that. I think once the idea of building a CDN came in mind, it connected the creative side, the business side and the nerd inside of me and I fell in love with it. Not to mention I always loved servers and networking.</p><p>After 8 years, I’m still incredibly passionate about the CDN industry and just tinkering with the hardware and network to remove that extra ms of latency. It might seem boring for some, but it just clicks all the right buttons for me. There’s always something to do and room to improve and just find new solutions to make our service better.</p><p>It’s easy to think that a CDN are just a couple of servers around the world and tinkering with the network routing, but it’s really much more than that once you have the basic framework set up, especially with so many new technologies popping up. We’re putting a large focus on the software, rather than just the hardware.</p><p><strong><img data-lazyloaded=\"1\" src=\"https://lowendbox.com/wp-content/uploads/2020/09/profile-dejan-300x203.jpg.webp\" loading=\"lazy\" class=\"size-medium wp-image-24830 alignleft litespeed-loaded\" data-src=\"https://lowendbox.com/wp-content/uploads/2020/09/profile-dejan-300x203.jpg.webp\" alt=\"\" width=\"300\" height=\"203\" align=\"left\" hspace=\"20\" data-srcset=\"https://lowendbox.com/wp-content/uploads/2020/09/profile-dejan-300x203.jpg.webp 300w, https://lowendbox.com/wp-content/uploads/2020/09/profile-dejan.jpg.webp 700w\" data-sizes=\"(max-width: 300px) 100vw, 300px\" sizes=\"(max-width: 300px) 100vw, 300px\" srcset=\"https://lowendbox.com/wp-content/uploads/2020/09/profile-dejan-300x203.jpg.webp 300w, https://lowendbox.com/wp-content/uploads/2020/09/profile-dejan.jpg.webp 700w\" data-was-processed=\"true\">I think your “about the bunnies” page is absolutely awesome, and elsewhere you’ve got bunnies with jetpacks, shields, and visors. Even your logo is about speed. Your artwork throughout your site is just amazing and adorable – it made me want to read more blog entries and pages just to see the art! I think the marketing conveys the perfect image. How did you land on the name and why don’t you sell branded stuffed animals?</strong></p><p>Aww, thank you!</p><p>Initially, the project was named RocketCDN, but that didn’t really feel like me. Luckily, around that time, I ran into TunnelBear VPN and I really fell in love with their branding. I always liked a more playful approach to an otherwise technical service, exactly what they did. So our own name and branding was in a big way inspired by them. I always liked cute things, so bunny and speed kind of went together.</p><p>At launch, the service was then actually called BunnySpeed, because somehow, I thought that would be a good idea. Thankfully, Google refused to index the page entirely because apparently it used to be an adult website in the past. Who would figure, right? So we had to rebrand and so the name <a href=\"https://www.bunnycdn.com\" target=\"_blank\" rel=\"noopener noreferrer\">BunnyCDN</a> was born.</p><p>I’ve actually been skeptical about the name for quite a long time, but I’ve grown to really love it. Every time I see any bunny branded item in a store, it always makes me smile and I often joke about creating Bunny Corp. I’m not really sure what it is, but it creates a very lovely feeling and I’m really very fond of the bunny branding now.</p><p>For the art itself, a large thanks goes to my wife that is an amazing artist. Most of the original graphical concepts and all of the blog illustrations are her work, so I always felt like we had a great synergy and she helped shape the look of <a href=\"https://www.bunnycdn.com\" target=\"_blank\" rel=\"noopener noreferrer\">BunnyCDN</a>. For the graphic design itself we have partnered with a design team in Indonesia though that I think also did an amazing job.</p><p>Haha, well the idea of selling plushies has definitely popped into mind, but it feels like we would be selling promotional material so it’s a bit weird. Maybe giving out some for free would be lovely though, thanks for planting this idea into my head that I won’t be able to get rid of… We do actually have some questionable merch just for our team though, like yoga pants. We think socks should be next. Because why not, we just all like the brand I guess.</p><p><strong>Customers have lots of choices in the CDN market. Why would someone choose <a href=\"https://www.bunnycdn.com\" target=\"_blank\" rel=\"noopener noreferrer\">BunnyCDN</a>? What sets you apart?</strong></p><p>This is an interesting question. Personally, I think the rather unique branding and great pricing is what has really set us apart in the beginning, but it was a bit of a double-edged sword. It’s been a core value for us to offer the best service we can for the lowest possible price, but in the real world, one can easily think that a low price would indicate a low-quality service.</p><p>I have heard of a study where a company sold batteries at a very low price, but nobody bought them because the consumers thought that the quality was horrible. Then once they raised the price, everyone started buying them like hot cakes.</p><p>I feel like we initially suffered from a similar problem, but once more and more people gave us a try, they realized that a low cost doesn’t necessarily mean low quality. We have been incredibly passionate about providing an excellent user experience that is incredibly simple to use, yet offers very powerful features coupled with great performance, reliability and great support. I think that’s really what sells <a href=\"https://www.bunnycdn.com\" target=\"_blank\" rel=\"noopener noreferrer\">BunnyCDN</a> in the long term more than the price and I would never sacrifice the quality of our service to save money. We simply offer a low pricing because we want to.</p><p>We are very passionate about what we do and constantly try to find better solutions and innovate where we can. I think our customers appreciate that. Hopefully, they also like the bunnies as much as we do.</p><p><strong>42 datacenters – wow! How many did you start with?</strong></p><p>At launch, I think the service had 8 tiny PoPs in Europe, North America and Singapore. I couldn’t really afford more at the time since everything was funded by myself …</p><p>We now actually have more than 42 PoPs, but some of them have not yet been publicly announced as we’re just testing the effect for now.</p><p>Our system allows us to add new locations rather easily and the infrastructure is designed to work on commodity hardware just as well as on tailored setups. Still, we need to be careful about how this might effect the cache hit rate and other factors. If nothing is cached, we’re not really offering a lot of benefits, quite the opposite in fact. So any expansion is thoroughly evaluated first.</p><p>That being said, opening PoPs is much easier in theory, but harder in practice and planned a bit more carefully than one might think. We need to make sure that we’re actually creating benefit.</p><p><strong>You have a special offering in Australia. Is that an underserved market?</strong></p><p>I’m not sure about being underserved, but it’s a very tricky region to do right. We were lucky because our partner there had a proposition to offer great pricing if we opened through multiple locations. Effectively, we built the fastest CDN network in Oceania. The result was a win-win and allowed us to provide really good value to our customers, so we decided to highlight it a little bit.</p><p><strong>Do you have a big warroom somewhere with giant television screens and uniformed officers watching the network? More seriously, how do you monitor dozens POPs around the world?</strong></p><p>We had a big TV in the office, but all of us ended up working remotely, so I just have an extra laptop with Grafana running now.</p><p>Obviously stability is one of the biggest requirements for a CDN. As such, we have multiple layers of monitoring starting at the DNS which checks all our nodes in real-time and automatically makes adjustments if necessary. We also monitor the whole stack with an external status monitoring service that ties into our API and then another monitoring service to check packet loss and connection quality to do any manual re-routing if needed.</p><p>Finally, we have a bunch of alerts and monitoring set up around the world and on each of our servers that then feed metrics into Grafana which does a final layer of alerting and manual monitoring. My wife is probably jealous of Grafana at this point. Did I mention I love Grafana?</p><p>We currently manage over 400 servers, so it’s never boring, but really, good automation is key here.</p><p><strong>What are the biggest headaches with a CDN – DDOS, security, or…?</strong></p><p>Being attacked is a daily occurrence, but we usually don’t run the actual root domain, so usually we’re not the main target.</p><p>The biggest headache probably ties in to the previous question, which is is maintaining and managing hundreds of servers and multiple network setups around the world.</p><p>I am personally very passionate about everything running perfectly at all times, but at this scale, something is bound to go wrong pretty much regularly, be it as simple as dying disk or just hitting a really weird bug in nginx that causes a server to practically explode. We’ve seen it all.</p><p>Abuse is also very annoying to deal with. It takes 1 person to make life harder for thousands of other people, so we’re quite strict on that. Thanks to this, I developed a passionate hate for live sports streaming.</p><p><strong>How is the IT talent market in Slovenia? Is your entire team there or are you spread out?</strong></p><p>We are still a small team, but the more we grow, the more I realize finding talented people is really hard because they’re all taken already. We also have quite unique requirements since we deal with some quite low level development, so it’s tricky.</p><p>Our team is actually rather spread out. We have people in Slovenia, United Kingdom, Austria, our designers are from Indonesia and I’m actually staying in Bangkok at the moment. It’s the joy of working in IT, you don’t really need an office. I feel extremely lucky to be able to work in an industry that allows this.</p><p><strong>How has your infrastructure changed over the six years you’ve been in business?</strong></p><p>It’s been insane. We went from little 512 MB VPS servers on DigitalOcean to clusters of dual CPU beasts with 60 TB of NVMe space and 80 Gbit of connectivity. The software stack has also changed a lot to support all the new features and scalability as we went from having 100Mbps capacity per PoP to over 100 Gbit in our bigger locations for example. It’s easy to think that a CDN is just a bunch of servers, but the more you grow the more complex it all becomes.</p><p>At smaller scale, it’s easy to grow vertically, but once you start pushing more traffic or bigger clients, you really need to have a very good horizontal scaling strategy.</p><p><strong>What’s your company culture like inside?</strong></p><p>It’s incredibly relaxed. We make bad jokes, we play Age of Empires, we rant at things. There’s always something fun going on. I want everyone to enjoy what they do and feel appreciated and then hopefully we can focus on doing great things. I hope we can continue this spirit as we grow.</p><p><strong>What are some of the newest products/features you’re most proud of? Anything exciting coming down the road?</strong></p><p>I feel like all the buzz in the CDN market is shifting more and more towards other edge solutions such as edge scripting which is definitely one area we’re exploring, but the actual static file delivery aspect has largely been left where it has been for a long time. However, I wasn’t really happy with the current state, so I wanted to see if we can innovate in this area in some way to provide extra value to an otherwise stagnant market.</p><p>Just recently we came up with two very unique features, the Geo-Replicated storage and the Perma-Caching feature. The Geo-Replicated storage is a multi-region storage that automatically replicates files around the world with immediate worldwide availability. That ties into the Perma-Cache which automatically replicates the CDN cache onto the storage, meaning that even in case the CDN node does not have a file, it will still find it very close on the storage.</p><p>These two features I think present a very unique value that solves a big potential bottleneck in traditional CDN systems where a cache MISS can destroy performance. It’s still a rather unique concept, but we’ve gotten some great feedback from our users regarding this. We also saved some of our customers thousands of dollars per month in origin traffic as well since it’s all stored permanently with us.</p><p>As such, we are very excited to see where we can this next</p><p>Besides that, we are always working on trying new ideas to try and offer more value and an increasingly better service. Some things are still a secret for now, but we are working on a really nice video solution and DNS service which I am happy to share, so keep an eye out for that.</p><p><strong>Final thoughts and anything you would like to add?</strong></p><p>After reading through all of this a couple of times, I’m really starting to feel very sentimental. <a href=\"https://www.bunnycdn.com\" target=\"_blank\" rel=\"noopener noreferrer\">BunnyCDN</a> throughout the years has really become a part of me and I am feeling really lucky to be in a position that I am. Going from a side-project to one of the most well known CDN brands has been a very exciting experience for me personally and I just regret not going full in earlier.</p><p>As such I just wanted to give some encouragement to anyone thinking of starting their own business. If you think you have a great idea and a passion for something, don’t be afraid to pursue it. It might take a year, it might take two years, it might take 5 years, but if you keep working on it and focus on creating a great product that adds value and continuing to improve yourself, I’m sure you will end up creating something great and I’m excited to see what that will be.</p><p><a href=\"https://www.bunncdn.com/\" target=\"_blank\" rel=\"noopener noreferrer\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI4MDAiIGhlaWdodD0iMjY3IiB2aWV3Qm94PSIwIDAgODAwIDI2NyI+PHJlY3Qgd2lkdGg9IjEwMCUiIGhlaWdodD0iMTAwJSIgZmlsbD0iI2NmZDRkYiIvPjwvc3ZnPg==\" loading=\"lazy\" class=\"alignnone size-full wp-image-24846\" data-src=\"https://lowendbox.com/wp-content/uploads/2020/10/bunnycdn-banner-800.jpg.webp\" alt=\"\" width=\"800\" height=\"267\" data-srcset=\"https://lowendbox.com/wp-content/uploads/2020/10/bunnycdn-banner-800.jpg.webp 800w, https://lowendbox.com/wp-content/uploads/2020/10/bunnycdn-banner-800-300x100.jpg.webp 300w, https://lowendbox.com/wp-content/uploads/2020/10/bunnycdn-banner-800-768x256.jpg.webp 768w\" data-sizes=\"(max-width: 800px) 100vw, 800px\"></a></p><p class=\"dpsp-share-text\"></p><div id=\"dpsp-content-bottom\" class=\"dpsp-content-wrapper dpsp-shape-rounded dpsp-column-auto dpsp-has-spacing dpsp-no-labels dpsp-show-on-mobile dpsp-button-style-1 dpsp-has-icon-background dpsp-has-button-background dpsp-show-total-share-count dpsp-show-total-share-count-after\"><ul class=\"dpsp-networks-btns-wrapper dpsp-networks-btns-content dpsp-has-button-icon-animation\"><li><a rel=\"nofollow\" href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flowendbox.com%2Fblog%2Finterview-qa-with-dejan-from-bunnycdn%2F&amp;t=Interview%3A%20Q%26A%20with%20Dejan%20from%20BunnyCDN\" class=\"dpsp-network-btn dpsp-facebook dpsp-no-label dpsp-first\" title=\"Share on Facebook\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://twitter.com/intent/tweet?text=Interview%3A%20Q%26A%20with%20Dejan%20from%20BunnyCDN&amp;url=https%3A%2F%2Flowendbox.com%2Fblog%2Finterview-qa-with-dejan-from-bunnycdn%2F&amp;via=LowEndNetwork\" class=\"dpsp-network-btn dpsp-twitter dpsp-no-label\" title=\"Share on Twitter\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://www.linkedin.com/shareArticle?url=https%3A%2F%2Flowendbox.com%2Fblog%2Finterview-qa-with-dejan-from-bunnycdn%2F&amp;title=Interview%3A%20Q%26A%20with%20Dejan%20from%20BunnyCDN&amp;mini=true\" class=\"dpsp-network-btn dpsp-linkedin dpsp-no-label dpsp-last\" title=\"Share on LinkedIn\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li></ul><div class=\"dpsp-total-share-wrapper\"><span class=\"dpsp-icon-total-share\"></span><span class=\"dpsp-total-share-count\">1</span><span>shares</span></div></div><div class=\"relpost-thumb-wrapper\"><div class=\"relpost-thumb-container\"><h3>Related posts:</h3><div style=\"clear: both\"></div><div style=\"clear: both\"></div><div class=\"relpost-block-container\"><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-the-founder-of-jsdelivr-dmitriy-akulov/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Interview: Q&amp;A with the Founder of jsdelivr, Dmitriy Akulov\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/09/jsdelivr-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with the Founder of jsdelivr, Dmitriy Akulov</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/poll-results-have-you-been-the-victim-of-a-ddos-attack/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Poll Results: Have You Been the Victim of a DDoS Attack?\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/06/lowendbox-poll-results-150x150.jpg) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Poll Results: Have You Been the Victim of a DDoS Attack?</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/lowendlols-dispute/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"LowEndLOLs: Dispute\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/08/Comic-3-Dispute-800-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">LowEndLOLs: Dispute</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/poll-results-which-of-these-features-do-you-look-for-when-selecting-a-provider/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Poll Results: Which of These Features Do You Look for When Selecting a Provider?\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/06/lowendbox-poll-results-150x150.jpg) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Poll Results: Which of These Features Do You Look for When Selecting a Provider?</div></div></a></div><div style=\"clear: both\"></div></div></div><div id=\"author-bio-box\" style=\"background: #f8f8f8; border-top: 2px solid #cccccc; border-bottom: 2px solid #cccccc; color: #333333\"><h3><a style=\"color: #555555;\" href=\"https://lowendbox.com/blog/author/raindog308/\" title=\"All posts by raindog308\" rel=\"author\">raindog308</a></h3><div class=\"bio-gravatar\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI3MCIgaGVpZ2h0PSI3MCIgdmlld0JveD0iMCAwIDcwIDcwIj48cmVjdCB3aWR0aD0iMTAwJSIgaGVpZ2h0PSIxMDAlIiBmaWxsPSIjY2ZkNGRiIi8+PC9zdmc+\" alt=\"\" data-src=\"https://secure.gravatar.com/avatar/4ce3b8640a70e05bd73ac25b8a37821c?s=70&amp;d=retro&amp;r=pg\" data-srcset=\"https://secure.gravatar.com/avatar/4ce3b8640a70e05bd73ac25b8a37821c?s=140&amp;d=retro&amp;r=pg 2x\" class=\"avatar avatar-70 photo\" height=\"70\" width=\"70\" loading=\"lazy\"></div><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"https://www.lowendtalk.com/profile/raindog308\" class=\"bio-icon bio-icon-website\"></a><p class=\"bio-description\">I'm Andrew, techno polymath and long-time LowEndTalk community Moderator. My technical interests include all things Unix, perl, python, shell scripting, and relational database systems. I enjoy writing technical articles here on LowEndBox to help people get more out of their VPSes.</p></div></div><div class=\"feedback\"></div></div>"}