{"id": "23958", "post": "<div class=\"post-23958 post type-post status-publish format-standard hentry category-interview tag-interview tag-qa\" id=\"post-23958\"><h2 class=\"storytitle\"><a href=\"https://lowendbox.com/blog/interview-qa-with-low-end-talk-moderator-nekki/\" rel=\"bookmark\">Interview: Q&amp;A with Low End Talk Moderator Nekki</a></h2><div class=\"meta\"><img data-lazyloaded=\"1\" src=\"data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=\" data-src=\"/media/icons/tag_green.png\" alt=\"Tags: \"> <a href=\"https://lowendbox.com/tag/interview/\" rel=\"tag\">interview</a>, <a href=\"https://lowendbox.com/tag/qa/\" rel=\"tag\">q&amp;a</a> <img data-lazyloaded=\"1\" src=\"data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=\" data-src=\"https://lowendbox.com/media/icons/calendar.png\" alt=\"Date/Time: \"> June 27, 2020 @ 4:02 am, by raindog308</div><div class=\"storycontent tablelook\"><p><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSIxNjIiIGhlaWdodD0iMTYyIiB2aWV3Qm94PSIwIDAgMTYyIDE2MiI+PHJlY3Qgd2lkdGg9IjEwMCUiIGhlaWdodD0iMTAwJSIgZmlsbD0iI2NmZDRkYiIvPjwvc3ZnPg==\" loading=\"lazy\" class=\"screenshot alignnone\" title=\"Interview: Q&amp;A with Low End Talk Moderator Nekki\" data-src=\"https://lowendbox.com/wp-content/uploads/2020/06/nsfw.jpg.webp\" alt=\"Interview: Q&amp;A with Low End Talk Moderator Nekki\" width=\"162\" height=\"162\">In this interview, we connect with the legendary <a href=\"https://www.lowendtalk.com/profile/nekki\" target=\"_blank\" rel=\"noopener noreferrer\">@Nekki</a>, whose account dates from August 2011.&nbsp; As of this writing he has over 18,700 comments, and an even more impressive 20,000+ thanks. From his break-the-Internet Black Friday threads to his Marquis de Safe method of moderation, @Nekki is one of LET’s true OGs, past masters, and black eminences. Let’s dive into his personality a bit. Before continuing please consider that this interview is Nekki in his own, raw words, and is therefore not safe for work (R-rated)!</p><p><strong>Where in the world do you live?</strong></p><p>In the UK, on the outskirts of London, but hopefully not for long.</p><p><strong>What is your background with IT?</strong></p><p>I’ve been fucking around with computers since I was 8, and starting getting involved in programming around 11 when I started hacking about with a game my uncle made to add in characters and places from The Transformers. Professionally, I’ve been in IT about 18 years across a lot of roles, from front-end development all the way to infrastructure management, from retouching imagery to delivering a transactional banking platform.</p><p><strong>What’s your day job?</strong></p><p>Officially, I head up an IT infrastructure/platform delivery team for a very large FTSE100-traded organisation. Unofficially, I spend much of my day in meetings stopping people from doing insane things and fighting with each other, pulling arses out of the fire, rescuing projects and wishing I’d done something less frustrating and stressful with my life.</p><p><span id=\"more-23958\"></span></p><p><strong>You were sentenced to some kind of penal sentence involving a lot of Azure work…what are your thoughts on The Big Clouds?</strong></p><p>Clearly it’s the way that big organisations are heading; being able to have all the complex infrastructure you need to run a global business without having to employ all those pesky expensive staff and run those annoyingly pricey datacentres is clearly attractive to the bean-counters and the shareholders, and I genuinely believe we’re on the cusp of proper laptops being replaced with cheap thin clients (or even BYOD) so <strong>all</strong> of an organisation’s data is held in the cloud and physical hardware costs are next to nil. I don’t think regulations and controls have caught up sufficiently however, which is a very serious risk in my opinion; it’s fine for the likes of Netflix to have a metric fuck-ton of servers in the cloud to deliver video to a house-bound planet, but banks, governments and medical organisations who hold the really personal data? I’m not so sure, especially given the clear increase in state-sponsored hacking occurring pretty much everywhere. I fear we’re not far out from a very, very serious cyber-security breach that turns things upside-down.</p><p>That was your one serious answer, BTW. Cuntflapswankstainvadgepacket.</p><p><strong>Doesn’t your LET username mean “drinker of souls” or “naked wolf boy” or something like that?</strong></p><p>It’s a Japanese word, the kanji being 熱気. As with most Japanese words there are a number of valid translations, but most common is ‘hot air’, which I think everyone can agree is entirely appropriate.</p><p><strong>So…anime…you’re into it? What in particular?</strong></p><p>Anything with robots (mecha, to use the appropriate parlance) or tentacles, preferably both. If I had to highlight the works of just one creative team I usually enjoy, it would probably be Ken Ishikawa and Go Nagai (who’s most famous works typically feature robots and tentacles). Anime fans reading this will also likely know how my anime proclivities relate to my username.</p><p><strong>What do you use your VPSes for?</strong></p><p>VPN, storage, a couple of websites… I don’t do much with VPS these days on account of work and my homelife keeping me increasingly busy. The majority of the action happens on one of my two (reasonably massive) dedicated servers.</p><p><strong>Debian, or…?</strong></p><p>There is no ‘or’. I think I deployed CentOS once on a VPS once by accident and it wouldn’t boot, so fuck that guy.</p><p><strong>I heard a rumour that you and Emma Watson are, shall we say, more than friends…?</strong></p><p>If by ‘Emma Watson’ you mean ‘Madame Palm and her five lovely daughters’, then yes, you could say we are ‘intimately’ acquainted with one another…</p><p><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSIzODAiIGhlaWdodD0iMjgxIiB2aWV3Qm94PSIwIDAgMzgwIDI4MSI+PHJlY3Qgd2lkdGg9IjEwMCUiIGhlaWdodD0iMTAwJSIgZmlsbD0iI2NmZDRkYiIvPjwvc3ZnPg==\" loading=\"lazy\" class=\"screenshot alignnone\" title=\"Interview: QA with Low End Talk Moderator Nekki / Emma Watson GIF\" data-src=\"https://lowendbox.com/wp-content/uploads/2020/06/emma_watson_love_cock.gif.webp\" alt=\"Interview: QA with Low End Talk Moderator Nekki / Emma Watson GIF\" width=\"380\" height=\"281\"><strong>Personally, I think the Emma Watson Black Friday sale WITH ITS ALL CAPS THEME was the most fun I’ve ever had on a forum. What are your memories/thoughts of black fridays?</strong></p><p>The first few BFs/CMs were amongst my favourite life experiences whilst clothed (which is really saying something, as I obviously don’t drown and bury hookers in the nude – too much of a DNA risk). I don’t have memories as such; everything was largely a blur and I genuinely don’t recall what I did or why I did it (with one exception, see below), I like to think that I just became the personification of the collective hunger of LET for absolutely batshit insane deals, which fuelled what happened. The day of the first ALL CAPS thread, I do remember that I ran around shouting the entire time because I was so hyped.</p><p>Fun fact: you’re directly responsible for the Emma Watson CM thread; you posted the now legendary ‘I love cock’ gif right at the end of the prior BF thread. I just took that concept and shot my thick, creamy, load all over it.</p><p><strong>Are you doing Black Friday 2020 here?</strong></p><p>No, I think BF has run its course now. CM2019 in particular was hugely disappointing. The special mix of personalities, willing providers and buyers without common sense just isn’t there any more.</p><p><strong>What are your thoughts on the state of the VPS world and market in 2020?</strong></p><p>No idea, I haven’t paid much attention for some time. The providers I trust are largely still going, so I just continue to buy from them.</p><p><strong>Have you had any encounters with those new giant murder hornets?</strong></p><p>I don’t think they made it to the UK, we have smaller ones that just like to drink your tea and nibble your sandwiches if left unattended, much more civilised.</p><p><strong>Word is that you are deep into football manager and such simulations. Tell us about that.</strong></p><p>Football Manager is basically just a gigantic spreadsheet with a nice visualisation on top, that allows you to fulfill your dreams of taking your local, terrible football (soccer to the heretics over the pond) club from playing on a dog-shit strewn field in the middle of nowhere to winning the league in your state-of-the-art 100,000 seater stadium. I’ve been wasting my life on it since it was called Championship Manager back when I was still in short trousers and I can’t imagine stopping, especially now it’s available on every electronic device known to man. It’s been a God-send with no actual football to watch.</p><p><strong>You’ve been on LET since 2011 with over 20,000 thanks (in fact, you’re only a few thanks behind the all-time leader, <a href=\"https://www.lowendtalk.com/profile/jar%29\" rel=\"nofollow\">@jar)</a>. To what do you attribute the community’s adulation?</strong></p><p>In part, I think the novelty of someone who uses the word ‘cunt’ repeatedly hasn’t worn off for most people. It could also be because many forum members still think I’m female (partly because of the username, partly because I claimed to be female several times), and y’know, internet nerds be horny. Mainly however, it’s because of @netomx who diligently thanked everything I posted for a few years. Cheers fella!</p><p><strong>Any favourite moments from your time on LET?</strong></p><p>Now there’s a question you could write a book on… hopefully you’ll permit me a few high/lowlights:</p><ul><li>BuyVM Vs Chicago VPS wars were epically epic (basements, Buffalo and slabbing).</li><li>The transformation of SZ1 from friendly wannabe hosting provider to gay porn-posting psychopath was an absolute joy to behold.</li><li>Green Value Host and Johnny Nuggets was the gift that kept on giving.</li><li>The Crystal/Thomas Dale identity theft episode.</li><li>Spirit throwing the ultimate hissy fit and deleting all his posts when he got de-modded.</li></ul><p>I could go on; it’s really hard to stop bringing things up once you start to think about the insanity of LET at its peak, and I’ve only mentioned the stuff that’s public knowledge!</p><p><strong>Any thoughts on the future of LET?</strong></p><p>I suspect more drama in the future. Based on past experience, it seem highly likely that the new owner is simply one of Chris Fabozzi’s many personalities, and LET will be transformed into a campaign site for Trump’s re-election campaign in the next few months. It will also turn out that LET has been hosted in Aldryic’s cousin’s basement all along, and someone will die from exhaustion during BF2021.</p><p>Seriously though, I dunno. The magic of peak LET is a magic that can never be recaptured because it was a wonderful combination of so many things that converged at just the right time to create something far greater that it had any right to. The future of LET for me is really unclear because of the hands in which it now resides. The new owner has been around LET for a large part of its life whilst somehow revealing very little of his true personality, motivations or intentions, so who the fuck knows where it might go? My own (limited) interactions with the owner some time back left me with the feeling of someone without much of a plan and who doesn’t ‘get’ LET at all. I hope, for the sake of those who still hold LET dear, that I’m wrong.</p><p>In my opinion, the only way to bring LET back to anywhere near its best is to reunite the family, but I feel that both the current ownership and the passing of time makes that impossible now. Maybe that’s for the best, remakes are rarely anywhere near as good as the original.</p><p>That was a bonus serious answer. Jizzblastspankmisslecunnybubble.</p><p class=\"dpsp-share-text\"></p><div id=\"dpsp-content-bottom\" class=\"dpsp-content-wrapper dpsp-shape-rounded dpsp-column-auto dpsp-has-spacing dpsp-no-labels dpsp-show-on-mobile dpsp-button-style-1 dpsp-has-icon-background dpsp-has-button-background dpsp-show-total-share-count dpsp-show-total-share-count-after\"><ul class=\"dpsp-networks-btns-wrapper dpsp-networks-btns-content dpsp-has-button-icon-animation\"><li><a rel=\"nofollow\" href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flowendbox.com%2Fblog%2Finterview-qa-with-low-end-talk-moderator-nekki%2F&amp;t=Interview%3A%20Q%26A%20with%20Low%20End%20Talk%20Moderator%20Nekki\" class=\"dpsp-network-btn dpsp-facebook dpsp-no-label dpsp-first\" title=\"Share on Facebook\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://twitter.com/intent/tweet?text=Interview%3A%20Q%26A%20with%20Low%20End%20Talk%20Moderator%20Nekki&amp;url=https%3A%2F%2Flowendbox.com%2Fblog%2Finterview-qa-with-low-end-talk-moderator-nekki%2F&amp;via=LowEndNetwork\" class=\"dpsp-network-btn dpsp-twitter dpsp-no-label\" title=\"Share on Twitter\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://www.linkedin.com/shareArticle?url=https%3A%2F%2Flowendbox.com%2Fblog%2Finterview-qa-with-low-end-talk-moderator-nekki%2F&amp;title=Interview%3A%20Q%26A%20with%20Low%20End%20Talk%20Moderator%20Nekki&amp;mini=true\" class=\"dpsp-network-btn dpsp-linkedin dpsp-no-label dpsp-last\" title=\"Share on LinkedIn\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li></ul><div class=\"dpsp-total-share-wrapper\"><span class=\"dpsp-icon-total-share\"></span><span class=\"dpsp-total-share-count\">4</span><span>shares</span></div></div><div class=\"relpost-thumb-wrapper\"><div class=\"relpost-thumb-container\"><h3>Related posts:</h3><div style=\"clear: both\"></div><div style=\"clear: both\"></div><div class=\"relpost-block-container\"><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-dedipath-cto-ernie-quick-on-his-company-and-making-success-happen/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"DediPath\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/10/DediPath_Logo-150x150.jpg) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with DediPath CTO Ernie Quick on His Company and Making Success Happen</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-the-founder-of-jsdelivr-dmitriy-akulov/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Interview: Q&amp;A with the Founder of jsdelivr, Dmitriy Akulov\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/09/jsdelivr-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with the Founder of jsdelivr, Dmitriy Akulov</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-letbox-owner-mahmoud-elghanam-on-the-hosting-industry-and-his-experience/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Interview: QA with LetBox Owner Mahmoud Elghanam\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/06/letbox-logo-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with LetBox Owner Mahmoud Elghanam on the Hosting Industry</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-aalayer-founder-armand-on-the-web-design-industry-and-great-customer-service/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"AALayer Web Hosting Design\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/05/aa-layer-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with AALayer Founder Armand on the Web Design Industry and Great Customer Service</div></div></a></div><div style=\"clear: both\"></div></div></div><div id=\"author-bio-box\" style=\"background: #f8f8f8; border-top: 2px solid #cccccc; border-bottom: 2px solid #cccccc; color: #333333\"><h3><a style=\"color: #555555;\" href=\"https://lowendbox.com/blog/author/raindog308/\" title=\"All posts by raindog308\" rel=\"author\">raindog308</a></h3><div class=\"bio-gravatar\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI3MCIgaGVpZ2h0PSI3MCIgdmlld0JveD0iMCAwIDcwIDcwIj48cmVjdCB3aWR0aD0iMTAwJSIgaGVpZ2h0PSIxMDAlIiBmaWxsPSIjY2ZkNGRiIi8+PC9zdmc+\" alt=\"\" data-src=\"https://secure.gravatar.com/avatar/4ce3b8640a70e05bd73ac25b8a37821c?s=70&amp;d=retro&amp;r=pg\" data-srcset=\"https://secure.gravatar.com/avatar/4ce3b8640a70e05bd73ac25b8a37821c?s=140&amp;d=retro&amp;r=pg 2x\" class=\"avatar avatar-70 photo\" height=\"70\" width=\"70\" loading=\"lazy\"></div><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"https://www.lowendtalk.com/profile/raindog308\" class=\"bio-icon bio-icon-website\"></a><p class=\"bio-description\">I'm Andrew, techno polymath and long-time LowEndTalk community Moderator. My technical interests include all things Unix, perl, python, shell scripting, and relational database systems. I enjoy writing technical articles here on LowEndBox to help people get more out of their VPSes.</p></div></div><div class=\"feedback\"></div></div>"}