{"id": "23997", "post": "<div class=\"post-23997 post type-post status-publish format-standard hentry category-interview tag-interview tag-jon-biloh tag-qa\" id=\"post-23997\"><h2 class=\"storytitle\"><a href=\"https://lowendbox.com/blog/interview-qa-with-lowendbox-lowendtalk-owner-jon-biloh/\" rel=\"bookmark\">Interview: Q&amp;A with LowEndBox/LowEndTalk Owner Jon Biloh</a></h2><div class=\"meta\"><img data-lazyloaded=\"1\" src=\"/media/icons/tag_green.png\" data-src=\"/media/icons/tag_green.png\" alt=\"Tags: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> <a href=\"https://lowendbox.com/tag/interview/\" rel=\"tag\">interview</a>, <a href=\"https://lowendbox.com/tag/jon-biloh/\" rel=\"tag\">jon biloh</a>, <a href=\"https://lowendbox.com/tag/qa/\" rel=\"tag\">q&amp;a</a> <img data-lazyloaded=\"1\" src=\"https://lowendbox.com/media/icons/calendar.png\" data-src=\"https://lowendbox.com/media/icons/calendar.png\" alt=\"Date/Time: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> July 25, 2020 @ 3:16 am, by raindog308</div><div class=\"storycontent tablelook\"><p><img data-lazyloaded=\"1\" src=\"https://lowendbox.com/wp-content/uploads/2020/06/73390767_2376564079136076_3197360726737944576_o.jpg.webp\" loading=\"lazy\" class=\"screenshot alignnone litespeed-loaded\" title=\"Interview: QA with LowEndBox/LowEndTalk Owner Jon Biloh\" data-src=\"https://lowendbox.com/wp-content/uploads/2020/06/73390767_2376564079136076_3197360726737944576_o.jpg.webp\" alt=\"Interview: QA with LowEndBox/LowEndTalk Owner Jon Biloh\" width=\"300\" height=\"300\" data-was-processed=\"true\">Today we’re continuing our <a href=\"https://lowendbox.com/category/interview/\">LowEndBox Interview Q&amp;A Series</a> by sitting down with Jon Biloh, the owner of <a href=\"https://www.lowendbox.com\">LowEndBox</a> and <a href=\"https://www.lowendtalk.com\">LowEndTalk</a>. In this interview, he responds to questions <a href=\"https://www.lowendtalk.com/discussion/165141/the-jon-biloh-ama\">submitted by the LowEndTalk community</a>.&nbsp; The questions have been cleaned up and grouped by LowEndTalk moderator and contributor <a href=\"https://www.lowendtalk.com/profile/raindog308\" target=\"_blank\" rel=\"noopener noreferrer\">@raindog308</a>.</p><p>In addition to being the current owner of LowEndBox and LowEndTalk, Jon runs a few different companies in a variety of industries based in New York and Florida (where he now lives). He is also the founder of ColoCrossing, a colocation, cloud and IaaS hosting provider based in Buffalo, New York, which he ran for 15 years prior to selling it to the Deluxe Corporation, in <a href=\"https://www.lowendtalk.com/discussion/149258/colocrossing-and-chicagovps-hvh-let-leb-etc-acquired-by-deluxe-com\">June 2018</a>. Today he supports the customers, employees and mission of ColoCrossing through a continuing role as an advisor to the company.</p><p>So let’s get started with the interview:</p><h1>Technical Questions</h1><p><strong>How much server horsepower does it take to run LET and LEB?&nbsp;What are the specs of LET’s server?</strong></p><p>Plenty of folks probably remember the infamous “Cluster” which previously ran LowEndBox and LowEndTalk for a handful of years and was known to commonly de-sync and cause other annoyances. Since I purchased LowEndBox and LowEndTalk from its prior owner in January 2020 we moved the hosting infrastructure to a new simplified virtualized environment that has been working really well. The new virtualized environment runs on bare metal gear equipped with the new Intel Scalable Xeon Platinum CPUs – so plenty of horsepower to keep up with the demanding traffic loads of LowEndBox and LowEndTalk. We’ve moved to an active/passive design instead of the active/active cluster and that’s both improved performance and eliminated syncing problems. There is an active/passive application server pair for LowEndBox and another for LowEndTalk and then another layer of segregated backups. Overall, simple is beautiful, reliable and fast.</p><p><strong>How has Cloudflare been and do you foresee staying with them for the foreseeable future? Any pros/cons with CF?</strong></p><p>Utilizing Cloudflare has been a big help in maintaining site uptime. It’s affordable, pretty reliable (no solution is perfect when it comes to fending off internet based attacks) and has been a worthwhile benefit. I don’t see LowEndBox/LowEndTalk moving away from Cloudflare anytime soon.</p><p><span id=\"more-23997\"></span></p><h1>Community Questions</h1><p><strong>Why is LowEndTalk still allowing hostile behavior from some users, who are just here to bash LET/LEB one way or other ? Healthy criticism is acceptable but some users here are out for the blood…</strong></p><p>A healthy discourse is good in just about any environment, including that of a busy and interesting message board. I don’t have an issue with folks voicing their opinions, suggestions, and more. It’s important to me that we create an environment that is welcoming and non-hostile, so that new and old community members alike feel comfortable spending time on our websites. Anyone who is spewing hatred isn’t welcome. Moderating a message board like LowEndTalk is an art more than a science, and is a tough job. Many compliments for the entire team of moderators at LowEndTalk, I’d say on the aggregate they are doing a really great job.</p><p><span style=\"color: #000000;\"><strong>How much did you spend to own LET/LEB?</strong></span></p><p>I purchased LowEndBox and LowEndTalk from the prior owner in January 2020. Based on the agreement I can’t share more details (which is standard in such things).</p><p><strong>Are you @WSS?</strong></p><p>I’m just Jon. I’ve got to say though, the <a href=\"https://www.lowendtalk.com/profile/wss\">avatar @WSS uses</a> makes me laugh.</p><p><strong>Why did you purchase LEB/LET? What is your end goal (there has to be a reason why you bought LET/LEB; whether it is for profit, “self benefit,” or something else)?</strong></p><p>Over the past couple years watching LowEndBox and LowEndTalk diminish from their prior content and traffic greatness under the prior owner wasn’t enjoyable. When the opportunity came to change that I grabbed the chance late last year. I enjoy being part of the LowEndBox and LowEndTalk community and because hosting has been such a big part of my professional career I’ve got a very special soft spot for the community. I like building things, especially things that are associated with an industry I’ve spent nearly 20 years in.</p><p><strong>LEB/LET has lost it’s roots of finding ways to maximize the potential of small amounts of computing resources and is now just a race to the cheapest price for the most oversold product.</strong></p><p>A lot has changed over the decade since LEA (LowEndAdmin) started LowEndBox. The market has evolved, virtualization has become common place and resource allotments have grown exponentially. That means in order for LowEndBox and LowEndTalk to stay relevant we’ve had to change a bit with the times, too. Part of my efforts over the past six months have been focused around creating new and interesting content, including <a href=\"https://lowendbox.com/category/tutorials\">tutorials</a>, <a href=\"https://lowendbox.com/category/interview/\">interviews</a>, <a href=\"https://lowendbox.com/category/editorial/\">opinion editorials</a>, <a href=\"https://lowendbox.com/category/editorial/\">community news</a>, and <a href=\"https://lowendbox.com/blog/the-state-of-low-end-box-and-low-end-talk-2020-update-edition/\">more</a>. With a commitment to quality content the best days for our community are ahead. If you’ve not read the <a href=\"https://lowendbox.com/blog/the-state-of-low-end-box-and-low-end-talk-2020-update-edition/\">March</a> of <a href=\"https://lowendbox.com/blog/the-state-of-low-end-box-and-low-end-talk-2020-june-update-edition/\">June</a> editions of the State of LowEndBox, check them out!</p><p><strong>In many ways, Linux has lots its way as well in a similar arena… that is, moving away from small stable monolithic applications to a mash of bloated multipurpose applications that may or may not work well, simply because computing resources are getting so cheap. (e.g. When is the last time anyone configured and compiled their own system specific kernels?)</strong></p><p>Yeah, I get that for sure. If you look at the life cycle of Windows for instance, you can see that the same cycle has occurred starting with Windows Me in the late 90’s, to the abomination that was Windows Vista and then back to cleaner code in Windows 7 and then ultimately to Windows 10 today. Developers got a bit lazy when resources became so abundant. You can see the exact same thing in computer game engines (doing more with less – Quake III engine vs. some of the resource pigs of the last five years). I still have buddies that make it their mission to get a lot work done on low resource, tight limitation BSD based boxes – they see it as an art form. Unfortunately their kind is becoming less and less common.</p><p><strong>How do you steer the content of LEB/LET back to it’s roots? Or do you think we’re too far gone to go back? The tutorials on LEB aren’t really about optimizing or minimizing resources, they’re just simple how-to’s to get something running. Not seeing if they an run in minimal environments.</strong></p><p>It’s a balance and as I’ve started the new campaign of content creation the past few months I’ve focused on simpler topics. More recently <a href=\"https://www.lowendtalk.com/profile/raindog308\">@raindog308</a> joined the content team and he has been working hard writing highly technical content more geared towards our advanced community than the general web user. So far <a href=\"https://www.lowendtalk.com/profile/raindog308\">@raindog308</a> (Andrew) has written about 50 articles and we’re going to keep that going for as long as he has the time. You’ll see his articles posted every week for the foreseeable future.</p><p><strong>What involvement do @dustinc and RackNerd have with LEB? Does any money change hands for the exposure he gets on the site?&nbsp;&nbsp;What is your stance on being funded by server providers? Does RackNerd have any involvement in this services funding?</strong></p><p>I’ve continued to use BuySellAds as our advertising system, despite their high cost (25% commission) because it’s an open platform that makes ad space opportunities equally available to all. In that context, RackNerd, as an advertiser, does support LowEndBox and LowEndTalk financially. I sincerely value and appreciate the contributions of all of our 30~ hosting advertisers and want to make sure that we continue to deliver a strong value for their advertising dollar. It’s been pointed out lately that RackNerd has contributed numerous articles and guest posts to LowEndBox by taking advantage of <a href=\"https://www.lowendtalk.com/discussion/164463/got-interesting-news-share-it#latest\">my requests for content to the community</a>. RackNerd seems to really have their marketing arm dialed in and I’d suggest others in the hosting space mirror what they’re doing by contributing content because it’s really excellent exposure – and free and open to all. Just takes a little effort.</p><p><strong>Does anyone other than you retain an ownership stake in LEB/LET?</strong></p><p>No, just me.</p><p><span style=\"color: #000000;\"><strong>What is the approximate revenue from LEB/LET in a month?</strong></span></p><p>That’s simple to calculate because all the revenue we derive to support our hosting infrastructure, content creation, administrative burden and other overhead can be found by multiplying the ad spaces on BuySellAds by the price per spot. After you take take out BuySellAd’s 25% cut, and cover all the costs, there isn’t much left over. This isn’t a get rich quick gig, that’s for sure.</p><p><strong>Do you pay or planning to pay the admin/moderators here?</strong></p><p>As the revenue grows and more investments are possible, all options are on the table. We are already paying for content creation, for example.</p><p><strong>Why the special section/attention for Los Angeles hosting on LEB?</strong></p><p>Los Angeles is the most frequently searched location on LowEndBox, which is why we are trying to make finding a great hosting provider in Los Angeles easier. Eventually I’d like to make special pages for each location, like we’ve already done for Los Angeles with the <a href=\"https://lowendbox.com/blog/frequently-asked-questions-los-angeles-vps/\">LA FAQ</a> and <a href=\"https://lowendbox.com/blog/best-los-angeles-vps-providers/\">Los Angeles Top Cheap VPS Hosts</a>.</p><p><strong>Will you be hosting a LET meetup?</strong></p><p>That would be great. I’d like to do that.</p><p><strong>Considering your interest in featuring quality companies offering quality services, what are your thoughts on doing an interview with every provider that wants to market/offer their products and services on LEB/LET?</strong></p><p>I am all about doing more interviews. So far we’ve published <a href=\"https://lowendbox.com/category/interview/\">quite a few the past two months</a>, and there are dozens more already completed waiting to be published through the balance of 2020. Any hosting provider is eligible, just speak up!</p><p><strong>Where is the future of LEB going? Do you have any plans for new forum technology?</strong></p><p>The future is quality hosting deals on cheap VPS, dedicated servers, VPN and more. Plus great content, via our expanded efforts towards&nbsp;<a href=\"https://lowendbox.com/category/tutorials\">tutorials</a>, <a href=\"https://lowendbox.com/category/interview/\">interviews</a>, <a href=\"https://lowendbox.com/category/editorial/\">opinion editorials</a>, <a href=\"https://lowendbox.com/category/editorial/\">community news</a>, and <a href=\"https://lowendbox.com/blog/the-state-of-low-end-box-and-low-end-talk-2020-update-edition/\">more</a>. Right now I think Vanilla is the best forum software for our community but that could change in the future.</p><p><strong>Do you plan to protect the community from “Summer/Black Friday” hosts?</strong></p><p>Absolutely. Since January 2020 when I took over the websites we’ve dramatically increased our pre-publishing review of hosting deals. While there will always be a bad apple and a provider that goes out of business, I absolutely want to limit the risks of that moving forward.</p><p><strong>Do you plan to create quality content like guides ?</strong></p><p>Yep, in fact we are already doing that. Check out our latest work: <a href=\"https://lowendbox.com/category/tutorials\">tutorials</a>, <a href=\"https://lowendbox.com/category/interview/\">interviews</a>, <a href=\"https://lowendbox.com/category/editorial/\">opinion editorials</a>, <a href=\"https://lowendbox.com/category/editorial/\">community news</a>, and <a href=\"https://lowendbox.com/blog/the-state-of-low-end-box-and-low-end-talk-2020-update-edition/\">more</a>.</p><p><strong>What are your plans for the next 5 years for LET?</strong></p><p>I want to see the community build and prosper. It makes me happy to see lots of activity and the return of plenty of the original old timers. Keeping (and growing) the momentum is a top goal for me.</p><p><strong>Who do you think the best provider on LET?</strong></p><p>I’ll let the community speak for that question. LowEndBox highlighted the results of the <a href=\"https://lowendbox.com/blog/2019-best-vps-provider-as-voted-by-the-low-end-talk-community/\">Best Providers on LowEndTalk for 2019 recently</a>. I know that LowEndTalk administrator <a href=\"https://www.lowendtalk.com/profile/FAT32\">@FAT32</a> is already working on the <a href=\"https://www.lowendtalk.com/discussion/165133/provider-poll-hy1-2020/p1\">2020 version of the Best Providers Poll</a>, too.</p><p><strong>How would you compare LET to Hostballs and LowEndspirit?</strong></p><p>There is room for plenty of different communities in our industry, so beyond that I don’t have many thoughts to share. I am focused on making LowEndBox and LowEndTalk the leading deal website and community message board in the hosting industry, and I value every user that spends time on our websites.</p><h1>ColoCrossing Questions</h1><p><strong>You regularly mention that you still do vaguely-defined “consulting work” for ColoCrossing. What is the precise nature of this work?</strong></p><p>I help where I’m needed. After spending my entire adult life in the IT industry, I can rack a server as well as the next person, along with having a pretty in-depth understanding of the business, all of its particulars and the underlying datacenter and infrastructure. I live full time in Florida now, so I’m not at the office more than a few times a year, but I’m always just a message away on Slack or Email. I’ve really enjoyed being able to maintain a relationship with the employees at ColoCrossing and our customers and I’m thankful that Deluxe has given me the opportunity to stay involved in this capacity.</p><p><strong>You were an admin before acquiring LET/LEB -&gt; why didn’t you make any changes (for the good/worse) then?</strong></p><p>I did not oversee LowEndBox and LowEndTalk in the nearly two years after I sold ColoCrossing. Prior to June 2018, when I sold ColoCrossing, my focus was mostly elsewhere growing the company and supporting our customers and employees. We had a number of really busy growth years and it was non-stop 7 days a week for me to keep up with it. I just didn’t have the chance to give LowEndBox or LowEndTalk the attention they needed pre-2018.</p><p><strong>How do you plan on remaining neutral with regard to offers (considering you still have a working relationship with CC)?</strong></p><p>Best way to answer this is to look at history since I purchased LowEndBox and LowEndTalk in January 2020. There has been no preferential treatment and all content creation opportunities have been open and available to all hosting providers. I’ve made sure that whenever a new initiative has been established that I post about it on LowEndTalk to make sure all interested hosting providers get the chance to take part.</p><p><strong>Are your decisions in running LET and LEB affected by CC?</strong></p><p>Not impacted one bit. Totally separate.</p><h1>Questions About You</h1><p><strong>Have you ever fired two guns while jumping through the air?</strong></p><p>Turns out I am not a ninja. So the answer, unfortunately, is no.</p><p><strong>What OS are you using at the moment?</strong></p><p>Windows 10 with two 2K monitors and an Intel NUC. Never been a Mac user. When I get on a Mac I’m lost, it’s not a great feeling.</p><p><strong>Any tip/advice for small businesses?</strong></p><p>There is no magic method to becoming successful in the hosting industry or any business venture. It all comes down to effort and dedication. For me I looked at every day as an opportunity to fix or improve one thing about my company. By doing so every single day, the incremental enhancements over a week, month and year become staggering. Value every client like they are your only customer and never take a little success for granted.</p><p><strong>Favorite books&nbsp;<em>or</em> books you’d recommend to those in the industry?</strong></p><p>Books not necessarily but I do advocate that people read industry publications and related blogs because they are an excellent source of information. Learning from those in your industry is critically important – never stop learning!</p><p><strong>How did you get into the server business? </strong><strong>How did you join ColoCrossing? Interesting stories?</strong></p><p>At 13 years old (2001) and a geek who enjoyed playing video games I started my first company, Velocity Servers, a hosting company focused on providing high performance game servers for Counter Strike and other Quake 3 engine games. A few years later (2006) I transitioned my focus into ColoCrossing, an internet service provider for small business. From there it was just building things client by client, server by server for years. Our footprint went from a couple small locations with a few racks per location in the early days to opening our first wholly owned flagship 300 cabinet datacenter in Buffalo, New York in 2015. From there things continued to grow as our product offerings became more sophisticated and our clientele continued to skew more enterprise. A big thanks to the incredibly talented team who I enjoy working with every single day and for without whom our combined success would not be possible.</p><p><strong>What do you do now?&nbsp; Do you have a job or you’re just a business man who owns LET?</strong></p><p>I run a company outside of the technology industry in Florida, plus I still support ColoCrossing as mentioned earlier and I run LowEndBox and LowEndTalk. I stay pretty busy and I prefer it that way.</p><p><strong>What are your favorite movie and TV series?</strong></p><p>I am a bit of a history buff so anything historical I enjoy. Favorite movies include Inception and Saving Private Ryan. I recently watched 1917 and thought that was well done with its unique cinematography.</p><p><strong>Do you personally play with/use LowEnd (or other) VPSes?</strong></p><p>I do have a VPS for proxy/vpn/security purposes. Especially useful when I am traveling on work to ensure that communications are secure. I’ve paid for it for over 5 years! And it’s actually from one of the hosts in our community.</p><p><strong>Do you have Lowendspirit account?</strong></p><p>I do not. I stay focused on my work at LowEndBox and LowEndTalk</p><p><strong>Anything else you think is interesting, or any life advice/tips?</strong></p><p>Treat others the same way you wish to be treated. Life passes by quickly, work hard and enjoy it the best you can, while you can.</p><p class=\"dpsp-share-text\"></p><div id=\"dpsp-content-bottom\" class=\"dpsp-content-wrapper dpsp-shape-rounded dpsp-column-auto dpsp-has-spacing dpsp-no-labels dpsp-show-on-mobile dpsp-button-style-1 dpsp-has-icon-background dpsp-has-button-background dpsp-show-total-share-count dpsp-show-total-share-count-after\"><ul class=\"dpsp-networks-btns-wrapper dpsp-networks-btns-content dpsp-has-button-icon-animation\"><li><a rel=\"nofollow\" href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flowendbox.com%2Fblog%2Finterview-qa-with-lowendbox-lowendtalk-owner-jon-biloh%2F&amp;t=Interview%3A%20Q%26A%20with%20LowEndBox%2FLowEndTalk%20Owner%20Jon%20Biloh\" class=\"dpsp-network-btn dpsp-facebook dpsp-no-label dpsp-first\" title=\"Share on Facebook\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://twitter.com/intent/tweet?text=Interview%3A%20Q%26A%20with%20LowEndBox%2FLowEndTalk%20Owner%20Jon%20Biloh&amp;url=https%3A%2F%2Flowendbox.com%2Fblog%2Finterview-qa-with-lowendbox-lowendtalk-owner-jon-biloh%2F&amp;via=LowEndNetwork\" class=\"dpsp-network-btn dpsp-twitter dpsp-no-label\" title=\"Share on Twitter\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://www.linkedin.com/shareArticle?url=https%3A%2F%2Flowendbox.com%2Fblog%2Finterview-qa-with-lowendbox-lowendtalk-owner-jon-biloh%2F&amp;title=Interview%3A%20Q%26A%20with%20LowEndBox%2FLowEndTalk%20Owner%20Jon%20Biloh&amp;mini=true\" class=\"dpsp-network-btn dpsp-linkedin dpsp-no-label dpsp-last\" title=\"Share on LinkedIn\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li></ul><div class=\"dpsp-total-share-wrapper\"><span class=\"dpsp-icon-total-share\"></span><span class=\"dpsp-total-share-count\">1</span><span>shares</span></div></div><div class=\"relpost-thumb-wrapper\"><div class=\"relpost-thumb-container\"><h3>Related posts:</h3><div style=\"clear: both\"></div><div style=\"clear: both\"></div><div class=\"relpost-block-container\"><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-dedipath-cto-ernie-quick-on-his-company-and-making-success-happen/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"DediPath\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/10/DediPath_Logo-150x150.jpg) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with DediPath CTO Ernie Quick on His Company and Making Success Happen</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-the-founder-of-jsdelivr-dmitriy-akulov/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Interview: Q&amp;A with the Founder of jsdelivr, Dmitriy Akulov\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/09/jsdelivr-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with the Founder of jsdelivr, Dmitriy Akulov</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-letbox-owner-mahmoud-elghanam-on-the-hosting-industry-and-his-experience/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Interview: QA with LetBox Owner Mahmoud Elghanam\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/06/letbox-logo-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with LetBox Owner Mahmoud Elghanam on the Hosting Industry</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-aalayer-founder-armand-on-the-web-design-industry-and-great-customer-service/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"AALayer Web Hosting Design\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/05/aa-layer-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with AALayer Founder Armand on the Web Design Industry and Great Customer Service</div></div></a></div><div style=\"clear: both\"></div></div></div><div id=\"author-bio-box\" style=\"background: #f8f8f8; border-top: 2px solid #cccccc; border-bottom: 2px solid #cccccc; color: #333333\"><h3><a style=\"color: #555555;\" href=\"https://lowendbox.com/blog/author/raindog308/\" title=\"All posts by raindog308\" rel=\"author\">raindog308</a></h3><div class=\"bio-gravatar\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI3MCIgaGVpZ2h0PSI3MCIgdmlld0JveD0iMCAwIDcwIDcwIj48cmVjdCB3aWR0aD0iMTAwJSIgaGVpZ2h0PSIxMDAlIiBmaWxsPSIjY2ZkNGRiIi8+PC9zdmc+\" alt=\"\" data-src=\"https://secure.gravatar.com/avatar/4ce3b8640a70e05bd73ac25b8a37821c?s=70&amp;d=retro&amp;r=pg\" data-srcset=\"https://secure.gravatar.com/avatar/4ce3b8640a70e05bd73ac25b8a37821c?s=140&amp;d=retro&amp;r=pg 2x\" class=\"avatar avatar-70 photo\" height=\"70\" width=\"70\" loading=\"lazy\"></div><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"https://www.lowendtalk.com/profile/raindog308\" class=\"bio-icon bio-icon-website\"></a><p class=\"bio-description\">I'm Andrew, techno polymath and long-time LowEndTalk community Moderator. My technical interests include all things Unix, perl, python, shell scripting, and relational database systems. I enjoy writing technical articles here on LowEndBox to help people get more out of their VPSes.</p></div></div><div class=\"feedback\"></div></div>"}