{"id": "22285", "post": "<div class=\"post-22285 post type-post status-publish format-standard hentry category-interview tag-cj-sculti tag-datawagon tag-interview tag-qa\" id=\"post-22285\"><h2 class=\"storytitle\"><a href=\"https://lowendbox.com/blog/interview-qa-with-datawagon-ceo-cj-on-the-dedicated-servers-hosting-and-growing-a-business/\" rel=\"bookmark\">Interview: Q&amp;A with Datawagon CEO CJ Sculti on Being a Young Entrepreneur, Learning on the Job and Becoming Successful</a></h2><div class=\"meta\"><img data-lazyloaded=\"1\" src=\"data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=\" data-src=\"/media/icons/tag_green.png\" alt=\"Tags: \"> <a href=\"https://lowendbox.com/tag/cj-sculti/\" rel=\"tag\">cj sculti</a>, <a href=\"https://lowendbox.com/tag/datawagon/\" rel=\"tag\">datawagon</a>, <a href=\"https://lowendbox.com/tag/interview/\" rel=\"tag\">interview</a>, <a href=\"https://lowendbox.com/tag/qa/\" rel=\"tag\">q&amp;a</a> <img data-lazyloaded=\"1\" src=\"data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=\" data-src=\"https://lowendbox.com/media/icons/calendar.png\" alt=\"Date/Time: \"> July 16, 2020 @ 9:00 am, by Jon Biloh</div><div class=\"storycontent tablelook\"><p><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSIyMDAiIGhlaWdodD0iMjAwIiB2aWV3Qm94PSIwIDAgMjAwIDIwMCI+PHJlY3Qgd2lkdGg9IjEwMCUiIGhlaWdodD0iMTAwJSIgZmlsbD0iI2NmZDRkYiIvPjwvc3ZnPg==\" loading=\"lazy\" class=\"screenshot alignnone\" data-src=\"https://lowendbox.com/wp-content/uploads/2020/07/CJ-sculti-interview.jpg.webp\" alt=\"CJ Sculti, CEO DataWagon\" width=\"200\" height=\"200\"></p><p><span style=\"font-weight: 400;\">And just like that we’ve already published five (and this article makes six) interviews as part of our Low End Box Q&amp;A series with web hosting industry professionals. Today, as we continue the series, we sit down with CJ Sculti, CEO of DataWagon. So let’s get started with the interview!</span></p><p><strong>What can you tell us about yourself, how you got to where you are today, and your role at your company?</strong></p><p>From a young age computers and the internet were always passions of mine. I bought a .99 cent shared web hosting plan in my early teenage years, and decided that I wanted to learn anything and everything that I could about hosting. I eventually upgraded to a VPS, then to a dedicated server, and then decided that I wanted to get into the hosting business myself. In 2014, when I was sixteen years old, I registered DataWagon LLC and started my company. I started off with a single dedicated server providing VPS and shared hosting. Today, DataWagon owns and operates hundreds of servers across multiple datacenters in the United States. I’ve dedicated the last six years of my life to making this happen, and I’m eager to continue leading DataWagon into the future!</p><p><span id=\"more-22285\"></span></p><p><strong>What advice would you give to business owners today, or those aspiring to become one?</strong></p><p>The first piece of advice that I’d give to any aspiring entrepreneur is to always believe in yourself and your idea. I know it sounds cliche, but in my opinion, it really is one of the most important things to running a successful business. When DataWagon was still in its early years, I <em>never</em> expected it to get as big as it was today.&nbsp; When I first started, I can recall looking at bigger hosts that had their own infrastructure and thinking that DataWagon would never get to that size. One day I just decided “You know what, I can do this and I’m going to,” and that’s what I did. Today, DataWagon is one of those companies that I thought it never would be. It’s easy to doubt and discourage yourself, especially when you have big goals, but to achieve big goals, you have to believe that you can. The second piece of advice that goes hand in hand with this is to stay patient. Things aren’t going to happen overnight; some things are going to take way longer than you want them to. Don’t let it discourage you. Stick to your plan, trust the process, work hard, and you will achieve your goal.</p><p><strong>Would you recommend the hosting industry as a source of opportunity for entrepreneurs?</strong></p><p>If hosting is something that you’re passionate about, then yes, I would 100% recommend the hosting industry as a source of opportunity. If hosting isn’t something that’s in your background though, then be sure to do your research, and make sure you know your stuff before starting a hosting company. The hosting industry is unique in that the customer puts a tremendous amount of trust in their host. They trust you with the security of their personal data and reachability of their website or services. Don’t betray the client’s trust by selling them a service that you’re not an expert in configuring and managing. The hosting industry is also super competitive, so you have to do your research, find your niche, and make sure you stand out from the crowd. It’s certainly not the easiest industry to be in, but if you’re passionate about it, there’s nothing more rewarding.</p><p><strong>What is the most significant characteristic that makes your company unique in today’s evolving market landscape?</strong></p><p>One thing that sets DataWagon apart from the competition is our DDoS mitigation platform. We’ve developed the platform from scratch over the past two years, and are very happy with where it’s at currently. We have a ton of customers that have switched to us from other DDoS protected hosts and tell us that our platform is the only one they’ve tried that successfully protected their service from certain DDoS attacks. We’ve spent tons of time tuning the filter, and are able to add new rules via eBPF syntax on the fly to block attacks that we haven’t seen before. The mitigation devices run on the edge of our network and can process packets at line rate using Intel DPDK.</p><p><strong>What do you enjoy most about your role? What do you find most difficult?</strong></p><p>What I enjoy most about my role at DataWagon is interacting with our current and future clients. I love making deals and providing people with a service that they need at a price that they’re going to be happy with. I’m sure any business owner will tell you the same, but to me, there is nothing more gratifying than having a customer utilize and rely on your service, and be happy with it. The most difficult thing that I have to do is deny orders when we’re out of stock. There’s nothing more frustrating than having to tell someone ‘we can’t help you out’ when they come to you requesting something that we can’t provide at the time.</p><p><strong>Both personally and professionally, what guiding principles ground you?</strong></p><p>In both my personal and professional life, honesty and integrity are two principles that guide me. In the hosting industry, there is certainly a lot of room for dishonesty, and it happens more often than we’d like. If I don’t feel that what I’m doing is fair and honest, then I’m not going to do it. DataWagon is never going to be the company that marks up a service 1000% simply because the client doesn’t know that they could get the same thing elsewhere for 10x cheaper. I always try to keep our pricing fair, for us, and our clients.</p><p><strong>Tell me about some of the new and exciting things you are working on at your company?</strong></p><p>We’ve recently overhauled our customer experience with the release of our new DataWagon Cloud panel. The public beta just recently released, and we’re looking to roll out the full version as soon as we can. We’ve completely replaced the WHMCS billing system with our new panel that’s been designed from the ground up. Clients can now manage their billing, dedicated servers, and VPS all from one panel. Clients can automatically reinstall their dedicated servers, access KVM over IPMI, manage which IPs are routed over our firewall, set rDNS records, view DDoS attack history, and do a ton more from the new panel. We also have a lot of new features on our roadmap for this upcoming year, including live dedicated server listings with instant setup, block storage for dedicated servers and VPS, and custom BPF firewall rules for clients.</p><p>Instant setup dedicated server offerings are something that we’re going to be rolling out in the near future. Automation is something that we’ve always been big on at DataWagon. It allows us to keep our costs down, and saves valuable time for our clients. At this point, we’ve basically automated the whole process of provisioning a dedicated server. Soon, clients will be able to buy a dedicated server and have it provisioned with their operating system of choice (Linux or Windows), and their requested size IP block, all in under 15 minutes from the time of payment.</p><p>Something else to look out for is our revamped VPS offerings that we’ll be releasing soon. Our new VPS packages will run on blazing fast AMD Ryzen 3950x powered nodes with RAID10 NVMe storage. We’ve spent months testing and optimizing our setup to provide our clients with the best possible performance in a virtualized environment. On top of the great hardware, clients will have access to our custom management panel that lets them view VPS stats, upload custom ISOs, and do tons more.</p><p><strong>Why should customers trust you and your business?</strong></p><p>Personally, I take privacy and security very seriously. Naturally, this translates into how I run my business. At DataWagon, we’re dedicated to preserving the privacy of our customers by all means necessary. Under no circumstances do we give out any client data unless we receive a verified subpoena from law enforcement requesting it. Additionally, we are huge advocates for free speech. The world is full of people who want to silence those that they don’t agree with, but at DataWagon, we’re dedicated to protecting your right to free speech. We are not, and don’t try to be the arbiter of the internet, like many ISPs do. Even if we don’t agree with something you host, as long as your content is legal and safe, we will have your back.</p><p><strong>Final thoughts and anything you would like to add?</strong></p><p>I’d like to thank @jbiloh for giving me the opportunity to participate in this interview series. I hope that I’ve given the community a bit more insight into who I am, and how we do things at DataWagon!</p><p>&nbsp;</p><p>If you’d like to learn more about DataWagon you may do so by visiting their <a href=\"https://datawagon.net\" target=\"_blank\" rel=\"noopener noreferrer\">website</a>.</p><p class=\"dpsp-share-text\"></p><div id=\"dpsp-content-bottom\" class=\"dpsp-content-wrapper dpsp-shape-rounded dpsp-column-auto dpsp-has-spacing dpsp-no-labels dpsp-show-on-mobile dpsp-button-style-1 dpsp-has-icon-background dpsp-has-button-background dpsp-show-total-share-count dpsp-show-total-share-count-after\"><ul class=\"dpsp-networks-btns-wrapper dpsp-networks-btns-content dpsp-has-button-icon-animation\"><li><a rel=\"nofollow\" href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flowendbox.com%2Fblog%2Finterview-qa-with-datawagon-ceo-cj-on-the-dedicated-servers-hosting-and-growing-a-business%2F&amp;t=Interview%3A%20Q%26A%20with%20Datawagon%20CEO%20CJ%20Sculti%20on%20Being%20a%20Young%20Entrepreneur%2C%20Learning%20on%20the%20Job%20and%20Becoming%20Successful\" class=\"dpsp-network-btn dpsp-facebook dpsp-no-label dpsp-first\" title=\"Share on Facebook\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://twitter.com/intent/tweet?text=Interview%3A%20Q%26A%20with%20Datawagon%20CEO%20CJ%20Sculti%20on%20Being%20a%20Young%20Entrepreneur%2C%20Learning%20on%20the%20Job%20and%20Becoming%20Successful&amp;url=https%3A%2F%2Flowendbox.com%2Fblog%2Finterview-qa-with-datawagon-ceo-cj-on-the-dedicated-servers-hosting-and-growing-a-business%2F&amp;via=LowEndNetwork\" class=\"dpsp-network-btn dpsp-twitter dpsp-no-label\" title=\"Share on Twitter\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://www.linkedin.com/shareArticle?url=https%3A%2F%2Flowendbox.com%2Fblog%2Finterview-qa-with-datawagon-ceo-cj-on-the-dedicated-servers-hosting-and-growing-a-business%2F&amp;title=Interview%3A%20Q%26A%20with%20Datawagon%20CEO%20CJ%20Sculti%20on%20Being%20a%20Young%20Entrepreneur%2C%20Learning%20on%20the%20Job%20and%20Becoming%20Successful&amp;mini=true\" class=\"dpsp-network-btn dpsp-linkedin dpsp-no-label dpsp-last\" title=\"Share on LinkedIn\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li></ul><div class=\"dpsp-total-share-wrapper\"><span class=\"dpsp-icon-total-share\"></span><span class=\"dpsp-total-share-count\">1</span><span>shares</span></div></div><div class=\"relpost-thumb-wrapper\"><div class=\"relpost-thumb-container\"><h3>Related posts:</h3><div style=\"clear: both\"></div><div style=\"clear: both\"></div><div class=\"relpost-block-container\"><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-dedipath-cto-ernie-quick-on-his-company-and-making-success-happen/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"DediPath\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/10/DediPath_Logo-150x150.jpg) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with DediPath CTO Ernie Quick on His Company and Making Success Happen</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-the-founder-of-jsdelivr-dmitriy-akulov/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Interview: Q&amp;A with the Founder of jsdelivr, Dmitriy Akulov\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/09/jsdelivr-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with the Founder of jsdelivr, Dmitriy Akulov</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-letbox-owner-mahmoud-elghanam-on-the-hosting-industry-and-his-experience/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Interview: QA with LetBox Owner Mahmoud Elghanam\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/06/letbox-logo-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with LetBox Owner Mahmoud Elghanam on the Hosting Industry</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/interview-qa-with-aalayer-founder-armand-on-the-web-design-industry-and-great-customer-service/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"AALayer Web Hosting Design\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/05/aa-layer-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Interview: Q&amp;A with AALayer Founder Armand on the Web Design Industry and Great Customer Service</div></div></a></div><div style=\"clear: both\"></div></div></div><div id=\"author-bio-box\" style=\"background: #f8f8f8; border-top: 2px solid #cccccc; border-bottom: 2px solid #cccccc; color: #333333\"><h3><a style=\"color: #555555;\" href=\"https://lowendbox.com/blog/author/jbiloh/\" title=\"All posts by Jon Biloh\" rel=\"author\">Jon Biloh</a></h3><div class=\"bio-gravatar\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI3MCIgaGVpZ2h0PSI3MCIgdmlld0JveD0iMCAwIDcwIDcwIj48cmVjdCB3aWR0aD0iMTAwJSIgaGVpZ2h0PSIxMDAlIiBmaWxsPSIjY2ZkNGRiIi8+PC9zdmc+\" alt=\"\" data-src=\"https://secure.gravatar.com/avatar/f766d6dc4b5f406b9f3cb0339d48de95?s=70&amp;d=retro&amp;r=pg\" data-srcset=\"https://secure.gravatar.com/avatar/f766d6dc4b5f406b9f3cb0339d48de95?s=140&amp;d=retro&amp;r=pg 2x\" class=\"avatar avatar-70 photo\" height=\"70\" width=\"70\" loading=\"lazy\"></div><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"https://www.lowendtalk.com/profile/jbiloh\" class=\"bio-icon bio-icon-website\"></a><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"http://Jbiloh\" class=\"bio-icon bio-icon-twitter\"></a><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"https://www.linkedin.com/in/jon-biloh-4b32598/\" class=\"bio-icon bio-icon-linkedin\"></a><p class=\"bio-description\">I'm Jon Biloh and I own LowEndBox and LowEndTalk. I've spent my nearly 20 year career in IT building companies and now I'm excited to focus on building and enhancing the community at LowEndBox and LowEndTalk.</p></div></div><div class=\"feedback\"></div></div>"}