{"id": "2471", "post": "<div class=\"post-2471 post type-post status-publish format-standard hentry category-editorial\" id=\"post-2471\"><h2 class=\"storytitle\"><a href=\"https://lowendbox.com/blog/like-a-phoenix-from-the-ashes/\" rel=\"bookmark\">Like a phoenix from the ashes…</a></h2><div class=\"meta\"><img data-lazyloaded=\"1\" src=\"https://lowendbox.com/media/icons/calendar.png\" data-src=\"https://lowendbox.com/media/icons/calendar.png\" alt=\"Date/Time: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> March 13, 2012 @ 1:53 pm, by Liam</div><div class=\"storycontent tablelook\"><p>We will rise again!</p><p>First off, I want to apologize because many of you were hoping for new LEB offers and instead received this post. This post is a call to action for our regular users and our ever returning guests.</p><p><span id=\"more-2471\"></span>In light of the recent events I have put a lot of thought into how the community handled it as well as the staff. Joel and Mark handled it like champs, I on the other hand didn’t react but took the time to reflect. The community handled it more different than I had hoped, but there was a lot of promise among the chaos. At first there was anger and outrage all over, which was understandable, but then their was a calmness where things began to settle down and displayed a glimpse of fellowship. Unfortunately to my dismay things started returning back to normal which, while familiar was not in the direction I had desired for. I was hoping that in such a negative event that we as a community would band together and become more united, stronger even as a result of what occurred. I was originally saving these thoughts for a thread on LET that would eventually find it’s way, with few replies, into the archives; but with the lack of updates on LEB I wanted to take this opportunity to show people that we are not dead, far from it. It’s just a case of horrible timing.</p><p>Prior to the events, Joel had already made plans on taking a much needed vacation, not from LEB/LET, but from his real life where he works hundreds of Australian hours a day (which converts to 14 hours US I think). Unfortunately, during the events he had very little time to move the websites over and one casualty of the lack of time was e-mail. As it stands I believe only Joel is getting e-mail thus in his absence we are not receiving the offers normally and thus why Mark has not been posting new content. Once he returns we will be going full steam ahead to ensure the sites cannot be disrupted like this in the future because we know how much these websites mean to some of you.</p><p>As for the call to action I spoke about, it’s more a request if anything. Let’s make an attempt as making LEB and LET a more&nbsp;positive&nbsp;place on the web. I’m not going to say that the negativity is what caused the recent events but I am fairly certain they didn’t help any. I’ve seen a lot of providers banding together and users helping out and being supportive, so I know it’s possible to turn things around. I am not trying to get these sites to be all sunshine and rainbows but I would like to see people making an effort to add meaningful content and leaving out personal attacks (of which I have been guilty of in the past). After all, we are all here with a common interest so making an attempt to get along with others will only benefit you and the community.</p><p>It’s been said many times, you cannot please everyone all the time so please bear with us if we do or say something you don’t like. Instead of turning your disagreement into an attack or rant, turn it into a discussion which we are all more than willing to listen to and participate in.&nbsp;I personally have a dozen ideas I will be proposing to Joel when he returns (one of which will be an “ideas” page where people can post ideas and the community votes on them similar to MyBB’s Ideas page: <a href=\"http://ideas.mybb.com/\">http://ideas.mybb.com/</a>)&nbsp;and I implore that you all do the same regardless how crazy, off the wall, or bad you think it might be. The 3 of us are here to provide a foundation to build upon but all of you are the pillars that keep it standing so please let us know what you’re thinking (in a mature way if possible).</p><p>I do expect some backlash for this post, mainly because I am treating LEB/LET as a community rather than a place for providers to advertise, which may seem strange coming from one of those providers but I feel that the collective knowledge and experience we have in this community rivals that of even the biggest forums out there. People come here for various reasons and hopefully we will be able to provide more reasons for people to keep coming back.&nbsp;We can achieve a lot if we work together as a community and we can show to the world that you can accomplish big things for under $7/month!</p><p>-KuJoe</p><p class=\"dpsp-share-text\"></p><div id=\"dpsp-content-bottom\" class=\"dpsp-content-wrapper dpsp-shape-rounded dpsp-column-auto dpsp-has-spacing dpsp-no-labels dpsp-show-on-mobile dpsp-button-style-1 dpsp-has-icon-background dpsp-has-button-background dpsp-show-total-share-count dpsp-show-total-share-count-after\"><ul class=\"dpsp-networks-btns-wrapper dpsp-networks-btns-content dpsp-has-button-icon-animation\"><li><a rel=\"nofollow\" href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flowendbox.com%2Fblog%2Flike-a-phoenix-from-the-ashes%2F&amp;t=Like%20a%20phoenix%20from%20the%20ashes...\" class=\"dpsp-network-btn dpsp-facebook dpsp-no-label dpsp-first\" title=\"Share on Facebook\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://twitter.com/intent/tweet?text=Like%20a%20phoenix%20from%20the%20ashes...&amp;url=https%3A%2F%2Flowendbox.com%2Fblog%2Flike-a-phoenix-from-the-ashes%2F&amp;via=LowEndNetwork\" class=\"dpsp-network-btn dpsp-twitter dpsp-no-label\" title=\"Share on Twitter\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://www.linkedin.com/shareArticle?url=https%3A%2F%2Flowendbox.com%2Fblog%2Flike-a-phoenix-from-the-ashes%2F&amp;title=Like%20a%20phoenix%20from%20the%20ashes...&amp;mini=true\" class=\"dpsp-network-btn dpsp-linkedin dpsp-no-label dpsp-last\" title=\"Share on LinkedIn\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li></ul><div class=\"dpsp-total-share-wrapper\"><span class=\"dpsp-icon-total-share\"></span><span class=\"dpsp-total-share-count\">0</span><span>shares</span></div></div><div id=\"author-bio-box\" style=\"background: #f8f8f8; border-top: 2px solid #cccccc; border-bottom: 2px solid #cccccc; color: #333333\"><h3><a style=\"color: #555555;\" href=\"https://lowendbox.com/blog/author/liam/\" title=\"All posts by Liam\" rel=\"author\">Liam</a></h3><div class=\"bio-gravatar\"><img data-lazyloaded=\"1\" src=\"https://secure.gravatar.com/avatar/2a78fb56721359b1d81ed05edb5a734f?s=70&amp;d=retro&amp;r=pg\" alt=\"\" data-src=\"https://secure.gravatar.com/avatar/2a78fb56721359b1d81ed05edb5a734f?s=70&amp;d=retro&amp;r=pg\" data-srcset=\"https://secure.gravatar.com/avatar/2a78fb56721359b1d81ed05edb5a734f?s=140&amp;d=retro&amp;r=pg 2x\" class=\"avatar avatar-70 photo litespeed-loaded\" height=\"70\" width=\"70\" loading=\"lazy\" srcset=\"https://secure.gravatar.com/avatar/2a78fb56721359b1d81ed05edb5a734f?s=140&amp;d=retro&amp;r=pg 2x\" data-was-processed=\"true\"></div><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"http://www.lowendbox.com\" class=\"bio-icon bio-icon-website\"></a><p class=\"bio-description\"></p></div></div><div class=\"feedback\"></div></div>"}