{"id": "27621", "post": "<div class=\"post-27621 post type-post status-publish format-standard hentry category-interview tag-cheap-hosting tag-dedicated-servers tag-managed-way tag-managedway tag-michigan\" id=\"post-27621\"><h2 class=\"storytitle\"><a href=\"https://lowendbox.com/blog/motoring-to-market-mastery-in-motown-interview-with-joe-green-of-managedway/\" rel=\"bookmark\">Motoring to Market Mastery in Motown: Interview with Joe Green of ManagedWay</a></h2><div class=\"meta\"><img data-lazyloaded=\"1\" src=\"/media/icons/tag_green.png\" data-src=\"/media/icons/tag_green.png\" width=\"16\" height=\"16\" alt=\"Tags: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> <a href=\"https://lowendbox.com/tag/cheap-hosting/\" rel=\"tag\">cheap hosting</a>, <a href=\"https://lowendbox.com/tag/dedicated-servers/\" rel=\"tag\">dedicated servers</a>, <a href=\"https://lowendbox.com/tag/managed-way/\" rel=\"tag\">managed way</a>, <a href=\"https://lowendbox.com/tag/managedway/\" rel=\"tag\">managedway</a>, <a href=\"https://lowendbox.com/tag/michigan/\" rel=\"tag\">michigan</a> <img data-lazyloaded=\"1\" src=\"https://lowendbox.com/media/icons/calendar.png\" data-src=\"https://lowendbox.com/media/icons/calendar.png\" width=\"16\" height=\"16\" alt=\"Date/Time: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> July 23, 2021 @ 12:00 am, by raindog308</div><div class=\"storycontent tablelook\"><p><em><img data-lazyloaded=\"1\" src=\"https://lowendbox.com/wp-content/uploads/2021/06/managed_way_logo_trans.png.webp\" loading=\"lazy\" class=\"alignright wp-image-27622 size-full litespeed-loaded\" data-src=\"https://lowendbox.com/wp-content/uploads/2021/06/managed_way_logo_trans.png.webp\" alt=\"ManagedWay Logo\" width=\"300\" height=\"300\" align=\"right\" hspace=\"20\" data-srcset=\"https://lowendbox.com/wp-content/uploads/2021/06/managed_way_logo_trans.png.webp 300w, https://lowendbox.com/wp-content/uploads/2021/06/managed_way_logo_trans-150x150.png.webp 150w\" data-sizes=\"(max-width: 300px) 100vw, 300px\" sizes=\"(max-width: 300px) 100vw, 300px\" srcset=\"https://lowendbox.com/wp-content/uploads/2021/06/managed_way_logo_trans.png.webp 300w, https://lowendbox.com/wp-content/uploads/2021/06/managed_way_logo_trans-150x150.png.webp 150w\" data-was-processed=\"true\">Our <a href=\"https://lowendbox.com/category/interview/\" target=\"_blank\" rel=\"noopener\" aria-label=\"LowEndBox Interview Series\">interview series</a> has featured a lot of industry leaders and we continue today by talking with Joe Green, Director of Product Management for <a href=\"https://managedway.com\" target=\"_blank\" rel=\"noopener\" aria-label=\"MnagedWay\">ManagedWay</a>. In this interview, you’ll learn how the company has grown from a small gaming server hosting company to operating its own facilities in Michigan and what they’ve learned along the way.</em></p><p><strong>Tell me about your background and ManagedWay’s history?</strong></p><p>I started my journey in IT by working the support desk for a school district and helped service and guide both student and faculty use of technology. Given my education and professional background in Information Technology, I have since transitioned to be the Director of Product Management at ManagedWay. ManagedWay was founded under the premise of providing the best customer care, paired with reliable and consistent service. As time went on we continued to grow and in 2015 acquired another business and moved into our two now self-owned and operated facilities. Despite our growth, the same goals and values that the company was founded on still guide our service today.</p><p><strong>ManagedWay is based in MI, how and why did you get your start there? How is the MI market evolving as the state and city rebounds from its automotive and industrial roots?</strong></p><p>ManagedWay was started originally as a gaming server hosting company. Over time the needs and requests of our clients began to exceed the scope of gaming servers and ManagedWay expanded to be the Colocation, Hosting, and Dedicated Internet company that we know today.</p><p>While we are seeing growth from the evolving Michigan market, we service customers outside of Michigan as well. We have clients that operate in completely different states and even other countries. In other words, our scope is global and we see growth in a variety of different regions, not just Michigan.</p><p><strong>ManagedWay operates two facilities in MI, what advantages does running your own facilities offer?</strong></p><p>The main advantage of running our own facility is customization. Our ability to customize the data halls to meet various customers’ needs parallels the scalability we offer to grow with our customers as their footprint increases. We have the capability to house single servers for those who are just starting out in our shared colocation areas all the way up to private cages and suites for companies with large infrastructure needs.</p><p>Other advantages include but are not limited to a built inventory cage where spare equipment such as cables, drives, and RAM are all available at a moment’s notice. We have set up different colocation work areas. This allows our clients to perform work on their gear in a quiet, secure, and comfortable setting, or by our 24/7/365 Technical Support Services Team.</p><p><span id=\"more-27621\"></span></p><p><strong><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI0MDAiIGhlaWdodD0iNDAwIiB2aWV3Qm94PSIwIDAgNDAwIDQwMCI+PHJlY3Qgd2lkdGg9IjEwMCUiIGhlaWdodD0iMTAwJSIgZmlsbD0iI2NmZDRkYiIvPjwvc3ZnPg==\" loading=\"lazy\" class=\"alignleft size-full wp-image-27623\" data-src=\"https://lowendbox.com/wp-content/uploads/2021/06/Joe-Green-ManagedWay-Headshots-1x1-1.jpg.webp\" alt=\"ManagedWay Joe Green\" width=\"400\" height=\"400\" data-srcset=\"https://lowendbox.com/wp-content/uploads/2021/06/Joe-Green-ManagedWay-Headshots-1x1-1.jpg.webp 400w, https://lowendbox.com/wp-content/uploads/2021/06/Joe-Green-ManagedWay-Headshots-1x1-1-300x300.jpg.webp 300w, https://lowendbox.com/wp-content/uploads/2021/06/Joe-Green-ManagedWay-Headshots-1x1-1-150x150.jpg.webp 150w\" data-sizes=\"(max-width: 400px) 100vw, 400px\">Many “rust belt” governors are keen to help make their states tech leaders of the next decade. How do you find qualified personnel in Michigan? Has that gotten easier or harder in the past years?</strong></p><p>We have been blessed first and foremost to have a great team!! When we do find ourselves in need of adding to the team, our staff make quality recommendations and our fantastic recruiting team completes a thorough screening process. We have also used many recruiting platforms to assist in finding potential candidates. Once we have made our selection we ensure that the individuals understand exactly what it is they will be doing as a member of our team and that they grow as individuals while we grow as a company. We pride ourselves on being a team and making resources available to ensure our staff have all the tools and knowledge needed for success.</p><p><strong>How has the COVID-19 pandemic impacted ManagedWay?</strong></p><p>The pandemic introduced some complexities to the workflow at first. Our staff quickly adapted and worked as a team to ensure that our clients needs were being met while maintaining safe working conditions. ManagedWay focused on the opportunities the pandemic presented and made upgrades to our infrastructure while also investing in staff development during this time. We have also been busy working on some new products that we hope to release soon!</p><p><strong>Where do you think the future takes the hosting industry? How is ManagedWay evolving to stay relevant?</strong></p><p>I think the future of the hosting industry will see cloud services take a larger slice of the pie, so to speak. ManagedWay is continuing to evolve, like we have since the beginning, and we are actively working to develop new products and services that position us at the forefront of the evolving telecommunications sector.</p><p><strong>Tell me about a past event in business you wish you had a “do-over” on? What did you learn from it?</strong></p><p>Rather than a do-over, I strongly believe that the experiences I’ve had heavily influence my growth and success. Everything that I have worked on has been a learning opportunity whether the expected outcome occurred or not. Navigating both failures and successes has given me the scope to approach new problems from novel standpoints. I’m proud of each of these moments because I’ve come out stronger than I started.</p><p><strong>Tell me about your top two successes in business?</strong></p><p>I find the most successful operations are those that bring the entire team together. There was one instance where we had a particularly large install for a client, and our entire team was ready to rack and stack the servers being shipped in, turn up network ports, run cross-connects, connect PDUs, and keep communication consistent with the client throughout the entire process. We were able to get them turned up in a timely manner and they are still happily up and running.</p><p>Another success that I am proud of is establishing a virtual training platform for our entire Technical Support Specialist team. Our team had a desire to expand their knowledge on some IT related topics, and I found a platform that contained a plethora of videos and exams that they could work through to do exactly that. We registered for some accounts and the platform has been utilized heavily by the team. They are happy to have access to the repository of information and it has proven beneficial to provide such a service to the team.</p><p><strong>What do you enjoy most about your role? What do you find most difficult?</strong></p><p>The most enjoyable part about my role is working with a team to find resolutions to questions or situations as they present themselves. I love critical thinking and a large portion of my responsibilities at ManagedWay involve this skill set. This allows me to effectively approach the most difficult aspects of my role that include planning for growth, developing new products, and troubleshooting situations that arise with current platforms. I’ve found that proper planning is crucial to meet the requested needs, operations, scale, and budget while producing quality sustainable outcomes.</p><p><strong>Both personally and professionally, what guiding principles ground you?</strong></p><p>As famously stated by Doc Brown, “If you set your mind to it, you can accomplish anything.” If I am ever faced with a situation that is unique to me, remembering that statement helps me take a step back and realize that with some research and consulting of the team a resolution can always be reached.</p><p><strong>Give us some details on new and exciting things you are working on at ManagedWay?</strong></p><p>We are excitedly working daily on expanding our portfolio of cloud based services to better serve the needs of our clients… That’s all I can say for now ;)</p><p><strong>How does ManagedWay earn the trust of its customers?</strong></p><p>Our mantra is big enough to deliver, small enough to care. This is reflected in our continued emphasis on caring for the most critical part of our operation: our customers. Our customers know that our Technical Support Specialists are on site ready to answer questions and resolve issues 24/7/365, and we put this in action with our typical 1-5 minute response time for tickets. We always have our communication lines open to our clients, and we are more than happy to have a conversation with them if they have a question, would like to inquire about expanding their services, or would like assistance brainstorming a solution to their needs.</p><p><strong>Final thoughts and anything you would like to add?</strong></p><p>This is an exciting time for the hosting industry and the world of technology as a whole. I truly enjoy my job with ManagedWay and everything our team has been able to do is downright outstanding. I cannot wait to see our future plans for ManagedWay come to fruition. I am very proud of everything we have accomplished as a company, and I am very much looking forward to continuing our success moving forward.</p><hr><p><em>Thanks, Joe, for the insights!&nbsp; Be sure to check out <a href=\"https://managedway.com\" target=\"_blank\" rel=\"noopener\" aria-label=\"ManagedWay\">ManagedWay</a>&nbsp;and also the rest of&nbsp;<a href=\"https://lowendbox.com/category/interview/\" target=\"_blank\" rel=\"noopener\" aria-label=\"LowEndTalk interview series\">interview series</a>&nbsp;for more insights from industry and community leaders.</em></p><div class=\"relpost-thumb-wrapper\"><div class=\"relpost-thumb-container\"><h3>Related posts:</h3><div style=\"clear: both\"></div><div style=\"clear: both\"></div><div class=\"relpost-block-container\"><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/how-to-check-out-your-dedicated-servers-hard-drive/\"><div class=\"relpost-custom-block-single\" style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"How to Check Out Your Dedicated Server's Hard Drive\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2021/07/chia_crypto-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">How to Check Out Your Dedicated Server's Hard Drive</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/custom-built-for-success-interview-with-radic-davydov-ceo-of-reliablesite/\"><div class=\"relpost-custom-block-single\" style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"ReliableSite Logo\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2021/06/reliablesite-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Custom-Built for Success: Interview with Radic Davydov, CEO of ReliableSite</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/dedicated-server-hosting-find-cheap-dedicated-servers-on-lowendbox/\"><div class=\"relpost-custom-block-single\" style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Dedicated Server Hosting - Find cheap Dedicated Servers on LowEndBox\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2021/05/cheap-dedicated-server-hosting-small-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Dedicated Server Hosting - Find cheap Dedicated Servers on LowEndBox</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/pandemic-relaxation-offer-from-the-venus-host-linux-windows-wordpress-hosting-for-2-44-month/\"><div class=\"relpost-custom-block-single\" style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"The Venus Host Logo\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/12/venushost_300-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Pandemic Relaxation Offer from The Venus Host! (Linux/Windows/Wordpress Hosting for $2.44/month!)</div></div></a></div><div style=\"clear: both\"></div></div></div><div id=\"author-bio-box\" style=\"background: #f8f8f8; border-top: 2px solid #cccccc; border-bottom: 2px solid #cccccc; color: #333333\"><h3><a style=\"color: #555555;\" href=\"https://lowendbox.com/blog/author/raindog308/\" title=\"All posts by raindog308\" rel=\"author\">raindog308</a></h3><div class=\"bio-gravatar\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI3MCIgaGVpZ2h0PSI3MCIgdmlld0JveD0iMCAwIDcwIDcwIj48cmVjdCB3aWR0aD0iMTAwJSIgaGVpZ2h0PSIxMDAlIiBmaWxsPSIjY2ZkNGRiIi8+PC9zdmc+\" alt=\"\" data-src=\"https://secure.gravatar.com/avatar/4ce3b8640a70e05bd73ac25b8a37821c?s=70&amp;d=retro&amp;r=pg\" data-srcset=\"https://secure.gravatar.com/avatar/4ce3b8640a70e05bd73ac25b8a37821c?s=140&amp;d=retro&amp;r=pg 2x\" class=\"avatar avatar-70 photo\" height=\"70\" width=\"70\" loading=\"lazy\"></div><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"https://www.lowendtalk.com/profile/raindog308\" class=\"bio-icon bio-icon-website\"></a><p class=\"bio-description\">I'm Andrew, techno polymath and long-time LowEndTalk community Moderator. My technical interests include all things Unix, perl, python, shell scripting, and relational database systems. I enjoy writing technical articles here on LowEndBox to help people get more out of their VPSes.</p></div></div><div class=\"feedback\"></div></div>"}