{"id": "24116", "post": "<div class=\"post-24116 post type-post status-publish format-standard hentry category-tutorials\" id=\"post-24116\"><h2 class=\"storytitle\"><a href=\"https://lowendbox.com/blog/protecting-and-remapping-apps-with-nginx-reverse-proxying/\" rel=\"bookmark\">Protecting and Remapping Apps with NGINX Reverse Proxying</a></h2><div class=\"meta\"><img data-lazyloaded=\"1\" src=\"https://lowendbox.com/media/icons/calendar.png\" data-src=\"https://lowendbox.com/media/icons/calendar.png\" alt=\"Date/Time: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> February 6, 2021 @ 12:00 am, by raindog308</div><div class=\"storycontent tablelook\"><p>Web services traditionally run on ports 80 (for http) and 443 (for https). Many other services run on other ports. Often times you’ll install a web-based app and discover that it runs on its own port.&nbsp; In this tutorial, we’ll show you how to take an app running on a port like 4440 and have it appear on its own subdomain or URL on port 80/443.</p><h1>Why Proxy Apps</h1><p>This can cause a few different issues:</p><ol><li>The client devices you typically work from (e.g., your web browser) may be behind a firewall that does not allow connections to ports other than ports 80 and 443. For example, things may work great at home, but if you want to access that web app while you’re at work, you’re out of luck.</li><li>If you expose that port to the Internet and it’s well-known port generally associated with that app, anyone scanning your VPS will immediatley know you’re running that app. If there is a vulnerability found, your VPS will be targeted. This is not true for ports 80/443 because there are millions of apps people might be running (or no app at all, just static content).</li></ol><p>You could change the port. For example, I love RunDeck, which runs on port 4440. I could change it to run on port 443, but there are two problems…</p><p><span id=\"more-24116\"></span></p><ol><li>Because ports 80 and 443 are below the number 1024, they’re considered privileged ports, which means that the software would have to either run as root or be engineered to first grab the port and then drop switch users. Most software is not engineered this way, which means running it as root may be opening your VPS up to a lot of security issues.</li><li>What if I have two or more apps? They can’t both bind to 80 or 443.</li></ol><p>Finally, not all web apps are security- or multiuser-focused. I’ve sometimes written quick apps for my use and didn’t want to spend time to make a user login/authentication system. One easy way to wrap everything in login is to use http basic authentication, which is as simple as adding a webserver directive and creating a users file (and using https so passwords aren’t sent in the clear). But your webserver has to be in the picture – it can’t help you if it never sees the request because you’re directly connecting to port 3000 or whatever.</p><h1>The Solution: Reverse Proxies</h1><p>In this example, I’ll setup Rundeck on a VM and reverse proxy it. Rundeck runs on port 4440. What I want is:</p><p><strong>www.lowend.party:</strong> show the lowend.party web site<br>\n<strong>rundeck.lowend.party:</strong> show Rundeck</p><p>In DNS, the A record is server1.lowend.party and both www.lowend.party and rundeck.lowend.party are CNAMEs to this A record.</p><p>Here’s my nginx server setup. Note that this is not a complex nginx setup – you would normally configure log locations, SSL, perhaps PHP, etc.</p><pre>server {\n  listen 80;\n  server_name www.lowend.party;\n\n  location / {\n    root /web/www.lowend.party;\n    index index.html;\n  }\n}\n\nserver {\n  listen 80;\n  server_name rundeck.lowend.party;\n  location / {\n    proxy_pass http://localhost:4440;\n  }\n}</pre><p>The first directive should be pretty familiar to any nginx user. It defines the port to listen on (80, http), the server name to listen for (www.lowend.party), and then I setup the location directives. There’s only one in this case and it defines a web root and order of index.</p><p>The second directive is where we see the proxying magic. Once again, I define the port to listen on and the server name. But now for location, instead of defining a web root, I use the proxy_pass directive. This says “take all requests and direct them to this URL”. In this case, the URL is Rundeck running on port 4440 on localhost.</p><p>Note that Rundeck could be running a different host entirely – nginx just wants a URL.</p><p>I could also do something like this, if I wanted Rundeck to appear on www.lowend.party/rundeck:</p><pre>server {\n  listen 80;\n  server_name www.lowend.party;\n\n  location /rundeck {\n    proxy_pass http://localhost:4440;\n  }\n\n  location / {\n    root /web/www.lowend.party;\n    index index.html;\n  }\n}</pre><p>Note that sometimes you may need to adjust the proxied app’s configuration, particularly if it is publishing a URL as part of its output. But normally, the app thinks its running on localhost (it is) and is allowed to live in ignorant bliss.</p><div id=\"author-bio-box\" style=\"background: #f8f8f8; border-top: 2px solid #cccccc; border-bottom: 2px solid #cccccc; color: #333333\"><h3><a style=\"color: #555555;\" href=\"https://lowendbox.com/blog/author/raindog308/\" title=\"All posts by raindog308\" rel=\"author\">raindog308</a></h3><div class=\"bio-gravatar\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI3MCIgaGVpZ2h0PSI3MCIgdmlld0JveD0iMCAwIDcwIDcwIj48cmVjdCB3aWR0aD0iMTAwJSIgaGVpZ2h0PSIxMDAlIiBmaWxsPSIjY2ZkNGRiIi8+PC9zdmc+\" alt=\"\" data-src=\"https://secure.gravatar.com/avatar/4ce3b8640a70e05bd73ac25b8a37821c?s=70&amp;d=retro&amp;r=pg\" data-srcset=\"https://secure.gravatar.com/avatar/4ce3b8640a70e05bd73ac25b8a37821c?s=140&amp;d=retro&amp;r=pg 2x\" class=\"avatar avatar-70 photo\" height=\"70\" width=\"70\" loading=\"lazy\"></div><a target=\"_blank\" rel=\"nofollow noopener noreferrer\" href=\"https://www.lowendtalk.com/profile/raindog308\" class=\"bio-icon bio-icon-website\"></a><p class=\"bio-description\">I'm Andrew, techno polymath and long-time LowEndTalk community Moderator. My technical interests include all things Unix, perl, python, shell scripting, and relational database systems. I enjoy writing technical articles here on LowEndBox to help people get more out of their VPSes.</p></div></div><div class=\"feedback\"></div></div>"}