{"id": "7005", "post": "<div class=\"post-7005 post type-post status-publish format-standard hentry category-tutorials tag-tutorials-2\" id=\"post-7005\"><h2 class=\"storytitle\"><a href=\"https://lowendbox.com/blog/tutorial-the-lowendcluster-part-4/\" rel=\"bookmark\">Tutorial – The LowEndCluster – Part 4</a></h2><div class=\"meta\"><img data-lazyloaded=\"1\" src=\"data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=\" data-src=\"/media/icons/tag_green.png\" alt=\"Tags: \"> <a href=\"https://lowendbox.com/tag/tutorials-2/\" rel=\"tag\">tutorials</a> <img data-lazyloaded=\"1\" src=\"data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=\" data-src=\"https://lowendbox.com/media/icons/calendar.png\" alt=\"Date/Time: \"> May 26, 2015 @ 1:00 am, by Maarten Kossen</div><div class=\"storycontent tablelook\"><p><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSIyNzEiIGhlaWdodD0iNzAiIHZpZXdCb3g9IjAgMCAyNzEgNzAiPjxyZWN0IHdpZHRoPSIxMDAlIiBoZWlnaHQ9IjEwMCUiIGZpbGw9IiNjZmQ0ZGIiLz48L3N2Zz4=\" loading=\"lazy\" class=\"alignnone size-full wp-image-3957 aligncenter\" data-src=\"https://lowendbox.com/wp-content/uploads/2013/05/lowendtutorial.png.webp\" alt=\"lowendtutorial\" width=\"271\" height=\"70\"></p><p>It’s time for the fourth and final part in the LowEndCluster series, a series of tutorials aimed at effectively using LowEndSpirit or very budget/low-resource boxes to create a redundant cluster hosting a WordPress website for less than $50/year!</p><p>As I said last time, we’re focusing on redundancy, not automated fail-over or scaling; that’s for future tutorials. I’m using the easiest approach possible on all aspects of this, which gives us plenty of room to improve in the future as well as keeping it easy to understand right now. While I’m writing this as part of a LowEndCluster series, each tutorial in itself has value as well and many of them can be applied to other situations as well. For example, the MariaDB master-slave tutorial and the filesystem one today can be used perfectly fine to keep a spare copy of, say, an existing Observium machine. The only limit is your imagination ;-)</p><p>This week we’re going to install our filesystem, which will be SSHFS-based and we’ll be using rsync to move all the data to the second server. It’s really quite simple to be honest, but very effective! Let’s get cracking!</p><p><span id=\"more-7005\"></span></p><h2>The web node – Part 1</h2><p>First we’re going to create a user account and SSH keys on one of the web nodes. We’re then going to repeat the user creation and copy the SSH keys to the second web node.</p><p>Let’s create the user first called ‘cluster’. We’ll use this user to log into the filesystem server:</p><blockquote><p>sudo adduser cluster</p></blockquote><p>You’ll be asked for a password here. Please provide a strong one. You won’t need it further down the road. After you have provided a password, you’ll be answered a number of questions. Feel free to fill those out, but none of them is required.</p><p>Now you’ve got a new user, switch to that user:</p><blockquote><p>sudo su cluster</p></blockquote><p>And go to its home directory:</p><blockquote><p>cd</p></blockquote><p>From the home directory, run the following command to generate an SSH key pair:</p><blockquote><p>ssh-keygen</p></blockquote><p>You’ll again be asked some questions, more specifically a password. Leave this empty and ENTER through it. We don’t want a password as it’s going to give us issues while mounting the remote filesystem.</p><p>Finally, create a directory where we’re going to mount the remote filesystem:</p><blockquote><p>sudo mkdir /filesystem</p></blockquote><p>And ensure the user ‘cluster’ owns what directory:</p><blockquote><p>sudo chown cluster. /filesystem</p></blockquote><p>So, the situation we have right now is as follows:</p><ul><li>You have a ‘cluster’ user with a strong password</li><li>You have an SSH key pair for the cluster user without a password</li><li>You have a /filesystem directory own by the user ‘cluster’ that will function as a mount point in the future</li></ul><p>Repeat the user creation on the second web node, but do not create an SSH key pair there. You should copy the SSH files from your first web node to your second web node:</p><blockquote><p>scp -r .ssh/ node2.example.net:/home/cluster/.ssh</p></blockquote><p>The above command should be run as the user ‘cluster’ from the first web node. What this does, is copy the .ssh directory and its contents over to the second web node. Both web nodes now have the same SSH key pair, which will eventually give them access to the filesystem node.</p><p>Before we can take that step, though, we’ll head over to the filesystem node.</p><h2>The filesystem node – Part 1</h2><p>On the first filesystem node node, repeat the user creation step from above:</p><blockquote><p>sudo adduser cluster</p></blockquote><p>Again, pick a strong password. It doesn’t need to match that of the one on the web node. You do need to be able to fill it out later, though.</p><p>Once this has been done, you should create a folder on the filesystem node where you want to put your files:</p><blockquote><p>sudo mkdir /filesystem</p></blockquote><p>This will create a directory called ‘filesystem’ in the root of your server. Feel free to put it somewhere else, but I’m using this location to keep things simple.</p><p>Now, ensure the user ‘cluster’ owns what directory:</p><blockquote><p>sudo chown cluster. /filesystem</p></blockquote><p>And you should be good!</p><p>On the filesystem node, you now have the following situation:</p><ul><li>A user ‘cluster’ with a strong password</li><li>A directory (/filesystem) to host your files owned by the user (and user group) ‘cluster’</li></ul><p>You should now repeat the above steps on the second filesystem node before you continue.</p><p><em>A short note: initially, I anticipated the need for </em>three<em> filesystem nodes. This is no longer the case. Two will suffice (they don’t have to be KVM either), which means you will have a total of 8 servers: 2 load balancers, 2 web nodes, 2 database nodes, and 2 filesystem nodes. I will elaborate on this in the final notes.</em></p><h2>The web node – Part 2</h2><p>Back on the web node, you now can copy the public key of the ‘cluster’ user’s SSH key pair to the filesystem nodes. As the user ‘cluster’, from the home directory, run:</p><blockquote><p>ssh-copy-id filesystemnode.example.net</p></blockquote><p>Replace filesystemnode.example.net with the hostname of your first filesystem node. You will be asked for a password: use the password you’ve set for the user on the <em>filesystem node</em>! The public SSH key should then be copied. Give this a try by trying to access the filesystem node via SSH:</p><blockquote><p>ssh filesystemnode.example.net</p></blockquote><p>You should now be logged in without it asking for your password. If that is the case, repeat the first step for the second filesystem node:</p><blockquote><p>ssh-copy-id filesystemnode2.example.net</p></blockquote><p>And that should now also have your public SSH key on it.</p><p>So, short recap. Right now, you have:</p><ul><li>Two web nodes with a ‘cluster’ user sharing the same SSH key pair</li><li>Two filesystem nodes with a ‘cluster’ user that have the web nodes’ user’s SSH public key in the <em>authorized_keys</em> file</li><li>The ability to access either filesystem node from either web node using SSH without being prompted for a password</li></ul><p>With that in mind, we can now mount the remote filesystem on the web nodes.</p><p>In order to be able to mount the remote filesystem, you need SSHFS installed on your server. For this to work, you need either an OpenVZ box with FUSE enabled, or a KVM machine. Most providers enable FUSE for your on demand; some have it built into their panel. SolusVM does not give users an option to enable/disable FUSE, so if your provider uses SolusVM, please contact them.</p><p>Let’s install SSHFS. On both web nodes, run:</p><blockquote><p>sudo apt-get install sshfs</p></blockquote><p>With SSHFS installed, you can actually mount the remote filesystem right away. We’ll make it “stick” in a bit, as a mount from the CLI won’t survive a reboot, but it’s good to test it. From one of the web nodes, as the user ‘cluster’, run:</p><blockquote><p>sshfs filesystemnode.example.net:/filesystem /filesystem</p></blockquote><p>Replace filesystemnode.example.net with the hostname or IP address of your first filesystem node. We’re going to work with the first one from now on, but just when accessing it from the web nodes.</p><p>If this doesn’t give any errors (and it shouldn’t), head over to the /filesystem directory on the web node:</p><blockquote><p>cd /filesystem</p></blockquote><p>And try to create a file there:</p><blockquote><p>touch README.md</p></blockquote><p>With that file having been created, let’s go back to the filesystem node.</p><h2>The filesystem node – Part 2</h2><p>On the filesystem node, first check if the file you’ve just created from the web node is present:</p><blockquote><p>ls -al /filesystem</p></blockquote><p>In the output, you should see the file ‘README.md’ listed. Neat, right?</p><p>OK, so now we can use the remote filesystem from the web node, we have a situation which we can work from. Before we start moving WordPress to the remote filesystem, though, I’d like to set up redundancy. I want to make sure that if the first filesystem node is offline, I can easily switch over my web nodes to the second filesystem node and have the same files there.</p><p>I’m going to use rsync for that. This tool should already be installed, but if it isn’t, here’s how you install it:</p><blockquote><p>sudo apt-get install rsync</p></blockquote><p>And that’s all.</p><p>In order to be able to rsync from the first filesystem node to the second filesystem node, the ‘cluster’ user on the first filesystem node needs to be able to access the second filesystem node.</p><p>As the cluster user on the first filesystem node, from the home directory of the user, run:</p><blockquote><p>ssh-keygen</p></blockquote><p>Follow the same rule as before: no password.</p><p>Now, copy this over to the second filesystem node:</p><blockquote><p>ssh-copy-id filesystemnode2.example.net</p></blockquote><p>And you should be able to access that no problem, no passwords asked, via SSH.</p><p>Now, back to rsync. It’s actually extremely easy to get this working. From the first web node, run the following command:</p><blockquote><p>rsync -a /filesystem filesystemnode2.example.net:/filesystem</p></blockquote><p>What this does is recursively synchronize all files from the first filesystem node to the second filesystem node.</p><p>The ‘-a’ flag does a lot of cool things that you want to happen:</p><ul><li>Performs a recursive sync (all directories and files under /filesystem in this case)</li><li>Copies symlinks as actual symlinks</li><li>Preserves permissions</li><li>Preserves modification times</li><li>Preserves the owner and group</li><li>Preserves several other files</li></ul><p>So, this will actually be a copy of the situation as it is on the first filesystem node rather than a half-assed backup.</p><p>But running the command by hand isn’t going to help you any. You want to have this ran on a regular basis. To solve this issue, I want to add the command to cron. Depending on the site of the filesystem and the amount of file modifications you make, I’d say you could run this every 15 minutes for a site with few modifications. Worst-case scenario is you loose 15 minutes of changes to files (<em>not</em> the database). You can change this to fit your needs, but keep in mind that rsync need to have enough time to complete before running it again.</p><p>On the first filesystem node, as the user ‘cluster’, run:</p><blockquote><p>crontab -e</p></blockquote><p>This will open an editor, or ask you to pick one. If it asks you to pick one, either pick one or press enter. The default is ‘nano’, which should be easiest for most people.</p><p>In the file that opens, add the following line:</p><blockquote><p>*/15 * * * * rsync -a /filesystem filesystemnode2.example.net:/filesystem</p></blockquote><p>Now save the file. From this point on, rsync should back up the files from the first filesystem node to the second filesystem node every 15 mintes!</p><p>It’s time to head for the final step when it comes to the filesystem: permanently mounting the remote filesystem on the web nodes. Before we start with that, however, let’s do another recap. We now have:</p><ul><li>Two web nodes with access to both filesystem nodes over SSH without needing a password</li><li>SSHFS installed on both web nodes</li><li>Two filesystem nodes with the first one having access to the second one over SSH without the need for a password</li><li>A cron running an rsync command every 15 minutes to back up the files from the first filesystem node to the second filesystem node</li><li>A working situation for mounting the remote filesystem on the web nodes</li></ul><h2>The web node – Part 3</h2><p>In order to mount the remote filesystem permanently, you need to add an entry to /etc/fstab, which lists the filesystems that should be mounted. In order to be able to mount it, though, you need to be able to log in to the remote filesystem as the user ‘cluster’ from the user ‘root’, since root mounts the filesystems at boot. In order to do this, the private SSH key of the ‘cluster’ user needs to be copied to the .ssh directory of the ‘root’ user.</p><p>Make yourself root:</p><blockquote><p>sudo su root</p></blockquote><p>And head to your home directory:</p><blockquote><p>cd</p></blockquote><p>From there, run the following command:</p><blockquote><p>cp /home/cluster/.ssh/id_rsa .ssh/</p></blockquote><p>This copies the private key to the root user’s .ssh directory, giving it the ability to log in to the filesystem nodes as the user ‘cluster’.</p><p>Now, open up /etc/fstab in your favorite editor (I’m using vim):</p><blockquote><p>vim /etc/fstab</p></blockquote><p>And add the following line:</p><blockquote><p>cluster@filesystemnode.example.net:/filesystem&nbsp;&nbsp;&nbsp; /filesystem&nbsp;&nbsp;&nbsp;&nbsp; fuse.sshfs&nbsp; defaults,_netdev&nbsp; 0&nbsp; 0</p></blockquote><p>Save the file. In order to test this, first unmount your test mount (if you had any):</p><blockquote><p>fusermount -u /filesystem</p></blockquote><p>And then try the fstab file:</p><blockquote><p>mount -a</p></blockquote><p>If there are no errors, you should see the remote filesystem mounted under /filesystem with all your files there. Do this on <em>both</em> web nodes to enable quick switching in case of an issue.</p><p>Once this is done, it’s time for the grand finale step: moving your WordPress files to the remote filesystem!</p><h2>The “big” migration</h2><p>There’s one last ‘but’ to this: the web server runs as ‘www-data’ and needs to be able to access the files owned by cluster. Since all files have user+group access, all you need to do it add the ‘www-data’ user on both web nodes to the ‘cluster’ group:</p><blockquote><p>sudo usermod -a -G cluster www-data</p></blockquote><p>This modifies the user ‘www-data’ and adds it to the group ‘cluster’.</p><p>Now you can safely migrate your files to the remote filesystem. Since we stored the files in a user’s home directory, we’re going to copy them from there to the /filesystem directory:</p><blockquote><p>sudo cp -rp /home/username/public_html /filesystem</p></blockquote><p>This copies the files recursively from the old location to the new one, preserving ownership and timestamps. After having done that, make sure all files are owned by ‘cluster’ in order to prevent any issues. Since ‘www-data’ is in the group ‘cluster’ this should not be an issue:</p><blockquote><p>sudo chown -R cluster. /filesystem</p></blockquote><p>Finally, with all the files on the remote filesystem, you need to take one more step for this to work: switching the web server to a different document root. Open up the file /etc/nginx/sites-available/hostname.conf and look for this line:</p><blockquote><p>root /home/username/public_html;</p></blockquote><p>Change that to:</p><blockquote><p>root /filesystem;</p></blockquote><p>And restart NGINX:</p><blockquote><p>sudo service nginx restart</p></blockquote><p>That’s it! It was quite some work, but you now have your (manual-intervention-required) fully redundant LowEndCluster!</p><h2>Final notes</h2><p>As this is quite an elaborate series, I make make this one into a lengthy guide in the future and/or expand on it. What I’ve done so far it touched the bare essentials of the possibilities and as technology develops, those possibilities will only increase.</p><p>I do need to note, though, that for a high-traffic website this may not be the best solution. Especially not with servers spread across the planet.</p><p>To get back to the required servers, here’s the list of servers I’ve actually used:</p><ul><li>2x BudgetVZ 128MB – Load balancers with IPv4 and IPv6 – €4/year each – €8/year total</li><li>2x MegaVZ 512MB – Database servers with NAT IPv4 and IPv6 – €5.5o/year each – €11/year total</li><li>2x LowEndSpirit 128MB – Web nodes with NAT IPv4 and IPv6 – €3/year each – €6/year total</li><li>2x LowEndSpirit 128MB – Filesystem nodes with NAT IPv4 and IPv6 – €3/year each – €6/year total</li></ul><p>It differs from my initial list in that KVM machines are no longer required for the filesystem. OpenVZ with FUSE works fine. This means you can actually create this 8-server cluster for less than $35/year (€31)! That’s both LowEnd and fantastic!</p><p>I hope you’ve enjoyed reading this series and I look forward to getting back to it in the future. Thank you for reading!</p><p class=\"dpsp-share-text\"></p><div id=\"dpsp-content-bottom\" class=\"dpsp-content-wrapper dpsp-shape-rounded dpsp-column-auto dpsp-has-spacing dpsp-no-labels dpsp-show-on-mobile dpsp-button-style-1 dpsp-has-icon-background dpsp-has-button-background dpsp-show-total-share-count dpsp-show-total-share-count-after\"><ul class=\"dpsp-networks-btns-wrapper dpsp-networks-btns-content dpsp-has-button-icon-animation\"><li><a rel=\"nofollow\" href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flowendbox.com%2Fblog%2Ftutorial-the-lowendcluster-part-4%2F&amp;t=Tutorial%20%E2%80%93%20The%20LowEndCluster%20%E2%80%93%20Part%204\" class=\"dpsp-network-btn dpsp-facebook dpsp-no-label dpsp-first\" title=\"Share on Facebook\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://twitter.com/intent/tweet?text=Tutorial%20%E2%80%93%20The%20LowEndCluster%20%E2%80%93%20Part%204&amp;url=https%3A%2F%2Flowendbox.com%2Fblog%2Ftutorial-the-lowendcluster-part-4%2F&amp;via=LowEndNetwork\" class=\"dpsp-network-btn dpsp-twitter dpsp-no-label\" title=\"Share on Twitter\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://www.linkedin.com/shareArticle?url=https%3A%2F%2Flowendbox.com%2Fblog%2Ftutorial-the-lowendcluster-part-4%2F&amp;title=Tutorial%20%E2%80%93%20The%20LowEndCluster%20%E2%80%93%20Part%204&amp;mini=true\" class=\"dpsp-network-btn dpsp-linkedin dpsp-no-label dpsp-last\" title=\"Share on LinkedIn\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li></ul><div class=\"dpsp-total-share-wrapper\"><span class=\"dpsp-icon-total-share\"></span><span class=\"dpsp-total-share-count\">0</span><span>shares</span></div></div><div class=\"relpost-thumb-wrapper\"><div class=\"relpost-thumb-container\"><h3>Related posts:</h3><div style=\"clear: both\"></div><div style=\"clear: both\"></div><div class=\"relpost-block-container\"><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/centos-6-end-of-life-is-coming-upgrade-to-a-new-centos-7-vps-now/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"CentOS 6 End of Life is Coming! Upgrade to a new CentOS 7 VPS Now\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/04/centos-6-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">CentOS 6 End of Life is Coming! Upgrade to a new CentOS 7 VPS Now</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/best-web-hosting-control-panels-after-the-cpanel-price-hike/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Best Web Hosting Control Panels after the cPanel Price Hike\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/03/leb-banner-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Best Web Hosting Control Panels after the cPanel Price Hike</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/how-to-set-up-plex-media-server-on-your-vps/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"How to Set Up Plex Media Server on Your Cheap VPS\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/04/how-to-set-up-plex-media-server-on-vps-2-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">How to Set Up Plex Media Server on Your Cheap VPS</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/how-to-create-a-dns-server-on-debian-stretch/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"How To Create a DNS Server On Debian Stretch\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/04/leb-centered-small.jpg) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">How To Create a DNS Server On Debian Stretch</div></div></a></div><div style=\"clear: both\"></div></div></div><div id=\"author-bio-box\" style=\"background: #f8f8f8; border-top: 2px solid #cccccc; border-bottom: 2px solid #cccccc; color: #333333\"><h3><a style=\"color: #555555;\" href=\"https://lowendbox.com/blog/author/mpkossen/\" title=\"All posts by Maarten Kossen\" rel=\"author\">Maarten Kossen</a></h3><div class=\"bio-gravatar\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI3MCIgaGVpZ2h0PSI3MCIgdmlld0JveD0iMCAwIDcwIDcwIj48cmVjdCB3aWR0aD0iMTAwJSIgaGVpZ2h0PSIxMDAlIiBmaWxsPSIjY2ZkNGRiIi8+PC9zdmc+\" alt=\"\" data-src=\"https://secure.gravatar.com/avatar/67eeccea1ee5a1ce2f93adc061f69a5f?s=70&amp;d=retro&amp;r=pg\" data-srcset=\"https://secure.gravatar.com/avatar/67eeccea1ee5a1ce2f93adc061f69a5f?s=140&amp;d=retro&amp;r=pg 2x\" class=\"avatar avatar-70 photo\" height=\"70\" width=\"70\" loading=\"lazy\"></div><p class=\"bio-description\">Maarten Kossen was the administrator of LowEndBox from 2013 to 2015, and brought many ideas and improvements to the website during his leadership. Today he is member of our community and LowEndTalk.</p></div></div><div class=\"feedback\"></div></div>"}