{"id": "10191", "post": "<div class=\"post-10191 post type-post status-publish format-standard hentry category-tutorials tag-docker tag-wordpress\" id=\"post-10191\"><h2 class=\"storytitle\"><a href=\"https://lowendbox.com/blog/using-docker-on-ubuntu-16-x-for-wordpress-development/\" rel=\"bookmark\">Using Docker on Ubuntu 16.x for WordPress Development</a></h2><div class=\"meta\"><img data-lazyloaded=\"1\" src=\"data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=\" data-src=\"/media/icons/tag_green.png\" alt=\"Tags: \"> <a href=\"https://lowendbox.com/tag/docker/\" rel=\"tag\">docker</a>, <a href=\"https://lowendbox.com/tag/wordpress/\" rel=\"tag\">wordpress</a> <img data-lazyloaded=\"1\" src=\"data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=\" data-src=\"https://lowendbox.com/media/icons/calendar.png\" alt=\"Date/Time: \"> February 24, 2017 @ 12:00 am, by Matt Zelasko</div><div class=\"storycontent tablelook\"><p style=\"text-align: center\"><a href=\"https://lowendbox.com/wp-content/uploads/2013/05/lowendtutorial.png\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSIyNzEiIGhlaWdodD0iNzAiIHZpZXdCb3g9IjAgMCAyNzEgNzAiPjxyZWN0IHdpZHRoPSIxMDAlIiBoZWlnaHQ9IjEwMCUiIGZpbGw9IiNjZmQ0ZGIiLz48L3N2Zz4=\" loading=\"lazy\" class=\"alignnone size-full wp-image-3957\" data-src=\"https://lowendbox.com/wp-content/uploads/2013/05/lowendtutorial.png.webp\" alt=\"lowendtutorial\" width=\"271\" height=\"70\"></a></p><p>Today, I’m going to show you how you can set up Docker on your Ubuntu PC and start using it for WordPress development. Along the way, I’ll show you why you would want to do that. Then I’ll dive into the details and share step-by-step instructions.<span id=\"more-10191\"></span></p><p>So, why bother using Docker? After all, you could get by with a text editor and an FTP client.</p><p>That’s the approach I used when I first got into WordPress development. Back then, I would edit files on my own computer and upload them to the server. I’d do all my testing on the remote machine, on a separate WordPress installation.</p><p>While it worked, it was pretty uncomfortable. I soon got frustrated with the delays every time I wanted to test a small code change. So I was happy when I learned about WAMP.</p><p>Now I could run my LAMP stack on my Windows box, build the entire project, and then deploy it when it was done. Even then, there were some difficulties I had to work around.</p><p>For one thing, Windows and Linux have some subtle difficulties that tripped me up a few times. One obvious issue is the way they deal with file paths.</p><p>There are some features in PHP that address these differences, but it was still a pain. So my next step was to install Ubuntu on my PC. Now I could develop in a native Linux environment. In fact, I could set it up so it was virtually identical to my web server,</p><p>This was great for my own projects, but I ran into major difficulties the first time I worked for a client.</p><p><strong>Dependency Hell</strong></p><p>The client in question was running an old version of PHP on their server. In fact, they had old versions of everything – MySQL, Apache, Linux, the works.</p><p>Unfortunately, they couldn’t update their server software because that would break all their code. Suddenly I found myself in a situation where I couldn’t code on my Linux box and upload the code when I was done. All because the packages on my PC were up to date.</p><p>I’d just taken my first bold step into the nightmare that developers affectionately call “dependency hell”. It took me several days to come up with a workaround.</p><p><strong>Virtualization</strong></p><p>After some frenzied research, I realized I would have to use a combination of Virtualbox and Vagrant to recreate the conditions on the server. Virtualbox is a free tool from Oracle that allows you to run virtual machines on your computer.</p><p>This allowed me to run a separate instance of Linux alongside my native system. I could set it up just right, duplicating all the eccentricities of my client’s out of date server.</p><p>Vagrant is a great tool that simplifies the process of running multiple VM versions.</p><p>Even then, it wasn’t easy. The version of PHP on the client’s box was so long in the tooth that it wasn’t available in any of the repositories. Instead, I had to track down the old source code and compile it from scratch. And that meant tracking down outdated versions of every library used by PHP. All-in-all, I spent 5 days setting up the environment so I could reach square zero.</p><p>Nonetheless, once I finally got things set up, the rest of the job was smooth sailing. And from that point on, Vagrant and Virtualbox became my indispensable web dev buddies.</p><p>That is until Docker appeared on the scene.</p><p><strong>Why Docker?</strong></p><p>So, why should you use docker? After all, virtual machines offer all the advantages I mentioned above. Of course, one reason why you may feel tempted is because of the popularity.</p><p>After all, much as we may try to deny it, every profession is prone to following trends. We all want to do what the “cool kids” are doing, and web developers are not immune.</p><p>Docker has grown to be one of the most popular open source projects over the last few years, so it certainly has popularity going for it. But there are very real reasons for that popularity.</p><p>Let’s examine some of these:</p><p><strong>Less Overhead</strong></p><p>Running a virtual machine gives you ultimate control over your development environment. But that control comes at a cost – running a second OS inside your host OS requires plenty of resources. A virtual machine has all the requirements of a physical one. It demands processor time, memory, disk space, and so on.</p><p>A modern OS is quite a big beast, and Linux is no different. After all, it’s designed to run in many different conditions, and deal with every requirement a user could have.</p><p>Docker isn’t a virtual machine. It doesn’t create a “pretend computer” that attaches itself to your PC, leaching the resources and slowing your machine to a crawl. Instead, it uses clever tricks to execute your apps and dependencies through the existing Linux kernel – the one that started when you booted your Ubuntu machine.</p><p>So the performance is much better. Your machine is under less strain, and so applications run fast – that includes the code you are working on as well as your regular apps outside the container.</p><p>Working on a responsive machine is much nicer than struggling with an unresponsive PC. And it’s better for your productivity, too.</p><p><strong>Packaging</strong></p><p>Docker wraps your app into a single object which you can deploy as a complete entity. All your dependencies, settings, and configurations are neatly bundled into a single package that you can deploy to any platform capable of running Docker.</p><p>This immediately reduces the headaches of deployment, which can be considerable. Hours (or even days) can be wasted fine tuning your production and development environments to get your application running right.</p><p>In a worst case scenario, you may find a new application is completely incompatible with essential apps that are already running on the server. In that case, you have to spend days or even weeks tweaking your new app to run on the production machine.</p><p>Of course, this is more of an issue for developers working on custom apps – WordPress tends to lower the integration headaches by providing a relatively stable platform to develop on.</p><p>For instance, a relatively simple unambitious plugin or theme should work with most versions of WordPress, as the WordPress API is quite reliable. But then again, how many real-world projects are “relatively simple”?</p><p>In reality, you’ll come to love Docker for reducing the pain of deployment.</p><p><strong>Application-Oriented</strong></p><p>As I mentioned, there are plenty of existing solutions for virtualization. These well-known and battle-tested projects have been a mainstay of IT departments for years now. But they are mostly server-oriented. They’re designed for their primary users – server administrators who deal with multiple physical boxes.</p><p>That’s why these projects are geared towards provisioning. They automate the manual tasks a server admin would have to do by hand when they set up a new server environment.</p><p>As developers, we have different priorities. For us, the application is the most important component. The rest of the server architecture is something we would rather take for granted.</p><p>With more traditional server provisioning tools (such as Puppet) we would inherit a large mass of overhead that we don’t need or want. Docker does away with this added complexity by focusing our attention on the job at hand – developing our applications.</p><p><strong>Version Tracking</strong></p><p>Any developer with more than a couple of projects under their belt knows the value of version tracking. Before the age of version control systems, keeping track of different versions of source code files was a major pain.</p><p>Development is an evolutionary process. As we code new features and fix bugs, we constantly change the codebase we are working on. Change is good, but it’s also a source of all kinds of problems. Fixing one bug often adds two or three additional ones. And they aren’t always immediately apparent.</p><p>Tracking down which change caused a specific bug can be hard for a single developer. When a team is working on the project, the problem can be magnified by several orders of magnitude.</p><p>That’s why git is such an indispensable tool, for single developers and teams alike.</p><p>Version tracking is essential for individual source code files. And it’s essential for different versions of your themes and plugins, too. That’s why Docker’s built-in version tracking is a Good Thing.</p><p><strong>Public Registry</strong></p><p>I’m sure I don’t have to convince you how valuable open-source development is. As a WordPress developer, you gain a massive head start by building on the work of others. Every component in your stack is a complex piece of software that you don’t have to code yourself.</p><p>Docker’s registry makes it easier to share code with the community – and to benefit from the work other developers have made available!</p><p>What’s more, you aren’t just sharing code snippets or individual files – you can download complete micro-services and even complete WordPress installations. This gets you off to a running start the next time you begin a project.</p><p>This is just a small taste of the many benefits that docker brings to the table. While I could go on and spend the rest of this article listing the virtues of Docker, I think you get the point.</p><p>So, let’s look at how you can get started</p><p><strong>Installing Docker</strong></p><p>One of the virtues of using Ubuntu as a development platform is the ease of installing popular packages. And Docker is certainly a popular package!</p><p>As long as your machine is connected to the Internet, you can install Docker with a few apt-get commands in the terminal.</p><p>But, before you do that, it’s worth doing a little housekeeping.</p><p>First, let’s ensure your system meets the minimum requirements. Docker only works on 64 bit systems. And it requires Linux kernel version 3.10 or later. You can check the kernel version in a terminal by typing:</p><pre class=\"code\">uname -r\n</pre><p>The first few digits are the version number – as long as it’s 3.10 or greater, you’re good to go.</p><p>The next step is to update your PC’s list of repositories, so it can fetch the latest and most stable versions of the packages you will be installing. You can do this with a single terminal command:</p><pre class=\"code\">sudo apt-get update\n</pre><p>The screen will fill with a bunch of text as APT fetches up-to-date package lists from its repositories. It usually only takes a few seconds.</p><p>Next, you have to ensure that APT can install packages over https, using CA certificates. You can install these features with:</p><pre class=\"code\">sudo apt-get install apt-transport-https ca-certificates\n</pre><p>This could take a few minutes depending on how many packages APT has to install.</p><p>The next step is to install the GPG key. GPG stands for Gnu Privacy Guard – this is the system that APT will use to decrypt the Docker packages and ensure they are legitimate.</p><p>Type the following into the terminal:</p><pre class=\"code\">sudo apt-key adv --keyserver hkp://p80.pool.sks-keyservers.net:80 --recv-keys 58118E89F3A912897C070ADBF76221572C52609D\n</pre><p>The next step is to add the Docker repo to APT. You do this by editing or creating a file under /etc/apt/sources.list.d/docker.list</p><p>The file is a single line, which contains the address of the repo. You have to enter the correct address for the version of Ubuntu you are using – in our case, we’ll be using the repo for Ubuntu 16.04.</p><p>Type the following lines into your terminal:</p><pre class=\"code\">sudo -i\n\necho \"deb https://apt.dockerproject.org/repo ubuntu-xenial main\" &gt; /etc/apt/sources.list.d/docker.list\n\nexit\n</pre><p>Now you have to update APT’s repo list again, with:</p><pre class=\"code\">sudo apt-get update\n</pre><p>If you had previously installed an old version of docker, you’ll have to purge it with:</p><pre class=\"code\">sudo apt-get purge lxc-docker\n</pre><p>Now let’s check that APT is pulling from the correct repo with:</p><pre class=\"code\">apt-cache policy docker-engine\n</pre><p>You should see a list of packages for Ubuntu Xenial.</p><p>Now you can install Docker’s dependancies. Type:</p><pre class=\"code\">sudo apt-get install linux-image-extra-$(uname -r) linux-image-extra-virtual\n</pre><p>This will install the appropriate Linux image extras package for your kernel version.</p><p>Ubuntu 16.04 and above already have most of the other dependencies for Docker. If you’re using an older version of Ubuntu, you’ll have to install the other dependencies manually. You can find a list at:</p><pre class=\"code\">https://docs.docker.com/engine/installation/linux/ubuntulinux/\n</pre><p>Finally, we’re ready to install Docker! All you have to do is type:</p><pre class=\"code\">sudo apt-get install docker-engine\n</pre><p>Sit back and let APT do its magic. If APT runs into any problems (such as missing dependencies) it will give you a helpful description of what went wrong. If you have any missing dependencies in the list, you’ll have to install them one by one using sudo apt-get install.</p><p>You may have to reboot your machine after installing these dependencies, especially if they included a new Linux kernel.</p><p>As soon as APT finishes the installation, you can start the docker daemon:</p><p>sudo service docker start</p><p>Finally, test it with:</p><pre class=\"code\">sudo docker run hello-world\n</pre><p>This will run a test container and print a simple message to the terminal.</p><p>So, you have Docker installed. The next step is to install Docker Compose. Docker compose is a useful tool for running docker applications, and it simplifies your workflow. It also allows you to compose applications from multiple containers that communicate with each other. This is called a micro-service architecture – but that’s beyond the scope of today’s article.</p><p>Docker Compose isn’t in the regular Ubuntu repos, so you’ll have to install it from the GitHub repository. The exact installation instructions vary with each new release, so you should check them out at https://github.com/docker/compose/releases</p><p>Here are the steps I followed as I was writing this article:</p><pre class=\"code\">sudo -i\n\ncurl -L https://github.com/docker/compose/releases/download/1.8.1/docker-compose-`uname -s`-`uname -m` &gt; /usr/local/bin/docker-compose\n\nchmod +x /usr/local/bin/docker-compose\n\nexit\n</pre><p>Now, let’s set up a WordPress environment. Previously, I told you that one of the benefits of Docker is the way other users share their environments to speed up your development work.</p><p>There are plenty of WordPress containers you can choose – the one I picked for this article is from visible.vc. They’ve shared it on GitHub, so you can quickly clone the project to your computer:</p><pre class=\"code\">git clone https://github.com/visiblevc/wordpress-starter your-project-name\n\ncd your-project-name\n</pre><p>Now all you have to do is run the container in Docker:</p><pre class=\"code\">docker-compose up\n</pre><p>Docker Compose will download the docker image and start running it. It will take care of all the dependencies, from the MySQL database to the Akismet WordPress plugin.</p><p>And there you have it – your own fresh WordPress install, running on localhost:8080.</p><p>Using Your WordPress Container</p><p>Right now, we have a bare-bones WordPress installation. You probably intend to do more.</p><p>So the next step is to start sharing directories between your PC and the Docker package. This allows you to edit the files on your machine, and run them in the package.</p><p>You can control the directory sharing from the docker-compose.yml file. This is a simple YAML file that contains all the settings you need. YAML is a lightweight human readable data format, so you’ll have no difficulty getting to grips with it.</p><p>Open it up in your favorite editor, and turn your attention to the “volumes” section at the end. Right now it says:<br>\ndata: {}</p><p>We want to change that to share directories from the project. You should already have a directory containing a starter theme in the ./wp-content/themes/the-theme directory. You might want to rename that later, but for now, let’s use it as it is.</p><p>Replace the contents of the volumes section with:</p><pre class=\"code\">- ./data:/data\n- ./wp-content/themes/the-theme:/app/wp-content/themes/the-theme\n</pre><p>Inside the container, the directory appears as /app/wp-content/themes/the-theme. WordPress sees this as one of the installed themes, and you can use it in the normal way.</p><p>You can also setup the WordPress database to your likings by editing the contents of /data/database.sql before you run docker-compose up. You can also use the WP Migrate DB plugin, just like you would with any other working WordPress installation.</p><p>There are more instructions for this container at https://github.com/visiblevc/wordpress-starter.</p><p>Conclusion</p><p>So, you’ve learned why you should use Docker, and you’ve set up your first WordPress development container. You’ve taken your first steps towards a more streamlined and stable workflow! There is more to learn about Docker, but you know enough to get started on your first project. Happy coding!</p><p class=\"dpsp-share-text\"></p><div id=\"dpsp-content-bottom\" class=\"dpsp-content-wrapper dpsp-shape-rounded dpsp-column-auto dpsp-has-spacing dpsp-no-labels dpsp-show-on-mobile dpsp-button-style-1 dpsp-has-icon-background dpsp-has-button-background dpsp-show-total-share-count dpsp-show-total-share-count-after\"><ul class=\"dpsp-networks-btns-wrapper dpsp-networks-btns-content dpsp-has-button-icon-animation\"><li><a rel=\"nofollow\" href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flowendbox.com%2Fblog%2Fusing-docker-on-ubuntu-16-x-for-wordpress-development%2F&amp;t=Using%20Docker%20on%20Ubuntu%2016.x%20for%20WordPress%20Development\" class=\"dpsp-network-btn dpsp-facebook dpsp-no-label dpsp-first\" title=\"Share on Facebook\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://twitter.com/intent/tweet?text=Using%20Docker%20on%20Ubuntu%2016.x%20for%20WordPress%20Development&amp;url=https%3A%2F%2Flowendbox.com%2Fblog%2Fusing-docker-on-ubuntu-16-x-for-wordpress-development%2F&amp;via=LowEndNetwork\" class=\"dpsp-network-btn dpsp-twitter dpsp-no-label\" title=\"Share on Twitter\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://www.linkedin.com/shareArticle?url=https%3A%2F%2Flowendbox.com%2Fblog%2Fusing-docker-on-ubuntu-16-x-for-wordpress-development%2F&amp;title=Using%20Docker%20on%20Ubuntu%2016.x%20for%20WordPress%20Development&amp;mini=true\" class=\"dpsp-network-btn dpsp-linkedin dpsp-no-label dpsp-last\" title=\"Share on LinkedIn\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li></ul><div class=\"dpsp-total-share-wrapper\"><span class=\"dpsp-icon-total-share\"></span><span class=\"dpsp-total-share-count\">0</span><span>shares</span></div></div><div class=\"relpost-thumb-wrapper\"><div class=\"relpost-thumb-container\"><h3>Related posts:</h3><div style=\"clear: both\"></div><div style=\"clear: both\"></div><div class=\"relpost-block-container\"><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/shields-up-protecting-your-wordpress-site-with-wordfence/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Shields Up! Protecting Your WordPress Site with Wordfence\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2013/05/lowendtutorial-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Shields Up! Protecting Your WordPress Site with Wordfence</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/how-to-secure-your-wordpress-site/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"How to secure your WordPress Site\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/03/leb-banner-150x150.png) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">How to secure your WordPress Site</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/installing-docker-compose-on-ubuntu-20-04/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"Installing Docker Compose on Ubuntu 20.04\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/06/installing-docker-compose-on-ubuntu-20-04-150x150.jpg) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">Installing Docker Compose on Ubuntu 20.04</div></div></a><a class=\"relpost-block-single\" href=\"https://lowendbox.com/blog/desivps-kvm-vps-windows-vps-and-vps-resource-pools-plus-a-special-offer-for-leb-readers/\"><div style=\"width: 150px; height: 215px;\"><div class=\"relpost-block-single-image\" alt=\"DesiVPS - KVM VPS, Windows VPS and VPS Resource Pools - Plus a special offer for LEB Readers!\" style=\"background: transparent url(https://lowendbox.com/wp-content/uploads/2020/04/leb-centered-small.jpg) no-repeat scroll 0% 0%; width: 150px; height: 150px;\"></div><div class=\"relpost-block-single-text\" style=\"font-family: Arial;  font-size: 12px;  color: #333333;\">DesiVPS - KVM VPS, Windows VPS and VPS Resource Pools - Plus a special offer for LEB Readers!</div></div></a></div><div style=\"clear: both\"></div></div></div><div id=\"author-bio-box\" style=\"background: #f8f8f8; border-top: 2px solid #cccccc; border-bottom: 2px solid #cccccc; color: #333333\"><h3><a style=\"color: #555555;\" href=\"https://lowendbox.com/blog/author/mzelasko/\" title=\"All posts by Matt Zelasko\" rel=\"author\">Matt Zelasko</a></h3><div class=\"bio-gravatar\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI3MCIgaGVpZ2h0PSI3MCIgdmlld0JveD0iMCAwIDcwIDcwIj48cmVjdCB3aWR0aD0iMTAwJSIgaGVpZ2h0PSIxMDAlIiBmaWxsPSIjY2ZkNGRiIi8+PC9zdmc+\" alt=\"\" data-src=\"https://secure.gravatar.com/avatar/f95732fa24234bcd42da5868fe5bfeef?s=70&amp;d=retro&amp;r=pg\" data-srcset=\"https://secure.gravatar.com/avatar/f95732fa24234bcd42da5868fe5bfeef?s=140&amp;d=retro&amp;r=pg 2x\" class=\"avatar avatar-70 photo\" height=\"70\" width=\"70\" loading=\"lazy\"></div><p class=\"bio-description\"></p></div></div><div class=\"feedback\"></div></div>"}