{"id": "51", "post": "<div class=\"post-51 post type-post status-publish format-standard hentry category-editorial\" id=\"post-51\"><h2 class=\"storytitle\"><a href=\"https://lowendbox.com/blog/you-get-what-you-paid-for-sometimes/\" rel=\"bookmark\">You Get What You Paid For, Sometimes</a></h2><div class=\"meta\"><img data-lazyloaded=\"1\" src=\"https://lowendbox.com/media/icons/calendar.png\" data-src=\"https://lowendbox.com/media/icons/calendar.png\" alt=\"Date/Time: \" class=\"litespeed-loaded\" data-was-processed=\"true\"> July 8, 2008 @ 1:38 am, by LowEndAdmin</div><div class=\"storycontent tablelook\"><p>One aim for running this website is to find the <em>cheapest</em> root you can find on the Internet (legally, of course :) For me I just want to have my own little box that I can do whatever I want, and install whatever software I want on it. I do not have a big budget for the playground so I am setting an artificial limit of USD$7/month for virtual servers — a price point that you probably cannot get decent shared hosting packages.</p><p>However, one problem of being <em>cheap</em> is — you usually get what you paid for, i.e. <em>cheap service</em>. And I am not talking about unmanaged service where you are responsible to set up every piece of software and are responsible to keep the box up-to-date. I am talking about <b>cheap &amp; nasty</b> hosts. Some of them are probably under-age with no previous sysadmin experience. Some put artificial limit on your server to explicitly cripple them to completely unusable. Some never reply your support tickets, when your server went off-line every second day. Some even accuse you for running warez or malware in order to boot you off, when all you have is securely patched WordPress blog site. (Okay, I know mentioning WordPress and security is a bit of oxymoron but hopefully you’ve got my point…)</p><p><span id=\"more-51\"></span></p><p>If you want horror stories, hosting industry is never short of them, and it is especially true with low end products like the VPS listed here. Got an email from M.N. complaining about a VPS provider that I’ve listed here. I am publishing the email but I am masking off the name of the host, as I have no prove whether the claim is true.</p><blockquote><p>… But I’m having problems with one I found in you site. &lt;provider name removed&gt; My service started on the first week of june, and stop working 2 weeks later.</p><p>I would like you to put a post, alerting people to stay away from they.</p><p>You can’t get in contact with then in any way. I tried every single email, contact form and phone calls.</p><p>Since his domain was created at &lt;date removed, somewhere early 2008&gt;, I’m pretty sure that it’s site is a fraud.</p></blockquote><p>Yes it <b>sucks</b> to have your server offline but the provider is no where to be found. Looking at their history is a good way to check their credibility, and a domain that was registered recently <em>might</em> be a sign of a new business, which <em>might</em> be a sign of untrustworthy. I do not want to be the one who is judgemental here so I do not really want to post my discoveries — so make sure you do your own home work!</p><p>On another note, this blog seems to be popular amongst the Chinese/Taiwanese VPS users, and being able to read/write Chinese myself, reading their sites give me some insight on what providers I ought to avoid (thank you <a href=\"http://gopherwood.info/\">Wayne</a> and <a href=\"http://joyus.org/blog/\">Matt</a> for being the guinea pig :)</p><p>Currently I have two low-end VPS with <a href=\"/tag/virtual-dedicated.net/\">Virtual-Dedicated.net</a> and <a href=\"/tag/rapidxen.net/\">RapidXen</a>. Both of them are pretty much trouble free so far. Here are some tips on picking the right low-end provider:</p><ul><li>If you are not sure which one to go for, pick VPS providers with <a href=\"/tag/xen/\"><b>Xen</b></a> over OpenVZ alternatives. You’ll find less <em>surprises</em> with your VPS as it behaves more like a dedicated server. It is arguably more demanding to manage so you are less likely to get an incompetent provider as well.</li><li>If you are not game enough, stick to the big and trustworthy names. From the <a href=\"/virtual-server-comparison/\">comparison matrix</a>, I will probably go for either <a href=\"/tag/vpslink.com/\">VPSLink</a>, <a href=\"/tag/virtual-dedicated.net/\">Virtual-Dedicated.net</a> or <a href=\"/tag/vpsvillage.com/\">VPS Village</a>. VPSLink is backed by Spry.com, which has many many years of managed Virtuozzo experience in Seattle, WA. VPS Village is backed by GrokThis.net, which again has years of experience in Xen hosting in Philadelphia, PA. Virtual-Dedicated.net/Datarealm is too a veteran with over a decade of experience in hosting industry.</li><li>Do a search on <a href=\"http://www.webhostingtalk.com/\">WebHosting Talk</a>, and <b>never</b> be the guinea pig. If the service looks too good to be true, there are always going to be people trying them out for you. Wait for at least 2-3 months for follow up reports if you want to be sure.</li></ul><p>The reason why I picked RapidXen is because some kind of trust I guess. When I did my own research on that business, I found it was started by William Pitcock/nenolod, who is a recognisable FOSS and Debian contributor, i.e. someone who probably know more about server administration than you do.</p><p>Well. At the end of the day shopping for a cheap VPS is just like shopping for the cheap Chinese import on eBay — sometimes you just don’t know what you are going to get. Actually shopping for VPS is arguably <em>easier</em> because there are a lot of tools (Google, WHT, this blog, etc) you can use to do your own research before you commit a purchase. And make sure you do!</p><p class=\"dpsp-share-text\"></p><div id=\"dpsp-content-bottom\" class=\"dpsp-content-wrapper dpsp-shape-rounded dpsp-column-auto dpsp-has-spacing dpsp-no-labels dpsp-show-on-mobile dpsp-button-style-1 dpsp-has-icon-background dpsp-has-button-background dpsp-show-total-share-count dpsp-show-total-share-count-after\"><ul class=\"dpsp-networks-btns-wrapper dpsp-networks-btns-content dpsp-has-button-icon-animation\"><li><a rel=\"nofollow\" href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flowendbox.com%2Fblog%2Fyou-get-what-you-paid-for-sometimes%2F&amp;t=You%20Get%20What%20You%20Paid%20For%2C%20Sometimes\" class=\"dpsp-network-btn dpsp-facebook dpsp-no-label dpsp-first\" title=\"Share on Facebook\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://twitter.com/intent/tweet?text=You%20Get%20What%20You%20Paid%20For%2C%20Sometimes&amp;url=https%3A%2F%2Flowendbox.com%2Fblog%2Fyou-get-what-you-paid-for-sometimes%2F&amp;via=LowEndNetwork\" class=\"dpsp-network-btn dpsp-twitter dpsp-no-label\" title=\"Share on Twitter\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li><li><a rel=\"nofollow\" href=\"https://www.linkedin.com/shareArticle?url=https%3A%2F%2Flowendbox.com%2Fblog%2Fyou-get-what-you-paid-for-sometimes%2F&amp;title=You%20Get%20What%20You%20Paid%20For%2C%20Sometimes&amp;mini=true\" class=\"dpsp-network-btn dpsp-linkedin dpsp-no-label dpsp-last\" title=\"Share on LinkedIn\"><span class=\"dpsp-network-icon\"></span><span class=\"dpsp-network-label-wrapper\"></span></a></li></ul><div class=\"dpsp-total-share-wrapper\"><span class=\"dpsp-icon-total-share\"></span><span class=\"dpsp-total-share-count\">0</span><span>shares</span></div></div><div id=\"author-bio-box\" style=\"background: #f8f8f8; border-top: 2px solid #cccccc; border-bottom: 2px solid #cccccc; color: #333333\"><h3><a style=\"color: #555555;\" href=\"https://lowendbox.com/blog/author/admin/\" title=\"All posts by LowEndAdmin\" rel=\"author\">LowEndAdmin</a></h3><div class=\"bio-gravatar\"><img data-lazyloaded=\"1\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSI3MCIgaGVpZ2h0PSI3MCIgdmlld0JveD0iMCAwIDcwIDcwIj48cmVjdCB3aWR0aD0iMTAwJSIgaGVpZ2h0PSIxMDAlIiBmaWxsPSIjY2ZkNGRiIi8+PC9zdmc+\" alt=\"\" data-src=\"https://secure.gravatar.com/avatar/11a4d9191634a9374eeca7d0e8982ba2?s=70&amp;d=retro&amp;r=pg\" data-srcset=\"https://secure.gravatar.com/avatar/11a4d9191634a9374eeca7d0e8982ba2?s=140&amp;d=retro&amp;r=pg 2x\" class=\"avatar avatar-70 photo\" height=\"70\" width=\"70\" loading=\"lazy\"></div><p class=\"bio-description\">The original owner of LowEndBox known as \"LowEndAdmin\" or \"LEA\" for short founded LowEndBox in 2008 and created the concept of hosting applications on low resource \"Low End Boxes\". After creating the roots of the community that we know today, \"LEA\" stepped aside and allowed others to carry the torch forward.</p></div></div><div class=\"feedback\"></div></div>"}