{"id": 117826, "date": "2017-06-25 12:10:30", "user": "Ympker", "post": "Hello,\r\nAs mentioned in previous discussion I was/am looking to allocate my overage resources to the opportunity of FREE Web Hosting / Shared Hosting. These resources consist of:\r\n\r\na) Overage resources from (prepaid) reseller bundles I have\r\n\r\nb) Overage resources from (prepaid) VPS I have\r\n\r\nGoing with this I will make no commitments whatsoever. There is no SLA or any other guarantees for this service. I will try to give notice about any service shutdowns/termination atleast 7 days in advance but this is on best effort only and is not to be expected. \r\nPlease make sure you have your own backups at all times and I HIGHLY suggest not to host anything crucial on this service. Think of it as an opportunity to try new things or host a small project without having to spend a dime but don't take it too serious or you may find yourself at a loss. It goes without saying that especially the \"Reseller\" resources I am sharing with you could be shutdown at any time if the provider deadpools and I have no influence on that whatsoever (unlike the servers I have rented which are mostly hosted with solid providers).\r\n\r\n**Rules** :\r\n\r\n- You have to be a member on LET for atleast 6 months\r\n\r\n- DBAD = Dont be a dick :- )\r\n\r\n- Expect me to terminate your account at any time and without notice if I see a reason to.\r\n\r\n- DO NOT PUT YOUR GOLDEN EGGS IN HERE!\r\n\r\n- MAKE BACKUPS!\r\n\r\n- To prevent spam/abuse you will need to provide proof of your identity. This can be done by providing of any legal documents which are acknowledged for this purpose. Please DO NOT pm me your scanned documents but ask me for my email adress first! \r\n\r\n- Another proof of identity would be a PayPal donation via friends &amp; family if you choose to support this project. I thought about offering to refund ppl after they sent the money to only use it as proof of identity but it is too much a hassle and I would loose money there afaik.\r\n\r\n- Speaking of which: NO REFUNDS on donations (\"an act or instance of presenting something as a gift, grant, or contribution.\")\r\n\r\n- There is NO SLA, support or warranty provided at all!\r\n\r\n- To prevent any hassle: No adult content, no file hosting, no illegal stuff.\r\n\r\n- Emails / Email Hosting is disabled by default.\r\n\r\n\r\n**Hosting Packages** :\r\n\r\nThere is no hard limit on the disk space &amp; bw but a soft limit is put in place to prevent abuse. You can contact me for more resources at any time and I will upgrade them for free (if available).\r\n\r\n**1.) cPanel Hosting on Reseller**:\r\n\r\nStatus: Available!\r\n\r\n- Disk Space: 5000 MB (SSD)\r\n\r\n- BW: 20000 MB \r\n\r\n- 0 Email\r\n\r\n- 1 Addon domain\r\n\r\n- Unlimited everything else\r\n\r\n\r\n\r\n**2. VestaCP / ispConfig**\r\n\r\nStatus: Coming soon!\r\n\r\n\r\nThe IPv6 mini VPS project is currently on a hold due to IPv6 causing some issues I need to look into/resolve first :)\r\n\r\n\r\nKind regards,\r\n\r\nYmpker"}