{"id": 118979, "date": "2017-07-09 17:13:08", "user": "Ympker", "post": "Hello and welcome to Elbaf-Hosting.com salesthread! With this brand I am looking to provide you with highly performant yet affordable Shared Hosting offers. All Plans run on 100% SSD Disks with the server location being in France. All plans come with Free DDoS Protection &amp; fast uplinks to ensure a stable performance of your web presence.\r\n\r\n**Feature Rundown**:\r\n\r\n \r\n\r\n- **100% SSD**\r\n- **Free DDoS Protection**\r\n- **Industry Standard** **cPanel** + **CloudLinux** + **Softaculous**\r\n- **Up to** **1024 MB Memory usage**\r\n- **1 vCPU at 100%**\r\n- **FREE SSL Certificate for your website(s)**\r\n- **6 months money back guarantee** (LET exclusive; see below)\r\n- **3 months for free** (LET exclusive; see below)\r\n- **Same Day Ticket Response** (best effort; see below)\r\n\r\n***LET-Budget Plan***: [Order now!](https://clients.elbaf-hosting.com/index.php/order/config/index/letbudget/?group_id=1&amp;pricing_id=1)\r\n\r\n![enter image description here](https://i.gyazo.com/0bb4b3fd3d6a99c8647470c76d32512e.png)\r\n\r\n\"Unlimited Bandwidth\" in this case implies \"Bandwidth is not actively measured. You can use up as much traffic as your website could possibly need. The connection is obviously shared with other users.\r\n\r\n**FAQ**:\r\n\r\n**How can I get the Service 3 months for free?**\r\n\r\n*Use the coupon code \"letbudget\" to pay for a free month.* *Do not pay your invoices for 2 months. Services are set to suspend 2 months after the last invoice was due.* *If you like the service renew it. If not, let it expire.*\r\n*It is STRICTLY FORBIDDEN to abuse this system which was put in place to allow for a thorough testing experience and the idea of making you feel at ease shall you decide to cancel our service as you will have enough time to move your data.* *If abuse gets the better of this I will need to take action unfortunately.*\r\n\r\n**What is the \"6 months Money-Back guarantee?**\r\n\r\n*This is an LET exclusive offer. We offer a phenomenal 3 months Money-Back Guarantee with no questions asked. If you find yourself unsatisfied between the 4th and 6th month of our service you can also make use of our Money-Back Guarantee however you will need  to state a legit reason why you are leaving. In this case we will decide on a case-by-case base. Both Guarantees only cover invoices that were paid without the use of a coupon code (due to the nature of this already cheap service).*\r\n\r\n**What is this so called \"Same Day Ticket Response?**\r\n\r\n*We strive to answer all tickets that have been submitted by 16:00 UTC+1 (Berlin time) on the same day. This is no guarantee whatsoever.*\r\n\r\n**Can I get a custom deal?**\r\n\r\n*Haha sure :P Just PM me with your requirements and we will work something out :-)*\r\n\r\n**I am a cheap c#nt but still want hosting! Got anything for me?**\r\n\r\n*Yes of course. I love tending to you cheapos &lt;3 PM me for a custom deal!*\r\n\r\n**Do you offer Support?**\r\n\r\n*Our Service is \"unmanaged\". Support is limited to answering inquiries that are related to billing and/or uptime issues. We do provide a Knowledge Base with basic instructions. If there are any issues at hand though do not hesitate to contact us as we will always strive to point you into the right direction :-)*\r\n\r\n**What about Backups?**\r\n\r\n*We do not take other backups than those necessary for an event of system failure. You are allowed to take backups via cPanel Wizard however DO NOT STORE THEM on your disk space as it is only allocated for direct Website usage. You are free to take FTP/Offsite backups or download them without any problems! Please remember to continously backup your account as we will not be held responsible for any data that is lost during any event of service outage. In case you are in desperate need of a backup please contact us as we still will try to help you out (for a processing fee that is). Restoration of backups is entirely of your concern. If in any case we provide backup data it is your task to restore it accordingly.*\r\n\r\n**Can I order a dedicated IP Adress?**\r\n\r\n*Not at the moment.*\r\n\r\n**Do you offer...?**\r\n\r\n*Contact me via PM or via Support Ticket*\r\n\r\n**Is XYZ allowed?**\r\n\r\n*We do not allow file hosting/sharing platforms, adult content/porn, free hosting services and any other resource hungry projects on our plans. For 99% of website users 1 GB Memory usage and 1 vCPU should be more than enough though. If you are still unsure about this open a ticket for a bespoke solution.*\r\n\r\n**Are orders processed automatically?**\r\n\r\n*Some are and some are not. If you are a new client we might manually process your order which can take up to 24 hours. Normally though orders regarding Web Hosting are provisioned automatically within ~5-10 minutes.* \r\n"}