{"id": 81890, "date": "2016-04-24 00:10:31", "user": "DreamCaster", "post": "Hello,\r\n\r\nWe have been in the web hosting business **since 2009**, providing budget friendly cPanel &amp; Linux hosting solutions.\r\n\r\nhttp://www.rosenhost.com\r\nhttp://www.rosenhost.info\r\n\r\n**Why choose RosenHost?**\r\n\r\n* We are in business since 2009 and we do not have any intention to go away. You can see our offers on WHT and similar locations for a long time.\r\n* We work hard to keep our servers clean. We take our network very seriously. Abusers and spammers are never tolerated.\r\n* Absolutely no risks on buying from RosenHost. We provide **14 DAYS MONEY BACK GUARANTEE.** If you are not satisfied with the service, you simply get a refund by opening a ticket to our sales team.\r\n* We are a small business but we will do our best to help you. I know many people here are pretty experienced with VMs and web hosting environments. If you know what you are doing and just need a cheap cPanel hosting account, our services might be a good choice for you. \r\n\r\n-------------\r\nPlease check our LET Exclusive cPanel powered web hosting plans. Annual payments are encouraged to get advantage of better pricing.\r\n\r\n**LET SPECIAL PLAN**\r\n\r\n* Softaculous / awstats /webalizer / SMTP-POP3/\r\n* 2   GB  Space \r\n* 30 GB  Bandwidth\r\n* 10 FTP Accounts\r\n* 10 Email Accounts / Lists\r\n* 10 mySQL Databases\r\n* 50 Subdomains\r\n* 10  Parked Domains\r\n* 10  Addon Domains\r\n* Lets Encrypt included on cPanel (LU only)\r\n* Dedicated IPs available in Colorado.\r\n* Located in Colorado, USA or Luxembourg, EU.\r\n\r\n**$0.99/mo or $3.99/Year**\r\n\r\n[Order USA](https://secure.rosenhost.com/cart.php?a=add&amp;pid=29)  | [Order Europe](https://secure.rosenhost.com/cart.php?a=add&amp;pid=30)\r\n\r\nColorado Test IP      : 64.111.24.104\r\n\r\nLuxembourg Test IP : 107.189.3.147\r\n\r\n----------------\r\n\r\n*Please feel free to try our services. We provide a \"no questions asked\" money back guarantee for 14 days. \r\n*This plan is useful for bloggers, small businesses, low traffic web sites and applications. Feel free to direct any questions to\r\n\r\n`support@rosenhost.com`\r\n\r\n* Our uptime information is public and can be seen below;\r\n* http://uptime.statuscake.com/?TestID=QhTQFtLC7B\r\n* We do not provide live chat support. Average ticket response time is 3 hours.\r\n* This is our first offer here. Please let us know if anything is missing.\r\n\r\nRegards,\r\n\r\n"}