{"id": 84234, "date": "2016-05-25 18:59:23", "user": "ratherbak3d", "post": "![](http://i1.wp.com/virtual6.net/wp-content/uploads/2016/04/logo2.png?w=629)\r\n\r\nTransfer to us today and we will handle the migration from another cPanel provider for free.\r\n\r\nAdvanced and powerful, beautiful and simple. Leverage the power of our server grade hardware and one of the biggest networks in Europe. Our cPanel Webhosting includes space for your website files, PHP support, DNS, Email, MYSQL Databases and more in one simple package. Use Site Publisher to build a website using our easy to use website creator, or upload your existing files and scripts.\r\n\r\nSimply supply a domain name to use or purchase one through us upon order. After that you will receive your login details instantly. Switch your name servers to ours and enjoy reliable quality cPanel webhosting at Virtual6.\r\n\r\n**DDoS Protection – Included free of charge:**\r\n\r\nOur cPanel webhosting is protected by the OVH anti-DDoS infrastructure in order to protect your domain(s) 24/7 against any type of DDoS attack, regardless of duration or size. A DDoS attack aims to render a server, service or an infrastructure unavailable by sending a multitude of simultaneous requests from multiple points across the internet. The intensity of this “crossfire” renders the service unstable, or even worse, unavailable.\r\n\r\n&lt;strong&gt;Support:&lt;/strong&gt;\r\n\r\nAll of our cPanel webhosting accounts include quality UK based support available during working hours to assist you with all of the features of your webhosting account.\r\n\r\n&lt;strong&gt;V6WH01&lt;/strong&gt;&lt;br&gt;\r\n1 x Domain(s)/Website(s)&lt;br&gt;\r\n10GB HDD Storage Space&lt;br&gt;\r\nUnmetered Bandwidth&lt;br&gt;\r\nUnlimited Email, Databases, FTP etc&lt;br&gt;\r\ncPanel Control Panel&lt;br&gt;\r\nDatacenter: Roubaix, France&lt;br&gt;\r\nNormally £4.50 PCM, now £2.25 PCM with promo \"6PTPAB0UO9\"&lt;br&gt;\r\nhttp://virtual6.net/cpanel-webhosting/&lt;br&gt;\r\nhttps://virtual6.net/whmcs/cart.php?a=add&amp;pid=6\r\n"}