{"id": 98718, "date": "2016-12-04 00:02:47", "user": "WSCallum", "post": "In a digital age where websites, power, speed and satisfaction are the norm, WebSound have striven over the last three years to continually improve services for clients and users alike whilst maintaining affordability.\r\n\r\nWebSounds new range of UK SSD Web Hosting services are powerful and reliable, our new servers implement new technologies which everyone adores to use now days, including the latest high performance Intel E3 v5 processors, paired with DDR4 RAM and Samsung SSD Drives in RAID 10, website performance is out of this world... (Google PageSpeed probably won't cope, your website will load so fast!). We've coupled this powerful hardware with a mixture of software and optimisations to ensure that this high performance platform remains stable, with the latest CloudLinux software implemented to ensure your accounts, website and content are completely secure from noisy neighbours, as well as implementing Nginx as our Web Server, and the latest MariaDB 10 for our Database Server.\r\n\r\nWe've thrown in a few other goodies as well, LetsEncrypt is now available for free, unlimited SSL certificates, and Softaculous is available for the easiest installation possible of a variety of different software, our partnership with CloudFlare will also come in handy to ensure the never ending high performance of your website. \r\n\r\nWe're offering our Mini Web Hosting package, OR our RESELLER1 Reseller Hosting package for £1 ($1.27), for the first month, with a 20% discount after your first month, impressive!\r\n\r\n&lt;b&gt;&lt;u&gt;All packages come with this as standard:&lt;/u&gt;&lt;/b&gt;\r\n&lt;ul&gt;&lt;li&gt;14 day money back guarantee&lt;/li&gt;\r\n&lt;li&gt;99.9% uptime, guaranteed&lt;/li&gt;\r\n&lt;li&gt;DDoS Protection&lt;/li&gt;\r\n&lt;li&gt;Instant Activation&lt;/li&gt;\r\n&lt;li&gt;Daily Backups&lt;/li&gt;\r\n&lt;li&gt;Unmetered Domain Names, MySQL Databases, Email Accounts and FTP Accounts&lt;/li&gt;\r\n&lt;li&gt;Overselling enabled for reseller accounts&lt;/li&gt;\r\n&lt;li&gt;Latest cPanel Control Panel&lt;/li&gt;&lt;/ul&gt;\r\n\r\n&lt;b&gt;&lt;u&gt;Web Hosting Packages:&lt;/u&gt;&lt;/b&gt;\r\n&lt;br /&gt;&lt;b&gt;Mini:&lt;/b&gt; 5GB SSD Disk Space, 150GB Monthly Bandwidth\r\n&lt;br /&gt;£1 ($1.27) for the first month, £1.43 ($1.82) per month after that with promotional code &lt;b&gt;WEBUK1&lt;/b&gt; - &lt;a href=\"https://websound.co.uk/cart.php?a=add&amp;pid=156&amp;promocode=WEBUK1\" target=\"_blank\"&gt;ORDER LINK&lt;/a&gt;\r\n\r\n&lt;b&gt;Small:&lt;/b&gt; 15GB SSD Disk Space, 300GB Monthly Bandwidth\r\n&lt;br /&gt;£2.39 ($3.04) per month with promotional code &lt;b&gt;WEB20&lt;/b&gt; - &lt;a href=\"https://websound.co.uk/cart.php?a=add&amp;pid=157&amp;promocode=WEB20\" target=\"_blank\"&gt;ORDER \r\nLINK&lt;/a&gt;\r\n \r\n&lt;b&gt;Medium:&lt;/b&gt; 25GB SSD Disk Space, 450GB Monthly Bandwidth\r\n&lt;br /&gt;£3.99 ($5.08) per month with promotional code &lt;b&gt;WEB20&lt;/b&gt; - &lt;a href=\"https://websound.co.uk/cart.php?a=add&amp;pid=158&amp;promocode=WEB20\" target=\"_blank\"&gt;ORDER LINK&lt;/a&gt;\r\n\r\n&lt;center&gt;&lt;b&gt;&lt;a href=\"https://websound.co.uk/webhosting\" target=\"_blank\"&gt;View all of our Web Hosting packages here!&lt;/a&gt;&lt;/b&gt;&lt;br /&gt; \r\n&lt;b&gt;&lt;a href=\"https://websound.co.uk/resellerhosting\" target=\"_blank\"&gt;View all of our Reseller Hosting packages here!&lt;/a&gt;&lt;/b&gt;&lt;/center&gt;\r\n"}