{"id": 102426, "date": "2017-01-11 19:38:23", "user": "ratherbak3d", "post": "![](https://virtual6.net/wp-content/uploads/2016/10/cropped-Virtual6-Logo.png)&lt;br&gt;\r\n**Lightning fast, ultra reliable Webhosting by Virtual6.net.**\r\n\r\nWe’re a UK based company which offers both UK hosting and IT support services. Based in Rotherham, we own and maintain our own enterprise class server cluster from a private data facility in Sheffield, just 11 miles away from our HQ. This allows us to react quickly and efficiently in service outages whilst lowering our outgoings and in turn, the prices we can offer our customers.\r\n\r\nWe have over 10 years of experience in both the IT support and hosting industries respectively, so we know a thing or two about running and building IT infrastructure. This, along with our passion for technology allows us to offer meaningful support and pro-active server management ensuring a stable environment with high availability.\r\n\r\nAs a service provider, we understand the need to maintain a quality network that works as it should at all times for our customers. We also understand the need to respond quickly and efficiently during outages which disturb both yours and your customers experience. This is why we have spent time putting in place extensive monitoring along with contingency plans for worst case scenarios. We have human staff available within 5 minutes of a critical outage, both remotely at our support desk and on site at our datacenter.\r\n\r\n&lt;h3&gt;Unlimited websites, domains &amp; sub-domains, databases and email accounts.. Oh and Unmetered bandwidth too.&lt;/h3&gt;\r\n\r\n&lt;ul&gt;\r\n&lt;li&gt;40GB HDD RAID Protected storage&lt;/li&gt;\r\n&lt;li&gt;Unmetered bandwidth&lt;/li&gt;\r\n&lt;li&gt;Free SSL certificates (Letsencrypt)&lt;/li&gt;\r\n&lt;li&gt;Flagship UK, Sheffield datacenter&lt;/li&gt;\r\n&lt;li&gt;Nightly off-site backups&lt;/li&gt;\r\n&lt;li&gt;User friendly control panel – cPanel/WHM&lt;/li&gt;\r\n&lt;li&gt;Dedicated IPv4 addresses available&lt;/li&gt;\r\n&lt;li&gt;Free migration from your current provider by Virtual6 technicians&lt;/li&gt;\r\n&lt;li&gt;Use your existing domain name or register one with us on checkout&lt;/li&gt;\r\n&lt;li&gt;24×7 Server monitoring, business hours support via email&lt;/li&gt;\r\n&lt;li&gt;Softaculous one click script installer&lt;/li&gt;\r\n&lt;/ul&gt;\r\n\r\nRRP: £12.00 Year&lt;br&gt;\r\nLET: £10.00 Year with promotion code \"82PiheGp\"&lt;br&gt;\r\nhttps://virtual6.net/webhosting/\r\n\r\n\r\nFor more information please contact us via this thread, PM or our normal methods as explained on our website. Thank you for reading."}