{"id": 118693, "date": "2017-07-06 04:53:38", "user": "tranzmedia", "post": "**About tranzmedia.com**\r\n\r\nTranzmedia is a privately-owned company founded in year 2005 and located in India-Austria. Tranzmedia was born out of a creative passion for conceptualizing and transforming simple ideas into serious technology platforms. Over the years, Tranzmedia has rolled out more than 100 major web sites, dozens of web solutions and technology platforms for clients in India and abroad. At Tranzmedia, we consider every one of our customers to be a part of our family. Our goal is to provide outstanding services for the best possible price. We are providing expert hosting solutions to thousands of our customers all over the world. Our customers trust us because we provide updated hosting solutions with dedicated customer services.\r\n\r\nWe help Startups We are there to help not only well-set businesses/organizations but also Startups. We know how every little thing counts for setting up business. This is where we come into picture. We give you unbeatable service so that your business runs smoothly.\r\n\r\n    =====&gt;&gt;======\r\n    Current Promotion : Web Development + Hosting for $75.S\r\n    =====&gt;&gt;======\r\nShared Hosting - Budget URL : https://www.tranzmedia.com/web-hosting\r\n\r\n    Hard Disk SSD RAID-10 - 1GB\r\n    Bandwidth - 10GB\r\n    Domains - 5\r\n    MySQL Database - 10\r\n    FTP - 5\r\n    Email Accounts - 100\r\n    FREE SSL\r\n    cPanel/WHM \r\n    Softaculous\r\n    Multi PHP Selector\r\n    Price: $3.99/month\r\n\r\nOrder : https://support.tranzmedia.com/cart.php?a=add&amp;pid=14\r\n\r\n========================================================\r\n\r\nShared Hosting - Mega URL : https://www.tranzmedia.com/web-hosting\r\n\r\n    Hard Disk - 5GB\r\n    Bandwidth - 50GB\r\n    Domains - 10\r\n    MySQL Database - 50\r\n    FTP - 100\r\n    Email Accounts - 500\r\n    FREE SSL\r\n    cPanel/WHM \r\n    Softaculous\r\n    Multi PHP Selector\r\n    Price : $6/month\r\n\r\nOrder : https://support.tranzmedia.com/cart.php?a=add&amp;pid=1\r\n\r\n========================================================\r\n\r\nFeatures:\r\n\r\n    No over selling | All accounts are monitored to assure they have the correct amount of usage\r\n    Instantly Activated\r\n    Multiple PHP Versions; 5.5 5.6 7.0 7.1\r\n    No DOWNTIME!\r\n    DDoS Protected \r\n    FREE Softaculous\r\n    FREE Backups\r\n    FREE Firewall \r\n\r\nFAQ: Q: Do you offer Softaculous? A: Yes, it is available.\r\n\r\nQ: What is your average setup time? A: Instant Activation.\r\n\r\nQ: How long have you been in business? A: Since 2005\r\n\r\nQ: DC location? A: France\r\n\r\nQ: Do you allow proxy sites? A: We allow private proxy sites. We do not permit public proxy sites.\r\n\r\nQ: Can you assist transferring our existing data? A: Yes, in most cases we can transfer your existing data to your cPanel account from another provider for free.\r\n\r\n`https://tranzmedia.com/`"}