{"id": 145493, "date": "2018-05-30 05:59:34", "user": "ForwardWeb", "post": "**BIG Promo on Web Hosting:** 60% off for the life of your account [Use Discount Code: Save60](https://secure.forwardweb.net/cart.php?gid=14)\r\n\r\n\r\n**Why Should I Switch to Forward Web Hosting?**\r\n\r\nWhether you are happy with your current web host or not, here are a few reasons why you should switch to Forward Web Hosting. \r\n\r\n\r\n**1. We care about your website as a whole.** Most web hosting service providers will solely focus on the server your web files are being served from, and that is it. With Forward Web, we do not stop at just the server your website is hosted on. We also care about all other aspects related to your website (from design, to security). Anything related to your website, Forward Web will be happy to assist. \r\n\r\n\r\n**2. We understand that without a stable and fast web hosting platform**, you will not be able to effectively market or even operate your business. This means we work very hard to insure our network IP’s remain clean, our server hardware remain up-to date and that your content is served in the fastest most efficient manner possible. Your business can rest easy knowing Forward Web will always do its best to insure we are not just meeting, but exceeding industry standards. \r\n\r\n\r\n**3. Forward Web will save you money, without sacrificing quality.** Whether you have heard of Forward Web or not. Our hardware and network are either in the same or higher category (in terms of quality) as any other brand name you can find. In addition to meeting, exceeding hardware and network requirements, Forward Web provides superior customer service by focusing on every aspect related to your website (not just the server). In other-words, with Forward Web, you receive a Better service, at lower rate, the best of both worlds. \r\n\r\n\r\n**** Latest feature we have added,** Free SSL's for your websites (dedicated IP's and purchasing of SSL's no longer needed, generate your SSL directly from your cPanel). Learn more here about Free SSL's here: **[https://forwardweb.net/free-ssl-lets-encrypt/](https://forwardweb.net/free-ssl-lets-encrypt/)**\r\n\r\n-----------------------------------------------------------------------------------------------------------\r\n\r\n**Starter: (Free SSL with DDOS Protection on Shared IP Address)**\r\n\r\nJust getting your website started? This web hosting plan comes with a single cPanel web hosting account with the ability to host up-to 3 websites (via add-on domains) and or multiple sub domain names. Ideal for any owner of a standard website that only needs to host no more than 3 websites. cPanel is industry standard software which makes managing your websites a simple and easy.\r\n\r\n\r\n- 10GB RAID Protected **Pure SSD Web Storage**\r\n- UNLIMITED Bandwidth \r\n- Host up-to 3 Websites (Via-Add on Domains)\r\n- Complimentary Email Service @YourDomain.com\r\n- FREE SSL's via Lets Encrypt (for optimum security)\r\n- FREE Website Builder (Easy to use Drag and Drop site builder With over 260 modern themes to build your website with, no experience necessary). \r\n- FREE Website Migrations (some restrictions may apply)\r\n\r\n\r\n[$13.98 (billed yearly) Use Discount Code: Save60](https://secure.forwardweb.net/cart.php?a=add&amp;pid=45&amp;promocode=save60)\r\n\r\n*Discount is recurring for the life of the account.*\r\n\r\n**[Click Here to Order ](https://secure.forwardweb.net/cart.php?a=add&amp;pid=45&amp;promocode=save60)\r\n\r\n-------------------------------------------------------------\r\n\r\n- UNLIMITED Raid Protected **Pure SSD Web Storage**\r\n- UNLIMITED Bandwidth\r\n- **FREE DOMAIN NAME** or transfer (see TOS for terms)\r\n- Host UNLIMITED WEBSITES (via add-on domain feature)\r\n- Complimentary Email Service @YourDomain.com\r\n- FREE SSL's via Lets Encrypt (for optimum security)\r\n- FREE Website Builder (Easy to use Drag and Drop site builder With over 260 modern themes to build your website with, no experience necessary). \r\n- FREE Website Migrations (some restrictions may apply)\r\n\r\n\r\n[$31.98 (billed yearly) Use Discount Code: Save60](https://secure.forwardweb.net/cart.php?a=add&amp;pid=46&amp;promocode=save60)\r\n\r\n*Discount is recurring for the life of the account.*\r\n\r\n**[Click Here to Order ](https://secure.forwardweb.net/cart.php?a=add&amp;pid=46&amp;promocode=save60)\r\n\r\n\r\nOur servers are built using enterprise grade hardware (built for 24/7 use)[/B] with Dual Intel Xeon Processors, 48GB Memory Minimums and Raid-Protected Pure SSD Storage. We take your websites serious, therefore we take our server hardware and network serious. \r\n\r\nWhere are our servers located? Formally the Federal Reserve Bank of Dallas, our servers are located in the most secure data center in the central United States. Our data center is located in the heart of downtown Dallas, TX. It is in a Tier 3+ facility on the same protected power grid as Dallas 911 and the local hospitals. This means our DC is exempt from rolling blackouts that historically have been an occurrence due to the Texas summer heat. Power is sent to the data center from four different substations, requiring all four substations to go offline before power to the building is interrupted. Additionally, the data center is serviced by water feeds from the north and south of the building. If you want your website hosted with Speed, security and redundancy in mind (built for enterprise), yet priced for the small business. Then Forward Web is the company for you.\r\n\r\n** Paypal and Credit/Debit Card accepted **\r\n\r\n\r\n"}