{"id": 166798, "date": "2020-09-08 14:06:40", "user": "SmallWeb", "post": "&lt;center&gt;\r\nHey friends! [SmallWeb ](https://smallweb.net \"SmallWeb\") has gone through some changes recently. We’re now offering two separate DirectAdmin web hosting services; “Budget” and “Shared”. Our “Budget” range being our yearly offerings and the “Shared” range for those that need just a little bit more for their buck on a monthly basis.\r\n\r\nSpeaking of our Budget range, It’s gone through a refresh! We’ve launched new pricing and specifications based on a recent review. You can now save more with the new SmallWeb Budget range.\r\n\r\n![](https://pbs.twimg.com/media/EhRSNsHXcAA_W1P?format=png&amp;name=large \"\")\r\n\r\n\r\n**Here are the refreshed plans!**\r\n\r\n**Budget ¼GB**\r\n¼GB (256MB) NVMe Storage, 100GB Transfer, 1 Website(s)\r\nEmail Functionality Disabled\r\n**Only £1.99/year**\r\n[Order Now](https://smallweb.net/order/config/index/budget/?group_id=45&amp;pricing_id=1407 \"Order Now\")\r\n\r\n**Budget ½GB**\r\n½GB (512MB) NVMe Storage, 100GB Transfer, 2 Website(s)\r\n**Only £2.99/year**\r\n[Order Now](https://smallweb.net/order/config/index/budget/?group_id=45&amp;pricing_id=1408 \"Order Now\")\r\n\r\n**Budget 1GB**\r\n1GB NVMe Storage, 100GB Transfer, 5 Website(s)\r\n**Only £5.99/year**\r\n[Order Now](https://smallweb.net/order/config/index/budget/?group_id=45&amp;pricing_id=1409 \"Order Now\")\r\n\r\n**Budget 2GB**\r\n2GB NVMe Storage, 200GB Transfer, 10 Website(s)\r\n**Only £9.99/year**\r\n[Order Now](https://smallweb.net/order/config/index/budget/?group_id=45&amp;pricing_id=1410 \"Order Now\")\r\n\r\n**How come you’re now able to offer services at a lower price?**\r\nOur PayPal processing fees have dramatically decreased since being accepted for lower rates based on our average transaction values.This enables us to pass the savings to you. \r\n\r\nOf course, this alone doesn’t cut it which is why other factors have made this possible such as our ability to offer multiple other payment gateways, targeted changes to the plan specifications to reduce over-usage and finally by keeping the pricing “as-is” for the foreseeable future, so, promotional codes will not apply to these plans. That doesn’t mean similar plans won't ever be available under a promotion, it just means that these specific plans right here will not be discounted in the future.\r\n\r\nIf you had a plan before this change, it’ll be known as “XXX YGB” or “Legacy YGB” where XXX represents a location tag and Y represents the storage. We are unable to convert Legacy services to these new plans but will gladly offer you credit or additional service if you’re manually switching from Legacy.\r\n\r\nSmallWeb Ltd is registered in England &amp; Wales under company 12272693\r\n&lt;/center&gt;"}