{"id": 173040, "date": "2021-08-03 23:08:48", "user": "AllHost_Ben", "post": "**Who are AllHost?**\r\nAllHost.co.uk are a web hosting provider aimed at providing high performance web hosting services with a user-friendly price point. We have been publicly providing hosting for just over 1 year under the AllHost name however have been providing private hosting for over 6 years now.  We are a registered company in the UK - 13477478.\r\n\r\nWe’re from a technical background, not sales, so there’s no pushy marketing with false promises, just simple web-hosting plans on a reliable platform.\r\nWith a combined 14 years in-depth experience of providing technical support and hosting environments to large web-hosting providers, we believe this makes us perfect for ensuring things run fast and remain reliable whilst offering a professional service.\r\n\r\n**What's Standard?**\r\nHosted on enterprise grade hardware in a Midlands (UK) Datacentre served by a multi-homed network with over 1Tbps of outbound capacity.\r\nFull RAID 10 SSDs.\r\ncPanel Control Panel.\r\nJetBackup - Daily Backups with 21 Restore Points.\r\nCloudLinux OS \r\nLiteSpeed Web Server + LSCache\r\nImunify 360\r\nFree SSL Provided by AutoSSL + Sectigo\r\nFree Migrations\r\nPHP Versions 5.4 to 8.0\r\nEnterprise DDoS Protection\r\nGit, Terminal and SSH Access Included with all plans.\r\nUnlimited MySQL Databases, Email Accounts, FTP Accounts, Sub-Domains as per T&amp;Cs.\r\n99.99% Uptime Guarantee\r\n30 Day Money Back Guarantee\r\nSame-Day Helpdesk/Ticket Support with 24/7 Critical Support Available.\r\n\r\n**Will my renewal price go up?**\r\nNever. No matter what cost increases we may suffer in future (cPanel), we aren't running bottom of the barrel hosting here and aren't going to ever increase prices for existing customers or services. The only time your renewal price will go up is if you order extras or change to a larger plan.\r\n\r\n**What's the deal?**\r\nPrices below are discounted using **coupon code: LET30 for 30% off** our website price.\r\n\r\nCP Lite (Shared Hosting)\r\nUp to 1 Domain\r\n10GB SSD Storage\r\n1 vCPU + 1GB RAM + 20 EP\r\n**£2.06/month or £20.60/year**\r\n\r\nCP Basic (Shared Hosting)\r\nUp to 3 Domains\r\n25GB SSD Storage\r\n2GB vCPU + 2GB RAM + 40 EP\r\n**£3.46/month or £34.65/year**\r\n\r\nCP Plus (Shared Hosting)\r\nUp to 5 Domains\r\n50GB SSD Storage\r\n3 vCPU + 3GB RAM + 60 EP\r\n**£6.26/month or £62.60/year**\r\n\r\n**Optional Extras**\r\nMore frequent backups (backup as frequent as every 2 hours)\r\nRelay through MailChannels or your chosen Mail relayer.\r\nDedicated IP Address\r\n\r\nYou can find the plans listed above [here](https://allhost.co.uk/cpanel-web-hosting/ \"here\")\r\nEmail: sales@allhost.co.uk\r\n\r\nWe also offer Reseller Hosting and Managed cPanel VPS."}