{"id": 85626, "date": "2016-06-15 10:49:06", "user": "hostdare", "post": "Hello ladies &amp; gentlemen! Today is a good day. It marks the inception of our brand on LET and we are very excited for it!\r\n\r\nBecause its our offer number **one**, we are offering the first month of our shared hosting plans at the rate of 1 USD. Cheaper than the average price of your breakfast :).\r\n\r\n**Coupon Code needed to take advantage of the great pricing:** 1USD  .\r\n\r\nAnyway people, enough with the talking, let's move to the offers. More talking to follow at the end of the thread, though. :P\r\n\r\nStarter SSD Hosting \r\n&lt;br&gt;This is our introduction plan. You are just starting your website and would love to get it quickly online? This tiny little package will get you on your feet and moving to success in the enormous internet world.\r\n&lt;pre&gt;\r\n2 Addon Domains   Hey, you can host 3 websites in total, how cool does that sound?\r\n\r\n55 GB SSD Dedicated Disk Space   Should be enough to kickstart your web presence\r\n\r\nUnmetered Bandwidth   No worries about that pesky \"Bandwidth Limit Exceeded\" page...\r\n\r\n10 SQL Databases    It's up to you, how to divide them\r\n\r\nUnlimited Sub Domains   More than enough\r\n\r\nPrice: **1 USD** for the first month and then only $4.49/month\r\n\r\nOrder link: https://manage.hostdare.com/cart.php?a=add&amp;pid=1\r\n&lt;/pre&gt;\r\n\r\nProfessional SSD Hosting\r\n&lt;br&gt;You probably already have a website? It is growing and the happy people visiting your website to get their required information is increasing? This package is for you. You get more resources to get your site big enough to serve everybody. Or you may have an awesome idea and you think that small plan isn't for you? No matter what is the case, this powerful beast of a package is here for you! :)\r\n&lt;pre&gt;\r\n40 Addon Domains   Make your web empire! Nobody can stop you!!\r\n\r\n120 GB SSD Dedicated Disk Space   Imagine all that website files you can upload to fill it...\r\n\r\nUnmetered Bandwidth   Everybody gets bandwidth!!!\r\n\r\n50 SQL Databases   You will be full of databases!\r\n\r\nUnlimited Sub Domains   Try to hit the limit! :P\r\n\r\nPrice: **1 USD** for the first month and then only $6.49/month\r\n\r\nOrder link: https://manage.hostdare.com/cart.php?a=add&amp;pid=3\r\n&lt;/pre&gt;\r\n\r\nNow as I promised, more talking to come.\r\n\r\nYou will ask: Who are you? Never heard your name before.\r\n&lt;pre&gt;\r\nWe are HostDare, a privately owned company that has been providing reliable and affordable shared hosting, reseller hosting, \r\ndedicated servers and VPS since the late 2015. \r\nWe are new, but our people have a lot of experience, \r\nso you can rest assured that your place on the internet is in good hands. \r\nWe are also quite friendly, you will notice. :)\r\n&lt;/pre&gt;\r\n\r\nWhat else do you provide?\r\n&lt;pre&gt;\r\nWHM/cPanel Control Panel\r\nSoftaculous Auto Script Installer for cPanel\r\nInstant Setup\r\nFree Pro-Active Monitoring\r\nCloudLinux powered, MariaDB Database System\r\n99.9% Uptime Guarantee\r\n24/7 Support via ticket system or Live Chat\r\nFree Account Migration from another host up to 10 domains\r\ncURL, ImageMagick, GD, PHP 5, MySQL 5, IonCube, Zend Optimizer and more!\r\nFree domain name on annual terms\r\nOwned hardware, no reselling!\r\n&lt;/pre&gt;\r\n\r\nIf you get any question, feel free to message us. No question is bad enough, to not get an answer. :)\r\n\r\nContact Us\r\n&lt;pre&gt;\r\nWebsite: http://www.hostdare.com\r\nEmail: sales@hostdare.com \r\nSupport: &lt;a href=\"https://manage.hostdare.com/submitticket.php\"&gt;Open a ticket&lt;/a&gt;\r\nFollow us on &lt;a href=\"https://twitter.com/hostdare\"&gt;Twitter&lt;/a&gt; and &lt;a href=\"https://www.facebook.com/hostdare/?ref=bookmarks\"&gt;Facebook&lt;/a&gt;\r\n&lt;/pre&gt;\r\n\r\nThanks for reading people and have a nice and warm day! :)\r\n\r\nHostDare Team"}