{"id": 97551, "date": "2016-11-24 00:55:37", "user": "xijinRK", "post": "**MirtHost** was founded in the December of 2015, every member in our team is well experienced, many staff have more than 7 years hosting experience in both US and oversea (China/France) hosting industry. Our goal is to provide quality, speedy, friendly hosting service at a affordable price. We're trying to be the best of you, making every clients mirth and satisfied with our service by providing surprisingly awesome network, customer service, and uptime for all product, to all clients.\r\n\r\nWe're part of nLayer Limited Company, a registered company in the United States, our team are fully US-based, we file tax returns, pay taxes, support economic growth of the great America.\r\n\r\nThis Thanksgiving; Black Friday; Cyber Monday, we've got some great discount for y'all on our shared hosting plans and here they are:\r\n\r\n[Click here to checkout the full list of our live shared hosting promotions](https://www.mirthost.com/portal/cart.php?gid=14)\r\n\r\n&gt; **LAX-SEO-E** |\r\n&gt; 10GB Disk Space /\r\n&gt; 100GB Bandwidth (Monthly) /\r\n&gt; Unlimited Domains /\r\n&gt; 1 Dedicated IPv4 Address /\r\n&gt; Self-Managed via cPanel Extended /\r\n&gt; Datacenter Located at Los Angeles, CA /\r\n&gt; $15 Annually /\r\n&gt; [Order Now](https://www.mirthost.com/portal/cart.php?a=add&amp;pid=63)\r\n\r\n&gt; **LAX-SEO-R** |\r\n&gt; 5GB Disk Space /\r\n&gt; 50GB Bandwidth (Monthly) /\r\n&gt; Unlimited Domains /\r\n&gt; 1 Dedicated IPv4 Address /\r\n&gt; Self-Managed via cPanel Extended /\r\n&gt; Datacenter Located at Los Angeles, CA /\r\n&gt; $10 Annually /\r\n&gt; [Order Now](https://www.mirthost.com/portal/cart.php?a=add&amp;pid=62)\r\n\r\nMost Shared Hosting Nodes Configured with 8GB of RAM, Intel Xeon HT CPU, cPanel Control Panel, MariaDB, NO physical resource limitation such as CloudLinux, Daily Offsite Backups in Hardware RAID6 server, MultiPHP PHP Selector (5.6 &amp; 7.0) &amp; PHP INI Editor, DDOS Protection, Softaculous, Let's Encrypt SSL\r\n\r\n**ALL PLANS come with 7 day money back guarantee w/ no questions asked**\r\n\r\nWe accept: Paypal, Credit Card, Debit Card.\r\n\r\nWe will beat prices, We can do price matches, Just open a ticket, We'll match it!\r\n\r\nHave any questions? Contact us [here](https://www.mirthost.com/portal/contact.php) or livechat with us.\r\n\r\nOrder Soon While Supplies Last, Great Deal, Great Saving!\r\n\r\nWe're looking forward to serve you.\r\n\r\nSincerely, Jin from nLayer."}