{"id": "1891", "date": "Oct 26, 2003 at 12:35 AM", "user": "artashes", "post": "\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t<div class=\"bbWrapper\">Dear HostingDiscussion.com Users,<br>\n<br>\nHere are a few simple rules to follow when choosing a web host that will help reduce the risk of signing up with a host that is unreliable or dishonest.<br>\n<br>\n<span style=\"font-size: 12px\"><b>1. Always ask your potential hosting company several pre-sales questions via the various support methods they provide.</b></span><br>\n<br>\nThis will accomplish two things: You will gain information about the host and you will get an idea of the average response time of the host. Some of the questions you might ask are:<br>\n<br>\n- How long have you been in business?<br>\n- What are the specs for your shared and reseller servers?<br>\n- What datacenter do you use?<br>\n- Do you have uptime statistics?<br>\n- Is my account easily upgradeable? Is there an upgrade fee?<br>\n- How many people are on your support staff?<br>\n- Do you have a file I can download to test system speed?<br>\n- Do you have a money back guarantee?<br>\n- Do you have an uptime guarantee and if so is it server uptime or network uptime?<br>\n- Do you perform regular backups or am I responsible for my own backups?<br>\n- Are there any scripts that you don't allow to run on shared plans?<br>\n<br>\n<span style=\"font-size: 12px\"><b>2. Beware of hosts who oversell their services.</b></span><br>\n<br>\nOverselling is when a host sells more space and/or transfer than they have available. For instance, a host may be leasing a server with an 80gb hard drive and 700gb of transfer. If the hosting plans offered by the host is 20gb of disk space and 100gb transfer that would mean the host can only sell 7 hosting plans without overselling.<br>\n<br>\nOne of the easiest ways to spot overselling is if the host is offering very large packages for very little money. The hosting business is like any other business, there are many costs involved. If a host is offering very low prices you should be very careful in your research before choosing this host. There is a very good possibility that the host is overloading server resources and the performance will be affected negatively. Be sure to ask a host how many accounts they allow on their servers and what resources are allocated to these accounts.<br>\n<br>\n<span style=\"font-size: 12px\"><b>3. Never trust a host who offers unlimited disk space or unlimited transfer.</b></span><br>\n<br>\nThe simple fact of the matter is <u>unlimited space and transfer do not exist</u>. Everything has a limit and a host who offers unlimited plans is most definitely overselling server resources and is being dishonest to potential clients. These hosts may seem like a good deal when signing up but they will either not be in business very long or you will have many issues with down time. These hosts also usually have a TOS (Terms of Service) that severely limits what files or scripts you can use on your site.<br>\n<br>\n<span style=\"font-size: 12px\"><b>4. Do a WhoIs search of the host.</b></span><br>\n<br>\nIf you find that the host's URL was registered for less time than the host claims to have been in business, contact the host and ask them about the discrepency. Be cautious about companies that use private registration (a feature that allows the registrant to hide WhoIs contact information from public eye).<br>\n<br>\nHostingDiscussion.com recommends <a href=\"http://www.domainwhitepages.com\" target=\"_blank\" class=\"link link--external\" rel=\"noopener\">this site</a> for WhoIs purposes.<br>\n<br>\n<span style=\"font-size: 12px\"><b>5. Read and understand the host's TOS (Terms of Service) and AUP (Acceptable Usage Policy).</b></span><br>\n<br>\nMany hosts will have hidden clauses in their TOS that will limit your ability to run your site the way you choose. This is not always a bad thing but it can be abused. Make sure you read the TOS and AUP and if anything concerns you contact the host and question it.<br>\n<br>\n<span style=\"font-size: 12px\"><b>6. Search forums for references to the host you are researching.</b></span><br>\n<br>\nAsk for opinions from people who have used the service. You should also do a Google, Yahoo! or other search engine search using the name of the host to see if any negative comments appear.<br>\n<br>\n<span style=\"font-size: 12px\"><b>7. Try to avoid spam-friendly hosts.</b></span><br>\n<br>\nThere is a much higher chance of IP addresses being blocked which are owned by hosts who support spam.<br>\n<br>\n<span style=\"font-size: 12px\"><b>8. Ask around.</b></span><br>\n<br>\nThe best way to choose a host is almost always based on recommendations from people who have used the hosts services.<br>\n<br>\n<span style=\"font-size: 12px\"><b>9. Do not rush into your hosting decision.</b></span><br>\n<br>\nDon't be fooled by limited time offers or hosts who advertise that a special offer will expire at midnight only to find out that the same offer is available the next day.<br>\n<br>\n<span style=\"font-size: 12px\"><b>10. Beware of hosting directories.</b></span><br>\n<br>\nMost are either owned by hosts or the rankings are based on how much the host pays. Very few, if any, are actually based on peoples' personal experience with a host or the quality of the host.<br>\n<br>\n<br>\n<b>The best way to begin your journey of selecting a host is</b> to determine <u>what you are able to spend</u> and <u>what your needs are</u>. If you are able to spend $7.00 per month on hosting and you require 500mb of disk space and 3gb of transfer then you should look for a host offering this. Don't go with a bargain host just because they can offer you 10 times as much for the same price. You will most often end up on the hunt for another new host in a very short time.<br>\n<br>\n<br>\nIf you know a good rule to add to this guide, please post it in this thread using an appropriate and a clear format. All non-related information will be deleted.<br>\n<br>\n<br>\n<b><span style=\"font-size: 12px\">GUIDE CREDIT: <a href=\"https://hostingdiscussion.com/members/28941/\" class=\"username\" data-xf-init=\"member-tooltip\" data-user-id=\"28941\" data-username=\"@bigredseo\" id=\"js-XFUniqueId5\">@bigredseo</a>, HD Community Advisor</span></b><br>\n<span style=\"font-size: 12px\">EDITED: March 21, 2016</span></div>\n\t\t\t\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t"}