{"id": "61872", "date": "May 22, 2017 at 2:43 PM", "user": "epotentia", "post": "\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t<div class=\"bbWrapper\">Welcome to <b>ePotentia</b>: the web host dedicated to helping you <b>get your online business off the ground</b>.<br>\n<br>\nCelebrating the release of our new site, we'd like to introduce you to our services at a discount!<br>\n<br>\n<br>\n<b>So who are we and why do you want our hosting?</b><br>\n<br>\nWe specialize in e-commerce and have been in the business for nearly 15 years. Sign up with us and we'll help you transfer your site or advise you how to get started. If we see your site is having issues, we'll advise you how to fix it rather than just suspend you. Our blog and social media will keep you up to date and our support team is always ready to help.<br>\n<br>\n<br>\n<b>Let's be honest...</b><br>\n<br>\nWe do not offer you unlimited space or bandwidth. We offer exactly the amount which is right to keep your site up and our servers fast and secure. We use CloudLinux to assign CPU and memory to each account and isolate each user's file system using CageFS. We actively ensure that no single client will ever affect the performance of everyone else. If there are issues we try to help. Daily off-site backups are also available to users, with up to 120 restore points every month, and do NOT count towards your disk space quota.<br>\n<br>\n<br>\n<b>So what do you truly offer?</b><br>\n<br>\n<ul>\n<li data-xf-list-type=\"ul\"><b>CloudLinux</b> - CPU, RAM and filesystem dedicated to you.</li>\n<li data-xf-list-type=\"ul\"><b>Free SSL</b> - Immediately encrypt your site traffic.</li>\n<li data-xf-list-type=\"ul\"><b>R1Soft</b> - Restore individual files from daily off-site backups 30 days back!</li>\n<li data-xf-list-type=\"ul\"><b>Railgun</b> - Speed up your site with free CloudFlare integration.</li>\n<li data-xf-list-type=\"ul\"><b>Two cPanels</b> - Simple or advanced? Choose what suits you best.</li>\n<li data-xf-list-type=\"ul\"><b>Multiple sitebuilders</b> - Use RVSiteBuilder, Softaculous or our custom graphical site builder!</li>\n</ul><br>\n<br>\n<b>Is there a special offer here?</b> Yes!<br>\n<ul>\n<li data-xf-list-type=\"ul\">Pay yearly and get <b>50% off</b>!*</li>\n<li data-xf-list-type=\"ul\">Have a site ready? <b>Free migration</b>**</li>\n<li data-xf-list-type=\"ul\">New site? <b>Free advice</b></li>\n<li data-xf-list-type=\"ul\">WordPress site? We'll help you <b>optimize your speed</b>!**</li>\n<li data-xf-list-type=\"ul\">Coupon code: <b><span style=\"color: Purple\">STARTANEW</span></b>***</li>\n</ul><br>\n<b>Check us out: </b><a href=\"https://www.epotentia.com/?utm_source=hd&amp;utm_medium=shared&amp;utm_campaign=startanew\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">https://www.epotentia.com</a><br>\n<br>\n*Starting at $25/year for the Personal plan, $100 for Business (includes reseller capabilities).<br>\n**Limited to the first 100 clients, in order of signup. Wondering where in the queue you'd end up? Send us an email or ask on live chat!<br>\n***Part of a charity? Contact us and maybe we can give you an even better offer!<br>\n<br>\n<br>\n<b>More questions?</b> <a href=\"https://www.epotentia.com/contact/?utm_source=hd&amp;utm_medium=shared&amp;utm_campaign=startanew\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">Contact us!</a><br>\n<br>\n<br>\n<b>Not happy?</b> Web hosting is fully refunded during the first month, no questions asked!</div>\n\t\t\t\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t"}