{"id": "69047", "date": "Oct 12, 2018 at 9:36 AM", "user": "kickassd", "post": "\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t<div class=\"bbWrapper\"><span style=\"font-size: 18px\"><b>Kickassd</b> - <i>Fast, efficient, stable, elastic, and living in the cloud. Powered by cPanel, Litespeed, and CloudLinux</i>.</span><br>\n<br>\n<br>\n<span style=\"font-size: 15px\">Kickassd is one of the original pure SSD shared hosting providers, and has been in business since 2016. We do things a little different then most and tend to stay on the cutting edge. Example were are one of the first providers to make TLS 1.3 available on our servers.</span><br>\n<br>\n<br>\n<b><span style=\"font-size: 18px\">Cool Features</span></b><br>\n<ul>\n<li data-xf-list-type=\"ul\"><br>\n<span style=\"font-size: 15px\"><b>Elastic Hosting:</b> You can upgrade and downgrade individual resources such as CPU, RAM, SSD space, IOPS, transfer at anytime. You have the power of a VPS or even dedicated server at your fingertips. Tailor your plan exactly to your needs for best ROI and efficiency.<br>\n<br>\n<b>Efficiency And Speed:</b> We spent considerable time finding the perfect mix and best tunes for our servers. The combination of Litespeed + Lscache + Opcode Cache + MariaDB + Tuning means you get more speed for less resources and much greater ability to handle traffic.<br>\n<br>\n<b>The Cloud:</b> Our Frankfurt location and all future locations and servers are in the cloud. This negates downtime due to hardware and network failure(*1). High Availability with automatic failover gives additional peace of mind and helps maintain excellent uptime. Disaster recovery instead of taking a day or more takes 5-10 minutes.<br>\n<br>\n<b>Backups and Snapshots:</b> You have the ability to restore your full account at anytime, or you can restore individual files, databases, emails, and even cronjobs. You can also download them at any time. Snapshots, this is a really cool feature! You can take a snapshot of your account. This is a mirror image of the entire account at that time and allows you to restore you account near instantly with a click.<br>\nLets say you have a large update with many changes. Make a snapshot just prior to the update, if it goes bad simply restore.<br>\n<br>\n<b>Cryptocurrency:</b> We are crypto enthusiasts and accept Bitcoin as well as many altcoins as payment.<br>\n<br>\n<b>Staging Support:</b> All our servers fully support Version Press which is a really great WordPress tool for staging and development work. Support is in the way of wp-cli, and GIT on all servers.<br>\n</span></li>\n</ul><i>(*1 - Montreal location is on dedicated hardware.)</i><br>\n<br>\n<br>\n<b><span style=\"font-size: 18px\">The Plans</span></b><br>\n<br>\n<span style=\"font-size: 15px\"><a href=\"https://kickassd.com/#plans\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">https://kickassd.com/#plans</a><br>\n<a href=\"https://kickassd.com/wordpress.php\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">https://kickassd.com/wordpress.php</a></span><br>\n<br>\n<b><span style=\"font-size: 15px\">Support:</span></b><span style=\"font-size: 15px\"> No canned replies, no lazy answers. Fast, friendly and driven, we want you to feel as if you are one of the family.<br>\n<br>\n<b>Reviews:</b> <a href=\"https://www.serchen.com/company/kickassd-web-hosting/\" target=\"_blank\" class=\"link link--external\" rel=\"nofollow ugc noopener\">https://www.serchen.com/company/kickassd-web-hosting/</a></span><br>\n<br>\n<span style=\"font-size: 15px\">Reseller Plans are coming early 2019.</span></div>\n\t\t\t\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t"}