{"id": "76273", "date": "Nov 13, 2020 at 9:47 PM", "user": "artashes", "post": "\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t<div class=\"bbWrapper\"><u><b>Things to consider</b></u><br>\n<br>\n<br>\n<b>Your host's profitability is very important</b><br>\n<br>\nIf you enter into a relationship with a host thinking solely about what you are getting from them, and not considering what they are getting from you, you will likely have a hard time in the long run. All hosts need to be profitable, otherwise they will disappear along with your data.<br>\n<ul>\n<li data-xf-list-type=\"ul\">The server may need to be taken down more often to accommodate upgrades and expansion.</li>\n<li data-xf-list-type=\"ul\">You may need to move your data more often, as the host will not be able to expand their server indefinitely.</li>\n</ul><br>\nAll of these issues are made worse if you are paying very little for your service.<br>\n<br>\n<br>\n<b>Read the TOS (Terms of Service)<br>\nPeriodic checkups. Do your own housekeeping</b><br>\n<br>\nPeriodically compare the resources that your website is consuming, and then compare that to the resource restrictions on your provider's Terms of Service. If what you are currently using is close to exceeding those on your plan, fully expect warnings by your host and possible termination of your account, resulting in complete data loss.<br>\n<br>\nHosting is a business with low margins. Unlimited or not, your host will be looking at doing 1 of 3 things when you start costing more than they are earning.<br>\n<ul>\n<li data-xf-list-type=\"ul\">Charge you more for the service, returning their service to profitability.</li>\n<li data-xf-list-type=\"ul\">Changing your service, returning their service to profitability.</li>\n<li data-xf-list-type=\"ul\">Terminating your service. (No money is better than a loss).</li>\n</ul><br>\nDoing your homework periodically will, at minimum, give you some knowledge as to when you could expect trouble. There is no such thing as a set and forget hosting account, and whilst unlimited seems to promise that, nothing is further from the truth.<br>\n<br>\nHere are some of the things you may find could happen.<br>\n<ul>\n<li data-xf-list-type=\"ul\">Hosts who don't use block backups, but file backups may stop backing up your account when it exceeds a number of inodes or a specific size. (So just as your site gets big enough to be worth backing up, they stop backing your site up.)</li>\n<li data-xf-list-type=\"ul\">They may insist on more money for the same account, or insist that you upgrade to a more expensive account or VPS.</li>\n<li data-xf-list-type=\"ul\">They may reduce some of your real-time limits.<br>\n- Maximum CPU Speed<br>\n- Maximum Network Speed<br>\n- Maximum Disk I/O</li>\n</ul><br>\n<br>\n<b>CPU - the most precious resource<br>\nDisk I/O is more precious than disk space</b><br>\n<br>\nIf your application thrashes the disk, then be prepared for your host to throttle your accounts disk i/o, or suspend your account all together.<br>\n<br>\n<i>Stay out of trouble</i><br>\n<br>\n<ul>\n<li data-xf-list-type=\"ul\">Use a caching plugin where practical.<br>\n- Keeps your CPU and database activities to a minimum.</li>\n<li data-xf-list-type=\"ul\">Use indexes on databases where you perform table joins<br>\n- Poor database queries are a shared hosts' worst nightmare, stealing untold CPU and I/O cycles. A few indexes will go a long way.</li>\n<li data-xf-list-type=\"ul\">Optimise your graphics.<br>\n- Not only will doing this reduce disk-space, it will also reduce your bandwidth usage, making your sites faster to load. Not only will your host be delighted, but your visitors will be too.</li>\n<li data-xf-list-type=\"ul\">If your caching algorithm uses more CPU or disk I/O than it saves, then don't use it.</li>\n<li data-xf-list-type=\"ul\">Make your own backups regularly, if you abuse/annoy your host they could be the only ones you have.</li>\n</ul><br>\n<br>\n<u><b>Summary</b></u><br>\n<ul>\n<li data-xf-list-type=\"ul\">You get what you pay for.</li>\n<li data-xf-list-type=\"ul\">Know your limits (check out the TOS).</li>\n<li data-xf-list-type=\"ul\">Don't overuse CPU, disk I/O or memory if you can help it. (Be considerate of other users on the server, as you would expect them to be to you).</li>\n<li data-xf-list-type=\"ul\">Make regular backups.</li>\n</ul><br>\n<br>\n<span style=\"font-size: 12px\"><b>GUIDE CREDIT:</b> <a href=\"https://hostingdiscussion.com/members/18884/\" class=\"username\" data-xf-init=\"member-tooltip\" data-user-id=\"18884\" data-username=\"@ughosting\" id=\"js-XFUniqueId5\">@ughosting</a>, HD Community Advisor</span></div>\n\t\t\t\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t"}